
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Установить отметку об отказе (я связался с перевозчиком)");
	Кнопки.Добавить("Отмена");
	
	ТекстВопроса = "В соответствии с правилами обмена электронным заказом(заявкой) не предусмотрен отказ грузоотправителя после подписания перевозчиком титула 2.
	|Обязательно свяжитесь с перевозчиком и сообщите, что перевозка не состоится.
	|
	|При выполнении команды мы пометим документ как завершенный и установим статус ""Отказ ГО Не подошли условия перевозчика"", но перевозчик не получит электронное уведомление о вашем отказе.
	|
	|Установить отметку об отказе?";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
		ТекстВопроса, Кнопки, , , ЭтотОбъект, "ОбработкаКомандыПодтверждение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> "Установить отметку об отказе (я связался с перевозчиком)" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	Форма = ДополнительныеПараметры.Форма;
	
	УстановитьСостояниеДО(ПараметрКоманды);
	
	Если Найти(Форма.ИмяФормы, "ФормаДокумента") Тогда 
		Форма.Закрыть();
	КонецЕсли;	
	
	Оповестить("КонтурЛогистика_ОбновитьЗадачи");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДО(ТитулСсылка)
	
	Если ТипЗнч(ТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2") Тогда 
		
		Документ = ТитулСсылка.Титул1;
				
	КонецЕсли;

	РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.УстановитьСостояние(Документ, "zz-rejectedConsignor",, Истина);
	
КонецПроцедуры