#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;
&НаКлиенте
Перем ПередЗаписьюПовторныйВызов; // Используется для не модальных вопросов перед записью
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ОповещениеПослеЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Статус			= Перечисления.СтатусыНачисленияРетроБонусов.Создано;	
		Объект.Ответственный	= ПараметрыСеанса.ТекущийПользователь;
		Объект.ДатаНачала		= НачалоМесяца(ТекущаяДатаСеанса());
		Объект.ДатаОкончания	= КонецМесяца(ТекущаяДатаСеанса());
		ПриЧтенииСозданииНаСервере();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения"  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	//// Конец СтандартныеПодсистемы.Свойства
   //ПроверяемыеРеквизиты.Очистить();

   //ПроверяемыеРеквизиты.Добавить("СпособДоставки");
   
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНачисления(Команда)
	ЗаполнитьНачисленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ЗаполнитьНачисления

Процедура ЗаполнитьНачисленияНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект.Начисление.Очистить();
	
	Запрос = Новый Запрос;
	Запрос_Текст = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер КАК Менеджер,
		|	ВыручкаИСебестоимостьПродажОбороты.Соглашение КАК Соглашение,
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Выручка
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			АналитикаУчетаПоПартнерам.Партнер.РетроБонус
		|				И АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК ВыручкаИСебестоимостьПродажОбороты
		|ГДЕ
		|	ИСТИНА
		|	И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер,
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер,
		|	ВыручкаИСебестоимостьПродажОбороты.Соглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыРетроБонусСоглашения.Ссылка КАК Партнер,
		|	ПартнерыРетроБонусСоглашения.Соглашение КАК Соглашение
		|ПОМЕСТИТЬ ВТ_Соглашения
		|ИЗ
		|	Справочник.Партнеры.РетроБонусСоглашения КАК ПартнерыРетроБонусСоглашения
		|ГДЕ
		|	ПартнерыРетроБонусСоглашения.Ссылка.РетроБонус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АналитикаУчета.Партнер КАК Партнер,
		|	СУММА(РасчетыПоСрокам.ПредоплатаОстаток) КАК НашДолг,
		|	СУММА(РасчетыПоСрокам.ДолгОстаток) КАК ДолгКлиента,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|				ТОГДА РасчетыПоСрокам.ДолгОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДолгКлиентаПросрочено
		|ПОМЕСТИТЬ ВТ_Задолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыПоСрокам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
		|		ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
		|ГДЕ
		|	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|
		|СГРУППИРОВАТЬ ПО
		|	АналитикаУчета.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выручка.Менеджер КАК Менеджер,
		|	ВТ_Выручка.Партнер КАК Партнер,
		|	СУММА(ВТ_Выручка.Сумма) КАК ВыручкаФакт
		|ПОМЕСТИТЬ ВТ_ОтборСоглашений
		|ИЗ
		|	ВТ_Выручка КАК ВТ_Выручка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Соглашения КАК ВТ_Соглашения
		|		ПО ВТ_Выручка.Партнер = ВТ_Соглашения.Партнер
		|			И ВТ_Выручка.Соглашение = ВТ_Соглашения.Соглашение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выручка.Менеджер,
		|	ВТ_Выручка.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОтборСоглашений.Менеджер КАК Менеджер,
		|	ВТ_ОтборСоглашений.Партнер КАК Партнер,
		|	ВТ_ОтборСоглашений.ВыручкаФакт КАК ВыручкаФакт,
		|	ЕСТЬNULL(ВТ_Задолженность.ДолгКлиентаПросрочено, 0) КАК Задолженность
		|ИЗ
		|	ВТ_ОтборСоглашений КАК ВТ_ОтборСоглашений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Задолженность КАК ВТ_Задолженность
		|		ПО ВТ_ОтборСоглашений.Партнер = ВТ_Задолженность.Партнер
		|ГДЕ
		|	ВТ_ОтборСоглашений.Партнер.РетроБонус";
	

	Запрос.УстановитьПараметр("ДатаНачала", 	Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(Объект.ДатаОкончания));
	
	Если ЗначениеЗаполнено(ОБъект.Партнер) Тогда
		Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Иначе
		Запрос_Текст = СтрЗаменить(Запрос_Текст, "И АналитикаУчетаПоПартнерам.Партнер = &Партнер", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОБъект.Менеджер) Тогда
		Запрос.УстановитьПараметр("Менеджер", Объект.Менеджер);
	Иначе
		Запрос_Текст = СтрЗаменить(Запрос_Текст, "И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер = &Менеджер", "");
	КонецЕсли;
	
	Запрос.Текст = Запрос_Текст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТЗ_ВариантыРасчетов = Выборка.Партнер.РетроБонусВариантыРасчетов.Выгрузить();
		ТЗ_ВариантыРасчетов.Сортировать("СуммаБазовая Убыв");
		
		НоваяСтрока = Объект.Начисление.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.Задолженность > 0 Тогда
			Продолжить;
		КонецЕсли;

		СуммаБазовая = 0;
		ПроцентБонуса = 0;
		Для каждого Ступень Из ТЗ_ВариантыРасчетов Цикл
			Если Выборка.ВыручкаФакт >= Ступень.СуммаБазовая Тогда
				ПроцентБонуса = Ступень.Процент;
				СуммаБазовая = Ступень.СуммаБазовая;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НоваяСтрока.СуммаБазовая = СуммаБазовая;
		НоваяСтрока.ПроцентБонуса = ПроцентБонуса;
		НоваяСтрока.Бонус = Выборка.ВыручкаФакт * ПроцентБонуса / 100;
		
	КонецЦикла;

КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыборПериода
	
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала		= РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания	= РезультатВыбора.КонецПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	П = Новый Структура("НачалоПериода,КонецПериода", Объект.ДатаНачала, КонецДня(Объект.ДатаОкончания));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", П, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти 

Процедура ПриЧтенииСозданииНаСервере()

КонецПроцедуры

Функция ПолучитьДОиО(НаименованиеОбработки) Экспорт
	рез = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки, Истина); 
	Возврат рез;
КонецФункции

#Область ВопросОЗаписиДокумента

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействия(п_Команда, ОповещениеЗавершения = Неопределено)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	ДополнительныеПараметры.Вставить("ИмяКоманды", п_Команда);
	
	Если Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно записать документ. Выполнить запись документа и продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьСЗапросомДальнейшегоДействияПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе 
		ПроверитьСЗапросомДальнейшегоДействияПродолжение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияПродолжение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;			
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьСЗапросомДальнейшегоДействияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);				
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;			
	
	Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры	


#КонецОбласти

#КонецОбласти