
&НаСервере
Процедура ОД_РаспределитьПоТНВЭДПослеНаСервере()

     ТЗ_Товары = Объект.Товары.Выгрузить();
	 ТЗ_Товары.Колонки.Добавить("КодТНВЭД", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	 Для каждого Т Из ТЗ_Товары Цикл
		 Т.КодТНВЭД = Т.Номенклатура.КодТНВЭД;
	 КонецЦикла;
	 
	ТЗ_ТНВЭД = ТЗ_Товары.Скопировать();
	 
	ТЗ_ТНВЭД.Свернуть("КодТНВЭД");
	ТЗ_ТНВЭД.Сортировать("КодТНВЭД");
	
	Объект.Разделы.Очистить();
	
	НомерРаздела = 1;
	Для каждого Т Из ТЗ_ТНВЭД  Цикл
	
		НоваяСтрока = Объект.Разделы.Добавить();
		НоваяСтрока.НомерРаздела = НомерРаздела;
		
		ТаможеннаяСтоимость = 0;
		НайденныеСтроки = ТЗ_Товары.НайтиСтроки(Новый Структура("КодТНВЭД", Т.КодТНВЭД));
		Для каждого ТТ Из НайденныеСтроки Цикл
			ТаможеннаяСтоимость = ТаможеннаяСтоимость + ТТ.ТаможеннаяСтоимость;
			
			СтрокаТЧ = Объект.Товары.Получить(ТТ.НомерСтроки-1);
			СтрокаТЧ.НомерРаздела = НомерРаздела;
		КонецЦикла;
		
		НоваяСтрока.ТаможеннаяСтоимость = ТаможеннаяСтоимость;
		НоваяСтрока.ОД_КодТНВЭД = Т.КодТНВЭД;
		
		Если Объект.Дата >= '20260101' Тогда
			ЗначениеСсылка = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
			Если ЗначениеСсылка = Неопределено Тогда
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				НоваяСтрока.СуммаНДС = ТаможеннаяСтоимость * 0.20;
			Иначе
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
				НоваяСтрока.СуммаНДС = ТаможеннаяСтоимость * 0.22;
			КонецЕсли;
		Иначе
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			НоваяСтрока.СуммаНДС = ТаможеннаяСтоимость * 0.20;
		КонецЕсли;
		
		
		НомерРаздела = НомерРаздела + 1;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОД_РаспределитьПоТНВЭДПосле(Команда)
	
	ОД_РаспределитьПоТНВЭДПослеНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры
