#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СтатусДокументаТребуетПроверки(Статус) Экспорт
	
	Возврат ПолучитьМассивСтатусовНеТребующихПроверки().Найти(Статус) = Неопределено; 
	
КонецФункции

Функция ПолучитьМассивСтатусовНеТребующихПроверки()
	
	Результат = ПолучитьМассивСтатусовВходящегоДокумента();
	Результат.Добавить(РаботаЗавершена);
	Результат.Добавить(РаботаЗавершенаРаспечатан);
	
	Возврат Результат
	
КонецФункции	

Функция ПолучитьМассивСтатусовВходящегоДокумента()
	
	Результат = Новый Массив;
	Результат.Добавить(Получен);
	Результат.Добавить(ПолученТребуетОбработки);
	Результат.Добавить(ПолученОбработанСПредупреждением);
	
	Возврат Результат

КонецФункции	

#КонецЕсли