
Функция ПолучитьДОиО(НаименованиеОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Спр = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки, Истина); 
	
	Если НЕ ЗначениеЗаполнено(Спр) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Спр.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется Тогда
		Возврат Спр;
	КонецЕсли;
	
КонецФункции

Функция ПользовательОграниченныеПрава() Экспорт
	
	Если РольДоступна("Операционист")
		ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
		ИЛИ РольДоступна("РуководительОтделаПродажДополнительно")
		ИЛИ РольДоступна("РабочееМестоМенеджераПоМаркетплейсам")
		ИЛИ РольДоступна("РабочееМестоМенеджерПоМаркетингу") Тогда // Задача 05.12.24/1

		Возврат Истина;
		
	Иначе	
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ()

Процедура МинимальныйИнтерфейс() Экспорт

	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	
	НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
    
    НастройкиСостава.Верх.Очистить();
    НастройкиСостава.Лево.Очистить();
    НастройкиСостава.Низ.Очистить();
    НастройкиСостава.Право.Очистить();
    
    //Добавить снизу панель открытых
    НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
        
    // Загрузить настройки состава в пустой объект настроек.
    НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
    
    // Положить объект настроек текущему пользователю в хранилище.
    ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);

КонецПроцедуры

Функция Получить_РольДоступна(п_РольНаименование) Экспорт
	
	Возврат РольДоступна(п_РольНаименование);

КонецФункции // ()

#Область УправлениеАкционнойЦеной

Функция ВидЦеныАкционная() Экспорт

	Спр = Справочники.qw_Константы.НайтиПоНаименованию("Вид цены Акционная", Истина);
	Если ЗначениеЗаполнено(Спр) Тогда
		Возврат Спр.Значение;
	КонецЕсли;

КонецФункции // ()

// Зинаков 17.06.2025/1 
Функция ПолучитьДоступностьАкционнойЦены(п_Партнер) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	//Если РольДоступна("Операционист")
	//	ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
	//	ИЛИ РольДоступна("РуководительОтделаПродажДополнительно") Тогда
	
		Спр = Справочники.qw_Константы.НайтиПоНаименованию("Исключение контрагентов из акций", Истина);
		Если Спр.Значения.Количество() > 0 Тогда
			МассивИсключений = Спр.Значения.ВыгрузитьКолонку("Значение");
			Если МассивИсключений.Количество() > 0 Тогда
				Если МассивИсключений.Найти(п_Партнер) <> Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	//КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

Функция ПолучитьВариантРасчетаЦены(п_Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВариантРасчетаЦеныНабора;
	КонецЕсли;
	
КонецФункции // ()

Функция ПолучитьЦену(п_Номенклатура, п_ВидЦены, п_Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			ВидЦены = &ВидЦены
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата",			п_Дата);
	Запрос.УстановитьПараметр("ВидЦены",		п_ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура",	п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;

КонецФункции // ()

// Зинаков 17.06.2025/1
// 02.03.2026, 01.04.2026
Функция ПолучитьЦенуПоОтбору(п_Парам) Экспорт
	
	Если п_Парам.ВидЦеныДокумента.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную Тогда
		Возврат 0;
	КонецЕсли;
	
	АкционнаяЦенаНоменклатуры = ПолучитьЦену(п_Парам.Номенклатура, п_Парам.ВидЦеныАкционная, п_Парам.Дата);
	
	Если НЕ ЗначениеЗаполнено(п_Парам.НоменклатураНабора) Тогда
		Возврат АкционнаяЦенаНоменклатуры;
	КонецЕсли;

	ВариантРасчетаЦены = ПолучитьВариантРасчетаЦены(п_Парам.НоменклатураНабора);

	Если ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
		Возврат АкционнаяЦенаНоменклатуры;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область ДоступнаяГруппаНоменклатуры

Функция ПолучитьДоступнуюГруппуНоменклатурыМенеджерПоЗакупкам() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Спр = Справочники.qw_Константы.НайтиПоНаименованию("Доступная группа номенклатуры Менеджер по закупкам", Истина);

	Если Спр.Значения.Количество() > 0 Тогда
		Возврат Спр.Значения.ВыгрузитьКолонку("Значение");
	Иначе	
		М = Новый Массив;
		М.Добавить(Спр.Значение);
		Возврат М;
	КонецЕсли;	

КонецФункции // ()

Функция ПолучитьДоступнуюГруппуНоменклатурыРуководительСервисногоОтдела() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Спр = Справочники.qw_Константы.НайтиПоНаименованию("Доступная группа номенклатуры Руководитель сервисного отдела", Истина);

	Если НЕ ЗначениеЗаполнено(Спр) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)";
	
	Запрос.УстановитьПараметр("Родитель", Спр.Значение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ()

Функция ПолучитьДоступнуюГруппуНоменклатурыМенеджерПоМаркетингу() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Спр = Справочники.qw_Константы.НайтиПоНаименованию("Доступная группа номенклатуры Менеджер по маркетингу", Истина);

	Если Спр.Значения.Количество() > 0 Тогда
		Возврат Спр.Значения.ВыгрузитьКолонку("Значение");
	Иначе	
		М = Новый Массив;
		М.Добавить(Спр.Значение);
		Возврат М;
	КонецЕсли;	
	
КонецФункции // ()

Функция ПолучитьДоступнуюГруппуНоменклатурыПомощникРуководителяСервисногоОтдела() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Спр = Справочники.qw_Константы.НайтиПоНаименованию("Доступная группа номенклатуры Помощник руководителя сервисного отдела", Истина);

	Если НЕ ЗначениеЗаполнено(Спр) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)";
	
	Запрос.УстановитьПараметр("Родитель", Спр.Значение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

#КонецОбласти

#Область ДоступныеПартнеры

// 24.04.2025/1
// руководитель сервисного отдела
Функция РСО_ПолучитьМассивПартнеров() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Спр = Справочники.qw_Константы.НайтиПоНаименованию("Руководитель сервисного отдела, Покупатели", Истина);
	
	Если НЕ ЗначениеЗаполнено(Спр) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Рез = Спр.Значения.ВыгрузитьКолонку("Значение");
	
	Возврат Рез;
	
КонецФункции // ()
	
#КонецОбласти

#Область ФункцииДляОтчетов

Функция ПолучитьЦенуОпт(п_Номенклатура, п_ДатаЦены)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаЦены,
		|			ВидЦены = &ВидЦены
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаЦены", п_ДатаЦены);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовая с НДС", Истина));
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;

КонецФункции // ()

Функция ПолучитьЦенуАкция(п_Номенклатура, п_ДатаЦены)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаЦены,
		|			ВидЦены = &ВидЦены
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаЦены", п_ДатаЦены);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Акционная", Истина));
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;

КонецФункции // ()

Функция ПолучитьНаценкуОпт()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЦен.Наценка КАК Наценка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	ВидыЦен.Ссылка = &ВидЦены";
	
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовая с НДС", Истина));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наценка;
	КонецЕсли;
	
	Возврат 0;

КонецФункции // ()

Функция ПолучитьЦенуОптРасч(п_Номенклатура, п_ДатаЦены) Экспорт
	
	ЦенаОпт			= ПолучитьЦенуОпт(п_Номенклатура, п_ДатаЦены);
	ЦенаАкционная	= ПолучитьЦенуАкция(п_Номенклатура, п_ДатаЦены);
	Наценка			= ПолучитьНаценкуОпт();

	Если ЦенаАкционная = 0 Тогда
		Рез = ЦенаОпт;
	Иначе
		СкидкаСумма = ЦенаАкционная * Наценка / 100;
		Рез = ЦенаОпт + СкидкаСумма;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()
	
Функция ПолучитьОсновногоМенеджераДляОтчета(п_Док, п_Номер, п_Дата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(п_Док) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Попытка
			Если ЗначениеЗаполнено(п_Док.Партнер) Тогда
				Возврат п_Док.Партнер.ОсновнойМенеджер;	
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	

	Возврат "";
	
КонецФункции // ()

#КонецОбласти
