#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверитьНастроенностьПочты();
	Контрагент = Параметры.Контрагент;
	Инициатор = Параметры.Инициатор;
	ПригласитьВЭДО = Параметры.Свойство("ПригласитьВЭДО");
	
	Если Не ЗначениеЗаполнено(Инициатор) Тогда
		Элементы.Инициатор.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Инициатор.АвтоОтметкаНезаполненного = Истина;
		Инициатор = ИнициаторПоУмолчанию();
	КонецЕсли;
	
	ВключеныУведомленияТолькоНаУказанныйEmail = КонтурЛогистика_ОбщегоНазначенияСервер.ВключеныУведомленияТолькоНаУказанныйEmailОГотовностиКЭПД();
	
	Параметры.Свойство("ОтправитьУведомлениеПоставитьГотовКЭПД", ОтправитьУведомлениеПоставитьГотовКЭПД);
	Параметры.Свойство("ОтправитьУведомлениеПригласитьВЭДО", ОтправитьУведомлениеПригласитьВЭДО);
	
	Если ПригласитьВЭДО Тогда
		Элементы.ДекорацияПригласитьВЭДО.Видимость = Истина;
		Элементы.ДекорацияПригласитьВЛогистику.Видимость = Ложь;
		Заголовок = "Ваш Контрагент еще не подключен к ЭДО";
	ИначеЕсли ОтправитьУведомлениеПригласитьВЭДО Тогда
		Элементы.ДекорацияПригласитьВЭДО.Видимость = Истина;
		Элементы.ДекорацияПригласитьВЭДО.Заголовок = "Контрагент не зарегистрирован в ЭДО. Отправьте уведомление с просьбой зарегистрироваться и проставить настройку «Транспортный ЭДО».";
		Элементы.ДекорацияПригласитьВЛогистику.Видимость = Ложь;
		ОтправитьНаПочтуАдминистратораДД = Ложь;
		Заголовок = "Ваш Контрагент еще не подключен к ЭДО";		
	ИначеЕсли ОтправитьУведомлениеПоставитьГотовКЭПД Тогда
		Элементы.ДекорацияПригласитьВЭДО.Видимость = Истина;
		Элементы.ДекорацияПригласитьВЭДО.Заголовок = "У контрагента есть ящик в Диадоке, но он не подтвердил готовность работать с ЭПД."
			+ Символы.ПС + "Отправьте уведомление с просьбой проставить настройку «Транспортный ЭДО».";
		Элементы.ДекорацияПригласитьВЛогистику.Видимость = Ложь;
		Заголовок = "Контрагент не подтвердил готовность к ЭПД";
		Элементы.ФормаПригласитьПоЭлПочте.Заголовок = "Отправить уведомление";
		
		Если ВключеныУведомленияТолькоНаУказанныйEmail Тогда
			Элементы.ОтправитьНаПочтуАдминистратораДД.Видимость = Ложь;
			ОтправитьНаУказаннуюПочту = Истина;
		Иначе
			Элементы.ОтправитьНаПочтуАдминистратораДД.Видимость = Истина;			
			ОтправитьНаПочтуАдминистратораДД = Истина;
		КонецЕсли;
		
		
	Иначе
		Элементы.ДекорацияПригласитьВЭДО.Видимость = Ложь;
		Элементы.ДекорацияПригласитьВЛогистику.Видимость = Истина;
	КонецЕсли;
	
	Если Контрагент.СвязанныеОбъекты.Количество() > 0 Тогда
		Основание = Контрагент.СвязанныеОбъекты[0].СвязанныйОбъект;
		Если ЗначениеЗаполнено(Основание) Тогда
			Попытка
				Выполнить("ЭлПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Основание, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, ТекущаяДатаСеанса())");
			Исключение
				// не смогли достать почту автоматом
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбновитьСтатусГотовКЭПД") Тогда
		ОбновитьСтатусГотовностиКЭПДКонтрагента();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОтправитьУведомлениеПоставитьГотовКЭПД Тогда
		
		СтатусГотовностиКЭПД = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Контрагент, "СтатусГотовностиКЭПД");
		Если СтатусГотовностиКЭПД = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыГотовностиКЭПД.Ready")
			Или СтатусГотовностиКЭПД = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыГотовностиКЭПД.NotReady") Тогда
			Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
	Если ОтправитьУведомлениеПригласитьВЭДО Или ОтправитьУведомлениеПоставитьГотовКЭПД Тогда
		
		ИмяФормыДляМетрики = ЭтаФорма.ИмяФормы;
		Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
			ИмяФормыДляМетрики = ЭтаФорма.ВладелецФормы.ИмяФормы;
		КонецЕсли;
		
		ДопИнформация = Новый Структура;
		Если ЗначениеЗаполнено(Инициатор) Тогда
			BoxID = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Инициатор, "ID");
			ДопИнформация.Вставить("BoxID", BoxID);
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Активация КА", "Начать активацию", ИмяФормыДляМетрики, "Открытие формы отправки уведомлений",, ДопИнформация);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПригласитьПоЭлПочте(Команда)
	
	Если ОтправитьУведомлениеПоставитьГотовКЭПД Или ОтправитьУведомлениеПригласитьВЭДО Тогда

		Если Не ЗначениеЗаполнено(Инициатор) Тогда
			Сообщить("Заполните инициатора отправки уведомления");
			Возврат;
		КонецЕсли;
		
		Если Не ОтправитьНаУказаннуюПочту И Не ОтправитьНаПочтуАдминистратораДД Тогда
			Сообщить("Заполните хотя бы одну электронную почта контрагента");
			Возврат;
		КонецЕсли;
		
		Если ОтправитьНаУказаннуюПочту И Не ЗначениеЗаполнено(ЭлПочта) Тогда
			Сообщить("Заполните электронную почта контрагента");
			Возврат;
		КонецЕсли;
		
		Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.EmailВалидный(ЭлПочта);
		Если ОтправитьНаУказаннуюПочту И Не Результат.Валидный Тогда
			Сообщить(Результат.Ошибка);
			Возврат;
		КонецЕсли;	
				
		Успех = ОтправитьУведомление();
		
		Если Успех Тогда
			Закрыть();	
		Иначе
			Элементы.ФормаПригласитьПоЭлПочте.Заголовок = "Отправить еще уведомление";
		КонецЕсли;
		
	Иначе
		
		УспешноОтправлено = ПригласитьПоЭлПочтеСервер();
		Если УспешноОтправлено Тогда 
			Состояние("Приглашение отправлено",,, БиблиотекаКартинок.КонтурЛогистика_Лого16);
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
				"Когда партнер примет приглашение, вы сможете обмениваться с ним электронными перевозочными документами",,,
				ЭтаФорма,"ОбработчикЗакрытьФорму");
		КонецЕсли;
			
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПочту(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтправитьНаУказаннуюПочтуПриИзменении(Элемент)
	
	Если ОтправитьНаУказаннуюПочту = Истина Тогда
        Элементы.ЭлПочтаУказанная.АвтоОтметкаНезаполненного = Истина;
    Иначе
        Элементы.ЭлПочтаУказанная.АвтоОтметкаНезаполненного = Ложь;
        Элементы.ЭлПочтаУказанная.ОтметкаНезаполненного = Ложь;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправкиНаУказаннуюПочтуНажатие(Элемент)
	КонтурЛогистика_СтдДиалогиКлиент.ПоказатьЗначениеЛок(, ОшибкиОтправкиНаУказаннуюПочту);
КонецПроцедуры

&НаКлиенте
Процедура ЭлПочтаУказаннаяПриИзменении(Элемент)	
	Элементы.РезультатОтправкиНаУказаннуюПочту.Заголовок = "";	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтправкиНаПочтуАдминистратораДДНажатие(Элемент)
	КонтурЛогистика_СтдДиалогиКлиент.ПоказатьЗначениеЛок(, ОшибкиОтправкиНаПочтуАдминистратораДД);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Если ОтправитьУведомлениеПоставитьГотовКЭПД Или ОтправитьУведомлениеПригласитьВЭДО Тогда
		Элементы.ЭлПочта.Видимость = Истина;
		Элементы.ФормаПригласитьПоЭлПочте.Видимость = Истина;
		Элементы.НастроитьПочту.Видимость = Ложь;
		Элементы.ГруппаПочта.Видимость = Истина;
		Элементы.ЭлПочта.Видимость = Ложь;
	Иначе
		Элементы.ЭлПочта.Видимость = НастройкиОтправкиПочтыЗаполнены;
		Элементы.ФормаПригласитьПоЭлПочте.Видимость = НастройкиОтправкиПочтыЗаполнены;
		Элементы.НастроитьПочту.Видимость = Ложь;
		Элементы.ГруппаПочта.Видимость = Ложь;
		Элементы.ЭлПочта.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстПриглашения()
	
	Возврат "" + Инициатор + " переходит на электронные перевозочные документы через Диадок.Логистика.
	|Вы сможете обмениваться электронными транспортными накладными, оформлять электронные путевые листы и другие документы.
	|	
	|Подключайтесь самостоятельно с сертификатом директора: https://support.kontur.ru/logistika/51865-avtoregistraciya_organizacij
	|Или отправив заявку https://kontur.ru/logistika#order или на эл. почту help.logistika@kontur.ru или по телефону +7 800 500 5978"
	
КонецФункции

&НаСервере
Функция ОтправитьУведомление()

	ПолучателиУведомлений = Новый Массив;
	
	Получатель = Новый Структура;
	Получатель.Вставить("ИНН", Контрагент.ИНН);
	Получатель.Вставить("КПП", Контрагент.КПП);
	
	УспехОтправки = Истина;
	
	Если ОтправитьНаУказаннуюПочту Тогда
		
		Получатель.Вставить("Email", ЭлПочта);
		
		ПолучателиУведомлений.Добавить(Получатель);
		
		Ответ = КонтурЛогистика_API_Диадок.Диадок_АПИ_SendEpdInvitationNotifications(Инициатор, ПолучателиУведомлений);
		
		ОбработатьОтвет(Ответ, УспехОтправки, "РезультатОтправкиНаУказаннуюПочту", "ОшибкиОтправкиНаУказаннуюПочту");
				
	КонецЕсли;
	
	Если ОтправитьНаПочтуАдминистратораДД Тогда
		
		ПолучателиУведомлений.Добавить(Получатель);
		
		Ответ = КонтурЛогистика_API_Диадок.Диадок_АПИ_SendEpdInvitationNotifications(Инициатор, ПолучателиУведомлений);
		
		ОбработатьОтвет(Ответ, УспехОтправки, "РезультатОтправкиНаПочтуАдминистратораДД", "ОшибкиОтправкиНаПочтуАдминистратораДД");
		
	КонецЕсли;

	Возврат УспехОтправки;
	
КонецФункции

&НаСервере
Процедура ОбработатьОтвет(Ответ, УспехОтправки, РеквизитРезультата, РеквизитОшибки)
	
	Если Ответ.Status = "Batch_Succeeded" Тогда
		
		Элементы[РеквизитРезультата].Заголовок = "Отправлено";
		Элементы[РеквизитРезультата].Гиперссылка = Ложь;
		Элементы[РеквизитРезультата].ЦветТекста = Новый Цвет(0, 150, 70); //зеленый
		
		ДопИнформация = Новый Структура;
		ДопИнформация.Вставить("BoxID", Инициатор.ID);
		ДопИнформация.Вставить("INN_KA", Контрагент.ИНН);
		ДопИнформация.Вставить("KPP_KA", Контрагент.КПП);
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Активация КА", "Начать активацию", ИмяФормыДляМетрики, "Отправить уведомление",, ДопИнформация);
		
	Иначе
		
		Элементы[РеквизитРезультата].Заголовок = "Ошибка";
		Элементы[РеквизитРезультата].Гиперссылка = Истина;
		Элементы[РеквизитРезультата].ЦветТекста = Новый Цвет(255, 0, 0); //красный
		
		ОписаниеОшибки = ПолучитьОшибкуОтправки(Ответ);
		ЭтаФорма[РеквизитОшибки] = ОписаниеОшибки;
		
		УспехОтправки = Ложь;
		
		ДопИнформация = Новый Структура;
		ДопИнформация.Вставить("BoxID", Инициатор.ID);
		ДопИнформация.Вставить("INN_KA", Контрагент.ИНН);
		ДопИнформация.Вставить("KPP_KA", Контрагент.КПП);
		ДопИнформация.Вставить("ПричинаОшибки", ОписаниеОшибки);
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Активация КА", "Начать активацию", ИмяФормыДляМетрики, "Ошибка отправки",, ДопИнформация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОшибкуОтправки(Ответ)
	
	ОписаниеОшибки = "";
	
	Если Не Ответ.Свойство("Results") Тогда
		Возврат ОписаниеОшибки;
	КонецЕсли;
		
	Для каждого Result Из Ответ.Results Цикл
		
		Если Не Result.Свойство("Errors") Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Error Из Result.Errors Цикл
		
			КодОшибки = "";
			Если Error.Свойство("Code") Тогда
				КодОшибки = Error.Code;
			КонецЕсли;
			
			ТекстОшибки = "";
			Если Error.Свойство("Message") Тогда
				ТекстОшибки = Error.Message;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				ПредставлениеОшибоки = ПредставлениеОшибоки(КодОшибки, ТекстОшибки);
				
				Ошибка = Новый Массив;
				Ошибка.Добавить(КодОшибки);
				Ошибка.Добавить(ПредставлениеОшибоки);
				
				ОписаниеОшибки = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Ошибка, ": ");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

&НаСервере
Функция ПригласитьПоЭлПочтеСервер()

	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = "Приглашение в Диадок.Логистика от " + Инициатор;
	Письмо.Тексты.Добавить(ТекстПриглашения());
	
	Если ЗначениеЗаполнено(ЭлПочта) Тогда
		Письмо.Получатели.Добавить(СокрЛП(ЭлПочта));
	КонецЕсли;
	
	ТекстОшибки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить("Не удалось отправить на почту.
			|Ошибка: " + ТекстОшибки);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОбработчикЗакрытьФорму(Параметр1) Экспорт
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастройкиУчетнойЗаписиЭлектроннойПочты" Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		ПроверитьНастроенностьПочты();
		ОбновитьВидимостьДоступность();
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастроенностьПочты()
	
	НастройкиОтправкиПочтыЗаполнены = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнициаторПоУмолчанию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|ГДЕ
		|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		|	И КонтурЛогистика_ОрганизацииДиадок.Наш";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		Возврат РезультатЗапроса[0].Ссылка;
	Иначе
		Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусГотовностиКЭПДКонтрагента()
	
	Организации = Новый Массив;
	Организации.Добавить(Контрагент);
	
	Попытка
		Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(Организации);
	Исключение
		// Ничего не делаем
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеОшибоки(КодОшибки, ТекстОшибки)
	
	Результат = Новый Структура;	
	Результат.Вставить("DuplicateEvent", "Уведомление контрагенту можно отправить только раз в 5 минут. Попробуйте позже.");
	
	Если Результат.Свойство(КодОшибки) Тогда
		Возврат Результат[КодОшибки];
	Иначе
		Возврат ТекстОшибки;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
