#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеПоСтроке(Значение) Экспорт
	
	Если Значение = "UnknownEpdStatus" Тогда
		
		Возврат Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.UnknownEpdStatus;
		
	ИначеЕсли Значение = "UndefinedEpdStatus" Тогда
		
		Возврат Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.UndefinedEpdStatus;
		
	ИначеЕсли Значение = "Ready" Тогда
		
		Возврат Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.Ready;
		
	ИначеЕсли Значение = "NotReady" Тогда
		
		Возврат Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.NotReady;	
		
	Иначе
		
		Возврат Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.UnknownEpdStatus;
		
	КонецЕсли;
	
КонецФункции

Функция ГотовностьНеОпределена(Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.UndefinedEpdStatus
		Или Значение = Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.UnknownEpdStatus Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли