
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УточнениеТипаЛогистика = "";
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
		Если Форма.Элементы.Найти("ТипЛогистика")<> Неопределено Тогда
			УточнениеТипаЛогистика = Форма.ТипЛогистика;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	СтруктураМассивов = ПолучитьСтруктуруМассивовДокументов(ПараметрКоманды);
	
	ПараметрыВводаДокументов = Новый Структура;
	ПараметрыВводаДокументов.Вставить("МассивДокументов1С", СтруктураМассивов.МассивДокументов1С);
	ПараметрыВводаДокументов.Вставить("МассивДокументовЛогистика", СтруктураМассивов.МассивДокументовЛогистика);
	ПараметрыВводаДокументов.Вставить("УточнениеТипаЛогистика", УточнениеТипаЛогистика);
	ПараметрыВводаДокументов.Вставить("РежимПропуститьДокументы", Истина);
	
	Если ПараметрКоманды.Количество() > 4 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
			"Вы уверены что хотите пропустить " + ПараметрКоманды.Количество() + " документов?",
			РежимДиалогаВопрос.ДаНетОтмена, "Подтвердите обработку",, ЭтотОбъект, "ПропуститьДокументыПакетно", ПараметрыВводаДокументов);
		
	Иначе
		
		ПропуститьДокументыПакетно(Истина, ПараметрыВводаДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьДокументыПакетно(Подтверждено = Истина, ПараметрыВводаПакетно) Экспорт
	
	МассивДокументов1С = ПараметрыВводаПакетно.МассивДокументов1С;
	МассивДокументовЛогистика = ПараметрыВводаПакетно.МассивДокументовЛогистика;
	
	УточнениеТипаЛогистика = ПараметрыВводаПакетно.УточнениеТипаЛогистика;
	
	Если Подтверждено = Истина
		Или Подтверждено = КодВозвратаДиалога.Да Тогда
		
		КонтурЛогистика_ОбработкаДокументовСервер.ПропуститьДокументыПакетно(
			МассивДокументов1С, МассивДокументовЛогистика, УточнениеТипаЛогистика);
		
		Оповестить("КонтурЛогистика_ВвестиДокумент");
		
		Для Каждого ДокументСсылка Из ПараметрыВводаПакетно.МассивДокументовЛогистика Цикл
			ОповеститьОбИзменении(ДокументСсылка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруМассивовДокументов(ИсходныйМассивСсылок)
	
	МассивДокументов1С = Новый Массив;
	МассивДокументовЛогистика = Новый Массив;
	
	Для Каждого Ссылка Из ИсходныйМассивСсылок Цикл
	
		Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Ссылка)
			Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Ссылка) Тогда
			
			Если ЗначениеЗаполнено(Ссылка.ДокументОснование) Тогда
				МассивДокументов1С.Добавить(Ссылка.ДокументОснование);
				МассивДокументовЛогистика.Добавить(Ссылка);
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "У документа " + Ссылка + " отсутствует основание!";
				Сообщение.Сообщить();
			КонецЕсли;
		Иначе
			МассивДокументов1С.Добавить(Ссылка);
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Новый Структура("МассивДокументов1С, МассивДокументовЛогистика", МассивДокументов1С, МассивДокументовЛогистика);
	
КонецФункции