#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Об = РеквизитФормыВЗначение("Объект");
	СКД = Об.ПолучитьМакет("ОтборПартнеры");
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	ОтборПартнеры.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	НастройкиПоУмолчанию = СКД.НастройкиПоУмолчанию;
	ОтборПартнеры.ЗагрузитьНастройки(НастройкиПоУмолчанию);

	ТЗКомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.НайтиПоПолномуИмени(
		"Документ.РеализацияТоваровУслуг"));
	ВывестиКомандыПечати(ТЗКомандыПечати);

	СразуНаПринтер = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьТаблицуЗаказыКлиентовНаСервере(ОтборДатаОтгрузки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборСпособДоставкиПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ОтборДатаОтгрузки) Тогда
		Сообщить("Не выбрана дата отгрузки.. ");
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуЗаказыКлиентовНаСервере(ОтборДатаОтгрузки);

КонецПроцедуры

&НаКлиенте
Процедура ОтборПартнерПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ОтборДатаОтгрузки) Тогда
		Сообщить("Не выбрана дата отгрузки.. ");
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуЗаказыКлиентовНаСервере(ОтборДатаОтгрузки);

КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ОтборДатаОтгрузки) Тогда
		Сообщить("Не выбрана дата отгрузки.. ");
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуЗаказыКлиентовНаСервере(ОтборДатаОтгрузки);

КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОтгрузкиПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ОтборДатаОтгрузки) Тогда
		Сообщить("Не выбрана дата отгрузки.. ");
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуЗаказыКлиентовНаСервере(ОтборДатаОтгрузки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицуНастройкиКомплектов(Команда)
	ЗаполнитьТаблицуНастройкиКомплектовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненности(Команда)

	Если Элементы.ДЗ_ЗаказыКлиентов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущийЗаказ = Элементы.ДЗ_ЗаказыКлиентов.ТекущиеДанные.ЗаказКлиента;
	ОткрытьФорму("ОбщаяФорма.СвязанныеДокументы", Новый Структура("ОбъектОтбора", ТекущийЗаказ));

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуЗаказыКлиентов(Команда)

	Если Не ЗначениеЗаполнено(ОтборДатаОтгрузки) Тогда
		Сообщить("Не выбрана дата отгрузки.. ");
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуЗаказыКлиентовНаСервере(ОтборДатаОтгрузки);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Если Не Т.Выбран Тогда
			Продолжить;
		КонецЕсли;
		Рез = СоздатьРеализациюНаСервере(Т.ЗаказКлиента);
		Если Рез Тогда
			КоличествоРеализация = ТЗ_Реализация.Количество();
			МассивРеализация = ПолучитьРеализацию(Т.ЗаказКлиента);
			Т.ФлагРеализация = ПолучитьКартинкуРеализация(МассивРеализация, Т.ЗаказКлиента);
			Т.Состояние = ПолучитьСостояниеЗаказа(Т.ЗаказКлиента);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализациюСчетФактуру(Команда)

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Если Не Т.Выбран Тогда
			Продолжить;
		КонецЕсли;
		Рез = СоздатьРеализациюНаСервере(Т.ЗаказКлиента);
		Если Рез Тогда
			КоличествоРеализация = ТЗ_Реализация.Количество();
			МассивРеализация	= ПолучитьРеализацию(Т.ЗаказКлиента);
			Т.ФлагРеализация = ПолучитьКартинкуРеализация(МассивРеализация, Т.ЗаказКлиента);
			Т.Состояние		 = ПолучитьСостояниеЗаказа(Т.ЗаказКлиента);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Если Не Т.Выбран Тогда
			Продолжить;
		КонецЕсли;

		НайденыСтроки = ТЗ_Реализация.НайтиСтроки(Новый Структура("ЗаказКлиента", Т.ЗаказКлиента));

		Рез = Ложь;
		Для Каждого ТТ Из НайденыСтроки Цикл
			Рез = СоздатьСФНаСервере(ТТ.Документ);
		КонецЦикла;

		Если Рез Тогда
			КоличествоСчетФактура = ТЗ_СчетФактуры.Количество();

			МассивСФ = Новый Массив;
			МассивРеализация = ПолучитьРеализацию(Т.ЗаказКлиента);
			Для Каждого ТТ Из МассивРеализация Цикл
				СчетФактура	= ПолучитьСчетФактуру(ТТ);
				Если ЗначениеЗаполнено(СчетФактура) Тогда
					МассивСФ.Добавить(СчетФактура);
				КонецЕсли;
			КонецЦикла;

			Т.ФлагСчетФактура = ПолучитьКартинкуСФ(МассивСФ, Т.ЗаказКлиента);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуру(Команда)

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Если Не Т.Выбран Тогда
			Продолжить;
		КонецЕсли;

		НайденыСтроки = ТЗ_Реализация.НайтиСтроки(Новый Структура("ЗаказКлиента", Т.ЗаказКлиента));

		Рез = Ложь;
		Для Каждого ТТ Из НайденыСтроки Цикл
			Рез = СоздатьСФНаСервере(ТТ.Документ);
		КонецЦикла;

		Если Рез Тогда
			КоличествоСчетФактура = ТЗ_СчетФактуры.Количество();

			МассивСФ = Новый Массив;
			МассивРеализация = ПолучитьРеализацию(Т.ЗаказКлиента);
			Для Каждого ТТ Из МассивРеализация Цикл
				СчетФактура	= ПолучитьСчетФактуру(ТТ);
				Если ЗначениеЗаполнено(СчетФактура) Тогда
					МассивСФ.Добавить(СчетФактура);
				КонецЕсли;
			КонецЦикла;

			Т.ФлагСчетФактура = ПолучитьКартинкуСФ(МассивСФ, Т.ЗаказКлиента);

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПередачу(Команда)

	ЛогСообщить("");
	ЛогСообщить(" ~~~~~~~~~~~~~~~~ передача товаров ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Если Не Т.Выбран Тогда
			Продолжить;
		КонецЕсли;

		Если Т.ФлагПередача > 0 Тогда
			Продолжить;
		КонецЕсли;

		ОрганизацияПолучатель = ЗначениеРеквизитаОбъекта(Т.ЗаказКлиента, "Организация");
		ОрганизацияОтправитель = ПолучитьОрганизациюКорреспондента(ОрганизацияПолучатель);

		ЛогСообщить(" - Организация получатель: " + ОрганизацияПолучатель);
		ЛогСообщить(" - Организация отправитель: " + ОрганизацияОтправитель);

		Если Не ЗначениеЗаполнено(ОрганизацияОтправитель) Тогда
			Сообщить("Не определена организация-отправитель " + Т.ЗаказКлиента + ", " + ОрганизацияПолучатель);
			ЛогСообщить("Не определена организация-отправитель " + Т.ЗаказКлиента + ", " + ОрганизацияПолучатель);
			Возврат;
		КонецЕсли;

		Организации = Организации();

		Если ОрганизацияПолучатель = Организации.Сергиенко1 Тогда

			ЛогСообщить(" - Создание документов, 2 этапа..");

			Рез = СоздатьПередачуНаСервере(Т.ЗаказКлиента, Организации.СергиенкоИП, Организации.ООО, Организации);
			Если Рез Тогда
				ЛогСообщить(" - ..создан документ для заказа: " + Т.ЗаказКлиента + " получатель: "
					+ Организации.СергиенкоИП + " отправитель: " + Организации.ООО);
			Иначе
				ЛогСообщить(" ! Ошибка, первый документ");
			КонецЕсли;

			Рез = СоздатьПередачуНаСервере(Т.ЗаказКлиента, ОрганизацияПолучатель, Организации.СергиенкоИП, Организации);
			Если Рез Тогда
				ЛогСообщить(" - ..создан документ для заказа: " + Т.ЗаказКлиента + " получатель: "
					+ ОрганизацияПолучатель + " отправитель: " + Организации.СергиенкоИП);
			Иначе
				ЛогСообщить(" ! Ошибка, второй документ");
			КонецЕсли;
		Иначе
			ЛогСообщить(" - Создание документов, 1 этап..");
			Рез = СоздатьПередачуНаСервере(Т.ЗаказКлиента, ОрганизацияПолучатель, ОрганизацияОтправитель, Организации);
			Если Рез Тогда
				ЛогСообщить(" - ..создан документ для заказа: " + Т.ЗаказКлиента + " получатель: "
					+ ОрганизацияПолучатель + " отправитель: " + ОрганизацияОтправитель);
			Иначе
				ЛогСообщить(" ! Ошибка, создания документа Передача товаров");
			КонецЕсли;

		КонецЕсли;

		Если Рез Тогда
			КоличествоПередача = ТЗ_ПередачаТоваров.Количество();
			МассивПередача = Новый Массив;
			СтрокиТЗ = ТЗ_ПередачаТоваров.НайтиСтроки(Новый Структура("ЗаказКлиента", Т.ЗаказКлиента));
			Для Каждого ТТ Из СтрокиТЗ Цикл
				МассивПередача.Добавить(ТТ.Документ);
			КонецЦикла;
			Т.ФлагПередача = ПолучитьКартинкуПередача(МассивПередача, Т.ЗаказКлиента);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Напечатать(Команда)

	НайденаСтрока = КомандыПечати.НайтиСтроки(Новый Структура("Идентификатор", Команда.Имя));
	Если НайденаСтрока.Количество() = 0 Тогда
		Сообщить("Не определена команда печати");
		Возврат;
	КонецЕсли;

	ИмяМенеджераПечати		= НайденаСтрока[0].МенеджерПечати;
	Обработчик				= НайденаСтрока[0].Обработчик;
	Идентификатор			= НайденаСтрока[0].Идентификатор;
	ИдентификаторОриг		= НайденаСтрока[0].ИдентификаторОриг;
	ДополнительныеПараметры	= ЗначениеИзСтрокиВн(НайденаСтрока[0].ДополнительныеПараметры);

	МассивОбъектов = Новый Массив;
	МассивЗаказов = Новый Массив;
	Для Каждого СтрокаДЗ Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл

		Если Не СтрокаДЗ.Выбран Тогда
			Продолжить;
		КонецЕсли;

		СтрокиРеализации = ТЗ_Реализация.НайтиСтроки(Новый Структура("ЗаказКлиента", СтрокаДЗ.ЗаказКлиента));
		Для Каждого СтрокаРеализации Из СтрокиРеализации Цикл
			МассивОбъектов.Добавить(СтрокаРеализации.Документ);
		КонецЦикла;
		МассивЗаказов.Добавить(СтрокаДЗ.ЗаказКлиента);
	КонецЦикла;

	Если МассивОбъектов.Количество() = 0 Тогда
		Сообщить("Не определены документы для печати..");
		Возврат;
	КонецЕсли;

	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("ОбъектыПечати", МассивОбъектов);
	ОписаниеКоманды.Вставить("Идентификатор", ИдентификаторОриг);
	ОписаниеКоманды.Вставить("Форма", ЭтотОбъект);
	ОписаниеКоманды.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	Если ЗначениеЗаполнено(ИмяМенеджераПечати) Тогда
		Если ИмяМенеджераПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
			МодульДополнительныеОтчетыИОбработкиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
				"ДополнительныеОтчетыИОбработкиКлиент");
			МодульДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуПечати(ОписаниеКоманды, ЭтотОбъект);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяМенеджераПечати, ИдентификаторОриг, МассивОбъектов,
				ЭтотОбъект, ДополнительныеПараметры);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Обработчик) Тогда
		Обработчик = Обработчик + "(ОписаниеКоманды)";
		Результат = Вычислить(Обработчик);
	ИначеЕсли Команда.Имя = "КомплектДокументовНаПринтерДоп" Тогда
		П = Новый Структура;
		П.Вставить("МассивОбъектов", МассивОбъектов);
		П.Вставить("МассивЗаказов", МассивЗаказов);
		П.Вставить("КомплектыДокументов", КомплектыДокументов);
		ПечатьКомплектаДокументов(П);
	Иначе
		Сообщить("Не определен обработчик печати");
	КонецЕсли;

	ЗаписатьРаспечатано(МассивЗаказов);
	УстановитьРаспечатано(МассивЗаказов);

КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВыделенныеСтроки(Команда)

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Т.Выбран = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВыделенныеСтроки(Команда)

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Т.Выбран = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)

	СвернутьВсеДеревоРекурсивно(ДЗ_ЗаказыКлиентов.ПолучитьЭлементы());

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)

	Для Каждого Ид Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Элементы.ДЗ_ЗаказыКлиентов.Развернуть(Ид.ПолучитьИдентификатор(), Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьТаблицуЗаказыКлиентов

Функция ПолучитьКартинкуПередача(п_Массив, п_Заказ)

	Рез = 0;
	Если п_Массив.Количество() > 1 Тогда
		Рез = 4;
	ИначеЕсли п_Массив.Количество() > 0 Тогда
		Рез = 1;
	ИначеЕсли п_Массив.Количество() = 0 Тогда
		ЕстьСтрокаОтгрузить = Ложь;
		Для Каждого Т Из п_Заказ.Товары Цикл
			Если Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
				ЕстьСтрокаОтгрузить = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Не ЕстьСтрокаОтгрузить Тогда
			Рез = 3;
		КонецЕсли;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьКартинкуСФ(п_Массив, п_Заказ)

	Если п_Заказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		Возврат 2;
	КонецЕсли;

	Рез = 0;
	Если п_Массив.Количество() > 1 Тогда
		Рез = 4;
	ИначеЕсли п_Массив.Количество() > 0 Тогда
		Рез = 1;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьКартинкуРеализация(п_Массив, п_Заказ)

	ПроцентОтгрузки = ПолучитьПроцентОтгрузки(п_Заказ);

	Рез = 0;
	Если п_Массив.Количество() > 1 Тогда
		Рез = 4;
		Если ПроцентОтгрузки < 100 Тогда
			Рез = 7;
		КонецЕсли;
	ИначеЕсли п_Массив.Количество() > 0 Тогда
		Рез = 1;
		Если ПроцентОтгрузки < 100 И п_Заказ.ХозяйственнаяОперация
			<> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
			Рез = 6;
		КонецЕсли;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьКартинкуРТО(п_Массив)

	Рез = 0;
	Если п_Массив.Количество() > 1 Тогда
		Рез = 4;
	ИначеЕсли п_Массив.Количество() > 0 Тогда
		ТекСтатус = п_Массив[0].Статус;
		Если ТекСтатус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Или ТекСтатус
			= Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Или ТекСтатус = Перечисления.СтатусыРасходныхОрдеров.Проверен
			Или ТекСтатус = Перечисления.СтатусыРасходныхОрдеров.КОтбору Тогда
			Рез = 1;
		Иначе
			Рез = 5;
		КонецЕсли;
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьПередачу(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ДополнительныеРеквизиты КАК ПередачаТоваровМеждуОрганизациямиДополнительныеРеквизиты
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациямиДополнительныеРеквизиты.Свойство = &Свойство
	|	И ПередачаТоваровМеждуОрганизациямиДополнительныеРеквизиты.Значение = &Значение
	|	И ПередачаТоваровМеждуОрганизациямиДополнительныеРеквизиты.Ссылка.Проведен";

	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
		"Заказ клиента", Истина));

	ТекЗначение = п_ЗаказКлиента.Номер + " от " + Формат(п_ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy");

	Запрос.УстановитьПараметр("Значение", ТекЗначение);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Функция ПолучитьРеализацию(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Дата КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|		РеализацияТоваровУслуг.Дата КАК Дата
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
	|		И РеализацияТоваровУслуг.Проведен
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Ссылка,
	|		РеализацияТоваровУслугТовары.Ссылка.Дата
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
	|		И РеализацияТоваровУслугТовары.Ссылка.Проведен) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Дата УБЫВ";

	Запрос.УстановитьПараметр("ЗаказКлиента", п_ЗаказКлиента);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Функция ПолучитьРТО(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен";

	Запрос.УстановитьПараметр("Распоряжение", п_ЗаказКлиента);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Функция ПолучитьСчетФактуру(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен";

	Запрос.УстановитьПараметр("ДокументОснование", п_Реализация);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции // ()

Процедура ЗаполнитьТаблицуЗаказыКлиентовНаСервере(п_ДатаОтгрузки)

	УстановитьПривилегированныйРежим(Истина);

	ТЗ_РТО.Очистить();
	ТЗ_Реализация.Очистить();
	ТЗ_СчетФактуры.Очистить();
	ТЗ_ПередачаТоваров.Очистить();

	Запрос = Новый Запрос;
	ЗапросТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Партнер,
	|	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация,
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО ЗаказКлиентаТовары.Ссылка = СостоянияЗаказовКлиентов.Заказ
	|ГДЕ
	|	ЗаказКлиентаТовары.ДатаОтгрузки = &ДатаОтгрузки
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|	И СостоянияЗаказовКлиентов.Состояние = &Состояние
	|	И ЗаказКлиентаТовары.Ссылка.Партнер В(&Партнер)
	|	И ЗаказКлиентаТовары.Ссылка.СпособДоставки = &СпособДоставки
	|ИТОГИ
	|	МАКСИМУМ(Состояние)
	|ПО
	|	ЗаказКлиента";

	Запрос.УстановитьПараметр("ДатаОтгрузки", п_ДатаОтгрузки);

	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		Запрос.УстановитьПараметр("Состояние", ОтборСостояние);
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "И СостоянияЗаказовКлиентов.Состояние = &Состояние", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборСпособДоставки) Тогда
		Запрос.УстановитьПараметр("СпособДоставки", ОтборСпособДоставки);
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "И ЗаказКлиентаТовары.Ссылка.СпособДоставки = &СпособДоставки", "");
	КонецЕсли;

#Область Партнеры

	СКД = ПолучитьИзВременногоХранилища(АдресСхемы);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, ОтборПартнеры.Настройки, , , Тип(
		"ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ_Отбор = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

	М_Отбор = ТЗ_Отбор.ВыгрузитьКолонку("Партнер");

	Если ЗначениеЗаполнено(М_Отбор.Количество() > 0) Тогда
		Запрос.УстановитьПараметр("Партнер", М_Отбор);
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "И ЗаказКлиентаТовары.Ссылка.Партнер В(&Партнер)", "");
	КонецЕсли;

#КонецОбласти

	Запрос.Текст = ЗапросТекст;

	РезультатЗапроса = Запрос.Выполнить();

	ДеревоЗначения = РеквизитФормыВЗначение("ДЗ_ЗаказыКлиентов");
	ДеревоЗначения.Строки.Очистить();
	Элементы.ДЗ_ЗаказыКлиентов.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;

	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	КоличествоРТО = 0;
	КоличествоПередача = 0;
	КоличествоРеализация = 0;
	КоличествоСчетФактура = 0;

	Пока ВыборкаЗаказ.Следующий() Цикл

		СтрокаЗаказ = ДеревоЗначения.Строки.Добавить();

		ЗаполнитьЗначенияСвойств(СтрокаЗаказ, ВыборкаЗаказ);

		СтрокаЗаказ.Выбран = Истина;

		МассивРТО = ПолучитьРТО(ВыборкаЗаказ.ЗаказКлиента);
		СтрокаЗаказ.ФлагРасходныйОрдер = ПолучитьКартинкуРТО(МассивРТО);
		КоличествоРТО = КоличествоРТО + МассивРТО.Количество();
		Для Каждого Т Из МассивРТО Цикл
			НоваяСтрока = ТЗ_РТО.Добавить();
			НоваяСтрока.Документ = Т.Ссылка;
			НоваяСтрока.ЗаказКлиента = ВыборкаЗаказ.ЗаказКлиента;
		КонецЦикла;

		МассивРеализация = ПолучитьРеализацию(ВыборкаЗаказ.ЗаказКлиента);
		СтрокаЗаказ.ФлагРеализация = ПолучитьКартинкуРеализация(МассивРеализация, ВыборкаЗаказ.ЗаказКлиента);
		КоличествоРеализация = КоличествоРеализация + МассивРеализация.Количество();
		МассивСФ = Новый Массив;
		Для Каждого Т Из МассивРеализация Цикл
			НоваяСтрока = ТЗ_Реализация.Добавить();
			НоваяСтрока.Документ = Т.Ссылка;
			НоваяСтрока.ЗаказКлиента = ВыборкаЗаказ.ЗаказКлиента;

			СчетФактура	= ПолучитьСчетФактуру(Т.Ссылка);
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				НоваяСтрока = ТЗ_СчетФактуры.Добавить();
				НоваяСтрока.Документ = СчетФактура;
				НоваяСтрока.ЗаказКлиента = ВыборкаЗаказ.ЗаказКлиента;
				КоличествоСчетФактура = КоличествоСчетФактура + 1;
				МассивСФ.Добавить(СчетФактура);
			КонецЕсли;
		КонецЦикла;

		СтрокаЗаказ.ФлагСчетФактура = ПолучитьКартинкуСФ(МассивСФ, ВыборкаЗаказ.ЗаказКлиента);

		МассивПередача = ПолучитьПередачу(ВыборкаЗаказ.ЗаказКлиента);

		СтрокаЗаказ.ФлагПередача = ПолучитьКартинкуПередача(МассивПередача, ВыборкаЗаказ.ЗаказКлиента);

		КоличествоПередача = КоличествоПередача + МассивПередача.Количество();
		Для Каждого Т Из МассивПередача Цикл
			НоваяСтрока = ТЗ_ПередачаТоваров.Добавить();
			НоваяСтрока.Документ = Т.Ссылка;
			НоваяСтрока.ЗаказКлиента = ВыборкаЗаказ.ЗаказКлиента;
		КонецЦикла;

		ВыборкаНоменклатура = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаНоменклатура.Следующий() Цикл
			СтрокаНоменклатура = СтрокаЗаказ.Строки.Добавить();
			СтрокаНоменклатура.Номенклатура			= ВыборкаНоменклатура.Номенклатура;
			СтрокаНоменклатура.ВариантОбеспечения	= ВыборкаНоменклатура.ВариантОбеспечения;
			СтрокаНоменклатура.Количество			= ВыборкаНоменклатура.Количество;
		КонецЦикла;

		СтрокаЗаказ.Распечатано = ПолучитьРаспечатано(ВыборкаЗаказ.ЗаказКлиента);

	КонецЦикла;

	ЗначениеВРеквизитФормы(ДеревоЗначения, "ДЗ_ЗаказыКлиентов");

КонецПроцедуры

#КонецОбласти

#Область СоздатьРеализацию

Функция ПолучитьЗаказы(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РеализацияТоваровУслугТовары.ЗаказКлиента
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка = &Ссылка) КАК ВложенныйЗапрос";

	Запрос.УстановитьПараметр("Ссылка", п_Реализация);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказКлиента");

КонецФункции // ()

Функция ПолучитьОстаткиПоОрганизации(п_Организация, п_Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			,
	|			Организация = &Организация
	|				И АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура) КАК ТоварыОрганизацийОстатки";

	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("Организация", п_Организация);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток;
	КонецЕсли;

	Возврат 0;

КонецФункции // ()

Функция ПолучитьСостояниеЗаказа(ТекущийЗаказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ";

	Запрос.УстановитьПараметр("Заказ", ТекущийЗаказ);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	КонецЕсли;

	Возврат "";

КонецФункции // ()

Функция ПолучитьПроцентОтгрузки(п_Заказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ";

	Запрос.УстановитьПараметр("Заказ", п_Заказ);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтгрузки;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция ВЗаказеТолькоУслуги(п_ЗаказКлиента)

	Для Каждого Т Из п_ЗаказКлиента.Товары Цикл

		Если Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда
			Продолжить;
		КонецЕсли;

		Если Т.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;

	Возврат Истина;

КонецФункции // ()

Функция ПолучитьСтрокиКЗаполнениюСерийныхНомеров(ВыделенныеСтроки)

	М = Новый Массив;

	Для Каждого п_ЗаказКлиента Из ВыделенныеСтроки Цикл
		Для Каждого Т Из п_ЗаказКлиента.Товары Цикл
			Если Т.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
				Если Т.Количество > 0 Тогда
					Для А = 0 По Т.Количество - 1 Цикл
						С = Новый Структура;
						С.Вставить("НомерСтроки", Т.НомерСтроки);
						С.Вставить("Номенклатура", Т.Номенклатура);
						С.Вставить("Заказ", п_ЗаказКлиента);
						С.Вставить("ЗаказНаСайте", ПолучитьДатуНомерЗаказаНаСайте(п_ЗаказКлиента));
						М.Добавить(С);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат М;

КонецФункции

Функция ПолучитьДатуЗаказаНаСайте(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиентаДополнительныеРеквизиты.Свойство.Наименование = ""Дата заказа на сайте (Список заказов клиентов)""
	|				ТОГДА ЗаказКлиентаДополнительныеРеквизиты.Значение
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ДатаЗаказаССайта
	|ИЗ
	|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|ГДЕ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка";

	Запрос.УстановитьПараметр("Ссылка", п_ЗаказКлиента);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаЗаказаССайта;
	КонецЕсли;

	Возврат "";

КонецФункции

Функция ПолучитьДатуНомерЗаказаНаСайте(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиентаДополнительныеРеквизиты.Свойство.Наименование = ""Номер заказа на сайте (Список заказов клиентов)""
	|				ТОГДА ЗаказКлиентаДополнительныеРеквизиты.Значение
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК НомерЗаказаССайта,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиентаДополнительныеРеквизиты.Свойство.Наименование = ""Дата заказа на сайте (Список заказов клиентов)""
	|				ТОГДА ЗаказКлиентаДополнительныеРеквизиты.Значение
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ДатаЗаказаССайта
	|ИЗ
	|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|ГДЕ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка";

	Запрос.УстановитьПараметр("Ссылка", п_ЗаказКлиента);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат "" + Выборка.НомерЗаказаССайта + " от " + Формат(Выборка.ДатаЗаказаССайта, "ДФ=dd.MM.yyyy");
	КонецЕсли;

	Возврат "";

КонецФункции

Функция СоздатьРеализациюНаСервере(ТекущийЗаказ)

	УстановитьПривилегированныйРежим(Истина);

	Если Не ВЗаказеТолькоУслуги(ТекущийЗаказ) Тогда
		ПроцентОтгрузки = ПолучитьПроцентОтгрузки(ТекущийЗаказ);
		Если ПроцентОтгрузки = 100 Тогда
			Сообщить("" + ТекущийЗаказ + " полностью реализован");
			Возврат Ложь;
		КонецЕсли;
		СостояниеЗаказа = ПолучитьСостояниеЗаказа(ТекущийЗаказ);
		Если СостояниеЗаказа <> Перечисления.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки И СостояниеЗаказа
			<> Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение Тогда
			Сообщить("Не удалось перевести заказ в состояние 'К отгрузке' " + ТекущийЗаказ);
			Сообщить("Требуется состояние 'В процессе отгрузки' или 'Ожидается обеспечение'" + ТекущийЗаказ);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	РТО_ВСтатусе = Ложь;
	МассивРТО = ПолучитьРТО(ТекущийЗаказ);
	Для Каждого РТО Из МассивРТО Цикл
		Если РТО.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Или РТО.Статус
			= Перечисления.СтатусыРасходныхОрдеров.Проверен Или РТО.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору
			Или РТО.Статус = Перечисления.СтатусыРасходныхОрдеров.КПроверке Тогда
			РТО_ВСтатусе = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Не РТО_ВСтатусе Тогда
		Сообщить("Расходный ордер на товары должен быть в статусе К отгрузке, К отбору, К проверке или Проверен");
		Возврат Ложь;
	КонецЕсли;

	Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Док.Заполнить(ТекущийЗаказ);

	Док.Дата				= ТекущаяДатаСеанса();
	Док.Подразделение		= ТекущийЗаказ.Подразделение;
	Док.СкидкиРассчитаны	= Истина;

	Если Док.Товары.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого Т Из Док.Товары Цикл
		Если Т.ПроцентАвтоматическойСкидки <> 0 И Т.СуммаАвтоматическойСкидки = 0 Тогда
			Т.СуммаАвтоматическойСкидки = Т.Цена * Т.КоличествоУпаковок - Т.СуммаСНДС;
		КонецЕсли;
	КонецЦикла;

	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);

		НоваяСтрока = ТЗ_Реализация.Добавить();
		НоваяСтрока.Документ = Док.Ссылка;
		НоваяСтрока.ЗаказКлиента = ТекущийЗаказ;

		Возврат Истина;
	Исключение
		Сообщить("Ошибка записи: " + Док + " " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СоздатьСФ

Функция СоздатьСФНаСервере(п_Реализация)

	УстановитьПривилегированныйРежим(Истина);

	Если п_Реализация.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		Возврат Ложь;
	КонецЕсли;

	ДокТест = Документы.СчетФактураВыданный.НайтиПоНомеру(п_Реализация.Номер, п_Реализация.Дата);
	Если Не ДокТест.Пустая() Тогда
		Сообщить("Создание Счет-фактуры, номер занят: " + п_Реализация.Номер);
		Возврат Ложь;
	КонецЕсли;

	СФ = Документы.СчетФактураВыданный.СоздатьДокумент();

	ДанныеСчетаФактуры = Новый Структура;
	ДанныеСчетаФактуры.Вставить("ДокументОснование", п_Реализация);
	ДанныеСчетаФактуры.Вставить("Организация", п_Реализация.Организация);

	СФ.Заполнить(ДанныеСчетаФактуры);

	СФ.Номер				= п_Реализация.Номер;
	СФ.ПредставлениеНомера	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(п_Реализация.Номер, Истина, Истина);

	ТаблицаПлатежноРасчетныеДокументы = Новый ТаблицаЗначений;
	ТаблицаПлатежноРасчетныеДокументы.Колонки.Добавить("НомерПлатежноРасчетногоДокумента");
	ТаблицаПлатежноРасчетныеДокументы.Колонки.Добавить("ДатаПлатежноРасчетногоДокумента");

	СписокОснований = Новый СписокЗначений;
	СписокОснований.Добавить(п_Реализация);

	Документы.СчетФактураВыданный.ЗаполнитьПлатежноРасчетныеДокументы(
		ТаблицаПлатежноРасчетныеДокументы, СписокОснований.ВыгрузитьЗначения(), СФ.Организация);

	СФ.ПлатежноРасчетныеДокументы.Загрузить(ТаблицаПлатежноРасчетныеДокументы);
	СФ.СтрокаПлатежноРасчетныеДокументы = Документы.СчетФактураВыданный.СтрокаРасчетноПлатежныхДокументов(
		СФ.ПлатежноРасчетныеДокументы);

	Попытка
		СФ.Записать(РежимЗаписиДокумента.Проведение);

		МассивЗаказы = ПолучитьЗаказы(п_Реализация);
		Для Каждого Т Из МассивЗаказы Цикл
			НоваяСтрока = ТЗ_СчетФактуры.Добавить();
			НоваяСтрока.Документ = СФ.Ссылка;
			НоваяСтрока.ЗаказКлиента = Т;
		КонецЦикла;

		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ()

#КонецОбласти

#Область СоздатьПередачуТоваровМеждуОрганизациями

Функция ЦенаПоВиду(п_Номенклатура, п_ВидЦены, п_Дата)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаЦены,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";

	Запрос.УстановитьПараметр("ВидЦены", п_ВидЦены);
	Запрос.УстановитьПараметр("ДатаЦены", п_Дата);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;

	Возврат 0;

КонецФункции // ()

Функция ПолучитьОрганизациюКорреспондента(п_Организация)

	СпрНастройкиГруппа = Справочники.qw_Константы.НайтиПоНаименованию("Передача товаров между организациями", Истина);
	Если Не ЗначениеЗаполнено(СпрНастройкиГруппа) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = Справочники.qw_Константы.Выбрать(СпрНастройкиГруппа);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Значение = п_Организация Тогда
			Возврат Выборка.Значения[0].Значение;
		КонецЕсли;
	КонецЦикла;

	Сообщить("Не найдена настройка передачи товаров между организациями");

КонецФункции // ()

Функция СоздатьПередачуНаСервере(п_ЗаказКлиента, п_ОрганизацияПолучатель, п_ОрганизацияОтправитель, Организации)

	УстановитьПривилегированныйРежим(Истина);

	СостояниеЗаказа = ПолучитьСостояниеЗаказа(п_ЗаказКлиента);

	Если СостояниеЗаказа <> Перечисления.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки И СостояниеЗаказа
		<> Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки И СостояниеЗаказа
		<> Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки Тогда
		Сообщить("Не удалось перевести заказ в состояние 'К отгрузке' " + п_ЗаказКлиента);
		ЛогСообщить("Не удалось перевести заказ в состояние 'К отгрузке' " + п_ЗаказКлиента);
		Возврат Ложь;
	КонецЕсли;

	Док = Документы.ПередачаТоваровМеждуОрганизациями.СоздатьДокумент();
	Док.Заполнить(п_ЗаказКлиента);

	Док.Дата					= ТекущаяДатаСеанса();
	Док.Подразделение			= п_ЗаказКлиента.Подразделение;
	Док.Организация				= п_ОрганизацияОтправитель;
	Док.ОрганизацияПолучатель	= п_ОрганизацияПолучатель;
	Док.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию;
	Док.Склад					= п_ЗаказКлиента.Склад;
	Док.ЦенаВключаетНДС			= Истина;
	Док.ДатаПлатежа				= ТекущаяДатаСеанса();
	Док.НалогообложениеНДС		= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;

	Док.Руководитель = "";
	Док.ГлавныйБухгалтер = "";

	Если Док.ОрганизацияПолучатель = Организации.Сергиенко1 Тогда
		Док.ВидЦены	= Справочники.ВидыЦен.НайтиПоНаименованию("Транзит с НДС", Истина);
	ИначеЕсли Док.ОрганизацияПолучатель = Организации.СергиенкоИП Тогда
		Док.ВидЦены	= Справочники.ВидыЦен.НайтиПоНаименованию("Комиссия 5", Истина);
	КонецЕсли;

	Для Каждого Т Из п_ЗаказКлиента.Товары Цикл
		Если Т.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		НоваяСтрока.ВидЦены 	= Док.ВидЦены;
		НоваяСтрока.Цена		= ЦенаПоВиду(НоваяСтрока.Номенклатура, Док.ВидЦены, Док.Дата);
		НоваяСтрока.Сумма		= НоваяСтрока.КоличествоУпаковок * НоваяСтрока.Цена;
		НоваяСтрока.СуммаСНДС	= НоваяСтрока.КоличествоУпаковок * НоваяСтрока.Цена;
		Если Док.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС Тогда
			Если Док.ОрганизацияПолучатель = Организации.Сергиенко1 Тогда
				НоваяСтрока.СтавкаНДС	= Перечисления.СтавкиНДС.НДС5;
				НоваяСтрока.СуммаНДС	= НоваяСтрока.СуммаСНДС * 5 / 105;
			Иначе
				НоваяСтрока.СтавкаНДС	= Перечисления.СтавкиНДС.НДС22;
				НоваяСтрока.СуммаНДС	= НоваяСтрока.СуммаСНДС * 22 / 122;
			КонецЕсли;
		Иначе
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
	КонецЦикла;

	Если Док.Товары.Количество() = 0 Тогда
		ЛогСообщить(" - отмена создания, не заполнена таблица Товары");
		Возврат Ложь;
	КонецЕсли;

	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);

		НоваяСтрока = ТЗ_ПередачаТоваров.Добавить();
		НоваяСтрока.Документ = Док.Ссылка;
		НоваяСтрока.ЗаказКлиента = п_ЗаказКлиента;

		ЛогСообщить("Записан документ: " + Док);

	Исключение
		Сообщить("! Ошибка записи: " + Док + " " + ОписаниеОшибки());
		ЛогСообщить("! Ошибка записи: " + Док + " " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Если ЗначениеЗаполнено(Док.Ссылка) Тогда
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			ЛогСообщить("Проведен документ: " + Док);
		Исключение
			Сообщить("! Ошибка проведения: " + Док + " " + ОписаниеОшибки());
			ЛогСообщить("! Ошибка проведения: " + Док + " " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;

	ЗначенияДополнительныхРеквизитов = Новый ТаблицаЗначений;
	ЗначенияДополнительныхРеквизитов.Колонки.Добавить("Свойство");
	ЗначенияДополнительныхРеквизитов.Колонки.Добавить("Значение");

	НоваяСтрока = ЗначенияДополнительныхРеквизитов.Добавить();
	НоваяСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
		"Заказ клиента", Истина);
	НоваяСтрока.Значение = п_ЗаказКлиента.Номер + " от " + Формат(п_ЗаказКлиента.Дата, "ДФ=dd.MM.yyyy");

	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Док.Ссылка, ЗначенияДополнительныхРеквизитов);

	Возврат Истина;

КонецФункции
#КонецОбласти

#Область Печать

Процедура ЗаполнитьТаблицуНастройкиКомплектовНаСервере()

	КомплектыДокументов.Очистить();

	МассивИсключений = ПолучитьМассивИсключений();
	МассивИсключений.Добавить("Комплект документов на принтер (внутр.)");
	МассивИсключений.Добавить("Комплект документов на принтер");
	МассивИсключений.Добавить("Комплект документов с настройкой...");

	Для Каждого Т Из КомандыПечати Цикл

		Если МассивИсключений.Найти(Т.Представление) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = КомплектыДокументов.Добавить();
		НоваяСтрока.ПечатнаяФорма = Т.Представление;
		НоваяСтрока.Идентификатор = Т.УникальныйИдентификатор;

	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьРаспечатано(п_МассивЗаказов)

	Для Каждого Заказ Из п_МассивЗаказов Цикл
		МЗ = РегистрыСведений.ОД_СостоянияПечатиДокументов.СоздатьМенеджерЗаписи();
		МЗ.ЗаказКлиента = Заказ;
		МЗ.Распечатано = Истина;
		МЗ.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьРаспечатано(п_МассивЗаказов)

	Для Каждого Т Из ДЗ_ЗаказыКлиентов.ПолучитьЭлементы() Цикл
		Если Не Т.Выбран Тогда
			Продолжить;
		КонецЕсли;
		Т.Распечатано = Истина;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьРаспечатано(п_Заказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияПечатиДокументов.Распечатано КАК Распечатано
	|ИЗ
	|	РегистрСведений.ОД_СостоянияПечатиДокументов КАК СостоянияПечатиДокументов
	|ГДЕ
	|	СостоянияПечатиДокументов.ЗаказКлиента = &Заказ";

	Запрос.УстановитьПараметр("Заказ", п_Заказ);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Распечатано;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // ()

Функция ПолучитьМассивИсключений()

	Рез = Новый Массив;

	//Рез.Добавить("Комплект документов на принтер");
	//Рез.Добавить("Комплект документов с настройкой...");
	Рез.Добавить("Этикетки доставки");
	Рез.Добавить("Задание на отбор товаров");
	Рез.Добавить("Счет-фактура (в валюте)");
	Рез.Добавить("* Счет на оплату с факсимиле");
	Рез.Добавить("* Счет на оплату с факсимиле (вес объем)");
	Рез.Добавить("Расходная накладная");
	Рез.Добавить("Накладная (М-15)");
	Рез.Добавить("* Транспортная накладная (реализация)");
	Рез.Добавить("* Отправить через sbis");

	Возврат Рез;

КонецФункции // ()

Процедура ВывестиКомандыПечати(п_ТЗКомандыПечати)

	Для Каждого Т Из п_ТЗКомандыПечати Цикл
		Если Т.Порядок = 0 Тогда
			Т.Порядок = 3;
		КонецЕсли;
	КонецЦикла;

	п_ТЗКомандыПечати.Сортировать("Порядок");

	НоваяСтрока = КомандыПечати.Добавить();
	НоваяСтрока.Идентификатор			=  "КомплектДокументовНаПринтерДоп";
	НоваяСтрока.Представление			=  "Комплект документов на принтер (внутр.)";
	НоваяСтрока.ДополнительныеПараметры =  ЗначениеВСтрокуВнутр("");

	Сч = 1;
	Для Каждого Т Из п_ТЗКомандыПечати Цикл

		НоваяСтрока = КомандыПечати.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		НоваяСтрока.ДополнительныеПараметры =  ЗначениеВСтрокуВнутр(Т.ДополнительныеПараметры);
		НоваяСтрока.ИдентификаторОриг		=  Т.Идентификатор;
		НоваяСтрока.ПредставлениеОриг		=  Т.Представление;

		Если Т.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
			Если СтрНайти(НоваяСтрока.Представление, "*") = 0 Тогда
				НоваяСтрока.Представление =  "* " + Т.Представление;
			КонецЕсли;
		КонецЕсли;

		НайденыСтроки = КомандыПечати.НайтиСтроки(Новый Структура("Идентификатор", Т.Идентификатор));
		Если НайденыСтроки.Количество() > 0 Тогда
			НоваяСтрока.Идентификатор = Т.Идентификатор + "_" + Сч;
			Сч = Сч + 1;
		КонецЕсли;

	КонецЦикла;

	МассивИсключений = ПолучитьМассивИсключений();

	Для Каждого КомандаПечати Из КомандыПечати Цикл

		Если МассивИсключений.Найти(КомандаПечати.Представление) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(КомандаПечати.Идентификатор) Тогда
			Продолжить;
		КонецЕсли;

		КомандаФормы = Команды.Добавить(КомандаПечати.Идентификатор);
		КомандаФормы.Действие = "Подключаемый_Напечатать";
		КомандаФормы.Заголовок = КомандаПечати.Представление;
		КомандаФормы.Подсказка = КомандаФормы.Заголовок;
		КомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Если ТипЗнч(КомандаПечати.Картинка) = Тип("Картинка") Тогда
			КомандаФормы.Картинка = КомандаПечати.Картинка;
		КонецЕсли;

		КнопкаФормы = Элементы.Добавить(КомандаФормы.Имя, Тип("КнопкаФормы"), Элементы.ПодменюПечать);
		КнопкаФормы.ИмяКоманды = КомандаФормы.Имя;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьКомплектаДокументов(Парам)
	
	Для Каждого ОбъектПечати Из Парам.МассивОбъектов Цикл
		Для Каждого СтрокаКомплекта Из Парам.КомплектыДокументов Цикл
			Если СтрокаКомплекта.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;

			Для Экземпляр = 1 По СтрокаКомплекта.Количество Цикл

				НайденаСтрока = КомандыПечати.НайтиСтроки(Новый Структура("УникальныйИдентификатор",
					СтрокаКомплекта.Идентификатор));
				Если НайденаСтрока.Количество() = 0 Тогда
					Сообщить("Не определена команда печати");
					Возврат;
				КонецЕсли;

				ИмяМенеджераПечати		= НайденаСтрока[0].МенеджерПечати;
				Обработчик				= НайденаСтрока[0].Обработчик;
				Идентификатор			= НайденаСтрока[0].Идентификатор;
				ИдентификаторОриг		= НайденаСтрока[0].ИдентификаторОриг;
				ДополнительныеПараметры	= ЗначениеИзСтрокиВн(НайденаСтрока[0].ДополнительныеПараметры);

				ОписаниеКоманды = Новый Структура;

				ТекущийОбъектПечати = Новый Массив;
				ТекущийОбъектПечати.Добавить(ОбъектПечати);

				ОписаниеКоманды.Вставить("ОбъектыПечати", ТекущийОбъектПечати);
				ОписаниеКоманды.Вставить("Идентификатор", ИдентификаторОриг);
				ОписаниеКоманды.Вставить("Форма", ЭтотОбъект);
				ОписаниеКоманды.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

				Если ЗначениеЗаполнено(ИмяМенеджераПечати) Тогда
					Если ИмяМенеджераПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
						ТекМенеджерПечати = "Обработка." + ИдентификаторОриг;
						ИД_ПечатнойФормы = "ВнешняяПечатнаяФорма." + ИдентификаторОриг;
						Если СразуНаПринтер Тогда
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(ТекМенеджерПечати,
								ИД_ПечатнойФормы, ТекущийОбъектПечати, ДополнительныеПараметры);
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТекМенеджерПечати, ИД_ПечатнойФормы,
								ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
						КонецЕсли;
					Иначе
						Если СразуНаПринтер Тогда
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(ИмяМенеджераПечати,
								ИдентификаторОриг, ТекущийОбъектПечати, ДополнительныеПараметры);
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяМенеджераПечати, ИдентификаторОриг,
								ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
						КонецЕсли;
					КонецЕсли;
				Иначе
					Сообщить("Не определен обработчик печати");
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ЗаписатьРаспечатано(Парам.МассивЗаказов);
	УстановитьРаспечатано(Парам.МассивЗаказов);

КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ЛогСообщить(М)

	ПолноеИмяФайла = "c:\log_1c\Обработка документов.txt";

	Попытка
		ЛогФайл = Новый ЗаписьТекста(ПолноеИмяФайла, КодировкаТекста.ANSI, , Истина, );
		ЛогФайл.Записать(Формат(ТекущаяДата(), "ДЛФ=DT") + ": " + М + Символы.ПС);
		ЛогФайл.Закрыть();
	Исключение
		Сообщить("ошибка записи лог файла");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеДеревоРекурсивно(п_КоллекцияЭлементов)

	Для Каждого ЭлементКоллекции Из п_КоллекцияЭлементов Цикл

		ВложенныеЭлементыКоллекции = ЭлементКоллекции.ПолучитьЭлементы();

		Если (ВложенныеЭлементыКоллекции.Количество() > 0) Тогда
			СвернутьВсеДеревоРекурсивно(ВложенныеЭлементыКоллекции);
		Иначе
			Прервать;
		КонецЕсли;

		Элементы.ДЗ_ЗаказыКлиентов.Свернуть(ЭлементКоллекции.ПолучитьИдентификатор());

	КонецЦикла;
КонецПроцедуры

Функция ЗначениеИзСтрокиВн(п_Строка)

	Возврат ЗначениеИзСтрокиВнутр(п_Строка);

КонецФункции // ()

Функция ЗначениеРеквизитаОбъекта(п_Объект, п_Реквизит)

	Возврат п_Объект[п_Реквизит];

КонецФункции // ()

Функция Организации()

	ЛогСообщить(" - ..заполнение списка организаций");

	Рез = Новый Структура;

	Рез.Вставить("Сергиенко1", Справочники.Организации.НайтиПоНаименованию("Сергиенко 1", Истина));
	ЛогСообщить(" - Сергиенко1: " + Справочники.Организации.НайтиПоНаименованию("Сергиенко 1", Истина));

	Рез.Вставить("СергиенкоИП", Справочники.Организации.НайтиПоНаименованию("Сергиенко Евгений Алексеевич ИП (ОРГ-Я)",
		Истина));
	ЛогСообщить(" - СергиенкоИП: " + Справочники.Организации.НайтиПоНаименованию(
		"Сергиенко  Евгений Алексеевич ИП (ОРГ-Я)", Истина));

	Рез.Вставить("ООО", Справочники.Организации.НайтиПоРеквизиту("ИНН", "7706469887"));
	ЛогСообщить(" - ООО: " + Справочники.Организации.НайтиПоРеквизиту("ИНН", "7706469887"));

	Возврат Рез;

КонецФункции // ()

#КонецОбласти