
&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(ДанныеЗаполнения.ДокументОснование);
	
	Если ТипОснования = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда

		Если ПустаяСтрока(НазначениеПлатежа) Тогда
			Если ДанныеЗаполнения.ДокументОснование.Расходы.Количество() > 0 Тогда
				СтатьяТранспортировка = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Транспортировка при продаже товара", Истина);
				Если ДанныеЗаполнения.ДокументОснование.Расходы[0].СтатьяРасходов = СтатьяТранспортировка Тогда
					НазначениеПлатежа = "Услуга по организации доставки груза по счету № от г. на сумму руб. в т.ч. НДС руб.";
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
		
		Если ПустаяСтрока(Подразделение) Тогда
			Если ДанныеЗаполнения.ДокументОснование.Расходы.Количество() > 0 Тогда
				Если ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование.Расходы[0].Подразделение) Тогда
					Подразделение = ДанныеЗаполнения.ДокументОснование.Расходы[0].Подразделение;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
