
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не КонтурЛогистика_ПодпискиИОплатаСервер.ПодпискиИОплатаДоступны() Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Включен тестовый режим. Сведения о подписках и оплате не отображаются.",
			"Контур.Логистика",
			0,
			ЭтотОбъект,
			"ОткрытьФормуПодписокИОплаты");
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПодписокИОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодписокИОплаты(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	КонтурЛогистика_ПодпискиИОплатаСервер.ЗарегистрироватьМетрикуПереходаВПодпискиИзНастроек();
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("CommonForm.КонтурЛогистика_ПодпискиИОплата");
	
КонецПроцедуры
