
#Область ПрограммныйИнтерфейс

Процедура ДЛ_Команда_ОформитьЭлектронноеПоручениеЭкспедитору(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

		ДокументыОснования = КонтурЛогистика_ИнтеграцияДЛСервер.ДокументыОснования(ПараметрКоманды);
	
	Если ДокументыОснования.Количество() > 0 Тогда 
		
		// Вводим через Документ основание - КЛ заметит пересечение
		СуществующиеМаршруты = КонтурЛогистика_ИнтеграцияДЛСервер.ВведенныеМаршрутыПорученияЭкспедитору(ПараметрКоманды);
		Если СуществующиеМаршруты.Количество() = 0 Тогда
			
			// TODO нельзя инициализировать КонтурЛогистика_ОбработкаДокументовКлиент - может отсутствовать (не добавлено расширение КонтурЛогистика)
			// Ввести новый док КонтурЛогистика_ПЭ_Титул1
			КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаПоДокументу1С(
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1"),
			ДокументыОснования[0],
			ПараметрыВыполненияКоманды.Источник);
			
		ИначеЕсли СуществующиеМаршруты.Количество() = 1 Тогда
			
			ОткрытьПЭСуществующегоМаршрута(ПараметрКоманды, ПараметрыВыполненияКоманды, СуществующиеМаршруты);
			
		Иначе
			
			// несколько маршрутов - открыть все ПЭ связанные с ними?
			
		КонецЕсли;
		
	Иначе
		
		// поискать введенный
		НайденныйМаршрут = КонтурЛогистика_ИнтеграцияДЛСервер.НайтиСуществующийМаршрут(ПараметрКоманды);
		
		Если ЗначениеЗаполнено(НайденныйМаршрут) Тогда
			
			СуществующиеМаршруты = Новый Массив;
			СуществующиеМаршруты.Добавить(НайденныйМаршрут);
			
			ОткрытьПЭСуществующегоМаршрута(ПараметрКоманды, ПараметрыВыполненияКоманды, СуществующиеМаршруты);
			
		Иначе // создать новый маршрут
			
			СозданныйМаршрут = КонтурЛогистика_ИнтеграцияДЛСервер.СоздатьМаршрут(ПараметрКоманды);
			МассивМаршрутов = Новый Массив;
			МассивМаршрутов.Добавить(СозданныйМаршрут);
			ДанныеЗаполнения = Новый Структура("МассивПартий", МассивМаршрутов);
			
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
			ОткрытьФорму("Документ.КонтурЛогистика_ПЭ_Титул1.ФормаОбъекта", 
				ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно,
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьПЭСуществующегоМаршрута(Знач ДЛ_ЗаявкаНаДоставку, Знач ПараметрыВыполненияКоманды, Знач СуществующиеМаршруты)
	
	ПЭ = КонтурЛогистика_ИнтеграцияДЛСервер.ЗаполнитьМаршрутИВернутьПоручение(СуществующиеМаршруты[0], ДЛ_ЗаявкаНаДоставку);
	// открыть это ПЭ или ввести новое
	
	Если Не ЗначениеЗаполнено(ПЭ) Тогда
		
		// сформируем ПЭ
		ПЭ = КонтурЛогистика_ИнтеграцияДЛСервер.СоздатьПЭПоМассивуМаршрутов(СуществующиеМаршруты);
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ПЭ);
	ОткрытьФорму("Документ.КонтурЛогистика_ПЭ_Титул1.ФормаОбъекта", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	

КонецПроцедуры

#КонецОбласти
