
&Вместо("ДобавитьКомандуСоздатьНаОсновании")
Функция ОД_ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании)

	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаказНаВнутреннееПотребление) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказНаВнутреннееПотребление.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ЗаказНаВнутреннееПотребление);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаказыНаВнутреннееПотребление";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
	
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции


// Функция возвращает текст запроса для определения реквизитов доставки.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстЗапросаРеквизитыДоставки() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Номер КАК Номер,
	|	Шапка.Проведен КАК Проведен,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ДатаОтгрузки КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК ПолучательОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада) КАК СпособДоставки,
	|	НЕОПРЕДЕЛЕНО КАК Зона,
	|	Шапка.АдресДоставки КАК Адрес,
	|	"""" КАК АдресЗначенияПолей,
	|	НЕОПРЕДЕЛЕНО КАК ВремяС,
	|	НЕОПРЕДЕЛЕНО КАК ВремяПо,
	|	"""" КАК ДополнительнаяИнформация,
	|	Шапка.Склад КАК Склад,
	|	ИСТИНА КАК ДоставитьПолностью,
	|	ЛОЖЬ КАК ОсобыеУсловияПеревозки,
	|	"""" КАК ОсобыеУсловияПеревозкиОписание,
	|	ЛОЖЬ КАК РазбиватьРасходныеОрдераПоРаспоряжениям
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&Ссылки)";
	
	Возврат ТекстЗапроса;
	
КонецФункции
