
&Вместо("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Перем РеквизитыШапки;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Товары") Тогда
		
		ДанныеЗаполнения.Свойство("РеквизитыШапки", РеквизитыШапки);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
		Товары.Загрузить(ДанныеЗаполнения.Товары);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Если ДанныеЗаполнения.Количество() > 0 Тогда

			ПервыйДок = ДанныеЗаполнения[0];
			
			Если ТипЗнч(ПервыйДок) = Тип("ДокументСсылка.Рекламация") Тогда
				
				Если ПервыйДок.Состояние = Перечисления.Рекл_СостоянияРекламации.Отгружена
					ИЛИ ПервыйДок.Состояние = Перечисления.Рекл_СостоянияРекламации.ПереданоВСборку
					ИЛИ ПервыйДок.Состояние = Перечисления.Рекл_СостоянияРекламации.Закрыта Тогда
				
					ДокументОснование	= ПервыйДок;
					Организация			= ПервыйДок.Организация;
					Склад				= ПервыйДок.Склад;
					Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);

					Для каждого Т Из ПервыйДок.Комплектующие Цикл
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
						НоваяСтрока.КоличествоУпаковок	= НоваяСтрока.Количество;
						НоваяСтрока.СтатьяРасходов		= ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
						НоваяСтрока.АналитикаРасходов	= ПервыйДок.Партнер;
					КонецЦикла;
				Иначе
					Сообщить("Для списания требуется статус Отгружена, Закрыта или Передано в сборку");
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ПервыйДок) = Тип("ДокументСсылка.Ремонт") Тогда

				Если ДанныеЗаполнения.Количество() = 1 Тогда
					ДокументОснование = ПервыйДок;
				КонецЕсли;

				Организация			= ПервыйДок.Организация;
				Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);
				ДатаОтгрузки		= НачалоДня(ТекущаяДатаСеанса()) + 86400;
				НеОтгружатьЧастями	= Истина;

				ТЧ_Запчасти = ПервыйДок.Запчасти;
				Если ТЧ_Запчасти.Количество() > 0 Тогда
					Склад = ТЧ_Запчасти[0].Склад;
				КонецЕсли;

				Для каждого Док Из ДанныеЗаполнения Цикл
					Для каждого Т Из Док.Запчасти Цикл
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
						НоваяСтрока.Количество			= Т.Количество;
						НоваяСтрока.КоличествоУпаковок	= Т.Количество;
						НоваяСтрока.СтатьяРасходов		= ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
						НоваяСтрока.АналитикаРасходов	= Док.Партнер;
						НоваяСтрока.ДатаОтгрузки		= ДатаОтгрузки;

						Если ЗначениеЗаполнено(Док.ПартнерОсуществляетРемонт) Тогда
							НоваяСтрока.АналитикаРасходов = Док.ПартнерОсуществляетРемонт;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;

				Для каждого Док Из ДанныеЗаполнения Цикл
					НоваяСтрока = Основания.Добавить();
					НоваяСтрока.Основание = Док;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ОД_ОбработкаПроведения(Отказ, РежимПроведения)

	Партнер = "";
	Если Товары.Количество() > 0 Тогда
		АналитикаРасходов = Товары[0].АналитикаРасходов;
		Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.Партнеры") Тогда
			Партнер = АналитикаРасходов;
		КонецЕсли;
	КонецЕсли;
	
	Если Доставка 
		И ЗначениеЗаполнено(АдресДоставки) 
		И ЗначениеЗаполнено(Партнер) Тогда
		
		Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
			НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
			НЗ.Отбор.Распоряжение.Установить(Ссылка);
			НЗ.Записать();

			МЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьМенеджерЗаписи();
			МЗ.Распоряжение 			= Ссылка;
			МЗ.Склад					= Склад;
			МЗ.СпособДоставки   		= Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
			//МЗ.Зона						= ЗонаДоставки;
			МЗ.ПолучательОтправитель	= Партнер;
			
			МЗ.ДополнительнаяИнформация	= УправлениеСвойствами.ЗначениеСвойства(Ссылка, "КомментарийДляДоставки");
			МЗ.Состояние				= Перечисления.СостоянияДоставки.ТребуетсяДоставка;
			МЗ.ДоставитьПолностью   	= Истина;
			МЗ.Дата						= ДатаОтгрузки;
			МЗ.Номер					= Ссылка.Номер;
			
			МЗ.Адрес = АдресДоставки;
			
			МЗ.Записать();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура ОД_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;

	Документы.ЗаказНаВнутреннееПотребление.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация, 
	МассивВсехРеквизитов, 
	МассивРеквизитовОперации);

	МассивНепроверяемыхРеквизитов = Новый Массив;

	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
	МассивВсехРеквизитов,
	МассивРеквизитовОперации,
	МассивНепроверяемыхРеквизитов);

	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаОтгрузки");

	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	ВсеСтрокиОтменены = Истина;
	ВариантНеТребуется = Перечисления.ВариантыОбеспечения.НеТребуется;
	Для Каждого СтрокаТаблицы Из Товары Цикл
		ВсеСтрокиОтменены = ВсеСтрокиОтменены И(
		СтрокаТаблицы.Отменено Или СтрокаТаблицы.ВариантОбеспечения = ВариантНеТребуется);
	КонецЦикла;

	Если Не НеОтгружатьЧастями
		Или НеОтгружатьЧастями И ВсеСтрокиОтменены Тогда

		МассивНепроверяемыхРеквизитов.Добавить("ДатаОтгрузки");

	КонецЕсли;

	Если ВсеСтрокиОтменены Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Склад");
	КонецЕсли;
	
	#Вставка
	МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
	#КонецВставки

	// Желаемая дата отгрузки в шапке должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ЖелаемаяДатаОтгрузки) И ЖелаемаяДатаОтгрузки < НачалоДня(Дата) Тогда

		ТекстОшибки = НСтр("ru='Желаемая дата отгрузки должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ЖелаемаяДатаОтгрузки",
		,
		Отказ);

	КонецЕсли;

	// Дата отгрузки в шапке должна быть не меньше даты документа
	Если НеОтгружатьЧастями
		И ЗначениеЗаполнено(ДатаОтгрузки)
		И ДатаОтгрузки < НачалоДня(Дата)
		И Не ВсеСтрокиОтменены Тогда

		ТекстОшибки = НСтр("ru='Дата отгрузки должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаОтгрузки",
		,
		Отказ);

	КонецЕсли;

	Для каждого СтрокаТЧ Из Товары Цикл

		АдресОшибки = " " + НСтр("ru='в строке %НомерСтроки% списка ""Товары""'");
		АдресОшибки = СтрЗаменить(АдресОшибки,"%НомерСтроки%", СтрокаТЧ.НомерСтроки);

		Если Не НеОтгружатьЧастями И СтрокаТЧ.ВариантОбеспечения <> ВариантНеТребуется
			И Не СтрокаТЧ.Отменено И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) Тогда

			ТекстОшибки = НСтр("ru='Не заполнена колонка ""Дата отгрузки""'");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "ДатаОтгрузки"),
			,
			Отказ);

		КонецЕсли;

		// Дата отгрузки в тч Товары должна быть не меньше даты документа
		Если Не НеОтгружатьЧастями И ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) И СтрокаТЧ.ДатаОтгрузки < НачалоДня(Дата) Тогда

			ТекстОшибки = НСтр("ru='Дата отгрузки должна быть не меньше даты документа ""%Дата%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%Дата%", Формат(Дата, "ДЛФ=DD"));

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "ДатаОтгрузки"),
			,
			Отказ);

		КонецЕсли;

	КонецЦикла;

	Если Не НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(ХозяйственнаяОперация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаправлениеДеятельности");
	КонецЕсли;

	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
	ЭтотОбъект, Новый Структура("Товары"), МассивНепроверяемыхРеквизитов, Отказ);

	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(
	ЭтотОбъект,
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаВнутреннееПотребление),
	Отказ,
	МассивНепроверяемыхРеквизитов);

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	ПараметрыПроверки.ИмяРеквизитаСтатьяАктивовПассивов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаАктивовПассивов = "АналитикаАктивовПассивов";

	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(
	ЭтотОбъект,
	ПотреблениеДляДеятельности,
	ПараметрыПроверки,
	Отказ);

КонецПроцедуры