
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьПараметрыЗапросаПриОбработкеПолученияДанныхВыбора(Параметры, Запрос) Экспорт

	//++ Локализация
	
	//++ НЕ УТ
	Если НЕ ЗначениеЗаполнено(Запрос.Параметры.РежимВыбораВзаимосвязанныхОрганизаций)
		И НЕ Параметры.Свойство("РежимВыбораВзаимосвязанныхОрганизаций") 
		И Параметры.Свойство("ХозяйственнаяОперация")
		И (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперацииРеглУчет.ПеремещениеОСвПодразделениеВыделенноеНаБаланс
			ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеОСвПодразделениеВыделенноеНаБаланс
			ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс) Тогда
			
		Запрос.УстановитьПараметр("РежимВыбораВзаимосвязанныхОрганизаций", "ТолькоВзаимосвязанные");
	КонецЕсли;
	//-- НЕ УТ
	
	//-- Локализация
	
КонецПроцедуры

//++ НЕ УТ

// // Возвращает регистрацию в налоговом органе на определенную дату
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация.
//  ДатаСведений - дата - дата на кторую требуется полуить регистрацию.
//  
// Возвращаемое значение:
//  СправочникСсылка.РегистрацииВНалоговомОргане - ссылка на текущую регистрацию или 
//  ссылка из реквизита РегистрацияВНалоговомОргане.
//
Функция РегистрацияВНалоговомОрганеНаДату(Организация, ДатаСведений) Экспорт

	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");

	ОсновнойНалоговыйОрган = РеквизитыОрганизации.РегистрацияВНалоговомОргане;

	//++ Локализация
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ДатаСведений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Период, ) КАК ИсторияРегистрацийВНалоговомОргане
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОргане.СтруктурнаяЕдиница = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОсновнойНалоговыйОрган = РезультатЗапроса.Выгрузить()[0].РегистрацияВНалоговомОргане;
	КонецЕсли;
	
	//-- Локализация

	Возврат ОсновнойНалоговыйОрган;
	
КонецФункции	

//-- НЕ УТ

//++ Локализация

// Процедура заполняет данные по патентам в форме организации.
//
// Параметры:
//  Форма                      - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//
Процедура НастроитьДанныеПримененияПСН(Форма) Экспорт
	
	Организация = Форма.Объект.Ссылка;
	УчетнаяПолитикаОрганизации = Форма.УчетнаяПолитикаОрганизаций.УчетнаяПолитика;
	
	ПрименяетсяПСН =
		ЗначениеЗаполнено(УчетнаяПолитикаОрганизации)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяПолитикаОрганизации, "ПрименяетсяПСН")
		И Форма.ВидОрганизации = "ИндивидуальныйПредприниматель";
	
	Форма.Элементы.ГруппаОтступПримененияПСН.Видимость = ПрименяетсяПСН;
		
	Если ПрименяетсяПСН Тогда
		
		СписокПатентовОрганизации = Справочники.Патенты.ПолучитьПатентыПоОрганизации(Организация, Неопределено);
		СписокДействующихПатентовОрганизации = Справочники.Патенты.ПолучитьДействующиеПатентыНаДату(Организация, Неопределено);
		СтрокаПСН = СтрШаблон(НСтр("ru='Патенты (%1 из %2)'"), СписокДействующихПатентовОрганизации.Количество(), СписокПатентовОрганизации.Количество());
		Форма.СтрокаПСН = Новый ФорматированнаяСтрока(СтрокаПСН, , , , "НастроитьТаблицуПримененияПСН");
		
	Иначе
		Форма.СтрокаПСН = Новый ФорматированнаяСтрока(НСтр("ru='Нет информации о применении ПСН.'"));
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак применения патента организацией на указанную дату по учетной политике
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - Организация, по которой требуется определение
//  ДатаДействия - Дата - Дата, на которую требуется определение
// 
// Возвращаемое значение:
//  Булево - использует организация патенты на указанную дату
//
Функция ОрганизацияПрименяетПатенты(Организация, ДатаДействия = Неопределено) Экспорт
	
	ПрименяетсяПСН = Ложь;
	Если ТипЗнч(Организация) = Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаДействия) Тогда
		ДатаДействия = ТекущаяДатаСеанса();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСрезПоследних.ПрименяетсяПСН КАК ПрименяетсяПСН
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период,
	|		Организация = ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ГоловнаяОрганизация) КАК ТаблицаСрезПоследних
	|";
	Запрос.УстановитьПараметр("Период", ДатаДействия);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПрименяетсяПСН = Выборка.ПрименяетсяПСН;
	КонецЕсли;
	
	Возврат ПрименяетсяПСН;
	
КонецФункции

//-- Локализация

#КонецОбласти
