
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроверкаОтвета", РежимПроверкиОтвета);
	
	Элементы.ГруппаСведенияПоМаршруту.Видимость = Ложь;
	Элементы.ГруппаСведенияПоТовару.Видимость = Ложь;
	
	Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Ложь;
	ИзменитьРасположениеПанелиОшибок();
	
	ОбновитьДанныеФормы();
	
	Элементы.ДокументОснование.Доступность = ТипыДокументаОснованияНастроеныДляТитула();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	ЗаполнитьДополнительныеТаблицы();
	
	УстановитьУсловноеОформление();
	
	Элементы.ФормаВвестиСР.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяСкладскаяРасписка");
	
	// Привет, обратная совместимость с 8.2
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ГруппаКоличественныеХарактеристикиПартииТоваров.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ВалютаУчетаГруза.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;	// Иначе улетает в космос
		Элементы.ЛицоПогрузки.Ширина = 30;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗначенияПоУмолчаниюДляНовогоДокумента();
	
	РассчитатьИтоги();
	
	ПроверитьДокумент();
	
	УправлениеВидимостьюИДоступностью();
	
	СформироватьЗаголовокГруппыРеквизитыДокументаПЭ();
	
	РазвернутьМаршрутыИГрузы();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И (Параметр = Объект.Ссылка
			Или (Параметр <> Неопределено
				И ТипЗнч(Параметр) = Тип("Массив")
				И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ВвестиДокумент");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);
	
	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда
		
		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);
		
	Иначе
		
		// Открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	Если Не ТекущиеДанные.ИдентификаторыСтрокДерева = Неопределено
		И ТекущиеДанные.ИдентификаторыСтрокДерева.Количество() > 0 Тогда
		
		ТекущийИдентификаторСтроки = ТекущиеДанные.ИдентификаторыСтрокДерева[0].Значение;
		
		ТекущиеДанные.ИдентификаторыСтрокДерева[0].Значение = ПолучитьУказательНаСтрокуДерева(ТекущийИдентификаторСтроки);
		
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя, "ПослеВыбораВТаблицеОшибок");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПогрузкиПриИзменении(Элемент)
	
	УстановитьВидимостьДогПогрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Титул1ПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ПЭ_Титул1) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоПоручениюЗавершение", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Вы уверены, что хотите перезаполнить документ?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПоручениюЗавершение(Ответ, ДополнительынеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполниьТитулПоПЭТитул1();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Титул1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Состояние", СостояниеПЭЗавершено());
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Документ.КонтурЛогистика_ПЭ_Титул1.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"ПЭ_Титул1НачалоВыбораЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Титул1НачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПЭ_Титул1 = Результат;
		ЗаполниьТитулПоПЭТитул1();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеПЭЗавершено()
	
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pe-completed");
	
КонецФункции

&НаКлиенте
Процедура ЗаполниьТитулПоПЭТитул1()
	
	ЗаполнитьПоПоручению();
	РазвернутьМаршрутыИГрузы();
	РассчитатьИтоги();
	ПроверитьДокумент();
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПоручению()
	
	Объект.ЗаявкиНаМаршрут.Очистить();
	Объект.РеквЗакПост.Очистить();
	Объект.СопрДокПарт.Очистить();
	Объект.ОбязательстваЭкспедитора.Очистить();
	Объект.Товары.Очистить();
	Объект.СведенияГосСистем.Очистить();
	Объект.ИнфУпГруз.Очистить();
	Объект.СведенияОКонтейнерах.Очистить();
	Объект.Марк.Очистить();
	Объект.СопрДок.Очистить();
	Объект.ИнфПол.Очистить();
	
	ПараметрыФормы = Новый Структура("Основание", Объект.ПЭ_Титул1);
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ПЭ_Титул1);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	// Обновим отображение дерева
	ЗаполнитьМаршрутыИГрузы();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДокПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспедиторПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспедицияДоговорПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПогрузкиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФДатПолПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриемкиГрузаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиГрузаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияПоТовару_СтранаПроисхожденияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = ТекущиеДанные.ИдентификаторСтрокиТовара;
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтран = Новый Массив;
	ОтборПоСтрокеТоваров = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	
	Для Каждого СтрокаСтраны Из Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборПоСтрокеТоваров) Цикл
		
		Если ЗначениеЗаполнено(СтрокаСтраны.Страна) Тогда
			МассивСтран.Добавить(СтрокаСтраны.Страна);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	ПараметрыФормы.Вставить("МассивСтран", МассивСтран);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_СтраныМира.Форма.ФормаВыбораСтранПроисхождениеПродукции",
		ПараметрыФормы,
		ЭтаФорма,
		ЭтаФорма,
		"ПослеВыбораСтран");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаМаршрутыИГрузы Тогда
		МаршрутыИГрузыПриАктивизацииСтроки(Элементы.МаршрутыИГрузы);
	Иначе
		Элементы.ГруппаСведенияПоМаршруту.Видимость = Ложь;
		Элементы.ГруппаСведенияПоТовару.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыИГрузыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИдентификаторСтрокиЗаявкиНаМаршрут = ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут;
	ТекущийИдентификаторСтрокиТовара = ТекущиеДанные.ИдентификаторСтрокиТовара;
	ИмяРеквизита = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "МаршрутыИГрузы", "");
	
	ЭтоСтрокаМаршрута = (ТекущийИдентификаторСтрокиТовара = "");
	
	Если ЭтоСтрокаМаршрута Тогда
		
		// Перенесем изменения из дерева в объект
		Для Каждого ТекущаяСтрока Из Объект.ЗаявкиНаМаршрут Цикл
			Если ТекущаяСтрока.ИдентификаторСтроки <> ТекущийИдентификаторСтрокиЗаявкиНаМаршрут Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрока[ИмяРеквизита] = ТекущиеДанные[ИмяРеквизита];
		КонецЦикла;
		
	Иначе
		
		// Перенесем изменения из дерева в объект
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			Если ТекущаяСтрока.ИдентификаторСтроки <> ТекущийИдентификаторСтрокиТовара Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрока[ИмяРеквизита] = ТекущиеДанные[ИмяРеквизита];
		КонецЦикла;
		
		// Пересчитем итоги по маршруту
		Если ИмяРеквизита <> "ОтгрузочноеНаименование"
			И ИмяРеквизита <> "ЗаявкаНаМаршрут"
			И ИмяРеквизита <> "Валюта"
			И ИмяРеквизита <> "ОбъемКубМ" Тогда
			
			Для Каждого ТекущаяСтрока Из Объект.ЗаявкиНаМаршрут Цикл
				Если ТекущаяСтрока.ИдентификаторСтроки <> ТекущийИдентификаторСтрокиЗаявкиНаМаршрут Тогда
					Продолжить;
				КонецЕсли;
				
				ТекущаяСтрока[ИмяРеквизита] = 0;
				Для Каждого ТекущаяСтрокаТовара Из Объект.Товары Цикл
					Если ТекущаяСтрокаТовара.ИдентификаторСтрокиЗаявкиНаМаршрут <> ТекущийИдентификаторСтрокиЗаявкиНаМаршрут Тогда
						Продолжить;
					КонецЕсли;
					
					ТекущаяСтрока[ИмяРеквизита] = ТекущаяСтрока[ИмяРеквизита] + ТекущаяСтрокаТовара[ИмяРеквизита];
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РассчитатьИтоги();
	
	ПроверитьДокумент();
	
	// Обновим итоги в дереве
	Если ИмяРеквизита <> "ОтгрузочноеНаименование"
		И ИмяРеквизита <> "ЗаявкаНаМаршрут"
		И ИмяРеквизита <> "Валюта" Тогда
		
		Если Не ЭтоСтрокаМаршрута Тогда
			ОбновитьИтогиДереваПоРеквизиту(ИмяРеквизита);
		КонецЕсли;
		
		РазвернутьМаршрутыИГрузы();
		
		// Перейдем обратно на редактируемую строку
		Для Каждого ЭлементМаршрута Из МаршрутыИГрузы.ПолучитьЭлементы() Цикл
			Для Каждого ЭлементТовара Из ЭлементМаршрута.ПолучитьЭлементы() Цикл
				Если ЭлементТовара.ИдентификаторСтрокиТовара = ТекущийИдентификаторСтрокиТовара Тогда
					ТекущийИдентификатор = ЭлементТовара.ПолучитьИдентификатор();
					Элементы.МаршрутыИГрузы.ТекущаяСтрока = ТекущийИдентификатор;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыИГрузыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "МаршрутыИГрузыКонтейнеры" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторСтрокиЗаявкиНаМаршрут", ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут);
	ПараметрыФормы.Вставить("ПризнакПеревозки", ТекущиеДанные.ПризнакПеревозки);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ПараметрыФормы.Вставить("АдресСведенийОКонтейнерах", АдресСведенийОКонтейнерах(ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут));
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.Форма.СведенияОКонтейнерах", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"МаршрутыИГрузыВыборЗавершение");
	
КонецПроцедуры

&НаСервере
Функция АдресСведенийОКонтейнерах(ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	
	НайденныеСтроки = Объект.СведенияОКонтейнерах.Выгрузить(ПараметрыОтбора);
	
	Возврат ПоместитьВоВременноеХранилище(НайденныеСтроки, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура МаршрутыИГрузыВыборЗавершение(Результат, ДополнительынеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ИдентификаторСтрокиЗаявкиНаМаршрут = Элементы.МаршрутыИГрузы.ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут;
	ОбновитьДанныеПоКонтейнерам(Результат, ИдентификаторСтрокиЗаявкиНаМаршрут);
	
	// Обновим отображение дерева
	ЗаполнитьМаршрутыИГрузы();
	
	// Развернем дерево
	РазвернутьМаршрутыИГрузы();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоКонтейнерам(Результат, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	// Признак перевозки
	Для Каждого ТенкущаяСтрока Из Объект.ЗаявкиНаМаршрут Цикл
		Если ТенкущаяСтрока.ИдентификаторСтроки <> ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
			Продолжить;
		КонецЕсли;
		
		ТенкущаяСтрока.ПризнакПеревозки = Результат.ПризнакПеревозки;
	КонецЦикла;
	
	
	АдресСведенийОКонтейнерах = Результат.АдресСведенийОКонтейнерах;
	
	// Удалим старые строки
	НаУдаление = Новый Массив;
	Для Каждого ТенкущаяСтрока Из Объект.СведенияОКонтейнерах Цикл
		Если ТенкущаяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут <> ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
			Продолжить;
		КонецЕсли;
		
		НаУдаление.Добавить(ТенкущаяСтрока);
	КонецЦикла;
	Для Каждого ТенкущаяСтрока Из НаУдаление Цикл
		Объект.СведенияОКонтейнерах.Удалить(ТенкущаяСтрока);
	КонецЦикла;
	
	// Добавим новые
	СведенияОКонтейнерах = ПолучитьИзВременногоХранилища(АдресСведенийОКонтейнерах);
	Для Каждого ТенкущаяСтрока Из СведенияОКонтейнерах Цикл
		НоваяСтрока = Объект.СведенияОКонтейнерах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТенкущаяСтрока);
		НоваяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут = ИдентификаторСтрокиЗаявкиНаМаршрут;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыИГрузыПриАктивизацииСтроки(Элемент)
	
	Если ИдетОбновленияЭлементовФормы
		Или Элементы.Страницы.ТекущаяСтраница <> Элементы.ГруппаМаршрутыИГрузы Тогда
		
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоТовар = (ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтрокиТовара));
	Элементы.ГруппаСведенияПоТовару.Видимость = ЭтоТовар;
	Элементы.ГруппаСведенияПоМаршруту.Видимость = Не ЭтоТовар;
	
	Если ЭтоТовар Тогда
		
		ОтборСтрок = Новый ФиксированнаяСтруктура(
			"ИдентификаторСтрокиТоваров", ТекущиеДанные.ИдентификаторСтрокиТовара);
		
		Элементы.СведенияГосСистем.ОтборСтрок = ОтборСтрок;
		Элементы.Марк.ОтборСтрок = ОтборСтрок;
		Элементы.ИнфУпГруз.ОтборСтрок = ОтборСтрок;
		
		ОтборСтрок = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтрокиТовара);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ТекущаяСтрока = НайденныеСтроки[0];
			
			СведенияПоТовару_ОписаниеОпасногоГруза = ТекущаяСтрока.ОписаниеОпасногоГруза;
			СведенияПоТовару_ОсобыеОтметки = ТекущаяСтрока.ОсобыеОтметки;
			СведенияПоТовару_СтранаПроисхождения = КонтурЛогистика_ОбщегоНазначенияКлиент.РассчитатьПредставлениеСтран(
				Объект.СтраныПроисхожденияПродукции, ТекущаяСтрока.ИдентификаторСтроки);
			СведенияПоТовару_ПрзИзъятВещ = ТекущаяСтрока.ПрзИзъятВещ;
			СведенияПоТовару_ПодлежитУчетуВГосСист = ТекущаяСтрока.ПодлежитУчетуВГосСист;
			СведенияПоТовару_КодТНВЭД = ТекущаяСтрока.КодТНВЭД;
		КонецЕсли;
		
		Элементы.ГруппаПодробныеСведенияГосСист.Видимость = СведенияПоТовару_ПодлежитУчетуВГосСист;
		
	Иначе
		
		ОтборСтрок = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут);
		НайденныеСтроки = Объект.ЗаявкиНаМаршрут.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ТекущаяСтрока = НайденныеСтроки[0];
			
			СведенияОМаршруте_СсылкаНаМаршрут = ТекущаяСтрока.ЗаявкаНаМаршрут;
			СведенияОМаршруте_СостояниеГруза = ТекущаяСтрока.СостояниеГруза;
			СведенияОМаршруте_СостояниеТары = ТекущаяСтрока.СостояниеТары;
			СведенияОМаршруте_СостояниеУпаковки = ТекущаяСтрока.СостояниеУпаковки;
			СведенияОМаршруте_СостояниеМаркировки = ТекущаяСтрока.СостояниеМаркировки;
			СведенияОМаршруте_СостояниеОпломбирования = ТекущаяСтрока.СостояниеОпломбирования;
			
			Элементы.СведенияОМаршруте_СсылкаНаМаршрут.Видимость = ЗначениеЗаполнено(СведенияОМаршруте_СсылкаНаМаршрут);
			
			ЕстьЗамечания = (СведенияОМаршруте_СостояниеГруза <> ТекстЗамечанияПоГрузунет());
			Элементы.СведенияОМаршруте_СостояниеГруза.Видимость = ЕстьЗамечания;
			
			// Обязательства экспедитора
			СкрытьВсеОбязательства();
			СведенияОМаршруте_Обязательства.Очистить();
			
			ОтборСтрокОбязательств = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ТекущаяСтрока.ИдентификаторСтроки);
			НайденныеСтрокиОбязятельств = Объект.ОбязательстваЭкспедитора.НайтиСтроки(ОтборСтрокОбязательств);
			Для Каждого ТекущееОбязательство Из НайденныеСтрокиОбязятельств Цикл
				СведенияОМаршруте_Обязательства.Добавить(ТекущееОбязательство.ОбязЭксп);
			КонецЦикла;
			Если СведенияОМаршруте_Обязательства.Количество() = 0 Тогда
				СведенияОМаршруте_Обязательства.Добавить("");
			КонецЕсли;
			ОбновитьЭлементыОтображенияОбязательств();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыИГрузыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиЗаявкиНаМаршрут = ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут;
	
	Если ТекущиеДанные.ИдентификаторСтрокиТовара = "" Тогда
		
		// Удаляется маршрут
		УдалитьВсеСвязиМаршрута(ИдентификаторСтрокиЗаявкиНаМаршрут);
		
		УдалитьСвязиИзТаблицы("ЗаявкиНаМаршрут", "ИдентификаторСтроки", ИдентификаторСтрокиЗаявкиНаМаршрут);
		
	Иначе
		
		// Удаляется товар
		УдалитьВсеСвязиТовара(ТекущиеДанные.ИдентификаторСтрокиТовара);
		
		УдалитьСвязиИзТаблицы("Товары", "ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтрокиТовара);
		
		// Проверим что в маршруте есть хотя бы один товар
		ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			// Удалим маршрут
			УдалитьВсеСвязиМаршрута(ИдентификаторСтрокиЗаявкиНаМаршрут);
			УдалитьСвязиИзТаблицы("ЗаявкиНаМаршрут", "ИдентификаторСтроки", ИдентификаторСтрокиЗаявкиНаМаршрут);
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновим отображение дерева
	ЗаполнитьМаршрутыИГрузы();
	
	// Развернем дерево
	РазвернутьМаршрутыИГрузы();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСвязиМаршрута(ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	ИмяКлюча = "ИдентификаторСтрокиЗаявкиНаМаршрут";
	
	УдалитьСвязиИзТаблицы("РеквЗакПост", ИмяКлюча, ИдентификаторСтрокиЗаявкиНаМаршрут);
	УдалитьСвязиИзТаблицы("СопрДокПарт", ИмяКлюча, ИдентификаторСтрокиЗаявкиНаМаршрут);
	УдалитьСвязиИзТаблицы("ОбязательстваЭкспедитора", ИмяКлюча, ИдентификаторСтрокиЗаявкиНаМаршрут);
	УдалитьСвязиИзТаблицы("ИнфПол", ИмяКлюча, ИдентификаторСтрокиЗаявкиНаМаршрут);
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		Если ТекущаяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут <> ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
			Продолжить;
		КонецЕсли;
		
		// Удалим данные по товарам маршрута
		УдалитьВсеСвязиТовара(ТекущаяСтрока.ИдентификаторСтроки);
		
	КонецЦикла;
	
	УдалитьСвязиИзТаблицы("Товары", ИмяКлюча, ИдентификаторСтрокиЗаявкиНаМаршрут);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСвязиТовара(ИдентификаторСтрокиТоваров)
	
	ИмяКлюча = "ИдентификаторСтрокиТоваров";
	
	УдалитьСвязиИзТаблицы("СведенияГосСистем", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("ИнфУпГруз", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("СведенияОКонтейнерах", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("Марк", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("ИнфПол", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("СтраныПроисхожденияПродукции", ИмяКлюча, ИдентификаторСтрокиТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвязиИзТаблицы(ИмяТаблицы, ИмяКлюча, ЗначениеКлюча)
	
	СтрокиНаУдаление = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицы] Цикл
		
		Если ТекущаяСтрока[ИмяКлюча] <> ЗначениеКлюча Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиНаУдаление.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из СтрокиНаУдаление Цикл
		Объект[ИмяТаблицы].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВсеОбязательства()
	
	Счет = 0;
	
	Для Каждого ТекущаяСтрока Из СведенияОМаршруте_Обязательства Цикл
		
		ИмяЭлемента = "СведенияОМаршруте_ОбязательстваЭкспедитора_" + Формат(Счет, "ЧДЦ=0; ЧН=0; ЧГ=");
		НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
		Если НайденныйЭлемент <> Неопределено И Счет <> 0 Тогда
			НайденныйЭлемент.Видимость = Ложь;
		КонецЕсли;
		
		Счет = Счет + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыОтображенияОбязательств()
	
	СведенияОМаршруте_ОбязательстваЭкспедитора_0 = "";
	Счет = 0;
	
	Для Каждого ТекущаяСтрока Из СведенияОМаршруте_Обязательства Цикл
		
		ИмяЭлемента = "СведенияОМаршруте_ОбязательстваЭкспедитора_" + Формат(Счет, "ЧДЦ=0; ЧН=0; ЧГ=");
		
		НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
		Если НайденныйЭлемент = Неопределено Тогда
			// Создадим новый элемент и реквизит
			ИдетОбновленияЭлементовФормы = Истина;
			СоздатьЭлементОбязательстваЭкспедитора(ИмяЭлемента);
			ИдетОбновленияЭлементовФормы = Ложь;
			ТекущийЭлементОбработки = Элементы[ИмяЭлемента];
		Иначе
			ТекущийЭлементОбработки = НайденныйЭлемент;
		КонецЕсли;
		
		ТекущийЭлементОбработки.Видимость = Истина;
		ЭтаФорма[ИмяЭлемента] = ТекущаяСтрока.Значение;
		
		Счет = Счет + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементОбязательстваЭкспедитора(ИмяПоля)
	
	// Добавим реквизит формы
	ОписаниеТипаСтрока = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.ОписаниеТипаСтрока(255);
	
	ОписаниеРеквизитов = Новый Структура;
	ОписаниеРеквизитов.Вставить(ИмяПоля, ОписаниеТипаСтрока);
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизиты(ЭтаФорма, ОписаниеРеквизитов, Истина);
	
	// Создадим элемент
	ГруппаРодитель = Элементы.ГруппаОбязательстваЭкспедитораПрограммный;
	ВидПолеВвода = 1;
	
	СвойстваПоля = Новый Структура;
	СвойстваПоля.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СвойстваПоля.Вставить("МногострочныйРежим", Истина);
	СвойстваПоля.Вставить("КнопкаОчистки", Истина);
	СвойстваПоля.Вставить("АвтоМаксимальнаяВысота", Ложь);
	СвойстваПоля.Вставить("МаксимальнаяВысота", 2);
	
	События = Новый Структура;
	События.Вставить("ПриИзменении", "СведенияОМаршруте_ОбязательстваЭкспедитора_ПриИзменении");
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(
		ЭтаФорма, ИмяПоля, ГруппаРодитель,, ВидПолеВвода, ИмяПоля, СвойстваПоля, События);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиОбязательстваВОбъект()
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим старые
	СтрокиНаУдаление = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.ОбязательстваЭкспедитора Цикл
		Если ТекущаяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут <> ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиНаУдаление.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из СтрокиНаУдаление Цикл
		Объект.ОбязательстваЭкспедитора.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	// Добавим новые
	Для Каждого ТекущаяСтрока Из СведенияОМаршруте_Обязательства Цикл
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ОбязательстваЭкспедитора.Добавить();
		НоваяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут = ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут;
		НоваяСтрока.ОбязЭксп = ТекущаяСтрока.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОМаршруте_ОбязательстваЭкспедитора_ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = Элемент.Имя;
	НомерСтроки = Число(СтрЗаменить(ИмяЭлемента, "СведенияОМаршруте_ОбязательстваЭкспедитора_", ""));
	
	СведенияОМаршруте_Обязательства[НомерСтроки].Значение = ЭтаФорма[Элемент.Имя];
	
	ПеренестиОбязательстваВОбъект();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрНастроекПодписанияПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЗамечанияПриИзменении(Элемент)
	
	Если ЕстьЗамечания Тогда
		СведенияОМаршруте_СостояниеГруза = "";
	Иначе
		СведенияОМаршруте_СостояниеГруза = ТекстЗамечанияПоГрузунет();
	КонецЕсли;
	
	Элементы.СведенияОМаршруте_СостояниеГруза.Видимость = ЕстьЗамечания;
	СведенияОМаршруте_СостояниеПриИзменении(Элементы.СведенияОМаршруте_СостояниеГруза);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗамечанияПоГрузунет()
	
	Возврат Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.СостояниеГруза();
	
КонецФункции

&НаКлиенте
Процедура СведенияОМаршруте_СостояниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.ЗаявкиНаМаршрут Цикл
		Если ТекущаяСтрока.ИдентификаторСтроки <> ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = СтрЗаменить(Элемент.Имя, "СведенияОМаршруте_", "");
		ТекущаяСтрока[ИмяРеквизита] = ЭтаФорма[Элемент.Имя];
	КонецЦикла;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияПоТовару_ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ТекущаяСтрока.ИдентификаторСтроки <> ТекущиеДанные.ИдентификаторСтрокиТовара Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = СтрЗаменить(Элемент.Имя, "СведенияПоТовару_", "");
		ТекущаяСтрока[ИмяРеквизита] = ЭтаФорма[Элемент.Имя];
	КонецЦикла;
	
	Элементы.ГруппаПодробныеСведенияГосСист.Видимость = СведенияПоТовару_ПодлежитУчетуВГосСист;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиДереваПоРеквизиту(ИмяРеквизита)
	
	МаршрутыИГрузыВрем = РеквизитФормыВЗначение("МаршрутыИГрузы");
	
	Для Каждого ТекущийМаршрут Из МаршрутыИГрузыВрем.Строки Цикл
		
		ИтогоПоМаршруту = 0;
		
		Для Каждого ТекущийТовар Из ТекущийМаршрут.Строки Цикл
			
			ИтогоПоМаршруту = ИтогоПоМаршруту + ТекущийТовар[ИмяРеквизита];
			
		КонецЦикла;
		
		ТекущийМаршрут[ИмяРеквизита] = ИтогоПоМаршруту;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(МаршрутыИГрузыВрем, МаршрутыИГрузы);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфУпГрузПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = Элементы.МаршрутыИГрузы.ТекущиеДанные.ИдентификаторСтрокиТовара;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфУпГрузПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСтоимостиПриИзменении(Элемент)
	
	Для Каждого ТекущаяСтрока Из Объект.ЗаявкиНаМаршрут Цикл
		ТекущаяСтрока.ТипСтоимости = Объект.ТипСтоимости;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.ТипСтоимости = Объект.ТипСтоимости;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаУчетаГрузаПриИзменении(Элемент)
	
	ТекстВопроса = "Перезаполнить значение в табличной части?";
	РежимДиалога = РежимДиалогаВопрос.ДаНетОтмена;
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, РежимДиалога,,, ЭтаФорма,
		"ВалютаУчетаГрузаПриИзмененииЗавершение", Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаУчетаГрузаПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.ЗаявкиНаМаршрут Цикл
		ТекущаяСтрока.Валюта = Объект.Валюта;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.Валюта = Объект.Валюта;
	КонецЦикла;
	
	ЗаполнитьМаршрутыИГрузы();
	
	РазвернутьМаршрутыИГрузы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// Если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(
		ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "r-rejected");
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	
	ПанельОшибокСвернутьРазвернутьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)
	
	ПерезаполнитьПоДокОснованиюСервер();
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка"), Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЕщеОбязательстваЭкспедитора(Команда)
	
	СведенияОМаршруте_Обязательства.Добавить("");
	
	ОбновитьЭлементыОтображенияОбязательств();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуМаршрутыИГрузы(Команда)
	
	ТекущиеДанные = Элементы.МаршрутыИГрузы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Найдем маршрут
	ДанныеМаршрута = Неопределено;
	Для Каждого ТекущийМаршрут Из Объект.ЗаявкиНаМаршрут Цикл
		Если ТекущийМаршрут.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
			ДанныеМаршрута = ТекущийМаршрут;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеМаршрута = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим новую строку по текущему маршруту
	НоваяСтрокаТовар = Объект.Товары.Добавить();
	НоваяСтрокаТовар.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	НоваяСтрокаТовар.ИдентификаторСтрокиЗаявкиНаМаршрут = ТекущиеДанные.ИдентификаторСтрокиЗаявкиНаМаршрут;
	НоваяСтрокаТовар.Учитывать = Истина;
	НоваяСтрокаТовар.ТипСтоимости = ДанныеМаршрута.ТипСтоимости;
	НоваяСтрокаТовар.Валюта = ДанныеМаршрута.Валюта;
	НоваяСтрокаТовар.ОсобыеОтметки = "Отсутствует";
	НоваяСтрокаТовар.ПризнакПеревозки = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВариантыПодачиКонтейнера.НетКонтейнера");
	
	// Обновим отображение дерева
	ЗаполнитьМаршрутыИГрузы();
	
	// Развернем дерево
	РазвернутьМаршрутыИГрузы();
	
	// Перейдем к новой строке
	Элементы.МаршрутыИГрузы.ТекущаяСтрока = ПолучитьУказательНаСтрокуДерева(НоваяСтрокаТовар.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСР(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Объект.ЗаявкиНаМаршрут.Количество() = 1 Тогда
			
			// Открываем сразу складскую расписку
			ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_СкладскаяРасписка.ФормаОбъекта";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		Иначе
			
			// Открываем мастер
			ПараметрыФормы = Новый Структура("ДокументОснования", Объект.Ссылка);
			ИмяОткрываемойФормы = "Документ.КонтурЛогистика_СкладскаяРасписка.Форма.МастерСозданияСкладскихРасписок";
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяОткрываемойФормы, ПараметрыФормы,, ЭтаФорма);
			
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Оформление СР", "Оформить СР", "Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.Форма.ФормаДокумента", "СР");
		
	Иначе
		
		Сообщить("Оформить складскую расписку можно только после записи документа");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораСтран(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = Результат.Идентификатор;
	ОтборПоСтрокеТоваров = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	СтрокиКУдалению = Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборПоСтрокеТоваров);
	
	Для Каждого СтрокаСтраны Из СтрокиКУдалению Цикл
		Объект.СтраныПроисхожденияПродукции.Удалить(СтрокаСтраны);
	КонецЦикла;
	
	Для Каждого Страна Из Результат.МассивСтран Цикл
		
		НоваяСтрока = Объект.СтраныПроисхожденияПродукции.Добавить();
		НоваяСтрока.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		НоваяСтрока.Страна = Страна;
		
	КонецЦикла;
	
	СведенияПоТовару_СтранаПроисхождения = КонтурЛогистика_ОбщегоНазначенияКлиент.РассчитатьПредставлениеСтран(
		Объект.СтраныПроисхожденияПродукции, ИдентификаторСтрокиТоваров);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Дерево - ОтгрузочноеНаименование
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("МаршрутыИГрузыОтгрузочноеНаименование");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаршрутыИГрузы.ИдентификаторСтрокиТовара");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	
	//
	
	// Дерево - Заявка на маршрут
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("МаршрутыИГрузыЗаявкаНаМаршрут");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаршрутыИГрузы.ИдентификаторСтрокиТовара");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	
	//
	
	// Дерево - Доступность редактирования маршрута
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МаршрутыИГрузыКоличество.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МаршрутыИГрузыОбъемКубМ.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаршрутыИГрузы.ИдентификаторСтрокиТовара");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	// Дерево - Заявка на маршрут
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("МаршрутыИГрузыКонтейнеры");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаршрутыИГрузы.ИдентификаторСтрокиТовара");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьМаршрутыИГрузы()
	
	Строки = МаршрутыИГрузы.ПолучитьЭлементы();
	
	Для Каждого Строка Из Строки Цикл
		
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.МаршрутыИГрузы.Развернуть(ИдентификаторСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоги()
	
	Объект.КоличествоМест = Итог("КоличествоМест");
	ИтогОбъемКубМ = Итог("ОбъемКубМ");
	Объект.МассаНеттоКг = Итог("МассаНеттоКг");
	Объект.МассаБруттоКг = Итог("МассаБруттоКг");
	
	Объект.Стоимость = Итог("Стоимость");
	Если Объект.Товары.Количество() <> 0
		И Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		Объект.Валюта = Объект.Товары[0].Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Итог(ПолеИтога)
	
	Итого = 0;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Итого = Итого + СтрокаТовары[ПолеИтога];
	КонецЦикла;
	
	Возврат Итого;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначенияПоУмолчаниюДляНовогоДокумента()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЛицоПогрузки) Тогда
		Объект.ЛицоПогрузки = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ФДатПол) Тогда
		Объект.ФДатПол = ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаДок) Тогда
		Объект.ДатаДок = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокГруппыРеквизитыДокументаПЭ()
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Заказчик = "Заказчик: " + Строка(Объект.Клиент) + " ";
	Иначе 
		Заказчик = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Экспедитор) Тогда
		Экспедитор = "Экспедитор: " + Строка(Объект.Экспедитор) + " ";
	Иначе 
		Экспедитор = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЭкспедицияДоговор) Тогда 
		Договор = "Договор: " + Строка(Объект.ЭкспедицияДоговор) + " ";
	Иначе 
		Договор = "";
	КонецЕсли;
	
	Элементы.ГруппаОсновныеРеквизиты.ЗаголовокСвернутогоОтображения = "Реквизиты ПЭ " + Заказчик + Экспедитор + Договор;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЕстьПоручениеЭкспедитора = ЗначениеЗаполнено(Объект.ПЭ_Титул1);
	Элементы.Клиент.ТолькоПросмотр = ЕстьПоручениеЭкспедитора;
	Элементы.Экспедитор.ТолькоПросмотр = ЕстьПоручениеЭкспедитора;
	
	УстановитьФорматыКолонокСКоличеством();
	УстановитьВидимостьДогПогрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "МассаНеттоКг", Элементы.МаршрутыИГрузыМассаБруттоКг);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "МассаНеттоКг", Элементы.МаршрутыИГрузыМассаНеттоКг);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ЗаполнитьМаршрутыИГрузы();
	
	ТекущийКодСостоянияДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка).Код;
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка);
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	ВозможностьОтветнойПодписи = ВозможностьОтветнойПодписи();
	
	Если ТекущийКодСостоянияДокументооборота = "fr-сheck-forwarder"
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		
		ВозможностьПодписанияИОтправки = Не ВозможностьОтветнойПодписи;
	Иначе
		ВозможностьПодписанияИОтправки = Ложь;
	КонецЕсли;
	
	ДоступнаОсновнаяКнопкаПоУмолчанию = Не ВозможностьОтветнойПодписи И ВозможностьПодписанияИОтправки;
	ДоступностьКнопкиСогласования = ВозможностьОтветнойПодписи;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(
		Объект.Ссылка, Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = Не ЭтоВходящий И ЕстьДокУчСист;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;
	
	ТребуетсяПодтверждение = ТребуетсяПодтверждение();
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.Видимость = ТребуетсяПодтверждение;
	Если ТребуетсяПодтверждение Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость =
		Не (ТребуетсяПодтверждение Или ТекущийКодСостоянияДокументооборота = "fr-completed");
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.Видимость = ДоступностьКнопкиСогласования;
	
	Если Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.Видимость Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ОткрытьНастройкуКонвертации.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМаршрутыИГрузы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаявкиНаМаршрут", Объект.ЗаявкиНаМаршрут.Выгрузить());
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиНаМаршрут.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаМаршрут.ЗаявкаНаМаршрут = ЗНАЧЕНИЕ(Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПустаяСсылка)
	|			ТОГДА ЗаявкиНаМаршрут.ИдентификаторСтроки
	|		ИНАЧЕ ЗаявкиНаМаршрут.ЗаявкаНаМаршрут
	|	КОНЕЦ КАК ЗаявкаНаМаршрут,
	|	ЗаявкиНаМаршрут.КоличествоМест КАК КоличествоМест,
	|	ЗаявкиНаМаршрут.МассаБруттоКг КАК МассаБруттоКг,
	|	ЗаявкиНаМаршрут.МассаНеттоКг КАК МассаНеттоКг,
	|	ЗаявкиНаМаршрут.Стоимость КАК Стоимость,
	|	ЗаявкиНаМаршрут.Валюта КАК Валюта,
	|	ЗаявкиНаМаршрут.ПризнакПеревозки КАК ПризнакПеревозки
	|ПОМЕСТИТЬ ВТ_ЗаявкиНаМаршрут
	|ИЗ
	|	&ЗаявкиНаМаршрут КАК ЗаявкиНаМаршрут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.ИдентификаторСтрокиЗаявкиНаМаршрут КАК ИдентификаторСтрокиЗаявкиНаМаршрут,
	|	Товары.ОтгрузочноеНаименование КАК ОтгрузочноеНаименование,
	|	Товары.КоличествоМест КАК КоличествоМест,
	|	Товары.Количество КАК Количество,
	|	Товары.ОбъемКубМ КАК ОбъемКубМ,
	|	Товары.Стоимость КАК Стоимость,
	|	Товары.Валюта КАК Валюта,
	|	Товары.МассаБруттоКг КАК МассаБруттоКг,
	|	Товары.МассаНеттоКг КАК МассаНеттоКг
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявкиНаМаршрут.ЗаявкаНаМаршрут КАК ЗаявкаНаМаршрут,
	|	ВТ_Товары.ОтгрузочноеНаименование КАК ОтгрузочноеНаименование,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.КоличествоМест КАК КоличествоМест,
	|	ВТ_Товары.ОбъемКубМ КАК ОбъемКубМ,
	|	ВТ_Товары.МассаБруттоКг КАК МассаБруттоКг,
	|	ВТ_Товары.МассаНеттоКг КАК МассаНеттоКг,
	|	ВТ_Товары.Стоимость КАК Стоимость,
	|	ВТ_Товары.Валюта КАК Валюта,
	|	ВТ_Товары.ИдентификаторСтроки КАК ИдентификаторСтрокиТовара,
	|	ВТ_Товары.ИдентификаторСтрокиЗаявкиНаМаршрут КАК ИдентификаторСтрокиЗаявкиНаМаршрут,
	|	""Количество контейнеров: 99999999"" КАК Контейнеры,
	|	ВТ_ЗаявкиНаМаршрут.ПризнакПеревозки КАК ПризнакПеревозки
	|ИЗ
	|	ВТ_ЗаявкиНаМаршрут КАК ВТ_ЗаявкиНаМаршрут
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО ВТ_ЗаявкиНаМаршрут.ИдентификаторСтроки = ВТ_Товары.ИдентификаторСтрокиЗаявкиНаМаршрут
	|ИТОГИ
	|	МАКСИМУМ(ОтгрузочноеНаименование),
	|	СУММА(Количество),
	|	СУММА(КоличествоМест),
	|	СУММА(ОбъемКубМ),
	|	СУММА(МассаБруттоКг),
	|	СУММА(МассаНеттоКг),
	|	СУММА(Стоимость),
	|	МАКСИМУМ(Валюта),
	|	МАКСИМУМ(ИдентификаторСтрокиЗаявкиНаМаршрут),
	|	МАКСИМУМ(Контейнеры),
	|	МАКСИМУМ(ПризнакПеревозки)
	|ПО
	|	ЗаявкаНаМаршрут";
	
	ДанныеТоваров = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Счет = 1;
	Для Каждого ТекущаяСтрока Из ДанныеТоваров.Строки Цикл
		
		// Заполним данные из маршрута
		Для Каждого ТекущийМаршрут Из Объект.ЗаявкиНаМаршрут Цикл
			Если ТекущийМаршрут.ИдентификаторСтроки <> ТекущаяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ТекущийМаршрут,
				"КоличествоМест, МассаБруттоКг, МассаНеттоКг, Стоимость, Валюта");
			
			ТекущаяСтрока.Контейнеры = ПредставлениеКонтенераПоМаршруту(ТекущийМаршрут.ИдентификаторСтроки);
			
		КонецЦикла;
		
		Если ТипЗнч(ТекущаяСтрока.ЗаявкаНаМаршрут) <> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		
		// Если маршрут не нашли, то установим представление
		ТекущаяСтрока.ЗаявкаНаМаршрут = "Маршрут №" + Формат(Счет, "ЧДЦ=0; ЧГ=");
		Счет = Счет + 1;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДанныеТоваров, "МаршрутыИГрузы");
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеКонтенераПоМаршруту(ИдентификаторСтроки)
	
	ПредставлениеКонтенеров = "Заполнить";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтроки);
	
	НайденныеСтроки = Объект.СведенияОКонтейнерах.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ПредставлениеКонтенеров = "количество (" + Формат(НайденныеСтроки.Количество(), "ЧДЦ=0") + ")";
	КонецЕсли;
	
	Возврат ПредставлениеКонтенеров;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставлениеДанных()
	
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыДокументаОснованияНастроеныДляТитула()
	
	ТипыНастроены = Истина;
	
	РеквизитМД = Метаданные.Документы["КонтурЛогистика_ЭкспедиторскаяРасписка"].Реквизиты.ДокументОснование;
	
	МассивТипов = РеквизитМД.Тип.Типы();
	
	Если МассивТипов.Количество() = 1 И МассивТипов.Найти(Тип("ДокументСсылка.КонтурЛогистика_Вспомогательный")) = 0 Тогда
		ТипыНастроены = Ложь;
	КонецЕсли;
	
	Возврат ТипыНастроены;
	
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		
		ЛокальныйТолькоПросмотр = Ложь;
	Иначе
		ЛокальныйТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВозможностьОтветнойПодписи = ВозможностьОтветнойПодписи();
	
	Если ВозможностьОтветнойПодписи Тогда
		ЛокальныйТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВозможностьПодписанияИОтправки = Не ЛокальныйТолькоПросмотр И Не ВозможностьОтветнойПодписи;
	
	Элементы.ГруппаШапка.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаУсловияПриемаГруза.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаДополнительныеПоля.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.ГруппаСведенияПоМаршруту.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.ГруппаСведенияПоТовару.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.ГруппаМаршрутыИГрузы.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.ДобавитьЕщеОбязательстваЭкспедитора.Доступность = Не ЛокальныйТолькоПросмотр;
	
	// ПодменюУправление
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена", Не ЛокальныйТолькоПросмотр);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", ВозможностьПодписанияИОтправки);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", ВозможностьПодписанияИОтправки);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_Согласовать", ВозможностьОтветнойПодписи);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьЭлемента(ИмяЭлемента, ЗначениеДоступности)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Доступность = ЗначениеДоступности;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВозможностьОтветнойПодписи()
	
	// Пока не используем
	Возврат Ложь;
	
	ТребуетсяОтветнаяПодпись = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТребуетсяОтветнаяПодписьЗаказчикаЭР");
	
	Если ТекущийКодСостоянияДокументооборота = "fr-сheck-cargo-owner"
		И ТребуетсяОтветнаяПодпись Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ТребуетсяПодтверждение()
	
	Если ТекущийКодСостоянияДокументооборота = "fr-forwarding-cargo-owner" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	Если ТекущийКодСостоянияДокументооборота = "fr-wait-forwarder"
		Или ТекущийКодСостоянияДокументооборота = "fr-wait-cargo-owner"
		Или ТекущийКодСостоянияДокументооборота = "fr-completed" Тогда
		
		ВсегдаВыводитьРезультатВалидации = Ложь;
	Иначе
		ВсегдаВыводитьРезультатВалидации = Истина;
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(
		ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	
	УправлениеВидимостьюИДоступностью(); // Доступность команд
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Процедура ДобавитьГрузыВ_ЭР(Документ)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТабличнуюЧастьЭРПоСвГруз(Документ);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	ОбновитьДанныеФормы();
	ОбновитьПредставлениеДанных();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ТекущийСтатус = СтатусТитула(Объект.Ссылка);
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусТитула(ДокументСсылка)
	
	Возврат РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументСсылка, Истина);
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДогПогрузки()
	
	Элементы.ДоговорПриемкиГруза.Видимость = (Объект.ЛицоПогрузки = 2);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	Объект.ИнфПол.Очистить();
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика", 
		ДокОбъект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка));
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)
	
	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	
	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);
	
	Если Элемент.Имя = "ДокУчСист_Грузоотправитель"
		Или Элемент.Имя = "ДокУчСист_Клиент"
		Или Элемент.Имя = "ДокУчСист_ОтправительШаблона"
		Или Элемент.Имя = "ДокУчСист_Экспедитор" Тогда
		
		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";
		
	Иначе
		
		ВызватьИсключение "Не реализовано";
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник." + ИмяСущности + ".ФормаВыбора", ПараметрыФормыПоиска, ЭтаФорма, ЭтаФорма,
		"ОбработчикВыбораСопоставленияРеквизитаДокумента", ПараметрыОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Выполнить переконвертацию или присваивание
	ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);
	
	ОбновитьПредставлениеДанных();
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Объект.ДокументОснование);
	ДанныеЗаполнения.Вставить("ТипЛогистика", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка);
	
	ДокОбъект.Заполнить(ДанныеЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоМестТоваров()
	
	КоличествоМест = 0;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
	КонецЦикла;
	
	Возврат КоличествоМест;
	
КонецФункции

&НаКлиенте
Функция ПолучитьУказательНаСтрокуДерева(ТекущийИдентификаторСтроки)
	
	Для Каждого ЭлементМаршрута Из МаршрутыИГрузы.ПолучитьЭлементы() Цикл
		
		Если ЭлементМаршрута.ИдентификаторСтрокиЗаявкиНаМаршрут = ТекущийИдентификаторСтроки Тогда
			Возврат ЭлементМаршрута.ПолучитьИдентификатор();
		КонецЕсли;
		
		Для Каждого ЭлементТовара Из ЭлементМаршрута.ПолучитьЭлементы() Цикл
			Если ЭлементТовара.ИдентификаторСтрокиТовара = ТекущийИдентификаторСтроки Тогда
				Возврат ЭлементТовара.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()
	
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		ИмяЭлементаРедактированиеЭТРН = "Редактирование_" + Эл.Ключ;
		
		Если Представления.Свойство(Эл.Ключ, Значение) Тогда
			
			// Есть значение в реквизите ДокУчСист_ххх извлеченного из Документа учетной системы
			текВыражение = "ДокУчСист_" + Эл.Ключ + " = Значение";
			Выполнить (текВыражение);
			
			// Определим доступность команды сопоставления
			Если Не ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				Продолжить;
			КонецЕсли;
			
			ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
			
			РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
			
			Если Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаРедактированиеЭТРН).Видимость = Не РеквизитИзвлеченИзДокумента;
			КонецЕсли;
			
			Если РеквизитИзвлеченИзДокумента Тогда // Если этот элемент выведен на форму и он рассчитан из документа уч сист
				
				Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
					ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
					НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
				Иначе
					НужноСопоставить = Ложь;
				КонецЕсли;
				
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
				Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить Или РеквизитыУчетногоДокументаВидимы;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
				
			Иначе // Не извлечен из документа Уч сист
				
				Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
				
				Если Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено Тогда 
					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Ложь;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка =
						"Не извлечен или не заполнен в док. основании. Открыть исходный документ";
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			// Не выведено поле ДокументаУчетной системы - только выберем видимость в пользу поля ввода РедактированиеЭТРНххх вместо ДокументЭТРНххх
			ЕстьЭлементРедактированиеЭТРН = Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено;
			Если ЕстьЭлементРедактированиеЭТРН Тогда 
				Элементы.Найти(ИмяЭлементаРедактированиеЭТРН).Видимость = Не ТолькоПросмотр И ЕстьЭлементРедактированиеЭТРН;
			КонецЕсли;
				
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = ТолькоПросмотр ИЛИ Не ЕстьЭлементРедактированиеЭТРН;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить(Эл.Ключ);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат СтруктураПредставлений;
	КонецЕсли;
	
	ИменаРеквизитов = Новый Массив;
	
	СоответствиеКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Для Каждого ТекущееЗначение Из СоответствиеКонвертируемыхРеквизитов Цикл
		ИменаРеквизитов.Добавить(ТекущееЗначение.Ключ);
	КонецЦикла;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка, ДокументОснование);
	
	СтруктураПредставлений = КонтурЛогистика_ОбработкаДокументовСервер.ВычислитьРеквизитыДокументаОснования(
		ИменаРеквизитов, ДокументТитулОбъект, КонтекстНастройкиКонвертации);
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()
	
	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ОтправительШаблона", "ОтправительШаблона");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "Грузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Клиент", "Клиент");
	МассивКонвертируемыхРеквизитов.Вставить("Экспедитор", "Экспедитор");
	
	Возврат МассивКонвертируемыхРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеТаблицы()
	
	РеквизитыЗаказаНаПоставку.Очистить();
	СопроводительныеДокументыМаршрутов.Очистить();
	
	Счет = 1;
	
	Для Каждого ТекущийМаршрут Из Объект.ЗаявкиНаМаршрут Цикл
		
		Если ЗначениеЗаполнено(ТекущийМаршрут.ЗаявкаНаМаршрут) Тогда
			ПредставлениеЗаказа = ТекущийМаршрут.ЗаявкаНаМаршрут;
		Иначе
			ПредставлениеЗаказа = "Маршрут №" + Формат(Счет, "ЧДЦ=0; ЧГ=");
			Счет = Счет + 1;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ТекущийМаршрут.ИдентификаторСтроки);
		
		// Реквизиты заказа на поставку
		РеквизитыЗаказа = Объект.РеквЗакПост.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ТекущаяСтрока Из РеквизитыЗаказа Цикл
			НоваяСтрока = РеквизитыЗаказаНаПоставку.Добавить();
			НоваяСтрока.ЗаявкаНаМаршрут = ПредставлениеЗаказа;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
		// Сопр док парт
		СопроводительныеДокументыЗаказа = Объект.СопрДокПарт.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ТекущаяСтрока Из СопроводительныеДокументыЗаказа Цикл
			НоваяСтрока = СопроводительныеДокументыМаршрутов.Добавить();
			НоваяСтрока.ЗаявкаНаМаршрут = ПредставлениеЗаказа;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#Область Сертификаты

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Элемент)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельОшибок

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокКоманднаяПанельСвернутьНажатие(Элемент)
	
	Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Ложь;
	Элементы.ПанельОшибокКоманднаяПанельРазвернуть.Видимость = Истина;
	
	ИзменитьРасположениеПанелиОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокКоманднаяПанельРазвернутьНажатие(Элемент)
	
	Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Истина;
	Элементы.ПанельОшибокКоманднаяПанельРазвернуть.Видимость = Ложь;
	
	ИзменитьРасположениеПанелиОшибок();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРасположениеПанелиОшибок()
	
	ПанельСвернута = (Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Истина);
	
	Если ПанельСвернута Тогда
		НовыйРодитель = Элементы.ВсяФорма;
		НовоеМестоположение = Неопределено;
		Элементы.ПанельОшибок.Ширина = 35;
		Элементы.ПанельОшибок.РастягиватьПоГоризонтали = Ложь;
	Иначе
		НовыйРодитель = Элементы.ВспомогательнаяЧасть;
		НовоеМестоположение = Элементы.ГруппаСведенияПоМаршруту;
		Элементы.ПанельОшибок.Ширина = 0;
		Элементы.ПанельОшибок.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ПанельОшибокРазвернутая, НовыйРодитель, НовоеМестоположение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
