
&Вместо("ПриКомпоновкеРезультата")
Процедура ОД_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	// Стандартная компоновка отчета.
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВНаличии"));
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Значение = НСтр("ru = 'В наличии'");
		ЗначениеПараметра.Использование = Истина;
	КонецЕсли;
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.РеквизитыНоменклатуры.Запрос;

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаВесНоменклатуры", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СпрНоменклатура.ЕдиницаИзмерения", "СпрНоменклатура"));
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаОбъемНоменклатуры", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СпрНоменклатура.ЕдиницаИзмерения", "СпрНоменклатура"));

	СхемаКомпоновкиДанных.НаборыДанных.РеквизитыНоменклатуры.Запрос = ТекстЗапроса;
	
	// 02/06/2025/1 Зинаков
	Если РольДоступна("Операционист")
		ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
		ИЛИ РольДоступна("РуководительОтделаПродажДополнительно") Тогда
	
		ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных["Поступление и отгрузка заказа"].Запрос;
		
		СтрокаПоиска =
		"РегистрНакопления.ГрафикПоступленияТоваров КАК Таблица
		|ГДЕ
		|	Таблица.КоличествоИзЗаказов <> 0";

		СтрокаЗамены =
		"РегистрНакопления.ГрафикПоступленияТоваров КАК Таблица
		|ГДЕ
		|	Таблица.КоличествоИзЗаказов <> 0	
		|	И НЕ Таблица.Регистратор ССЫЛКА Документ.ЗаказПоставщику";

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоиска, СтрокаЗамены);

		СхемаКомпоновкиДанных.НаборыДанных["Поступление и отгрузка заказа"].Запрос = ТекстЗапроса;
	
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолейЕдиницИзмерений(), МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;

КонецПроцедуры
