#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СколькоВключеноАвтоотправокПоТипу(ТипЛогистика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипЛогистическогоДокумента", ТипЛогистика);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_СценарииАвтоматическойРаботы.Ссылка) КАК КоличествоАвтоотправок
	|ИЗ
	|	Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы КАК КонтурЛогистика_СценарииАвтоматическойРаботы
	|ГДЕ
	|	НЕ КонтурЛогистика_СценарииАвтоматическойРаботы.ПометкаУдаления
	|	И КонтурЛогистика_СценарииАвтоматическойРаботы.Включен
	|	И КонтурЛогистика_СценарииАвтоматическойРаботы.ТипЛогистическогоДокумента = &ТипЛогистическогоДокумента";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КоличествоАвтоотправок;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции 

Функция ВыполнитьВсеАктивныеСценарии(БезПодписанияНаСервере = Ложь) Экспорт
	
	ДокументыНаПодписание = Новый Массив;
	
	// получим все включенные, непомеченные на удаление роботы 
	// у которых либо нет расписания, либо в соотв. с расписанием он сейчас активен
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаВсехАктивныхСценариев();
	
	Запрос.УстановитьПараметр("ТекущееВремя", Дата(1,1,1) + (ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(ТекущаяДатаСеанса()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ВыполнитьСценарий(Выборка.Ссылка, Выборка.Сценарий, БезПодписанияНаСервере, ДокументыНаПодписание);
			
			СнятьОшибкиСценариевАвтоматическойРаботы(Выборка.Ссылка);
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗафиксироватьОшибкуВРегистреИЖурнале(Выборка.Ссылка,, ТекстОшибки);
			
			Сообщить("КонтурЛогистика_Робот_" + Выборка.Ссылка + ": " + ТекстОшибки);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ДокументыНаПодписание;
	
КонецФункции

Процедура ВыполнитьСценарий(Сценарий, ТипСценария, БезПодписанияНаСервере = Ложь, ДокументыНаПодписание = Неопределено) Экспорт
	
	Если ЭтоСценарийАвтоотправки(ТипСценария) Тогда
		
		ВыполнитьСценарийАвтоотправки(Сценарий, БезПодписанияНаСервере, ДокументыНаПодписание);
		
	ИначеЕсли ТипСценария = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьВходящихДокументов Тогда
		
		ВыполнитьПодписьВходящихДокументов(Сценарий, БезПодписанияНаСервере);
		
	ИначеЕсли ТипСценария = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.СогласованиеДокументов Тогда
		
		ВыполнитьСогласованиеДокументов(Сценарий);
		
	Иначе
		
		ВызватьИсключение "Сценарий " + ТипСценария + " не поддерживается в текущей версии и будет добавлен позже";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаВсехАктивныхСценариев()
	 
	Возврат	"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.Ссылка КАК Ссылка,
			|	КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.Ссылка.Сценарий КАК Сценарий,
			|	ВЫБОР
			|			КОГДА &ДеньНедели = 1
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ПН = ИСТИНА
			|			КОГДА &ДеньНедели = 2
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ВТ = ИСТИНА
			|			КОГДА &ДеньНедели = 3
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.СР = ИСТИНА
			|			КОГДА &ДеньНедели = 4
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ЧТ = ИСТИНА
			|			КОГДА &ДеньНедели = 5
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ПТ = ИСТИНА
			|			КОГДА &ДеньНедели = 6
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.СБ = ИСТИНА
			|			КОГДА &ДеньНедели = 7
			|				ТОГДА КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ВС = ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|		И КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.Ссылка.Включен
			|		И КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ВремяС <= &ТекущееВремя
			|		И КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.ВремяПо >= &ТекущееВремя
			|		И НЕ КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности.Ссылка.ПометкаУдаления КАК СейчасАктивен
			|ПОМЕСТИТЬ ВТ_РоботыСРасписанием
			|ИЗ
			|	Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы.ИнтервалыАктивности КАК КонтурЛогистика_СценарииАвтоматическойРаботыИнтервалыАктивности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтурЛогистика_СценарииАвтоматическойРаботы.Ссылка КАК Ссылка,
			|	КонтурЛогистика_СценарииАвтоматическойРаботы.Сценарий КАК Сценарий,
			|	ЕСТЬNULL(ВТ_РоботыСРасписанием.СейчасАктивен, ИСТИНА) КАК СейчасАктивен
			|ИЗ
			|	Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы КАК КонтурЛогистика_СценарииАвтоматическойРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РоботыСРасписанием КАК ВТ_РоботыСРасписанием
			|		ПО (ВТ_РоботыСРасписанием.Ссылка = КонтурЛогистика_СценарииАвтоматическойРаботы.Ссылка)
			|ГДЕ
			|	НЕ КонтурЛогистика_СценарииАвтоматическойРаботы.ПометкаУдаления
			|	И КонтурЛогистика_СценарииАвтоматическойРаботы.Включен
			|	И ЕСТЬNULL(ВТ_РоботыСРасписанием.СейчасАктивен, ИСТИНА)
			|
			|УПОРЯДОЧИТЬ ПО
			|	КонтурЛогистика_СценарииАвтоматическойРаботы.ПорядокВыполнения";
	
КонецФункции

Процедура ВыполнитьСценарийАвтоотправки(СценарийСсылка, БезПодписанияНаСервере = Ложь, ДокументыНаПодписание = Неопределено) Экспорт
	
	Если ДокументыНаПодписание = Неопределено Тогда
		ДокументыНаПодписание = Новый Массив;
	КонецЕсли;
	
	ПерезаполнятьЧерновики = СценарийСсылка.ПерезаполнятьЧерновики;
	
	Если ЗначениеЗаполнено(СценарийСсылка.Сценарий)
		И СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ОбработатьВходящиеДокументыЛогистики Тогда
		
		Запрос = СформироватьЗапросСпискаЗадачРобота(СценарийСсылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		// Отладка: Результат.Выгрузить();
		
		Пока Выборка.Следующий() Цикл
			
			// Выполним проверку дополнительного условия из сценария на языке 1С
			Если Не ПроверитьДополнительноеУсловиеНаЯзыке1С(СценарийСсылка, Выборка) Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
			
				КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументУчетнойСистемыПоТитулу(Выборка.ДокументЛогистика, Истина);
				
			Исключение
				
				// необработанные ошибки
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
					"Проблемы при отправке документов: " + ТекстОшибки);
				
				ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, Выборка.ДокументЛогистика, ТекстОшибки);
				
				КонтурЛогистика_Метрика.ОбработатьОшибку("Роботы", ТекстОшибки, Выборка.ДокументЛогистика, "обработка входящего", "ВыполнитьСценарийАвтоотправки", Ложь);
				
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(СценарийСсылка.НастройкаКонвертации) Тогда
			СценарийНКД = СценарийСсылка.НастройкаКонвертации.Сценарий;
		Иначе
			КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
				СценарийСсылка.ТипЛогистическогоДокумента);
			СценарийНКД = КонтекстНастройкиКонвертации.Сценарий;
		КонецЕсли;
		
		РазрешеноОтправлятьТ2ДоВодителя = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("РазрешитьОтправлятьТ2ДоВодителя");
		РазрешеноОтправлятьТ4ДоВодителя = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("РазрешитьОтправлятьТ4ДоВодителя");
		СтатусПогрузкаВодитель = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-wait-driver-approve");
		СтатусРазгрузкаВодитель = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-wait-driver-approve");
		СтатусРазгрузкаВозвратаВодитель = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pd-wait-driver-approve");
		СтатусПогрузкаВодительЧерновик = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-wait-driver-draftApprove");
		СтатусПогрузкаКладовщикЧерновик = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-wait-storekeeper");
		СтатусПогрузкаОформлениеГрузоотправительЧерновик = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-wait-consignor-sign");
		СтатусРазгрузкаВодительЧерновик = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-wait-driver-draftApprove");
		СтатусРазгрузкаКладовщикЧерновик = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-wait-storekeeper");
		СтатусРазгрузкаОформлениеГрузоотправительЧерновик = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-wait-consignee-sign");
		
		// Требуется выбрать задачи
		Запрос = СформироватьЗапросСпискаЗадачРобота(СценарийСсылка);
		
		ДобавитьДопФильтры(Запрос, СценарийСсылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		// Отладка: Результат.Выгрузить();
		
		// Определим будем ли обрабатывать задания параллельно фоновыми заданиями или выполнять сразу последовательно
		Если БезПодписанияНаСервере
			Или Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользоватьОтправкуВФоне() Тогда
			
			ВыполнятьЗаданиеСразу = Истина;
		Иначе
			ВыполнятьЗаданиеСразу = Ложь;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			// Выполним проверку дополнительного условия из сценария на языке 1С
			Если Не ПроверитьДополнительноеУсловиеНаЯзыке1С(СценарийСсылка, Выборка) Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьТребуемоеДействие = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПеременнаяСодержитСвойство(Выборка, "ТребуемоеДействие");
			
			// список случаев при которых допустимо выполнение робота
			Если Не Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
				И Не (Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
					И (Выборка.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСервиса
						ИЛИ Выборка.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСоединения))
				И Не Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена
				И Не (Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
					И СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного)
				И Не (Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
					И (Не ЕстьТребуемоеДействие ИЛИ (Выборка.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание
						Или Выборка.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю
						Или Выборка.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный)))
				//И Не Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработан  // TODO добавить при мерже с новым статусом
				И Не Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка()
				И Не Выборка.Статус = NULL
				И Не (Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
					И (Не ЕстьТребуемоеДействие ИЛИ (Выборка.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание
						Или Выборка.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю
						Или Выборка.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный)))
				И Не (СценарийСсылка.ОбработкаОтказа И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоСостояниеОтказа(Выборка.СтатусЭТРН)) Тогда
				
				Продолжить;
			КонецЕсли;
			
			Если Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
				И Не (Выборка.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСервиса 
					И (Лев(Выборка.КодОшибки, 1) = "5" Или СокрЛП(Выборка.КодОшибки) = "408" Или СокрЛП(Выборка.КодОшибки) = "413")
						Или СокрЛП(Выборка.КодОшибки) = "425" Или СокрЛП(Выборка.КодОшибки) = "429")
					И Не Выборка.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСоединения Тогда
				Продолжить;
			КонецЕсли;
			
			ТипЛогистическогоДокумента = СценарийСсылка.ТипЛогистическогоДокумента;
			
			// для Т2 и Т4 пока Титул находится на согласовании с водителем ничего делать не нужно
			Если ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 
				И Не РазрешеноОтправлятьТ2ДоВодителя 
				И Выборка.СтатусЭТРН = СтатусПогрузкаВодитель Тогда
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Не обработан Титул 2 по ЭТрН: " + Выборка.ДокументЭТРН + ". На согласовании водителя на погрузке.");
				Продолжить;
			КонецЕсли;
			
			Если ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4 
				И Не РазрешеноОтправлятьТ4ДоВодителя 
				И (Выборка.СтатусЭТРН = СтатусРазгрузкаВодитель
					Или Выборка.СтатусЭТРН = СтатусРазгрузкаВозвратаВодитель) Тогда
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Не обработан Титул 4 по ЭТрН: " + Выборка.ДокументЭТРН + ". На согласовании водителя на выгрузке.");
				Продолжить;
			КонецЕсли;
			
			// для Т2 и Т4 обращаем внимание, нет ли комментариев водителя
			Если (ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
				ИЛИ ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4) 
				И СценарийСсылка.ТолькоБезЗамечанийУчастников = Истина 
				И Выборка.КомментарииВодителя = Истина  Тогда 
				Продолжить;
			КонецЕсли;
			
			// Для Т2 и Т4 проверяем, что получили черновик Т1 (Т3) и не формируем Т2 (Т4)
			Если ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
				И (Выборка.СтатусЭТРН = СтатусПогрузкаВодительЧерновик
					Или Выборка.СтатусЭТРН = СтатусПогрузкаКладовщикЧерновик
					Или Выборка.СтатусЭТРН = СтатусПогрузкаОформлениеГрузоотправительЧерновик) Тогда
				Продолжить;
			ИначеЕсли ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
				И (Выборка.СтатусЭТРН = СтатусРазгрузкаВодительЧерновик
					Или Выборка.СтатусЭТРН = СтатусРазгрузкаКладовщикЧерновик
					Или Выборка.СтатусЭТРН = СтатусРазгрузкаОформлениеГрузоотправительЧерновик) Тогда
				Продолжить;
			КонецЕсли;
			
			// Определим контекст для обработки задачи
			Контекст = Новый Структура;
			Контекст.Вставить("БезПодписанияНаСервере", БезПодписанияНаСервере);
			
			Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного Тогда
				Контекст.Вставить("Ссылка", Выборка.Ссылка);
			Иначе
				Контекст.Вставить("ДокументЛогистика", Выборка.ДокументЛогистика);
				Контекст.Вставить("Документ1С", Выборка.Документ1С);
				Контекст.Вставить("ПредыдущийТитул", Выборка.ПредыдущийТитул);
				Контекст.Вставить("ТребуемоеДействие", ?(ЕстьТребуемоеДействие, Выборка.ТребуемоеДействие, Неопределено));
				Контекст.Вставить("СтатусЭТРН ", Выборка.СтатусЭТРН);
				
				Если ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
					Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
					Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
					Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
					
					Контекст.Вставить("Водитель", Выборка.Водитель);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ВыполнятьЗаданиеСразу Тогда
				
				Попытка
				
					// Выполняем сразу, так как вызывается обработка на клиенте
					ВыполнитьЗаданиеОчереди(СценарийСсылка, Контекст, ДокументыНаПодписание);
				
				Исключение
					
					// необработанные ошибки
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					
					КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
						"Проблемы при отправке документов: " + ТекстОшибки);
					
					ОбъектСОшибкой = Неопределено;
					Если ЗначениеЗаполнено(Выборка.Документ1С) Тогда 
						ОбъектСОшибкой = Выборка.Документ1С;
					ИначеЕсли ЗначениеЗаполнено(Выборка.ДокументЛогистика) Тогда 
						ОбъектСОшибкой = Выборка.ДокументЛогистика;
					ИначеЕсли ЗначениеЗаполнено(Выборка.ГлавныйДокумент) Тогда 
						ОбъектСОшибкой = Выборка.ГлавныйДокумент;
					КонецЕсли;
					
					ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, ОбъектСОшибкой, ТекстОшибки);
					КонтурЛогистика_Метрика.ОбработатьОшибку("Роботы", ТекстОшибки, ОбъектСОшибкой, Строка(СценарийСсылка), "ВыполнитьСценарийАвтоотправки", Ложь);

				КонецПопытки;
				
			Иначе
				
				// Оперделим документ основания
				Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного Тогда
					ДокументОснования = Выборка.Ссылка;
				ИначеЕсли ОформлениеНаОснованииУчетногоДокумента(ТипЛогистическогоДокумента, СценарийСсылка.СпецСценарий) Тогда
					ДокументОснования = Выборка.Документ1С;
				Иначе
					ДокументОснования = Выборка.ПредыдущийТитул;
				КонецЕсли;
				
				// Добавляем в очередь
				РегистрыСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ДобавитьВОчередь(
					СценарийСсылка, ДокументОснования, Контекст);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Это фоновый технический процесс, который не выполняет бизнес-логику, но обеспечивает работоспособность всей системы очереди.
// Безопасно выдает задачу воркеру и гарантирует, что она не потеряется и не будет обработана дважды.
// Восстанавливает зависшие задачи, поддерживает порядок в хранилище.
//
Процедура ПланировщикЗапускаРоботов() Экспорт
	
	// Если задача выполняется слишком долго, то завершим работу вокера и вернем его задачи в работу
	CбросCтатусаДляЗависшихЗадач();
	
	// Проверим, что фоновое задание вокера не заврешили вручную или автоматически,
	// иначе вернем все его задачи обратно в очередь
	ПроверкаРаботоспособностиВокеров();
	
	// Раздадим новые задачи вокерам
	ВыдачаЗадачВокерамИзОчереди();
	
КонецПроцедуры

Процедура CбросCтатусаДляЗависшихЗадач()
	
	// Проверим и сбросим статус для зависших задач.
	// Задача считется зависшей, если с начала взятия в роботу проходит больше 60 секунд и работа над ней не завершена.
	// Период увелисивается с увеличением количества попыток выполнить задачу.
	// Максимальное количество попыток равно три.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ОжидаемыйПериодВыполненияЗадачи", 60);	// Секунд
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ИдентификаторВоркера КАК ИдентификаторВоркера
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыЗадач.ВОбработке)
	|	И ДОБАВИТЬКДАТЕ(КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ВремяНачалаОбработки, СЕКУНДА, КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.КоличествоПопыток * 0.8 * &ОжидаемыйПериодВыполненияЗадачи + &ОжидаемыйПериодВыполненияЗадачи) < &ТекущаяДатаСеанса
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ИдентификаторВоркера";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Убиваем фоновое
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяМетода", МетодЗапускаВокера());
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		
		ФоновыеЗаданияЛок = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
		Для Каждого ТекущееФоновоеЗадание Из ФоновыеЗаданияЛок Цикл
			Если ТекущееФоновоеЗадание.Ключ = Выборка.ИдентификаторВоркера Тогда
				ТекущееФоновоеЗадание.Отменить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Высвобождаем задачи
		ВозвращениеНеЗавершенныхЗадачВокераВОчередь(Выборка.ИдентификаторВоркера);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаРаботоспособностиВокеров()
	
	// Получим вокеры из очереди
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ИдентификаторВоркера КАК ИдентификаторВоркера
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыЗадач.ВОбработке)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ИдентификаторВоркера";
	
	ИдентификаторыВоркеровИзОчереди = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторВоркера");
	
	// Получим уже запущенные вокеры (фоновые задания)
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", МетодЗапускаВокера());
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ФоновыеЗаданияЛок = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	// Вычислим завершенные вокеры
	Для Каждого ТекущийИдентификаторВоркера Из ИдентификаторыВоркеровИзОчереди Цикл
		
		ВокерЗапущен = Ложь;
		
		Для Каждого ТекущееФоновоеЗдание Из ФоновыеЗаданияЛок Цикл
			
			Если ТекущееФоновоеЗдание.Ключ = ТекущийИдентификаторВоркера Тогда
				ВокерЗапущен = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВокерЗапущен Тогда
			Продолжить;
		КонецЕсли;
		
		// Если вокер был остановлен, то его задачи вернем в очередь без увеличения попытки
		ВозвращениеНеЗавершенныхЗадачВокераВОчередь(ТекущийИдентификаторВоркера);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВозвращениеНеЗавершенныхЗадачВокераВОчередь(ИдентификаторВоркера)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторВоркера", ИдентификаторВоркера);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Сценарий КАК Сценарий,
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ДокументОснования КАК ДокументОснования
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыЗадач.ВОбработке)
	|	И КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ИдентификаторВоркера = &ИдентификаторВоркера";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрыСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ВернутьЗадачуВОчередьОбработки(
			Выборка.Сценарий, Выборка.ДокументОснования);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыдачаЗадачВокерамИзОчереди()
	
	ИмяМетодаВыполнения = МетодЗапускаВокера();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", ИмяМетодаВыполнения);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ФоновыеЗаданияЛок = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	МаксимальныйРазмерПакета = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"Производительность_Роботы_КоличествоЗадач");
	Если МаксимальныйРазмерПакета < 1 Тогда
		МаксимальныйРазмерПакета = 1;
	КонецЕсли;
	
	МаксимальноеКолвоВокеров = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"Производительность_Роботы_КоличествоПотоков");
	Если МаксимальноеКолвоВокеров < 1 Тогда
		МаксимальноеКолвоВокеров = 1;
	КонецЕсли;
	
	ТекущееКолвоВокеров = ФоновыеЗаданияЛок.Количество();
	
	Если ТекущееКолвоВокеров >= МаксимальноеКолвоВокеров Тогда
		// Нет свободных вокеров
		Возврат;
	КонецЕсли;
	
	КолвоСвободныхВокеров = МаксимальноеКолвоВокеров - ТекущееКолвоВокеров;
	ОбщаяЕмкостьВЗадачах = КолвоСвободныхВокеров * МаксимальныйРазмерПакета;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Сценарий КАК Сценарий,
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ДокументОснования КАК ДокументОснования
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыЗадач.ВОчереди)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ВремяСоздания";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(ОбщаяЕмкостьВЗадачах, "ЧДЦ=0; ЧГ="));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Определим количество вокеров
	КолвоСвободныхВокеров = Мин(КолвоСвободныхВокеров, Выборка.Количество());
	
	// Инициализируем идентификаторы вокеров
	Вокеры = Новый Массив;
	Для Счет = 1 По КолвоСвободныхВокеров Цикл
		Вокеры.Добавить(Строка(Новый УникальныйИдентификатор));
	КонецЦикла;
	
	// Распределим задачи по вокерам равномерно
	СквознойНомерЗадачи = 0;
	Пока Выборка.Следующий() Цикл
		
		СквознойНомерЗадачи = СквознойНомерЗадачи + 1;
		
		ТекущийНомерВокера = СквознойНомерЗадачи % КолвоСвободныхВокеров;
		ТекущийВокер = Вокеры[ТекущийНомерВокера];
		
		// Добавим задание для текущего вокера
		РегистрыСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ДатьЗадачуВокеру(
			Выборка.Сценарий, Выборка.ДокументОснования, ТекущийВокер);
		
	КонецЦикла;
	
	// Запускаем вокеры
	Для Каждого Значение Из Вокеры Цикл
		
		Параметры = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(Значение);
		НаименованиеФоновогоЗадания = "Выполнение сценариев автоотправки (вокер - " + Значение + ")";
		ФоновыеЗадания.Выполнить(ИмяМетодаВыполнения, Параметры, Значение, НаименованиеФоновогоЗадания);
		
	КонецЦикла;
	
КонецПроцедуры

Функция МетодЗапускаВокера()
	
	Возврат "КонтурЛогистика_ДлительныеОперацииСервер.ВоркерСценарияАвтоматическойРаботы";
	
КонецФункции

// Это фоновый испольнитель, который извлекает задачи из очереди и выполняет их
//
Процедура Воркер(ИдентификаторВоркера) Экспорт
	
	// Получим задачм для текущего вокера
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторВоркера", ИдентификаторВоркера);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Сценарий КАК Сценарий,
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ДокументОснования КАК ДокументОснования,
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Контекст КАК Контекст
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы КАК КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы
	|ГДЕ
	|	КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.ИдентификаторВоркера = &ИдентификаторВоркера
	|	И КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыЗадач.ВОбработке)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Выполним обработку
		Контекст = Выборка.Контекст.Получить();
		РегистрыСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.УстановитьНачалоНадЗадачей(
			Выборка.Сценарий, Выборка.ДокументОснования, ТекущаяДатаСеанса());
		
		Попытка
			
			ВыполнитьЗаданиеОчереди(Выборка.Сценарий, Контекст);
			
			РегистрыСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.УстановитьУспех(
				Выборка.Сценарий, Выборка.ДокументОснования, ТекущаяДатаСеанса());
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Если ЗначениеЗаполнено(Выборка.Сценарий) Тогда
				ЗафиксироватьОшибкуВРегистреИЖурнале(Выборка.Сценарий,, ТекстОшибки);
			Иначе
				Если ТипЗнч(Контекст.ФайлыОбмена) = Тип("Массив")
					И Контекст.ФайлыОбмена.Количество() <> 0 Тогда
					
					ДанныеЖР = Контекст.ФайлыОбмена[0];
				Иначе
					ДанныеЖР = Неопределено;
				КонецЕсли;
				
				ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
				ТекстОшибкиПодробно = "Отправка файлов обмена.
					|Текст ошибки: " + ТекстОшибки;
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ДанныеЖР, ТекстОшибкиПодробно);
			КонецЕсли;
			
			РегистрыСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.УстановитьОшибку(
				Выборка.Сценарий, Выборка.ДокументОснования, ТекстОшибки);
				
			КонтурЛогистика_Метрика.ОбработатьОшибку("Роботы", ТекстОшибки, Выборка.ДокументОснования, Выборка.Сценарий, ТекстОшибки, Ложь);

		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаданиеОчереди(СценарийСсылка, Контекст, ДокументыНаПодписание = Неопределено)
	
	Если ЗначениеЗаполнено(СценарийСсылка) Тогда
		
		// Робот
		ВыполнитьЗаданиеСценарийРобота(СценарийСсылка, Контекст, ДокументыНаПодписание);
		
	Иначе
		
		// Отложенная отправка
		ВыполнитьОтправкуФайла(Контекст);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗаданиеСценарийРобота(СценарийСсылка, Контекст, ДокументыНаПодписание)
	
	Если ДокументыНаПодписание = Неопределено Тогда
		ДокументыНаПодписание = Новый Массив;
	КонецЕсли;
	
	БезПодписанияНаСервере = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвойствоСтруктурыЛок(
		Контекст, "БезПодписанияНаСервере", Ложь);
	
	Если ЗначениеЗаполнено(СценарийСсылка.НастройкаКонвертации) Тогда
		СценарийНКД = СценарийСсылка.НастройкаКонвертации.Сценарий;
	Иначе
		СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.Отправка;
	КонецЕсли;
	
	// Спец сценарии
	// ТРН - Т1,Т3 подписываем ранее отправленный неподписанный или входящий неподписанный
	Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного Тогда 
		
		// с версии 1.1.0 здесь теперь требуется просто изготовить файлы, подписать и отправить (а не делать отдельный алгоритм с патчингом)
		
		// Подпись
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		ПараметрыФормированияФайловРеквизиты.Вставить("СформированАвтоматическимСценарием", Истина);
		
		Титулы = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(Контекст.Ссылка);
		
		ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика, Сценарий",
			Титулы, СценарийСсылка.ТипЛогистическогоДокумента, СценарийСсылка.Сценарий);
		
		// Изготавливаем файлы
		КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
			ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Если МассивФайловОбмена.Количество() = 0 Тогда
			// Не удалось изготовить файл, фиксируем ошибку
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			КоличествоСообщенийПосле = СообщенияПользователю.Количество();
			Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
				ЗафиксироватьСообщения(СценарийСсылка, Титулы[0], СообщенияПользователю, КоличествоСообщенийДо);
			КонецЕсли;
		КонецЕсли;
		
		// Подписываем файлы
		КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
		МассивПодписанныхФайловОбмена = КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.ПодписатьФайлыОбмена(
			МассивФайловОбмена,, БезПодписанияНаСервере);
		
		Если МассивПодписанныхФайловОбмена.Количество() = 0 Тогда
			// Не удалось подписать файл, фиксируем ошибку
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			КоличествоСообщенийПосле = СообщенияПользователю.Количество();
			Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
				ЗафиксироватьСообщения(СценарийСсылка, Титулы[0], СообщенияПользователю, КоличествоСообщенийДо);
			КонецЕсли;
		КонецЕсли;
		
		РазностьМассивов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивФайловОбмена, МассивПодписанныхФайловОбмена);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыНаПодписание, РазностьМассивов);
	
		// Отправка
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивПодписанныхФайловОбмена);
		Если РезультатОтправки.Успешно Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Отправлен подписанный: " + Титулы[0]);
			Если МассивПодписанныхФайловОбмена.Количество() <> 0 Тогда
				СнятьОшибкиСценариевАвтоматическойРаботы(СценарийСсылка, Титулы[0]);
			КонецЕсли;
		Иначе
			ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Проблемы при отправке документов: " + ТекстОшибки);
			ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, Титулы[0], ТекстОшибки);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Ввод черновиков
	Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковДокументов
		И ЗначениеЗаполнено(Контекст.ДокументЛогистика) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПерезаполнятьЧерновики = СценарийСсылка.ПерезаполнятьЧерновики;
	
	Если ОформлениеНаОснованииУчетногоДокумента(СценарийСсылка.ТипЛогистическогоДокумента, СценарийСсылка.СпецСценарий) Тогда
		
		// Сценарий переотправки при отказе Т2 медика
		Если (СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02)
			И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоСостояниеОтказа(Контекст.СтатусЭТРН)
			И ЗначениеЗаполнено(Контекст.ДокументЛогистика) Тогда
			
			// Вводим документ
			ДокументыОснования = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контекст.ДокументЛогистика);
			ВведенныеДокументы = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПереотправка(
				ДокументыОснования, СценарийСсылка.ТипЛогистическогоДокумента);
			
			// Перезаполняем документ
			Для Каждого ВведенныйДокумент Из ВведенныеДокументы Цикл
				ПараметрыЗаполнения = Новый Структура;
				ПараметрыЗаполнения.Вставить("ДокументОснование", ВведенныйДокумент.ДокументОснование);
				ПараметрыЗаполнения.Вставить("ТипЛогистика", СценарийСсылка.ТипЛогистическогоДокумента);
				ПараметрыЗаполнения.Вставить("Разделитель", ВведенныйДокумент.Разделитель);
				
				ВведенныйДокументОбъект = ВведенныйДокумент.ПолучитьОбъект();
				ВведенныйДокументОбъект.Заполнить(ПараметрыЗаполнения);
				ВведенныйДокументОбъект.Записать();
			КонецЦикла;
			
		Иначе
			ВведенныеДокументы = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументЛогистикаНаОснованиДокумента1С(
				Контекст.Документ1С, СценарийСсылка.ТипЛогистическогоДокумента, Ложь, Ложь, ПерезаполнятьЧерновики);
		КонецЕсли;
		
		Если ВведенныеДокументы.Количество() > 0 И Не ЗначениеЗаполнено(Контекст.ДокументЛогистика) Тогда // если не было заполнено документа логистика в выборке и его ввели сейчас
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Введен черновик: " + ВведенныеДокументы[0] + " по: " + Контекст.Документ1С);
		КонецЕсли;
		
	Иначе
		
		МассивПредыдущихТитулов = Новый Массив;
		МассивПредыдущихТитулов.Добавить(Контекст.ПредыдущийТитул);
		МассивДопДанныеЗаполнения = Новый Массив;
		
		// для ПЛт2,6 в разрезе Водителя
		Если СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
			Или СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
			Или СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02 
			Или СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
			
			МассивДопДанныеЗаполнения.Добавить(Новый Структура("Водитель", Контекст.Водитель));
		КонецЕсли;
		
		РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
			МассивПредыдущихТитулов, СценарийСсылка.ТипЛогистическогоДокумента, Ложь,
			МассивДопДанныеЗаполнения, ПерезаполнятьЧерновики, СценарийСсылка.СпецСценарий);
		ВведенныеДокументы = РезультатВвода.ВведенныеДокументы;
		
		Если Не РезультатВвода.Успешно Тогда
			ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатВвода);
			ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка,, ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВведенныеДокументы.Количество() > 0 Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Запуск автоотправки по: " + ВведенныеДокументы[0]);
	Иначе
		Возврат;
	КонецЕсли;
	
	// Без подписи
	Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИПодготовкаКОтправкеНеподписанных Тогда 
		
		РезультатПодготовки = КонтурЛогистика_ОбработкаДокументовСервер.ПодготовитьДокументыКОтправке(ВведенныеДокументы, Ложь);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Подготовлен НЕподписанный: " + ВведенныеДокументы[0]);
		
		Если РезультатПодготовки.Успешно Тогда
			СнятьОшибкиСценариевАвтоматическойРаботы(СценарийСсылка, ВведенныеДокументы[0]);
		Иначе
			ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатПодготовки);
			ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, ВведенныеДокументы[0], ТекстОшибки);
		КонецЕсли;
		
	ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИОтправкаНеподписанных Тогда
		
		ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ВведенныеДокументы, СценарийСсылка.ТипЛогистическогоДокумента);
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
		ПараметрыФормированияФайловРеквизиты.Вставить("СформированАвтоматическимСценарием", Истина);
		
		Если Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.Оформить Тогда
			
			Если СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного Тогда
				ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаПодписание");
			ИначеЕсли СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_ОтправкаПодписанного
				Или СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного Тогда
				
				ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаСогласованиеВодителю");
			КонецЕсли;
			
		ИначеЕсли Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание Тогда
			
			ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаПодписание");
			
			ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(
				СценарийСсылка.ТипЛогистическогоДокумента);
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Передача на подписание", "Передать на подписание",
				"Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы", ИмяСсылкиПоТипу);
			
		ИначеЕсли Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю Тогда
			
			ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаСогласованиеВодителю");
			
			ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(
				СценарийСсылка.ТипЛогистическогоДокумента);
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Передача водителю", "Передать водителю",
				"Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы", ИмяСсылкиПоТипу);
			
		КонецЕсли;
		
		// Изготавливаем файлы
		КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
			ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Если МассивФайловОбмена.Количество() = 0 Тогда
			// Не удалось изготовить файл, фиксируем ошибку
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			КоличествоСообщенийПосле = СообщенияПользователю.Количество();
			Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
				ЗафиксироватьСообщения(СценарийСсылка, ВведенныеДокументы[0], СообщенияПользователю, КоличествоСообщенийДо);
			КонецЕсли;
		КонецЕсли;
		
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивФайловОбмена);
		
		Если РезультатОтправки.Успешно Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Отправлен НЕподписанный: " + ВведенныеДокументы[0]);
			Если МассивФайловОбмена.Количество() <> 0 Тогда
				СнятьОшибкиСценариевАвтоматическойРаботы(СценарийСсылка, ВведенныеДокументы[0]);
			КонецЕсли;
		Иначе
			ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Проблемы при отправке документов: " + ТекстОшибки);
			ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, ВведенныеДокументы[0], ТекстОшибки);
		КонецЕсли;
		
	// С подписью
	ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИПодготовкаКОтправке
		Или СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИОтправка Тогда
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("СформированАвтоматическимСценарием", Истина);
		
		Если СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.Отправка Тогда
			ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		Иначе
			
			Если Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.Оформить Тогда
				ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
				
				Если СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного Тогда
					ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаПодписание");
				ИначеЕсли СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_ОтправкаПодписанного
					Или СценарийНКД = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного Тогда
					
					ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаСогласованиеВодителю");
				КонецЕсли;
			ИначеЕсли Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание Тогда
				
				ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
				ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаПодписание");
				
				ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(
					СценарийСсылка.ТипЛогистическогоДокумента);
				КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
					"Передача на подписание", "Передать на подписание",
					"Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы", ИмяСсылкиПоТипу);
				
			ИначеЕсли Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю Тогда
				
				ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
				ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаСогласованиеВодителю");
				
				ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(
					СценарийСсылка.ТипЛогистическогоДокумента);
				КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
					"Передача водителю", "Передать водителю",
					"Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы", ИмяСсылкиПоТипу);
				
			ИначеЕсли Контекст.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный Тогда
				ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
			Иначе
				ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыВводаДокументов = Новый Структура;
		ПараметрыВводаДокументов.Вставить("МассивДокументов", ВведенныеДокументы);
		ПараметрыВводаДокументов.Вставить("УточнениеТипаЛогистика", СценарийСсылка.ТипЛогистическогоДокумента);
		
		// Изготавливаем файлы
		КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
			ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Если МассивФайловОбмена.Количество() = 0 Тогда
			// Не удалось изготовить файл, фиксируем ошибку
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			КоличествоСообщенийПосле = СообщенияПользователю.Количество();
			Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
				ЗафиксироватьСообщения(СценарийСсылка, ВведенныеДокументы[0], СообщенияПользователю, КоличествоСообщенийДо);
			КонецЕсли;
		КонецЕсли;
		
		// Подписываем файлы
		Если ПараметрыФормированияФайловРеквизиты.ТребуетсяПодпись Тогда
			КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
			МассивПодписанныхФайловОбмена = КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.ПодписатьФайлыОбмена(
				МассивФайловОбмена,, БезПодписанияНаСервере);
			
			Если МассивПодписанныхФайловОбмена.Количество() = 0 Тогда
				// Не удалось подписать файл, фиксируем ошибку
				СообщенияПользователю = ПолучитьСообщенияПользователю();
				КоличествоСообщенийПосле = СообщенияПользователю.Количество();
				Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
					ЗафиксироватьСообщения(СценарийСсылка, ВведенныеДокументы[0], СообщенияПользователю, КоличествоСообщенийДо);
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Добавим не подписанные
			МассивПодписанныхФайловОбмена = МассивФайловОбмена;
		КонецЕсли;
		
		РазностьМассивов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивФайловОбмена, МассивПодписанныхФайловОбмена);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыНаПодписание, РазностьМассивов);
		
		Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда
			
			Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИПодготовкаКОтправке Тогда
				
				// Ранее здесь использовался перевод титула в статус подготовлен к отправке.
				// Теперь, когда у титулов появился статус "Подписан", это не требуется
				// Выполнение обмена отправит в фоне титулы в статусе "Подписан"
				
			Иначе
				
				// Отправка
				РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивПодписанныхФайловОбмена);
				Если РезультатОтправки.Успешно Тогда
					КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
						"Отправлен подписанный: " + ВведенныеДокументы[0]);
					Если МассивПодписанныхФайловОбмена.Количество() <> 0 Тогда
						СнятьОшибкиСценариевАвтоматическойРаботы(СценарийСсылка, ВведенныеДокументы[0]);
					КонецЕсли;
				Иначе
					ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
					КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
						"Проблемы при отправке документов: " + ТекстОшибки);
					ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, ВведенныеДокументы[0], ТекстОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОтправкуФайла(Контекст)
	
	ФайлыОбмена = Контекст.ФайлыОбмена;
	
	РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(ФайлыОбмена);
	
КонецПроцедуры

Функция ОформлениеНаОснованииУчетногоДокумента(ТипЛогистическогоДокумента, СпецСценарий)
	
	Если ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8
		Или (ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			И СпецСценарий <> Перечисления.КонтурЛогистика_СпецСценарииЗадач.ПЛТитул1ПослеСменыВодителя)
		Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02
		Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		Или ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗафиксироватьСообщения(СценарийСсылка, ОбъектОбработки, СообщенияПользователю, КоличествоСообщенийДо)
	
	ТекстОшибки = "";
	
	Для ТекущийИндекс = КоличествоСообщенийДо По СообщенияПользователю.Количество() - 1 Цикл
		Если ТекстОшибки <> "" Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС;
		КонецЕсли;
		ТекстОшибки = ТекстОшибки + СообщенияПользователю[ТекущийИндекс].Текст;
	КонецЦикла;
	
	ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, ОбъектОбработки, ТекстОшибки);
	
КонецПроцедуры

Процедура ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, ОбъектОбработки, ТекстОшибки)
	
	// Запишем в регистр
	РегистрыСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ДобавитьОшибку(СценарийСсылка, ОбъектОбработки, ТекстОшибки);
	
	// Запишем в ЖР
	Если ЗначениеЗаполнено(ОбъектОбработки) Тогда
		ДанныеЖР = ОбъектОбработки;
	Иначе
		ДанныеЖР = СценарийСсылка;
	КонецЕсли;
	
	ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
	ТекстОшибкиПодробно = "Сценарий роботов: " + Строка(СценарийСсылка) + "
		|Текст ошибки: " + ТекстОшибки;
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ДанныеЖР, ТекстОшибкиПодробно);
	
КонецПроцедуры

Процедура СнятьОшибкиСценариевАвтоматическойРаботы(СценарийСсылка, ОбъектОбработки = Неопределено)
	
	РегистрыСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.УдалитьЗапись(СценарийСсылка, ОбъектОбработки);
	
КонецПроцедуры

Процедура ДобавитьДопФильтры(Запрос, СценарийСсылка) Экспорт
	
	Если ЗначениеЗаполнено(СценарийСсылка.ДополнительноеУсловиеГДЕ)Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ДопУсловиеГДЕ", " И " + СценарийСсылка.ДополнительноеУсловиеГДЕ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СценарийСсылка.ДополнительноеУсловиеГДЕПараметрИзЗначенияНастройки) Тогда
		
		ЗначенияНастройки = Справочники.КонтурЛогистика_Настройки.СписокЗначенийНастройки(
			СценарийСсылка.ДополнительноеУсловиеГДЕПараметрИзЗначенияНастройки);
		
		Если ЗначенияНастройки.Количество() = 0 Тогда
			ВызватьИсключение "При установки параметра дополнительного условия не удалось получить значение параметра, "
				+ "так как в настройке """ + СценарийСсылка.ДополнительноеУсловиеГДЕПараметрИзЗначенияНастройки
				+ """ не заполнены ""Связанные объекты"".";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Параметр", ЗначенияНастройки);
		
	ИначеЕсли ЗначениеЗаполнено(СценарийСсылка.ДополнительноеУсловиеГДЕВычислениеПараметра) Тогда
		
		ВыражениеВычисления = СценарийСсылка.ДополнительноеУсловиеГДЕВычислениеПараметра;
		ВычисленноеЗначение = Неопределено;
		РезультатВычисления = Неопределено;
		
		Параметры = Новый Структура;
		Параметры.Вставить("СценарийСсылка", СценарийСсылка);
		
		ВычисленноеЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ВычислитьЗначениеВБезопасномРежиме(
			ВыражениеВычисления, Параметры);
		
		Запрос.УстановитьПараметр("Параметр", ВычисленноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоСценарийАвтоотправки(Сценарий) Экспорт
	
	Если Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковДокументов
		ИЛИ Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИОтправкаНеподписанных
		ИЛИ Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИПодготовкаКОтправкеНеподписанных
		ИЛИ Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИПодготовкаКОтправке
		ИЛИ Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИОтправка
		ИЛИ Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного
		ИЛИ Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ОбработатьВходящиеДокументыЛогистики
		Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;

КонецФункции

Функция СформироватьЗапросСпискаЗадачРобота(СценарийСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	ТипЛогистика = СценарийСсылка.ТипЛогистическогоДокумента;
	
	Если Не ЗначениеЗаполнено(ТипЛогистика) Тогда 
		ВызватьИсключение "Не знаю тип логистического докуента для сценария " + СценарийСсылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СценарийСсылка.НастройкаКонвертации) Тогда
		ТипДокументаКонфигурации = СценарийСсылка.НастройкаКонвертации.ТипДокумента1С;
	Иначе
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			СценарийСсылка.ТипЛогистическогоДокумента);
		ТипДокументаКонфигурации = КонтекстНастройкиКонвертации.ТипДокумента1С;
		Если Не ЗначениеЗаполнено(ТипДокументаКонфигурации) Тогда
			ТипДокументаКонфигурации = "Все типы";
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипДокументаКонфигурации) 
		И СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		
		ВызватьИсключение "Настройте конвертацию документов для автоотправки Т1";
		
	КонецЕсли;
	
	Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного
		И Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(СценарийСсылка.ТипЛогистическогоДокумента) Тогда 
		
		ТекстЗапроса = ТекстЗапросаПатчаПодписью(ТипЛогистика, СценарийСсылка);
		
	ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьРанееОтправленного
		И Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ_5_02(СценарийСсылка.ТипЛогистическогоДокумента) Тогда 
		
		ТекстЗапроса = ТекстЗапросаПодписанияПЛ_5_02(ТипЛогистика, СценарийСсылка);
		
	ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ОбработатьВходящиеДокументыЛогистики Тогда 
		
		ТекстЗапроса = ТекстЗапросаОбработкиВходящихДокументовЛогистики(ТипЛогистика, СценарийСсылка);
		
	Иначе
		
		РезультатаФормированияЗапроса = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
			ТипЛогистика, ТипДокументаКонфигурации, СценарийСсылка.СпецСценарий);
		
		ТекстЗапроса = ДополнитьЗапросСценарияПоТипуЛогистики(ТипЛогистика, РезультатаФормированияЗапроса.ПолныйТекстЗапроса, СценарийСсылка);
		
		Для Каждого ПараметрЗапроса Из РезультатаФормированияЗапроса.СтруктураПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
		
		Если СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или СценарийСсылка.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
			Запрос.УстановитьПараметр("СостоянияОтказа", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостояниеОтказа());
		КонецЕсли; 
		
	КонецЕсли;
	
	Попытка
		
		Запрос.Текст = ТекстЗапроса;
		
		// Проверим, успешно ли соберется запрос - если запрос плохой - то тут будет падение
		//@skip-warning
		
		УстановитьПараметрыЗапроса(ТипЛогистика, Запрос, СценарийСсылка);
		
	Исключение
		
		ВызватьИсключение ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Запрос;
	
КонецФункции

Процедура УстановитьПараметрыЗапроса(ТипЛогистика, Запрос, СценарийСсылка)
	
	СекундВЧасе = 60 * 60;
	СекундВДне = 24 * СекундВЧасе;
	
	ЧасовВПрошлое = СценарийСсылка.ИнтервалВремениЗадачЧасов;
	ДатаОкончания = ТекущаяДатаСеанса();
	Если ЧасовВПрошлое = 0 Тогда 
		
		НачалоТекДня = НачалоДня(ДатаОкончания);
		
		Если ДатаОкончания - НачалоТекДня < СекундВЧасе Тогда 
			ДатаНачала = НачалоТекДня - СекундВЧасе;  // иначе при запуске раз в час пропустим задачи с 23:00 до 24:00
		Иначе
			ДатаНачала = НачалоТекДня;
		КонецЕсли;
		
	Иначе
		
		ДатаНачала = ДатаОкончания - ЧасовВПрошлое * СекундВЧасе;
		
	КонецЕсли;
	
	ЧасовВБудущее = СценарийСсылка.ИнтервалВремениЗадачЧасовВБудущее;
	ДатаОкончания = ДатаОкончания + ЧасовВБудущее * СекундВЧасе;
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("НачалоПериодаПоследующийТитул", ДатаНачала - 5 * СекундВДне);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаОкончания);
	Запрос.УстановитьПараметр("ОкончаниеПериодаПоследующийТитул", ДатаОкончания + СекундВДне);
	
	Запрос.УстановитьПараметр("СписокГрузоотправителейВариантФильтрации", СценарийСсылка.СписокГрузоотправителейВариантФильтрации);
	Запрос.УстановитьПараметр("СписокПеревозчиковВариантФильтрации", СценарийСсылка.СписокПеревозчиковВариантФильтрации);
	Запрос.УстановитьПараметр("СписокГрузополучателейВариантФильтрации", СценарийСсылка.СписокГрузополучателейВариантФильтрации);
	Запрос.УстановитьПараметр("СписокГрузоотправителейДиадок", СценарийСсылка.СписокГрузоотправителейДиадок.ВыгрузитьКолонку("ОрганизацияДиадок"));
	Запрос.УстановитьПараметр("СписокПеревозчиковДиадок", СценарийСсылка.СписокПеревозчиковДиадок.ВыгрузитьКолонку("ОрганизацияДиадок"));
	Запрос.УстановитьПараметр("СписокГрузополучателейДиадок", СценарийСсылка.СписокГрузополучателейДиадок.ВыгрузитьКолонку("ОрганизацияДиадок"));
	
	Запрос.УстановитьПараметр("СписокПунктовМаршрутаОтправкиВариантФильтрации", СценарийСсылка.СписокПунктовМаршрутаОтправкиВариантФильтрации);
	Запрос.УстановитьПараметр("СписокПунктовМаршрутаПрибытияВариантФильтрации", СценарийСсылка.СписокПунктовМаршрутаПрибытияВариантФильтрации);
	Запрос.УстановитьПараметр("СписокПунктовМаршрутаОтправки", СценарийСсылка.СписокПунктовМаршрутаОтправки.ВыгрузитьКолонку("ПунктМаршрута"));
	Запрос.УстановитьПараметр("СписокПунктовМаршрутаПрибытия", СценарийСсылка.СписокПунктовМаршрутаПрибытия.ВыгрузитьКолонку("ПунктМаршрута"));
	
	Запрос.УстановитьПараметр("СписокСостоянийДокументооборотаВариантФильтрации", СценарийСсылка.СписокСостоянийДокументооборотаВариантФильтрации);
	Запрос.УстановитьПараметр("СписокСостоянийДокументооборота", СценарийСсылка.СписокСостоянийДокументооборота.ВыгрузитьКолонку("Состояние"));
	
	ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
	Для Каждого ФильтрСостояние Из СценарийСсылка.СписокСостоянийДокументооборота Цикл 
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(ФильтрСостояние.Состояние);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 Тогда
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", НЕ КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РазрешитьОтправлятьТ2ДоВодителя"));
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНДляОтправки", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-wait-carrier-sign"));
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНОжидания", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-wait-driver-approve"));
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4 Тогда
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", НЕ КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РазрешитьОтправлятьТ4ДоВодителя"));
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНДляОтправки", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-wait-carrier-sign"));
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНОжидания", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-wait-driver-approve"));
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5 Тогда
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНДляОтправки", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("completed")); //TODO изменить на "c-carrier-signed", когда вэб добавит статусы
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНОжидания", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("c-wait-consignor-sign"));
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6 Тогда
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНДляОтправки", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("c-wait-consignor-sign"));
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНОжидания", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка());
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupBefore"));
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupBefore2ndDriver"));
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupBefore"));
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupBefore2ndDriver"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techInspection"));
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techInspection"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-odometerBefore"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-on-the-way"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2 Тогда
		ТребуемыеСостояниеЭТРНДляОтправки = Новый Массив;
		ТребуемыеСостояниеЭТРНДляОтправки.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-carrier"));
		
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляОтправки", ТребуемыеСостояниеЭТРНДляОтправки);
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда
		
		Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.СогласованиеДокументов Тогда
			СостояниеДО = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("fr-сheck-cargo-owner");
			ТребуемыеСостояниеЭТРНДляСогласования = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СостояниеДО);
			
			Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляСогласования", ТребуемыеСостояниеЭТРНДляСогласования);
			
		ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьВходящихДокументов Тогда
			СостояниеДО = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("fr-сheck-forwarder");
			ТребуемыеСостояниеЭТРНДляПодписаниеВходящих = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СостояниеДО);
			
			Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляПодписаниеВходящих", ТребуемыеСостояниеЭТРНДляПодписаниеВходящих);
			
		КонецЕсли;
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка Тогда
		
		Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.СогласованиеДокументов Тогда
			СостояниеДО = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("wr-сheck-cargo-owner");
			ТребуемыеСостояниеЭТРНДляСогласования = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СостояниеДО);
			
			Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляСогласования", ТребуемыеСостояниеЭТРНДляСогласования);
			
		ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьВходящихДокументов Тогда
			СостояниеДО = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("wr-сheck-forwarder");
			ТребуемыеСостояниеЭТРНДляПодписаниеВходящих = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СостояниеДО);
			
			Запрос.УстановитьПараметр("ТребуемыеСостояниеЭТРНДляПодписаниеВходящих", ТребуемыеСостояниеЭТРНДляПодписаниеВходящих);
			
		КонецЕсли;
		
	ИначеЕсли ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		// в Т1 запрос без этого параметра, а перед отправкой Т3 нет водителя
		Запрос.УстановитьПараметр("БлокироватьПредыдущимУчастникомЦепочки", Ложь);
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНДляОтправки", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка()); // все равно не попадем в кейс
		Запрос.УстановитьПараметр("ТребуемоеСостояниеЭТРНОжидания", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка());
		
	КонецЕсли;
	
	Если Запрос.Параметры.Свойство("ТекущийПользователь") = Истина Тогда
		Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьФильтрСоединениеПоОрганизации(ТекстЗапроса, ВариантФильтрации, ИмяПараметраСписка, ИмяРеквизита)
	
	Если ВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.УказатьСписок Тогда
		
		ШаблонТекста = "
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОрганизацииДиадок КАК ВТ_ОрганизацииДиадок_%1
			|	ПО ВТ_ОрганизацииДиадок_%1.Ссылка В (&%2)
			|		И втДокументы.%1 = ВТ_ОрганизацииДиадок_%1.СвязанныйОбъект";
		
		ТекстСоединения = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок(ШаблонТекста,
			ИмяРеквизита, ИмяПараметраСписка);
		
	ИначеЕсли ВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеКромеУказанных Тогда
		
		ШаблонТекста = "
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОрганизацииДиадок КАК ВТ_ОрганизацииДиадок_%1
			|	ПО НЕ ВТ_ОрганизацииДиадок_%1.Ссылка В (&%2)
			|		И втДокументы.%1 = ВТ_ОрганизацииДиадок_%1.СвязанныйОбъект";
		
		ТекстСоединения = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок(ШаблонТекста,
			ИмяРеквизита, ИмяПараметраСписка);
		
	Иначе
		
		ТекстСоединения = "";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ТекстСоединения;
	
КонецПроцедуры

Процедура ДобавитьФильтрУсловиеПоОрганизации(ТекстЗапроса, ВариантФильтрации, ПутьДоРеквизита, ИмяПараметраСписка)
	
	Если ВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.УказатьСписок Тогда
		
		ШаблонТекста = "%1 В (&%2)";
		
		ТекстУсловия = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок(
			ШаблонТекста, ПутьДоРеквизита, ИмяПараметраСписка);
		
	ИначеЕсли ВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеКромеУказанных Тогда
		
		ШаблонТекста = "НЕ %1 В (&%2)";
		
		ТекстУсловия = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок(
			ШаблонТекста, ПутьДоРеквизита, ИмяПараметраСписка);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекстЗапроса = "" Тогда
		ТекстЗапроса = ТекстУсловия;
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
			|И " + ТекстУсловия;
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнитьЗапросСценарияПоТипуЛогистики(ТипЛогистика, ВходнойТекстЗапроса, СценарийСсылка)
		
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
		
		ТекстВТОрганизацииДиадок = 
			"ВЫБРАТЬ
			|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка КАК Ссылка,
			|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
			|ПОМЕСТИТЬ ВТ_ОрганизацииДиадок
			|ИЗ
			|	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
			|ГДЕ
			|	НЕ КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.ПометкаУдаления";
		
		ТекстДополнительногоСоединенияИЗ = "";
		ДобавитьФильтрСоединениеПоОрганизации(ТекстДополнительногоСоединенияИЗ,
			СценарийСсылка.СписокГрузоотправителейВариантФильтрации,
			"СписокГрузоотправителейДиадок", "Отправитель");
		ДобавитьФильтрСоединениеПоОрганизации(ТекстДополнительногоСоединенияИЗ,
			СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"СписокПеревозчиковДиадок", "Перевозчик");
		ДобавитьФильтрСоединениеПоОрганизации(ТекстДополнительногоСоединенияИЗ,
			СценарийСсылка.СписокГрузополучателейВариантФильтрации,
			"СписокГрузополучателейДиадок", "Получатель");
		
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		
			Если СценарийСсылка.ОбработкаОтказа Тогда
				ТекстУсловияОбработкиОтказа = "
					|	ИЛИ (КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&СостоянияОтказа) И "
						+ СценарийСсылка.ДополнительноеУсловиеГДЕОбработкаОтказа + ")";
			Иначе
				ТекстУсловияОбработкиОтказа = "";
			КонецЕсли;
		
			Если СценарийСсылка.СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ПЛТитул1ПослеСменыВодителя Тогда
				// Заменим имена таблиц и полей, так как документ основания другой и тип реквизитов организаций другой
				ТекстДополнительногоСоединенияИЗ = СтрЗаменить(
					ТекстДополнительногоСоединенияИЗ, "втДокументы.Отправитель", "ПодзапросТ5СоСменами.Грузоотправитель");
				ТекстДополнительногоСоединенияИЗ = СтрЗаменить(
					ТекстДополнительногоСоединенияИЗ, "втДокументы.Перевозчик", "ПодзапросТ5СоСменами.Перевозчик");
				ТекстДополнительногоСоединенияИЗ = СтрЗаменить(
					ТекстДополнительногоСоединенияИЗ, "втДокументы.Получатель", "ПодзапросТ5СоСменами.Грузополучатель");
				ТекстДополнительногоСоединенияИЗ = СтрЗаменить(
					ТекстДополнительногоСоединенияИЗ, ".СвязанныйОбъект", ".Ссылка");
				
				ТекстДополнительногоУсловия =
					"(ПодзапросТекущийТ1СоСменами.Ссылка ЕСТЬ NULL
					|	ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
					|	ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена)"
						+ ТекстУсловияОбработкиОтказа + ")";
			Иначе
				ТекстДополнительногоУсловия =
					"(КонтурЛогистика_ПЛ_Титул1.Ссылка ЕСТЬ NULL
					|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
					|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена)"
						+ ТекстУсловияОбработкиОтказа + ")";						
			КонецЕсли;
								
		ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
			
			ТекстДополнительногоУсловия =
				"(КонтурЛогистика_ЗЗ_Титул1.Ссылка ЕСТЬ NULL
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена))";
			
		ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
			
			ТекстДополнительногоУсловия =
				"(КонтурЛогистика_ТрН_Титул1.Ссылка ЕСТЬ NULL
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена)
				|	ИЛИ ((КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена)
				|			ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Получен))
				|		И (&Сценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_Сценарии.ОтправкаЧерновик_ОтправкаПодписанного)
				|			ИЛИ &Сценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_Сценарии.ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного)
				|			ИЛИ &Сценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_Сценарии.ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного)
				|			ИЛИ &Сценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_ОтправкаПодписанного)
				|			ИЛИ &Сценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного))))";
			
		Иначе
			
			ТекстДополнительногоУсловия =
				"(КонтурЛогистика_ТрН_Титул1.Ссылка ЕСТЬ NULL
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена))";
			
		КонецЕсли;
	
		Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИОтправкаНеподписанных
			Или СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИОтправка Тогда
			ТекстДополнительногоУсловия = СтрЗаменить(ТекстДополнительногоУсловия,
				"ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)", 
			    "ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
				|	ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка)");
		КонецЕсли;
			
		ТекстЗапроса = ТекстВТОрганизацииДиадок + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|" + ВходнойТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопСоединениеИЗ", ТекстДополнительногоСоединенияИЗ);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопУсловиеГДЕ", " И " + ТекстДополнительногоУсловия + "//ДопУсловиеГДЕ");
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2 Тогда
		
		ТекстДополнительногоУсловия = "";
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокГрузоотправителейВариантФильтрации,
			"ПодзапросПредыдущийТитул.Грузоотправитель", "СписокГрузоотправителейДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"ПодзапросПредыдущийТитул.Перевозчик", "СписокПеревозчиковДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокГрузополучателейВариантФильтрации,
			"ПодзапросПредыдущийТитул.Грузополучатель", "СписокГрузополучателейДиадок");
		
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2 Тогда
			
			ТекстУсловияСостоянияЭТРН = "КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&ТребуемыеСостояниеЭТРНДляОтправки)";
			Если ТекстДополнительногоУсловия = "" Тогда
				ТекстДополнительногоУсловия = ТекстУсловияСостоянияЭТРН;
			Иначе
				ТекстДополнительногоУсловия = ТекстДополнительногоУсловия + " И
				|" + ТекстУсловияСостоянияЭТРН;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстДополнительногоУсловия <> "" Тогда
			ТекстЗапроса = СтрЗаменить(ВходнойТекстЗапроса, "//ДопУсловиеГДЕ", " И " + ТекстДополнительногоУсловия + "//ДопУсловиеГДЕ");
		Иначе
			ТекстЗапроса = ВходнойТекстЗапроса;
		КонецЕсли;
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6 Тогда
		
		ТекстДополнительногоУсловия = "И НЕ КонтурЛогистика_ПредыдущийТитул.ПометкаУдаления";
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокГрузоотправителейВариантФильтрации,
			"КонтурЛогистика_ПредыдущийТитул.ДокументЭТРН.Грузоотправитель",
			"СписокГрузоотправителейДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"КонтурЛогистика_ПредыдущийТитул.ДокументЭТРН.Перевозчик",
			"СписокПеревозчиковДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокГрузополучателейВариантФильтрации,
			"КонтурЛогистика_ПредыдущийТитул.ДокументЭТРН.Грузополучатель",
			"СписокГрузополучателейДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПунктовМаршрутаОтправкиВариантФильтрации,
			"КонтурЛогистика_ПредыдущийТитул.ДокументЭТРН.МестоПогрузки",
			"СписокПунктовМаршрутаОтправки");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПунктовМаршрутаПрибытияВариантФильтрации,
			"КонтурЛогистика_ПредыдущийТитул.ДокументЭТРН.МестоДоставки",
			"СписокПунктовМаршрутаПрибытия");
		
		ТекстЗапроса = СтрЗаменить(ВходнойТекстЗапроса,
			"И НЕ КонтурЛогистика_ПредыдущийТитул.ПометкаУдаления",
			ТекстДополнительногоУсловия);
		
		Если СценарийСсылка.СписокСостоянийДокументооборота.Количество() > 0 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"//ДопУсловиеГДЕ",
			"
			|	И КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&ТребуемыеСостояниеЭТРНДляОтправки)
			|	//ДопУсловиеГДЕ ");
		КонецЕсли;
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7
		И СценарийСсылка.СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул7ПослеТитула4 Тогда
		
		ТекстДополнительногоУсловия = "И НЕ КонтурЛогистика_ТрН_Титул3.ПометкаУдаления";
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокГрузоотправителейВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул3.ДокументЭТРН.Грузоотправитель",
			"СписокГрузоотправителейДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул3.ДокументЭТРН.Перевозчик",
			"СписокПеревозчиковДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокГрузополучателейВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул3.ДокументЭТРН.Грузополучатель",
			"СписокГрузополучателейДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПунктовМаршрутаОтправкиВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул3.ДокументЭТРН.МестоПогрузки",
			"СписокПунктовМаршрутаОтправки");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПунктовМаршрутаПрибытияВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул3.ДокументЭТРН.МестоДоставки",
			"СписокПунктовМаршрутаПрибытия");
		
		ТекстЗапроса = СтрЗаменить(ВходнойТекстЗапроса,
			"И НЕ КонтурЛогистика_ТрН_Титул3.ПометкаУдаления",
			ТекстДополнительногоУсловия);
		
		Если СценарийСсылка.СписокСостоянийДокументооборота.Количество() > 0 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"//ДопУсловиеГДЕ",
			"
			|	И КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&ТребуемыеСостояниеЭТРНДляОтправки)
			|	//ДопУсловиеГДЕ ");
		КонецЕсли;
		
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка Тогда
		
		ТекстВТОрганизацииДиадок = 
			"ВЫБРАТЬ
			|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка КАК Ссылка,
			|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
			|ПОМЕСТИТЬ ВТ_ОрганизацииДиадок
			|ИЗ
			|	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
			|ГДЕ
			|	НЕ КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.ПометкаУдаления";
		
		ТекстЗапроса = ТекстВТОрганизацииДиадок + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|" + ВходнойТекстЗапроса;
		
		ТекстДополнительногоСоединенияИЗ = "";
		ДобавитьФильтрСоединениеПоОрганизации(ТекстДополнительногоСоединенияИЗ,
			СценарийСсылка.СписокГрузоотправителейВариантФильтрации,
			"СписокГрузоотправителейДиадок", "Отправитель");
		ДобавитьФильтрСоединениеПоОрганизации(ТекстДополнительногоСоединенияИЗ,
			СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"СписокПеревозчиковДиадок", "Перевозчик");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопСоединениеИЗ", ТекстДополнительногоСоединенияИЗ);
		
		Если СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.СогласованиеДокументов Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопУсловиеГДЕ",
				"	И КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&ТребуемыеСостояниеЭТРНДляСогласования)
				|	//ДопУсловиеГДЕ ");
		ИначеЕсли СценарийСсылка.Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ПодписьВходящихДокументов Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопУсловиеГДЕ",
				"	И КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&ТребуемыеСостояниеЭТРНДляПодписаниеВходящих)
				|	//ДопУсловиеГДЕ ");
		КонецЕсли;
		
	Иначе
		
		ТекстЗапроса = ВходнойТекстЗапроса;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПатчаПодписью(ТипЛогистика, СценарийСсылка)

	Текст = "ВЫБРАТЬ
	        |	КонтурЛогистика_ТрН_Титул1.Ссылка КАК Ссылка,
	        |	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.Перевозчик КАК Перевозчик,
	        |	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН КАК ГлавныйДокумент
	        |ПОМЕСТИТЬ ВТ_ДокументыПодсистемы
	        |ИЗ
	        |	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	        |ГДЕ
	        |	КонтурЛогистика_ТрН_Титул1.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	        |	И НЕ КонтурЛогистика_ТрН_Титул1.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДокументыПодсистемы.Ссылка КАК Ссылка,
	        |	ВТ_ДокументыПодсистемы.Перевозчик КАК Перевозчик,
	        |	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус КАК Статус,
	        |	КонтурЛогистика_СтатусыТитуловСрезПоследних.ТипОшибки КАК ТипОшибки,
	        |	КонтурЛогистика_СтатусыТитуловСрезПоследних.КодОшибки КАК КодОшибки,
	        |	КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние КАК Состояние
	        |ИЗ
	        |	ВТ_ДокументыПодсистемы КАК ВТ_ДокументыПодсистемы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
	        |		ПО ВТ_ДокументыПодсистемы.ГлавныйДокумент = КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Документ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	        |		ПО ВТ_ДокументыПодсистемы.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ";
	
	ТекстДополнительногоУсловия = "";
	ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
		"ВТ_ДокументыПодсистемы.Перевозчик",
		"СписокПеревозчиковДиадок");
	ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокСостоянийДокументооборотаВариантФильтрации,
		"КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние",
		"СписокСостоянийДокументооборота");
	
	Если ТекстДополнительногоУсловия <> "" Тогда
		Текст = Текст + "
			|ГДЕ
			|" + ТекстДополнительногоУсловия;
	КонецЕсли;
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда 
		//запрос реализован на Т1 и замены не требуются
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3 Тогда
		Текст = СтрЗаменить(Текст, "Титул1", "Титул3");
	Иначе
		ВызватьИсключение "Для типа " + ТипЛогистика + " требуется уточнить запрос построения списка для подписи существующего черновика";
	КонецЕсли;
	
	Возврат Текст;	

КонецФункции

Функция ТекстЗапросаПодписанияПЛ_5_02(ТипЛогистика, СценарийСсылка)

	Текст = "ВЫБРАТЬ
	        |	КонтурЛогистика_ПЛ_Титул1_5_02.Ссылка КАК Ссылка,
	        |	КонтурЛогистика_ПЛ_Титул1_5_02.ЛицоОформившееПЛ КАК Перевозчик
	        |ПОМЕСТИТЬ ВТ_ДокументыПодсистемы
	        |ИЗ
	        |	Документ.КонтурЛогистика_ПЛ_Титул1_5_02 КАК КонтурЛогистика_ПЛ_Титул1_5_02
	        |ГДЕ
	        |	КонтурЛогистика_ПЛ_Титул1_5_02.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	        |	И НЕ КонтурЛогистика_ПЛ_Титул1_5_02.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДокументыПодсистемы.Ссылка КАК Ссылка,
	        |	ВТ_ДокументыПодсистемы.Перевозчик КАК Перевозчик,
	        |	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус КАК Статус,
	        |	КонтурЛогистика_СтатусыТитуловСрезПоследних.ТипОшибки КАК ТипОшибки,
	        |	КонтурЛогистика_СтатусыТитуловСрезПоследних.КодОшибки КАК КодОшибки,
	        |	КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние КАК Состояние
	        |ИЗ
	        |	ВТ_ДокументыПодсистемы КАК ВТ_ДокументыПодсистемы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
	        |		ПО ВТ_ДокументыПодсистемы.Ссылка = КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Документ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	        |		ПО ВТ_ДокументыПодсистемы.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ";
	
	ТекстДополнительногоУсловия = "";
	ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
		"ВТ_ДокументыПодсистемы.Перевозчик",
		"СписокПеревозчиковДиадок");
	ДобавитьФильтрУсловиеПоОрганизации(ТекстДополнительногоУсловия, СценарийСсылка.СписокСостоянийДокументооборотаВариантФильтрации,
		"КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние",
		"СписокСостоянийДокументооборота");
	
	Если ТекстДополнительногоУсловия <> "" Тогда
		Текст = Текст + "
			|ГДЕ
			|" + ТекстДополнительногоУсловия;
	КонецЕсли;
	
	Если ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда 
		ВызватьИсключение "Для типа " + ТипЛогистика + " требуется уточнить запрос построения списка для подписи существующего черновика";
	КонецЕсли;
	
	Возврат Текст;	

КонецФункции

Процедура ВыполнитьПодписьВходящихДокументов(СценарийСсылка, БезПодписанияНаСервере)
	
	Если Не ЗначениеЗаполнено(СценарийСсылка.Сценарий) Тогда
		Возврат;
	КонецЕсли;
	
	Если СценарийСсылка.ТипЛогистическогоДокумента <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда
		Возврат;
	КонецЕсли;
	
	// Требуется выбрать задачи
	Запрос = СформироватьЗапросСпискаЗадачРобота(СценарийСсылка);
	
	ДобавитьДопФильтры(Запрос, СценарийСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	// Отладка: Результат.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		// Выполним проверку дополнительного условия из сценария на языке 1С
		Если Не ПроверитьДополнительноеУсловиеНаЯзыке1С(СценарийСсылка, Выборка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		ПараметрыФормированияФайловРеквизиты.Вставить("СформированАвтоматическимСценарием", Истина);
		
		ПараметрыВводаДокументов = Новый Структура;
		ПараметрыВводаДокументов.Вставить("МассивДокументов", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Выборка.ДокументЛогистика));
		ПараметрыВводаДокументов.Вставить("УточнениеТипаЛогистика", СценарийСсылка.ТипЛогистическогоДокумента);
		
		// Изготавливаем файлы
		КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
		ФайлыОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
			ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Если ФайлыОбмена.Количество() = 0 Тогда
			// Не удалось изготовить файл, фиксируем ошибку
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			КоличествоСообщенийПосле = СообщенияПользователю.Количество();
			Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
				ЗафиксироватьСообщения(СценарийСсылка, Выборка.ДокументЛогистика, СообщенияПользователю, КоличествоСообщенийДо);
			КонецЕсли;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Сформирован файл обмена: " + ФайлыОбмена[0] + " по: " + Выборка.ДокументЛогистика);
		
		// Подписываем файлы
		КоличествоСообщенийДо = ПолучитьСообщенияПользователю().Количество();
		ПодписанныеФайлыОбмена = КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.ПодписатьФайлыОбмена(
			ФайлыОбмена,, БезПодписанияНаСервере);
		
		Если ПодписанныеФайлыОбмена.Количество() = 0 Тогда
			// Не удалось подписать файл, фиксируем ошибку
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			КоличествоСообщенийПосле = СообщенияПользователю.Количество();
			Если КоличествоСообщенийДо <> КоличествоСообщенийПосле Тогда
				ЗафиксироватьСообщения(СценарийСсылка, Выборка.ДокументЛогистика, СообщенияПользователю, КоличествоСообщенийДо);
			КонецЕсли;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Подписан файл обмена: " + ПодписанныеФайлыОбмена[0] + " по: " + Выборка.ДокументЛогистика);
		
		// Отправка
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(ПодписанныеФайлыОбмена);
		Если РезультатОтправки.Успешно Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Отправлен подписанный: " + ПодписанныеФайлыОбмена[0]);
			Если ПодписанныеФайлыОбмена.Количество() <> 0 Тогда
				СнятьОшибкиСценариевАвтоматическойРаботы(СценарийСсылка, Выборка.ДокументЛогистика);
			КонецЕсли;
		Иначе
			ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Проблемы при отправке документов: " + ТекстОшибки);
			ЗафиксироватьОшибкуВРегистреИЖурнале(СценарийСсылка, Выборка.ДокументЛогистика, ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьСогласованиеДокументов(СценарийСсылка)
	
	Если Не ЗначениеЗаполнено(СценарийСсылка.Сценарий) Тогда
		Возврат;
	КонецЕсли;
	
	Если СценарийСсылка.ТипЛогистическогоДокумента <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда
		Возврат;
	КонецЕсли;
	
	// Требуется выбрать задачи
	Запрос = СформироватьЗапросСпискаЗадачРобота(СценарийСсылка);
	
	ДобавитьДопФильтры(Запрос, СценарийСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	// Отладка: Результат.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		// Выполним проверку дополнительного условия из сценария на языке 1С
		Если Не ПроверитьДополнительноеУсловиеНаЯзыке1С(СценарийСсылка, Выборка) Тогда
			Продолжить;
		КонецЕсли;
		
		ФайлыОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ФайлыОбменаСогласованния(Выборка.ДокументЛогистика);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Сформирован файл обмена: " + ФайлыОбмена[0] + " по: " + Выборка.ДокументЛогистика);
		
		СогласованныеФайлыОбмена = КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.СогласоватьФайлыОбмена(ФайлыОбмена);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Подписан файл обмена: " + СогласованныеФайлыОбмена[0] + " по: " + Выборка.ДокументЛогистика);
		
		Если ТипЗнч(СогласованныеФайлыОбмена) = Тип("Массив") И СогласованныеФайлыОбмена.Количество() > 0 Тогда
			
			РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьСогласованныеФайлыВДиадок(СогласованныеФайлыОбмена);
			Если РезультатОтправки.Успешно Тогда
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Отправлен подписанный: " + СогласованныеФайлыОбмена[0]);
				
			Иначе
				
				ТекстСообщения = "Проблемы при отправке документов: "
					+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаОбработкиВходящихДокументовЛогистики(ТипЛогистика, СценарийСсылка)
	
	// базовый текст на примере ТРН Т2
	ТекстЗапроса = "ВЫБРАТЬ
		|	КонтурЛогистика_ТрН_Титул2.Ссылка КАК ДокументЛогистика,
		|	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус КАК Статус
		|ИЗ
		|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
		|		ПО (КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ = КонтурЛогистика_ТрН_Титул2.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
		|		ПО (КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Документ = КонтурЛогистика_ТрН_Титул2.ДокументЭТРН)
		|ГДЕ
		|	КонтурЛогистика_ТрН_Титул2.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И НЕ КонтурЛогистика_ТрН_Титул2.ПометкаУдаления
		|	И КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки)
		|	//ДопУсловиеГДЕ";
	
	ТекстЗамены = "И НЕ КонтурЛогистика_ТрН_Титул2.ПометкаУдаления";
	ДобавитьФильтрУсловиеПоОрганизации(ТекстЗамены, СценарийСсылка.СписокГрузоотправителейВариантФильтрации,
		"КонтурЛогистика_ТрН_Титул2.ДокументЭТРН.Грузоотправитель",
		"СписокГрузоотправителейДиадок");
	
	// для ПЛ реквизит "Перевозчик" называется "ЛицоОформившееПЛ"
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипЛогистика) Тогда
		ДобавитьФильтрУсловиеПоОрганизации(ТекстЗамены, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул2.ДокументЭТРН.ЛицоОформившееПЛ",
			"СписокПеревозчиковДиадок");
	Иначе // ТРН / ЗЗ
		ДобавитьФильтрУсловиеПоОрганизации(ТекстЗамены, СценарийСсылка.СписокПеревозчиковВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул2.ДокументЭТРН.Перевозчик",
			"СписокПеревозчиковДиадок");
	КонецЕсли;
	
	// для ТРН можно фильтровать еще по ГП и пунктам отгрузки / приемки
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипЛогистика) Тогда
		ДобавитьФильтрУсловиеПоОрганизации(ТекстЗамены, СценарийСсылка.СписокГрузополучателейВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул2.ДокументЭТРН.Грузополучатель",
			"СписокГрузополучателейДиадок");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстЗамены, СценарийСсылка.СписокПунктовМаршрутаОтправкиВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул2.ДокументЭТРН.МестоПогрузки",
			"СписокПунктовМаршрутаОтправки");
		ДобавитьФильтрУсловиеПоОрганизации(ТекстЗамены, СценарийСсылка.СписокПунктовМаршрутаПрибытияВариантФильтрации,
			"КонтурЛогистика_ТрН_Титул2.ДокументЭТРН.МестоДоставки",
			"СписокПунктовМаршрутаПрибытия");
	КонецЕсли;
	
	// дополнить текст собранными условиями
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"И НЕ КонтурЛогистика_ТрН_Титул2.ПометкаУдаления", ТекстЗамены);
	
	// еще фильтр по состояниям документооборота 
	Если СценарийСсылка.СписокСостоянийДокументооборота.Количество() > 0 Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"//ДопУсловиеГДЕ",
		"
		|	И КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние В(&ТребуемыеСостояниеЭТРНДляОтправки)
		|	//ДопУсловиеГДЕ ");
	КонецЕсли;
	
	Имя = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);
	
	// замена типа титула
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТрН_Титул2", Имя);
	
	// Для ПЛ и ЗЗ реквизит содержащий главный документ называется не "ДокументЭТРН" а "Титул1" , а для их Т1 "Ссылка" 
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипЛогистика)
		Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипЛогистика) Тогда
		
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументЭТРН", "Ссылка");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДокументЭТРН", "Титул1");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;	

КонецФункции

Процедура ВыполнитьВсеАктивныеСценарииОбработкиВходящихДокументов() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаВсехАктивныхСценариев();
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"И ЕСТЬNULL(ВТ_РоботыСРасписанием.СейчасАктивен, ИСТИНА)", 
			"И ЕСТЬNULL(ВТ_РоботыСРасписанием.СейчасАктивен, ИСТИНА) И КонтурЛогистика_СценарииАвтоматическойРаботы.Ссылка.Сценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СценарииАвтоматическойРаботы.ОбработатьВходящиеДокументыЛогистики)");
	
	Запрос.УстановитьПараметр("ТекущееВремя", Дата(1,1,1) + (ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели(ТекущаяДатаСеанса()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ВыполнитьСценарийАвтоотправки(Выборка.Ссылка);
			
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗафиксироватьОшибкуВРегистреИЖурнале(Выборка.Ссылка,, ТекстОшибки);
			
			Сообщить("КонтурЛогистика_Робот_" + Выборка.Ссылка + ": " + ТекстОшибки);
			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПроверитьДополнительноеУсловиеНаЯзыке1С(Сценарий, Выборка)
	
	ДополнительноеУсловиеНа1С = Сценарий.ДополнительноеУсловиеНа1С;
	Если Не ЗначениеЗаполнено(ДополнительноеУсловиеНа1С) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Сценарий", Сценарий);
	Параметры.Вставить("Выборка", Выборка);
	
	РезультатВычисления = КонтурЛогистика_ОбщегоНазначенияСервер.ВычислитьЗначениеВБезопасномРежиме(
		ДополнительноеУсловиеНа1С, Параметры);
	
	Возврат РезультатВычисления;
	
КонецФункции

#Область ПереходНаЭПЛ502

Процедура ПеренестиСценарииАвтоотправкиДляЭПЛВФормат502(ТихийРежим = Истина) Экспорт
	
	ТипыДокументаЛогистика = Новый Массив;
	ТипыДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
	ТипыДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2);
	ТипыДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4);
	ТипыДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	ТипыДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СценарииАвтоматическойРаботы.Ссылка КАК Ссылка,
		|	КонтурЛогистика_СценарииАвтоматическойРаботы.НастройкаКонвертации КАК НастройкаКонвертации
		|ИЗ
		|	Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы КАК КонтурЛогистика_СценарииАвтоматическойРаботы
		|ГДЕ
		|	НЕ КонтурЛогистика_СценарииАвтоматическойРаботы.ПометкаУдаления
		|	И КонтурЛогистика_СценарииАвтоматическойРаботы.ТипЛогистическогоДокумента В (&ТипыДокументаЛогистика)";	
	
	Запрос.УстановитьПараметр("ТипыДокументаЛогистика", ТипыДокументаЛогистика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
		
			ПеренестиСценарийАвтоотправкиДляЭПЛВФормат502(ВыборкаДетальныеЗаписи.Ссылка);
		
		Исключение
			
			ТекстОшибки = "Ошибка при переносе сценария автоотправки в формат 5.02. Ошибка: " + ОписаниеОшибки();
			ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			
			Если Не ТихийРежим Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщить("Перенос сценариев автоотправки выполнен");
		
КонецПроцедуры

Процедура ПеренестиСценарийАвтоотправкиДляЭПЛВФормат502(СценарийАвтоотправки)
	
	Если СценарийАвтоотправки.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
		ТипЭПЛ502 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02;
	ИначеЕсли СценарийАвтоотправки.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2 Тогда
		ТипЭПЛ502 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02;
	ИначеЕсли СценарийАвтоотправки.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3 Тогда
		ТипЭПЛ502 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02;
	ИначеЕсли СценарийАвтоотправки.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5 Тогда
		ТипЭПЛ502 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02;
	ИначеЕсли СценарийАвтоотправки.ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6 Тогда
		ТипЭПЛ502 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СценарийАвтоотправки.НастройкаКонвертации) Тогда
		
		Если ЗначениеЗаполнено(СценарийАвтоотправки.НастройкаКонвертации) Тогда
			Родитель = СценарийАвтоотправки.НастройкаКонвертации.Родитель;
		Иначе
			Родитель = Неопределено;
		КонецЕсли;
		
		НастройкаКонвертации502 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.НайтиНастройкуКонвертацииДокументов(
			ТипЭПЛ502, СценарийАвтоотправки.НастройкаКонвертации.ТипДокумента1С, Родитель);		
		
	КонецЕсли;
		
	СценарийАвтоотправки502 = НайтиСценарийАвтоматическойРаботы(СценарийАвтоотправки.Сценарий, ТипЭПЛ502, НастройкаКонвертации502);
	
	Если ЗначениеЗаполнено(СценарийАвтоотправки502) Тогда
		Возврат;	
	КонецЕсли;	
	
	СценарийАвтоотправки502Объект = СценарийАвтоотправки.Скопировать();
	СценарийАвтоотправки502Объект.ТипЛогистическогоДокумента = ТипЭПЛ502;	
	СценарийАвтоотправки502Объект.Включен = Ложь;
	СценарийАвтоотправки502Объект.СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ПустаяСсылка();
    СценарийАвтоотправки502Объект.НастройкаКонвертации = НастройкаКонвертации502;
	
	СценарийАвтоотправки502Объект.СписокГрузоотправителейДиадок.Очистить();
	СценарийАвтоотправки502Объект.СписокПунктовМаршрутаОтправки.Очистить();
	СценарийАвтоотправки502Объект.СписокПунктовМаршрутаПрибытия.Очистить();
	
	СценарийАвтоотправки502Объект.Записать();
		
КонецПроцедуры

Функция НайтиСценарийАвтоматическойРаботы(Сценарий, ТипЛогистическогоДокумента, НастройкаКонвертации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СценарииАвтоматическойРаботы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы КАК КонтурЛогистика_СценарииАвтоматическойРаботы
		|ГДЕ
		|	НЕ КонтурЛогистика_СценарииАвтоматическойРаботы.ПометкаУдаления
		|	И КонтурЛогистика_СценарииАвтоматическойРаботы.ТипЛогистическогоДокумента = &ТипЛогистическогоДокумента
		|   И КонтурЛогистика_СценарииАвтоматическойРаботы.НастройкаКонвертации = &НастройкаКонвертации
		|	И КонтурЛогистика_СценарииАвтоматическойРаботы.Сценарий = &Сценарий";
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("НастройкаКонвертации", НастройкаКонвертации);
	Запрос.УстановитьПараметр("ТипЛогистическогоДокумента", ТипЛогистическогоДокумента);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли