
&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Ремонт") Тогда
	
		Для каждого Т Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
		КонецЦикла;
		
		ДокументОснование	= ДанныеЗаполнения;
		Организация			= ДанныеЗаполнения.Организация;
		СкладОтправитель	= ДанныеЗаполнения.ПриемкаВРемонт;
		СкладПолучатель		= ДанныеЗаполнения.ВозвратИзРемонта;
		Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);
	КонецЕсли;

КонецПроцедуры
