#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
		
	ТекПользовательАдминистратор 	= КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор();
	ТекПользовательМожетВНастройки  = РольДоступна("КонтурЛогистика_НастройкаПодписания");
	ТекПользователь1С 				= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		//это пустой набор записей, т.е. удаление записей
		Если Не ТекПользовательАдминистратор
			И Не Отбор.Пользователь1С.Значение = ТекПользователь1С Тогда  // Свою настройку можно технически, без этого не перезаписать 
			
			Отказ = Истина;
			ВызватьИсключение("Удаление настроек подписания разрешено только администратору");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(ТекЗапись.ОрганизацияДиадок) Тогда 
			Сообщить("С версии 0.6.0 обязательно указывать организацию");
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекЗапись.ОбщийСпособПодтвержденияПолномочий) Тогда
			Сообщить("Укажите способ подтверждения полномочий");
			Отказ = Истина;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ТекЗапись.УдалитьМЧД)
		//	И не ЗначениеЗаполнено(ТекЗапись.УдалитьДатаВыпускаМЧД) Тогда 
		//	Сообщить("До перехода на формат ФНС транспортной накладной 5.02 обязательно указывать дату выпуска МЧД");
		//	Отказ = Истина;
		//КонецЕсли;	
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" 
			И ТекЗапись.СертификатНаСервере Тогда 
			
			Сообщить("НЕВОЗМОЖНО использовать серверный сертификат в файловой базе: " + ТекЗапись.УдалитьОтпечатокСертификата);
			Отказ = Истина;
			
			Прервать;
			
		КонецЕсли;	
		
		Если Не ТекПользовательАдминистратор И Не ТекПользовательМожетВНастройки Тогда	
			
			Если Не ТекЗапись.Пользователь1С = ТекПользователь1С Тогда 
				Отказ = Истина;
				ВызватьИсключение("Пользователи НЕ администраторы подсистемы Логистика могут настраивать подписание только для себя");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
			
	Если Не Отказ Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли