&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// В режимах совместимости до 8.3.8 при группировке по организации возникает ошибка: Некорректное использование поля Организация
	ПоддержкаГруппировки = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПроверитьПоддержкуГруппировкиДинамическогоСпискаПоСсылочномуПолю();
	Если ПоддержкаГруппировки = "Без поддержки до 8.3.3" Тогда
		
		ПолеОрганизация = Новый ПолеКомпоновкиДанных("Организация");
		Для Каждого ТекущаяСтрока Из Список.Группировка.Элементы Цикл
			Если ТекущаяСтрока.Поле <> ПолеОрганизация Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрока.Использование = Ложь;
		КонецЦикла;	
	
	ИначеЕсли ПоддержкаГруппировки = "Без поддержки до 8.3.8" Тогда
		 
		СтруктураНастроек = Список.КомпоновщикНастроек.Настройки.Структура;		
		Для Каждого Настройка Из СтруктураНастроек Цикл			
			Если ТипЗнч(Настройка) = Тип("ГруппировкаКомпоновкиДанных") Тогда				
				ГруппировкаКомпоновкиДанных = Настройка;
				Прервать;				
			КонецЕсли;			
		КонецЦикла;
		
		Если Не ГруппировкаКомпоновкиДанных = Неопределено Тогда
			ПолеОрганизация = Новый ПолеКомпоновкиДанных("Организация");
			Для Каждого ПолеГруппировки Из ГруппировкаКомпоновкиДанных.ПоляГруппировки.Элементы Цикл			
				Если ПолеГруппировки.Поле <> ПолеОрганизация Тогда
					Продолжить;
				КонецЕсли;			
				ПолеГруппировки.Использование = Ложь;			
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаВыбора(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("РазвернутьДеревоПодразделений", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоПодразделений()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Развернуть(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры
