
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
		"ВыборКаталогаВыгрузкиЗаверешение", ЭтотОбъект, РежимДиалогаВыбораФайла.ВыборКаталога,
		"Укажите каталог для сохранения архива документооборота",,,,, ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКаталогаВыгрузкиЗаверешение(Результат, Документы) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Каталог = Результат;
	Иначе
		Каталог = Результат[0];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущийДокумент Из Документы Цикл
		
		Интерактивно = Истина;
		ГлавныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоТитулу(ТекущийДокумент);
		Если Не ЗначениеЗаполнено(ГлавныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанынеДокумента = Новый Структура("Номер, Дата");
		
		ТипДокумента = ТипЗнч(ГлавныйДокумент);
		ЭтоЭТрН = ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная");
		ЭтоЭПЛ = ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1");
		ЭтоЭПЭ = ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1");
		ЭтоЭЗЗ = ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1");
		ЭтоЭЭР = ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ЭкспедиторскаяРасписка");
		ЭтоЭСР = ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_СкладскаяРасписка");
		
		Если ЭтоЭТрН Тогда
			
			Архив = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьАрхивДокументооборотаТрН_ApiЛогистика(ГлавныйДокумент);
			
			ТекущиеДанынеДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
				ГлавныйДокумент, "НомерТрН, ДатаТрН");
			ДанынеДокумента.Номер = ТекущиеДанынеДокумента.НомерТрН;
			ДанынеДокумента.Дата = ТекущиеДанынеДокумента.ДатаТрН;
			
			ПрефиксИмениФайла = "ЭТрН";
			
		ИначеЕсли ЭтоЭПЛ Тогда
			
			Архив = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьАрхивДокументооборотаПЛ_ApiЛогистика(ГлавныйДокумент);
			
			ТекущиеДанынеДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
				ГлавныйДокумент, "НомерПЛ, ДатаПЛ");
			ДанынеДокумента.Номер = ТекущиеДанынеДокумента.НомерПЛ;
			ДанынеДокумента.Дата = ТекущиеДанынеДокумента.ДатаПЛ;
			
			ПрефиксИмениФайла = "ЭПЛ";
			
		ИначеЕсли ЭтоЭПЭ Тогда
			
			Архив = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьАрхивДокументооборота_ApiДиадока(ГлавныйДокумент, Интерактивно);
			
			ТекущиеДанынеДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
				ГлавныйДокумент, "НомДок, ДатаДок");
			ДанынеДокумента.Номер = ТекущиеДанынеДокумента.НомДок;
			ДанынеДокумента.Дата = ТекущиеДанынеДокумента.ДатаДок;
			
			ПрефиксИмениФайла = "ЭПЭ";
			
		ИначеЕсли ЭтоЭЗЗ Тогда
			
			Архив = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьАрхивДокументооборота_ApiДиадока(ГлавныйДокумент, Интерактивно);
			
			ТекущиеДанынеДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
				ГлавныйДокумент, "НомЗак, ДатаЗак");
			ДанынеДокумента.Номер = ТекущиеДанынеДокумента.НомЗак;
			ДанынеДокумента.Дата = ТекущиеДанынеДокумента.ДатаЗак;
			
			ПрефиксИмениФайла = "ЭЗЗ";
			
		ИначеЕсли ЭтоЭЭР Тогда
			
			Архив = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьАрхивДокументооборота_ApiДиадока(ГлавныйДокумент, Интерактивно);
			
			ТекущиеДанынеДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
				ГлавныйДокумент, "НомерДок, ДатаДок");
			ДанынеДокумента.Номер = ТекущиеДанынеДокумента.НомерДок;
			ДанынеДокумента.Дата = ТекущиеДанынеДокумента.ДатаДок;
			
			ПрефиксИмениФайла = "ЭЭР";
			
		ИначеЕсли ЭтоЭСР Тогда
			
			Архив = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьАрхивДокументооборота_ApiДиадока(ГлавныйДокумент, Интерактивно);
			
			ТекущиеДанынеДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
				ГлавныйДокумент, "НомерДок, ДатаДок");
			ДанынеДокумента.Номер = ТекущиеДанынеДокумента.НомерДок;
			ДанынеДокумента.Дата = ТекущиеДанынеДокумента.ДатаДок;
			
			ПрефиксИмениФайла = "ЭСР";
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Архив) Тогда
			Продолжить;
		КонецЕсли;
		
		ПодкаталогМесяц = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьПодкаталогАрхиваМесяц(ДанынеДокумента.Дата);
		
		ИмяФайла = КонтурЛогистика_ОбработкаДокументовСервер.ИмяАрхива(
			ПрефиксИмениФайла, ДанынеДокумента.Номер, ДанынеДокумента.Дата);
		
		Архив.Записать(Каталог + ПодкаталогМесяц + "\" + ИмяФайла);
		
		ЗапуститьПриложение(Каталог);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти