&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗаполнитьНаСервере(ПараметрКоманды);
	
	Оповестить("КонтурЛогистика_Обновить_НКД_НКС");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(НастройкаКонвертации)
	
	Параметры = Новый Структура;
	Если ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников") Тогда
		Параметры.Вставить("ТипОбъектаЛогистика", НастройкаКонвертации.ТипСправочникаЛогистика);
		Параметры.Вставить("ТипОбъекта1С", НастройкаКонвертации.ТипСправочникаИлиДокументаУС);
		Параметры.Вставить("РеквизитТитула", НастройкаКонвертации.РеквизитТитула);
	Иначе
		Параметры.Вставить("ТипОбъектаЛогистика", НастройкаКонвертации.ТипДокументаЛогистика);
		Параметры.Вставить("ТипОбъекта1С", НастройкаКонвертации.ТипДокумента1С);
		Параметры.Вставить("РеквизитТитула", Неопределено);
	КонецЕсли;
	
	Если КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.РасширениеСДополнительнымиРеквизитамиУстановлено() Тогда
		КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(, Параметры);
	ИначеЕсли КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.КонфигурацияСДополнительнымиРеквизитамиУстановлена() Тогда
		КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФ.ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(, Параметры);	
	КонеЦесли;
		
КонецПроцедуры
