
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ПоправкаЧасовогоПояса = ТекущаяДатаСеанса - УниверсальноеВремя(ТекущаяДатаСеанса);
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоправкаЧасовогоПояса", ПоправкаЧасовогоПояса);
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("ДатаНачалаЗамераЛокальная");
	
	Список.УстановитьОграниченияИспользованияВГруппировке(МассивПолей);
	Список.УстановитьОграниченияИспользованияВОтборе(МассивПолей);
	Список.УстановитьОграниченияИспользованияВПорядке(МассивПолей);
	
КонецПроцедуры

#КонецОбласти