#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОсновнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьОсновнуюКомандуКонтурИнтеграцииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ДокументыУчета = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(Форма.Объект.Ссылка);
	
	ЗапускИзЛогистики = Истина;
	КонтурЛогистика_ИнтеграцияКонтурКлиент.ПеревозочныеНажатие(Форма, ДокументыУчета, ЗапускИзЛогистики);
	
КонецПроцедуры

Процедура ВыполнитьОсновнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуКонтурИнтеграции(Команда, Форма, Источник, Оповещение) Экспорт
	
	ОткрытьФорму("Обработка.КонтурЛогистика_РабочийСтол.Форма.Форма");
	
КонецПроцедуры

Процедура ВыполнитьДополнительнуюКомандуКонтурИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

Процедура ПослеЗаписи(Форма, Объект, ПараметрыЗаписи) Экспорт
	
	ОбновитьСостояниеОсновнойКоманды(Форма);
	
КонецПроцедуры

Процедура ПеревозочныеНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	ОбновитьСостояниеОсновнойКоманды(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСостояниеОсновнойКоманды(Форма)
	
	МодульКонтурИнтеграцияКлиент = КонтурЛогистика_СтдОбщегоНазначенияКлиент.ОбщийМодульЛок("КонтурИнтеграцияКлиент");
	МодульКонтурИнтеграцияКлиентСервер = КонтурЛогистика_СтдОбщегоНазначенияКлиент.ОбщийМодульЛок("КонтурИнтеграцияКлиентСервер");
	
	ДокументыУчетнойСистемы = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(Форма.Объект.Ссылка);
	СостояниеЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.СостояниеЭПД(ДокументыУчетнойСистемы);
	
	НомерКоманды = 1;
	ОписаниеКоманды1 = МодульКонтурИнтеграцияКлиентСервер.ОписаниеКоманды("Логистика", НомерКоманды);
	ОписаниеКоманды1.Заголовок = СостояниеЭПД.Заголовок;
	
	ОписаниеКоманд = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(ОписаниеКоманды1);
	
	МодульКонтурИнтеграцияКлиент.ОбновитьОсновныеКоманды(Форма, ОписаниеКоманд);
	
КонецПроцедуры

#КонецОбласти