
#Область ЗаполнитьНаОсновании

&После("ЗаполнитьНаОсновании")
Процедура ОД_ЗаполнитьНаОсновании(ДанныеЗаполнения)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаполнитьПоЗаданиюНаПеревозку(ДанныеЗаполнения);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоЗаданиюНаПеревозку(п_ЗаданиеНаПеревозку)
	
	КлючСвязи = "";
	Для каждого Пункт Из п_ЗаданиеНаПеревозку.Маршрут Цикл
		Если Пункт.Доставлено Тогда
			КлючСвязи = Пункт.КлючСвязи;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(КлючСвязи) Тогда
		Сообщить("! Нет отмеченных пунктов для заполнения доверенности");
		Возврат;
	КонецЕсли;
	
	Заказы = Новый Массив;
	
	НайденыСтроки = п_ЗаданиеНаПеревозку.Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Для каждого СтрокаТЧ Из НайденыСтроки Цикл
		ТестМассив = Новый Массив;
		ТестМассив.Добавить(СтрокаТЧ.Распоряжение);
		СуммаКПолучению = СуммаКПолучению(ТестМассив);
		Если СуммаКПолучению > 0 Тогда
			Заказы.Добавить(СтрокаТЧ.Распоряжение);
		КонецЕсли;
	КонецЦикла;

	Если Заказы.Количество() = 0 Тогда
		Сообщить("! Нет заказов для заполнения доверенности");
		Возврат;
	КонецЕсли;

	Заказ1 = Заказы[0];
	
	ТипДоверенности					= Перечисления.ТипыВыданныхДоверенностей.НаПолучениеДС;
	ДокументОснование				= Заказ1;
	Организация						= Заказ1.Организация;
	Контрагент						= Заказ1.Контрагент;
	Партнер							= Заказ1.Партнер;
	ФизЛицо							= п_ЗаданиеНаПеревозку.Водитель;
	ПредставлениеДокументаФизЛица	= ДанныеПаспорта(ФизЛицо);
	СуммаДокумента					= СуммаКПолучению(Заказы); 
	Валюта							= Справочники.Валюты.НайтиПоКоду("643"); 
	
КонецПроцедуры

Функция ДанныеПаспорта(п_ФизЛицо)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Серия КАК Серия,
		|	ДокументыФизическихЛиц.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &ФизЛицо
		|	И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("Паспорт гражданина РФ", Истина));
	Запрос.УстановитьПараметр("ФизЛицо", п_ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Серия + " " + Выборка.Номер;
	КонецЕсли;

КонецФункции // ()

Функция СуммаКПолучению(п_Заказы)
	
	Рез = 0;
	Для каждого Т Из п_Заказы Цикл
		СуммаДопРеквизит = УправлениеСвойствами.ЗначениеСвойства(Т, "ПолучитьДС");
		Попытка
			СуммаЧисло = Число(СуммаДопРеквизит);
		Исключение
			СуммаЧисло = 0;
		КонецПопытки;
		Рез = Рез + СуммаЧисло;
	КонецЦикла;

	Возврат Рез;

КонецФункции // ()

#КонецОбласти
