#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Пропускаем обработку, чтобы гарантировать получение формы объекта при передаче параметра "АвтоТест".
	Если ДанныеЗаполнения = "АвтоТест" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	
		Для каждого Т Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
			
			НоваяСтрока.НомерДокументаПродажи	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеЗаполнения.Номер);
			НоваяСтрока.ДатаДокументаПродажи	= ДанныеЗаполнения.Дата;
		КонецЦикла;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Заказ = ДанныеЗаполнения;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Реализация = ДанныеЗаполнения;
		КонецЕсли;
		
		Организация			= ДанныеЗаполнения.Организация;
		Склад				= ДанныеЗаполнения.Склад;
		Партнер				= ДанныеЗаполнения.Партнер;
		Контрагент			= ДанныеЗаполнения.Контрагент;
		Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);

		Если ЗначениеЗаполнено(Партнер) Тогда
			Менеджер = Партнер.ОсновнойМенеджер;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Состояние = Перечисления.Рекл_СостоянияРекламации.Создана Тогда
		
		Движения.СвободныеОстатки.Записывать = Истина;
		Для Каждого Т Из Комплектующие Цикл

			СвободныйОстаток = ПолучитьСвободныйОстаток(Т.Номенклатура, Склад);
			
			Если СвободныйОстаток < Т.Количество Тогда
				Сообщить("Номенклатура: " + Т.Номенклатура);
				Сообщить("Требуется: " + Т.Количество);
				Сообщить("Свободный остаток: " + СвободныйОстаток);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = Движения.СвободныеОстатки.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период				= Дата;
			Движение.Номенклатура		= Т.Номенклатура;
			Движение.Склад				= Склад;
			Движение.ВРезервеСоСклада	= Т.Количество;
		КонецЦикла;

		Движения.ТоварыКОтгрузке.Записывать = Истина;
		Для Каждого Т Из Комплектующие Цикл
			Движение = Движения.ТоварыКОтгрузке.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период				= Дата;
			Движение.ДокументОтгрузки	= Ссылка;
			Движение.Номенклатура		= Т.Номенклатура;
			Движение.Склад				= Склад;
			Движение.ВРезерве			= Т.Количество;
		КонецЦикла;
	Иначе
		ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	КонецЕсли;
	
	Если Состояние = Перечисления.Рекл_СостоянияРекламации.КПеревозке
		ИЛИ Состояние = Перечисления.Рекл_СостоянияРекламации.ПереданоВСборку Тогда
		
		Если СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
			Если ЗначениеЗаполнено(ДатаДоставки) Тогда
				НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
				НЗ.Отбор.Распоряжение.Установить(Ссылка);
				НЗ.Записать();

				МЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьМенеджерЗаписи();
				МЗ.Распоряжение 			= Ссылка;
				МЗ.Склад					= Склад;
				МЗ.СпособДоставки   		= Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
				МЗ.Зона						= ЗонаДоставки;
				МЗ.ПолучательОтправитель	= Ссылка.Партнер;
				
				МЗ.Состояние			= Перечисления.СостоянияДоставки.ТребуетсяДоставка;
				МЗ.ДоставитьПолностью   = Истина;
				МЗ.Дата					= ДатаДоставки;
				МЗ.Номер				= Ссылка.Номер;
				
				Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
					МЗ.Адрес = АдресДоставкиПеревозчика;
				Иначе
					МЗ.Адрес = АдресДоставки;
				КонецЕсли;
				
				МЗ.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
	НЗ.Отбор.Распоряжение.Установить(Ссылка);
	НЗ.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();	
	
	Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		НепроверяемыеРеквизиты.Добавить("АдресДоставки");
		НепроверяемыеРеквизиты.Добавить("ПеревозчикПартнер");
		НепроверяемыеРеквизиты.Добавить("АдресДоставкиПеревозчика");
		НепроверяемыеРеквизиты.Добавить("ОсобыеУсловияПеревозкиОписание");
	ИначеЕсли СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда	
		НепроверяемыеРеквизиты.Добавить("АдресДоставки");
		НепроверяемыеРеквизиты.Добавить("ОсобыеУсловияПеревозкиОписание");
	Иначе	
		НепроверяемыеРеквизиты.Добавить("ПеревозчикПартнер");
		НепроверяемыеРеквизиты.Добавить("АдресДоставкиПеревозчика");
		НепроверяемыеРеквизиты.Добавить("ОсобыеУсловияПеревозкиОписание");
	КонецЕсли;

	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область Дополнительно

Функция ПолучитьСвободныйОстаток(п_Номенклатура, п_Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
		|ГДЕ
		|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
		|	И СвободныеОстаткиОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("Склад", п_Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Остаток;
	КонецЦикла;
	
	Возврат 0;
	

КонецФункции // ()

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры
	
#КонецОбласти