#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		Если ЗначениеЗаполнено(НомерДокумента) И ЗначениеЗаполнено(ДатаДокумента) Тогда
			Наименование = НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		ИначеЕсли ЗначениеЗаполнено(ИдДок) Тогда
			Наименование = ИдДок;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ОрганизацияИНН))
		И Не Справочники.КонтурЛогистика_Договоры.ИННЗаполненКорректно(ОрганизацияИНН) Тогда
		Отказ = Истина;
		Сообщить("ИНН организации должен состоять из 10 или 12 цифр");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(КонтрагентИНН))
		И Не Справочники.КонтурЛогистика_Договоры.ИННЗаполненКорректно(КонтрагентИНН) Тогда
		Отказ = Истина;
		Сообщить("ИНН контрагента должен состоять из 10 или 12 цифр");
	КонецЕсли;
	
	Для Каждого СтрокаУчастника Из Участники Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрокаУчастника.УчастникИНН))
			И Не Справочники.КонтурЛогистика_Договоры.ИННЗаполненКорректно(СтрокаУчастника.УчастникИНН) Тогда
			Отказ = Истина;
			Сообщить("ИНН участника должен состоять из 10 или 12 цифр");
		КонецЕсли;
	КонецЦикла;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_Договоры_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьСторонуДоговораПриЗаполнении("организации", Организация, ОрганизацияИНН, "Объект.Организация", Отказ);
	ПроверитьСторонуДоговораПриЗаполнении("контрагента", Контрагент, КонтрагентИНН, "Объект.Контрагент", Отказ);
	
	Организации = Новый ТаблицаЗначений;
	Организации.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Организации.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок"));
	Организации.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	ДобавитьСтрокуИННОрганизаций(Организации, ОрганизацияИНН);
	Если ЗначениеЗаполнено(Организация) Тогда
		ИННСправочникаОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Организация, "ИНН");
		ДобавитьСтрокуИННОрганизаций(Организации,, Организация);
	Иначе
		ИННСправочникаОрганизации = "";
	КонецЕсли;
	
	ДобавитьСтрокуИННОрганизаций(Организации, КонтрагентИНН);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ИННСправочникаКонтрагент = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Контрагент, "ИНН");
		ДобавитьСтрокуИННОрганизаций(Организации,, Контрагент);
	Иначе
		ИННСправочникаКонтрагент = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ОрганизацияИНН) И ИННСправочникаОрганизации <> ОрганизацияИНН Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "ИНН организации не совпадает со значением в карточке";
		ПараметрыСообщения.ПутьКДанным  = "Объект.Организация";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(КонтрагентИНН) И ИННСправочникаКонтрагент <> КонтрагентИНН Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "ИНН контрагента не совпадает со значением в карточке";
		ПараметрыСообщения.ПутьКДанным  = "Объект.Контрагент";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Участники Цикл
		ДобавитьСтрокуИННОрганизаций(Организации, ТекущаяСтрока.УчастникИНН);
		ДобавитьСтрокуИННОрганизаций(Организации,, ТекущаяСтрока.Участник);
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.УчастникИНН) Или Не ЗначениеЗаполнено(ТекущаяСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		ИННУчастиника = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ТекущаяСтрока.Участник, "ИНН");
		
		Если ИННУчастиника <> ТекущаяСтрока.УчастникИНН Тогда
			ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
			ПараметрыСообщения.Текст = "ИНН участиника " + ТекущаяСтрока.УчастникИНН + " не совпадает со значением в карточке";
			ПараметрыСообщения.ПутьКДанным  = "Объект.Участники";
			
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Организации.Свернуть("ИНН, Организация", "Количество");
	Для Каждого ТекущаяСтрока Из Организации Цикл
		Если ТекущаяСтрока.Количество < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИНН) Тогда
			ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
			ПараметрыСообщения.Текст = "Есть дубли по ИНН " + ТекущаяСтрока.ИНН;
			
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Организация) Тогда
			ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
			ПараметрыСообщения.Текст = "Есть дубли по организации """ + ТекущаяСтрока.Организация + """";
			
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСторонуДоговораПриЗаполнении(ИмяСтороны, Организация, ИНН, ПутьКДанным, Отказ)
	
	Если Не ЗначениеЗаполнено(Организация) И Не ЗначениеЗаполнено(СокрЛП(ИНН)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ИНН))
		И Не Справочники.КонтурЛогистика_Договоры.ИННЗаполненКорректно(ИНН) Тогда
		
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "ИНН " + ИмяСтороны + " должен состоять из 10 или 12 цифр";
		ПараметрыСообщения.ПутьКДанным = ПутьКДанным;
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация)
		И Не Справочники.КонтурЛогистика_Договоры.ИННЗаполненКорректно(
			Справочники.КонтурЛогистика_Договоры.ИННСтороныДоговора(Организация, ИНН)) Тогда
		
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Укажите ИНН " + ИмяСтороны + " или выберите организацию Диадок с заполненным ИНН";
		ПараметрыСообщения.ПутьКДанным = ПутьКДанным;
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуИННОрганизаций(Организации, ИНН = Неопределено, Организация = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИНН) И Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Организации.Добавить();
	НоваяСтрока.ИНН = ИНН;
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Количество = 1;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли