#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Сериализовать(Знач Значение) Экспорт
    
    Если Значение = _1 Тогда
        Возврат 1;
    ИначеЕсли Значение = _2 Тогда
        Возврат 2;
    ИначеЕсли Значение = _3 Тогда
        Возврат 3;
    ИначеЕсли Значение = _4 Тогда
        Возврат 4;
    ИначеЕсли Значение = _5 Тогда
        Возврат 5;
    Иначе 
    	Возврат 0;    
    КонецЕсли;
    
 КонецФункции
 
Функция Десериализовать(Знач Значение) Экспорт
    
    Если Значение = "1" Тогда
        Возврат _1;
    ИначеЕсли Значение = "2" Тогда
        Возврат _2;
    ИначеЕсли Значение = "3" Тогда
        Возврат _3;
    ИначеЕсли Значение = "4" Тогда
        Возврат _4;
    ИначеЕсли Значение = "5" Тогда
        Возврат _5;
    Иначе 
        Возврат ПустаяСсылка();
    КонецЕсли;
    
КонецФункции 

#КонецЕсли