
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ЭтоАдминистратор", ЭтоАдминистратор);
	Параметры.Свойство("РезультатВалидацииПрав", РезультатВалидацииПрав);
	
	СоздатьЭлементыОтображенияПрав();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.НастроитьПраваСотрудникаЛогистики.Видимость = ЭтоАдминистратор;
	Элементы.НастроитьПраваСотрудникаДиадока.Видимость = ЭтоАдминистратор;
	Элементы.ПерейтиКАдминистраторам.Видимость = Не ЭтоАдминистратор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы Тогда
		Оповестить("КонтурЛогистика_ФормаПроверкиПравДоступа_Закрытие", Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьПраваСотрудникаЛогистики(Команда)
	
	СсылкаНастройкиВеб = КонтурЛогистика_ОбщегоНазначенияСервер.СсылкаВебСпискаСотрудниковЛогистики(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНастройкиВеб);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПраваСотрудникаДиадока(Команда)
	
	СсылкаНастройкиВеб = КонтурЛогистика_ОбщегоНазначенияСервер.СсылкаВебСпискаСотрудниковДиадока(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНастройкиВеб);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКАдминистраторам(Команда)
	
	СсылкаНастройкиВеб = КонтурЛогистика_ОбщегоНазначенияСервер.СсылкаВебСпискаСотрудниковЛогистики(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНастройкиВеб);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьЭлементыОтображенияПрав()
	
	Счет = 0;
	
	Элементы.ГруппаСервисЛогистикаРазделПЛ.Видимость = (РезультатВалидацииПрав.Логистика.ПЛ.Количество() <> 0);
	Для Каждого ИмяРоли Из РезультатВалидацииПрав.Логистика.ПЛ Цикл
		
		Счет = Счет + 1;
		
		ИмяДекарации = "ДекорацияЛогистикаРоль_" + Формат(Счет, "ЧГ=");
		ЗаголовокДекарации = " - " + ИмяРоли;
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, ИмяДекарации,
			Элементы.ГруппаСервисЛогистикаРазделПЛ, ЗаголовокДекарации);
		
	КонецЦикла;
	
	Элементы.ГруппаСервисЛогистикаРазделТрН.Видимость = (РезультатВалидацииПрав.Логистика.ТРН.Количество() <> 0);
	Для Каждого ИмяРоли Из РезультатВалидацииПрав.Логистика.ТРН Цикл
		
		Счет = Счет + 1;
		
		ИмяДекарации = "ДекорацияЛогистикаРоль_" + Формат(Счет, "ЧГ=");
		ЗаголовокДекарации = " - " + ИмяРоли;
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, ИмяДекарации,
			Элементы.ГруппаСервисЛогистикаРазделТрН, ЗаголовокДекарации);
		
	КонецЦикла;
	
	Элементы.ГруппаСервисЛогистика.Видимость =
		(Элементы.ГруппаСервисЛогистикаРазделПЛ.Видимость
			Или Элементы.ГруппаСервисЛогистикаРазделТрН.Видимость);
	
	Элементы.ГруппаСервисДиадок.Видимость = (РезультатВалидацииПрав.Диадок.Количество() <> 0);
	Для Каждого ИмяРоли Из РезультатВалидацииПрав.Диадок Цикл
		
		Счет = Счет + 1;
		
		ИмяДекарации = "ДекорацияЛогистикаРоль_" + Формат(Счет, "ЧГ=");
		ЗаголовокДекарации = " - " + ИмяРоли;
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорацияНадпись(ЭтаФорма, ИмяДекарации,
			Элементы.ГруппаСервисДиадокРоли, ЗаголовокДекарации);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
