#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Сериализовать(Знач Значение) Экспорт
	
	Если Значение = ЯвляетсяГрузомТоваром Тогда
		Возврат "1";
	ИначеЕсли Значение = ЯвляетсяТарой Тогда
		Возврат "2";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция Десериализовать(Знач Значение) Экспорт
	
	Если Значение = "1" Тогда
		Возврат ЯвляетсяГрузомТоваром;
	ИначеЕсли Значение = "2" Тогда
		Возврат ЯвляетсяТарой;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецЕсли