
&НаСервере
Процедура ОД_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого Т Из ТекущийОбъект.Товары Цикл
			
			Если ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда

				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Основной ассортимент", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Под заказ", Истина));
				КонецЕсли;
				
			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж Тогда
				
				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Основной ассортимент", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Под заказ", Истина));
				КонецЕсли;

			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
				
				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Основной ассортимент", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Под заказ", Истина));
				КонецЕсли;
				
			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента Тогда
				
				Если Т.РольАссортимента = Перечисления.РолиАссортимента.ПостоянныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Выводится из ассортимента", Истина));
				ИначеЕсли Т.РольАссортимента = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
					УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив", Истина));
				КонецЕсли;

			ИначеЕсли ТекущийОбъект.Этап = Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв Тогда
				УстановитьДополнительныйРеквизит(Т.Номенклатура, Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Архив", Истина));
			КонецЕсли;;
		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДополнительныйРеквизит(п_Номенклатура, п_Значение)

	ЗначенияДополнительныхРеквизитов = Новый ТаблицаЗначений;
	ЗначенияДополнительныхРеквизитов.Колонки.Добавить("Свойство");
	ЗначенияДополнительныхРеквизитов.Колонки.Добавить("Значение");
	
    НоваяСтрока = ЗначенияДополнительныхРеквизитов.Добавить();
    НоваяСтрока.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ассортимент", Истина);
    НоваяСтрока.Значение = п_Значение;
	
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(п_Номенклатура, ЗначенияДополнительныхРеквизитов);

КонецПроцедуры
