
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументСсылка", ПараметрКоманды);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
		"Отменить пропуск задач на ЭЗЗ Т1 и ЭТрН Т1?", РежимДиалогаВопрос.ДаНетОтмена, "Подтвердите операцию",,
		ЭтотОбъект, "ОбработчикСогласия", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласия(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТихийРежим = Истина;
	КонтурЛогистика_ОбработкаДокументовСервер.ОтменитьПропускЗадачЭкспедитора(ДополнительныеПараметры.ДокументСсылка, ТихийРежим);
	
	Сообщить("Отменен пропуск задач на ЭЗЗ Т1 и ЭТрН Т1");
	
КонецПроцедуры