#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ОткрытаИзТЧОрганизацииДиадокИРоли", ОткрытаИзТЧОрганизацииДиадокИРоли);
	
	Если Параметры.Свойство("СвязанныеОбъекты") Тогда
		
		Для каждого СвязанныйОбъект Из Параметры.СвязанныеОбъекты Цикл
			НоваяСтрока = СвязанныеОбъекты.Добавить();
			НоваяСтрока.СвязанныйОбъект = СвязанныйОбъект;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОбновитьДанныеКарточкиОрганизации();
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеКарточкиОрганизации()
	
	Если (Не ЗначениеЗаполнено(Организация) Или СвязанныеОбъекты.Количество() = 0)
		И Не ОткрытаИзТЧОрганизацииДиадокИРоли Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияОбъект = Организация.ПолучитьОбъект();
	ОрганизацияОбъект.СвязанныеОбъекты.Загрузить(СвязанныеОбъекты.Выгрузить());
	ОрганизацияОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти