
&НаКлиенте
Процедура ОД_ОтправитьПисьмаПосле(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рассылка актов сверки");
	
	ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
			
	П = Новый Структура;
	П.Вставить("Документы", ВыделенныеСтроки);
			
	ОткрытьФорму("ВнешняяОбработка.АктСверкиРассылка.Форма", П);
	
	
КонецПроцедуры
