
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") 
		И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" Тогда
		УточнениеТипаЛогистика = ПараметрыВыполненияКоманды.Источник.ТипЛогистика;
	Иначе
		УточнениеТипаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1");
	КонецЕсли;
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ПараметрКоманды, УточнениеТипаЛогистика);
	ИспользуютсяМногиеКОдномуЭЗЗ = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдномуЭЗЗ") = Истина;
	
	Если Не ИспользуютсяМногиеКОдномуЭЗЗ Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Для использования этой команды необходимо включить общую настройку ""1 ЭЗЗ из нескольких документов""");
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = ПараметрыВводаДокументов.МассивДокументов[0];
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаПоДокументу1С(УточнениеТипаЛогистика, ДокументСсылка, 
		ЭтотОбъект, ПараметрыВводаДокументов.МассивДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено)

	Оповестить("КонтурЛогистика_ВвестиДокумент");

КонецПроцедуры

