#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ВывестиИННКППШапка(ДеревоЗагрузки, ОбластьШапка, Владелец)
	Попытка
		ОблИННКППОрг = ОбластьШапка.Области["ИННКППОрг"];
		ИдФайла = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/ИдФайл", "ИмяЭлемента").ЗначениеЭлемента;
		ИННКПП = СтрРазделить(ИдФайла, "_")[2];
		НеобходимоЗаполнятьИННКПП = Ложь;
		Если СтрДлина(ИННКПП) = 19 Тогда 
			ОблИННКППОрг.Текст = СтрЗаменить(ОблИННКППОрг.Текст, "ИНН:", "ИНН: " + Лев(ИННКПП, 10));
			ОблИННКППОрг.Текст = СтрЗаменить(ОблИННКППОрг.Текст, "КПП:", "КПП: " + Прав(ИННКПП, 9));
		ИначеЕсли СтрДлина(ИННКПП) = 12 Тогда
			ОблИННКППОрг.Текст = СтрЗаменить(ОблИННКППОрг.Текст, "ИНН:", "ИНН: " + ИННКПП);
		Иначе
			НеобходимоЗаполнятьИННКПП = Истина;
		КонецЕсли;
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "НомерДокумента, ДатаДокумента, Организация");
		ОбластьШапка.Области["НомерДокумента"].Значение = Реквизиты.НомерДокумента;
		ОбластьШапка.Области["ДатаДокумента"].Значение = Реквизиты.ДатаДокумента;
		Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Реквизиты.Организация) Тогда 
			СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
				Реквизиты.Организация, ТекущаяДатаСеанса(), "НаимЮЛПол,ИННЮЛ,КППЮЛ");
			ОбластьШапка.Области["НаимОрг"].Значение = СведенияОбОрганизации.НаимЮЛПол;
			Если НеобходимоЗаполнятьИННКПП Тогда 
				ОблИННКППОрг.Текст = СтрЗаменить(ОблИННКППОрг.Текст, "ИНН:", "ИНН: " + СведенияОбОрганизации.ИННЮЛ);
				ОблИННКППОрг.Текст = СтрЗаменить(ОблИННКППОрг.Текст, "КПП:", "КПП: " + СведенияОбОрганизации.КППЮЛ);
			КонецЕсли;
		Иначе
			СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
				Реквизиты.Организация, ТекущаяДатаСеанса(), "ФИО,ИННФЛ");
			ОбластьШапка.Области["НаимОрг"].Значение = СведенияОбОрганизации.ФИО;
			Если НеобходимоЗаполнятьИННКПП Тогда 
				ОблИННКППОрг.Текст = СтрЗаменить(ОблИННКППОрг.Текст, "ИНН:", "ИНН: " + СведенияОбОрганизации.ИННФЛ);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция Сформировать_СообщениеОбИсчисленнойСуммеТранспортногоНалога501(ДеревоЗагрузки, Владелец) Экспорт 
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	Макет = Отчеты.ВизуализацияВходящихИзвещенийФНС.ПолучитьМакет("СообщениеОбИсчисленнойСуммеТранспортногоНалога501");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ВывестиИННКППШапка(ДеревоЗагрузки, ОбластьШапка, Владелец);
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОТрНал/НалИсчисл", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") И ЗначениеЗаполнено(ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента) Тогда 
		ОбластьШапка.Области["НалИсчисл"].Значение = ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента + " руб.";
	Иначе
		ОбластьШапка.Области["НалИсчисл"].Значение = "0 руб.";
	КонецЕсли;
	Результат.Вывести(ОбластьШапка);
	
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОТрНал/ИсчТрНал", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") Тогда 
		Результат.Вывести(Макет.ПолучитьОбласть("ИсчТрНал_Шапка"));
		
		Для Каждого СтрокаДанных Из ДанныеПоИсчисленномуНалогу.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ИсчТрНал")) Цикл 
			ОбластьДетализация = Макет.ПолучитьОбласть("ИсчТрНал_Детализация");
			Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,НалСтавка,ВладенТС,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
				ОбластьДетализация.Области["ИсчТрНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
			КонецЦикла;
			ОбластьДетализация.Области.ИсчТрНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НаимОбъект") + "; "
				+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "РегЗнак") + "; "
				+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
				+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
				
			Результат.Вывести(ОбластьДетализация);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоПересчету = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОТрНал/ПерТрНал", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоПересчету) = Тип("СтрокаДереваЗначений") Тогда 
		СтрокиПоПересчету = ДанныеПоПересчету.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ПерТрНал"));
		Для Каждого СтрокаПерерасчета0 Из СтрокиПоПересчету Цикл 
			ОбластьШапкаПерерасчета = Макет.ПолучитьОбласть("ПерТрНал_Шапка");
			ОбластьШапкаПерерасчета.Области.ПерТрНал_НомерСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "НомерСообщ");
			Результат.Вывести(ОбластьШапкаПерерасчета);
			
			СтрокиСведений = СтрокаПерерасчета0.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СведТСПер"));
			Если СтрокиСведений.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			Результат.Вывести(Макет.ПолучитьОбласть("ПерТрНал_ШапкаТабличнойЧасти"));
			Для Каждого СтрокаДанных Из СтрокиСведений Цикл 
				ОбластьДетализация = Макет.ПолучитьОбласть("ИсчТрНал_Детализация");
				Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,НалСтавка,ВладенТС,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
					ОбластьДетализация.Области["ИсчТрНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
				КонецЦикла;
				ОбластьДетализация.Области.ИсчТрНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НаимОбъект") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "РегЗнак") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
					
				Результат.Вывести(ОбластьДетализация);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоСуммеНалога = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОТрНал/СумНалогОКТМО", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоСуммеНалога) = Тип("СтрокаДереваЗначений") Тогда
		ПечатьДетализацииПоОКТМО(ДанныеПоСуммеНалога, Результат, Макет);
	КонецЕсли;
	
	Результат.Вывести(Макет.ПолучитьОбласть("Подвал"));
	Возврат Результат;
КонецФункции

Функция Сформировать_СообщениеОбИсчисленнойСуммеЗемельногоНалога501(ДеревоЗагрузки, Владелец) Экспорт 
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	Макет = Отчеты.ВизуализацияВходящихИзвещенийФНС.ПолучитьМакет("СообщениеОбИсчисленнойСуммеЗемельногоНалога501");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ВывестиИННКППШапка(ДеревоЗагрузки, ОбластьШапка, Владелец);
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОЗемНал/НалИсчисл", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") И ЗначениеЗаполнено(ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента) Тогда 
		ОбластьШапка.Области["НалИсчисл"].Значение = ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента + " руб.";
	Иначе
		ОбластьШапка.Области["НалИсчисл"].Значение = "0 руб.";
	КонецЕсли;
	Результат.Вывести(ОбластьШапка);
	
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОЗемНал/ИсчЗемНал", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") Тогда 
		Результат.Вывести(Макет.ПолучитьОбласть("ИсчЗемНал_Шапка"));
		
		Для Каждого СтрокаДанных Из ДанныеПоИсчисленномуНалогу.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ИсчЗемНал")) Цикл 
			ОбластьДетализация = Макет.ПолучитьОбласть("ИсчЗемНал_Детализация");
			Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,ДоляЗУ,НалВычет,НалСтав,ВладенЗУ,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
				ОбластьДетализация.Области["ИсчЗемНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
			КонецЦикла;
			ОбластьДетализация.Области.ИсчЗемНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НомКадастрЗУ") + "; "
				+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
				+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
				
			Результат.Вывести(ОбластьДетализация);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоПересчету = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОЗемНал/ПерЗемНал", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоПересчету) = Тип("СтрокаДереваЗначений") Тогда 
		СтрокиПоПересчету = ДанныеПоПересчету.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ПерЗемНал"));
		Для Каждого СтрокаПерерасчета0 Из СтрокиПоПересчету Цикл 
			ОбластьШапкаПерерасчета = Макет.ПолучитьОбласть("ПерЗемНал_Шапка");
			ОбластьШапкаПерерасчета.Области.ПерЗемНал_НомерСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "НомерСообщ");
			Результат.Вывести(ОбластьШапкаПерерасчета);
			
			СтрокиСведений = СтрокаПерерасчета0.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СведЗУПер"));
			Если СтрокиСведений.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			Результат.Вывести(Макет.ПолучитьОбласть("ПерЗемНал_ШапкаТабличнойЧасти"));
			Для Каждого СтрокаДанных Из СтрокиСведений Цикл 
				ОбластьДетализация = Макет.ПолучитьОбласть("ИсчЗемНал_Детализация");
				Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,ДоляЗУ,НалВычет,НалСтав,ВладенЗУ,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
					ОбластьДетализация.Области["ИсчЗемНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
				КонецЦикла;
				ОбластьДетализация.Области.ИсчЗемНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НомКадастрЗУ") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
					
				Результат.Вывести(ОбластьДетализация);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПоСуммеНалога = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОЗемНал/СумНалогОКТМО", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоСуммеНалога) = Тип("СтрокаДереваЗначений") Тогда
		ПечатьДетализацииПоОКТМО(ДанныеПоСуммеНалога, Результат, Макет);
	КонецЕсли;
	
	Результат.Вывести(Макет.ПолучитьОбласть("Подвал"));
	Возврат Результат;
КонецФункции

Функция Сформировать_СообщениеОбИсчисленныхСуммахНалогов501(ДеревоЗагрузки, Владелец) Экспорт 
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	Макет = Отчеты.ВизуализацияВходящихИзвещенийФНС.ПолучитьМакет("СообщениеОбИсчисленныхСуммахНалогов501");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ВывестиИННКППШапка(ДеревоЗагрузки, ОбластьШапка, Владелец);
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ТрНалог/ТрНалИсчисл", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") И ЗначениеЗаполнено(ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента) Тогда 
		ОбластьШапка.Области["ТрНалИсчисл"].Значение = ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента + " руб.";
	Иначе
		ОбластьШапка.Области["ТрНалИсчисл"].Значение = "0 руб.";
	КонецЕсли;
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/НалогИмОрг/НалИмОргИсчисл", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") И ЗначениеЗаполнено(ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента) Тогда 
		ОбластьШапка.Области["НалИмОргИсчисл"].Значение = ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента + " руб.";
	Иначе
		ОбластьШапка.Области["НалИмОргИсчисл"].Значение = "0 руб.";
	КонецЕсли;
	ДанныеПоИсчисленномуНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ЗемНалог/ЗемНалИсчисл", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоИсчисленномуНалогу) = Тип("СтрокаДереваЗначений") И ЗначениеЗаполнено(ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента) Тогда 
		ОбластьШапка.Области["ЗемНалИсчисл"].Значение = ДанныеПоИсчисленномуНалогу.ЗначениеЭлемента + " руб.";
	Иначе
		ОбластьШапка.Области["ЗемНалИсчисл"].Значение = "0 руб.";
	КонецЕсли;
	Результат.Вывести(ОбластьШапка);
	
#Область ТранспортныйНалог
	ДанныеПоНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ТрНалог", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоНалогу) = Тип("СтрокаДереваЗначений") Тогда 
		ИсчисленоВсего = ЗначениеПодчиненногоЭлемента(ДанныеПоНалогу, "ТрНалИсчисл");
		Исчислено = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ТрНалог/ИсчТрНал", "ИмяЭлемента");
		Перерасчет = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ТрНалог/ПерТрНал", "ИмяЭлемента");
		Детализация = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ТрНалог/СумНалогОКТМО", "ИмяЭлемента");
		
		Если ТипЗнч(Исчислено) = Тип("СтрокаДереваЗначений") Тогда 
			Результат.Вывести(Макет.ПолучитьОбласть("ИсчТрНал_Шапка"));
			
			Для Каждого СтрокаДанных Из Исчислено.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ИсчТрНал")) Цикл 
				ОбластьДетализация = Макет.ПолучитьОбласть("ИсчТрНал_Детализация");
				Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,НалСтавка,ВладенТС,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
					ОбластьДетализация.Области["ИсчТрНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
				КонецЦикла;
				ОбластьДетализация.Области.ИсчТрНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НаимОбъект") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "РегЗнак") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
					
				Результат.Вывести(ОбластьДетализация);
			КонецЦикла;
		КонецЕсли;
		Если ТипЗнч(Перерасчет) = Тип("СтрокаДереваЗначений") Тогда
			СтрокиПоПересчету = Перерасчет.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ПерТрНал"));
			Для Каждого СтрокаПерерасчета0 Из СтрокиПоПересчету Цикл 
				ОбластьШапкаПерерасчета = Макет.ПолучитьОбласть("ПерТрНал_Шапка");
				ОбластьШапкаПерерасчета.Области.ПерТрНал_НомерСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "НомерСообщ");
				ОбластьШапкаПерерасчета.Области.ПерТрНал_ДатаСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "ДатаСообщ");
				Результат.Вывести(ОбластьШапкаПерерасчета);
				
				СтрокиСведений = СтрокаПерерасчета0.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СведТСПер"));
				Если СтрокиСведений.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Результат.Вывести(Макет.ПолучитьОбласть("ПерТрНал_ШапкаТабличнойЧасти"));
				Для Каждого СтрокаДанных Из СтрокиСведений Цикл 
					ОбластьДетализация = Макет.ПолучитьОбласть("ИсчТрНал_Детализация");
					Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,НалСтавка,ВладенТС,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
						ОбластьДетализация.Области["ИсчТрНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
					КонецЦикла;
					ОбластьДетализация.Области.ИсчТрНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НаимОбъект") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "РегЗнак") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
						
					Результат.Вывести(ОбластьДетализация);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		Если ТипЗнч(Детализация) = Тип("СтрокаДереваЗначений") Тогда
			ПечатьДетализацииПоОКТМО(Детализация, Результат, Макет);
		КонецЕсли;
	КонецЕсли;
#КонецОбласти

#Область ИмущественныйНалог
	ДанныеПоНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/НалогИмОрг", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоНалогу) = Тип("СтрокаДереваЗначений") Тогда 
		ИсчисленоВсего = ЗначениеПодчиненногоЭлемента(ДанныеПоНалогу, "НалИмОргИсчисл");
		Исчислено = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/НалогИмОрг/ИсчНалИмОрг", "ИмяЭлемента");
		Перерасчет = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/НалогИмОрг/ПерНалИмОрг", "ИмяЭлемента");
		Детализация = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/НалогИмОрг/СумНалогОКТМО", "ИмяЭлемента");
		
		Если ТипЗнч(Исчислено) = Тип("СтрокаДереваЗначений") Тогда 
			Результат.Вывести(Макет.ПолучитьОбласть("ИсчНалИмОрг_Шапка"));
			
			Для Каждого СтрокаДанных Из Исчислено.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ИсчНалИмОрг")) Цикл 
				ОбластьДетализация = Макет.ПолучитьОбласть("ИсчНалИмОрг_Детализация");
				Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,ДоляИмОрг,НалСтав,ВладенИмОрг,РазмНалЛьг,СумИсчисл", ",") Цикл 
					ОбластьДетализация.Области["ИсчНалИмОрг_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
				КонецЦикла;
				ОбластьДетализация.Области.ИсчНалИмОрг_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НомКадастрНИ") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
					
				Результат.Вывести(ОбластьДетализация);
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(Перерасчет) = Тип("СтрокаДереваЗначений") Тогда
			СтрокиПоПересчету = Перерасчет.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ПерНалИмОрг"));
			Для Каждого СтрокаПерерасчета0 Из СтрокиПоПересчету Цикл 
				ОбластьШапкаПерерасчета = Макет.ПолучитьОбласть("ПерНалИмОрг_Шапка");
				ОбластьШапкаПерерасчета.Области.СведИмОргПер_НомерСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "НомерСообщ");
				ОбластьШапкаПерерасчета.Области.СведИмОргПер_ДатаСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "ДатаСообщ");
				Результат.Вывести(ОбластьШапкаПерерасчета);
				
				СтрокиСведений = СтрокаПерерасчета0.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СведИмОргПер"));
				Если СтрокиСведений.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Результат.Вывести(Макет.ПолучитьОбласть("СведИмОргПер_ШапкаТабличнойЧасти"));
				Для Каждого СтрокаДанных Из СтрокиСведений Цикл 
					ОбластьДетализация = Макет.ПолучитьОбласть("ИсчНалИмОрг_Детализация");
					Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,ДоляИмОрг,НалСтав,ВладенИмОрг,РазмНалЛьг,СумИсчисл", ",") Цикл 
						ОбластьДетализация.Области["ИсчНалИмОрг_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
					КонецЦикла;
					ОбластьДетализация.Области.ИсчНалИмОрг_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НомКадастрНИ") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
						
					Результат.Вывести(ОбластьДетализация);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		Если ТипЗнч(Детализация) = Тип("СтрокаДереваЗначений") Тогда
			ПечатьДетализацииПоОКТМО(Детализация, Результат, Макет);
		КонецЕсли;
	КонецЕсли;
#КонецОбласти

#Область ЗемельныйНалог
	ДанныеПоНалогу = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ЗемНалог", "ИмяЭлемента");
	Если ТипЗнч(ДанныеПоНалогу) = Тип("СтрокаДереваЗначений") Тогда 
		ИсчисленоВсего = ЗначениеПодчиненногоЭлемента(ДанныеПоНалогу, "ЗемНалИсчисл");
		Исчислено = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ЗемНалог/ИсчЗемНал", "ИмяЭлемента");
		Перерасчет = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ЗемНалог/ПерЗемНал", "ИмяЭлемента");
		Детализация = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/СообщИсчНОНал/ЗемНалог/СумНалогОКТМО", "ИмяЭлемента");
		
		Если ТипЗнч(Исчислено) = Тип("СтрокаДереваЗначений") Тогда 
			Результат.Вывести(Макет.ПолучитьОбласть("ИсчЗемНал_Шапка"));
			
			Для Каждого СтрокаДанных Из Исчислено.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ИсчЗемНал")) Цикл 
				ОбластьДетализация = Макет.ПолучитьОбласть("ИсчЗемНал_Детализация");
				Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,ДоляЗУ,НалСтав,ВладенЗУ,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
					ОбластьДетализация.Области["ИсчЗемНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
				КонецЦикла;
				ОбластьДетализация.Области.ИсчЗемНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НомКадастрЗУ") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
					+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
					
				Результат.Вывести(ОбластьДетализация);
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(Перерасчет) = Тип("СтрокаДереваЗначений") Тогда 
			СтрокиПоПересчету = Перерасчет.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "ПерЗемНал"));
			Для Каждого СтрокаПерерасчета0 Из СтрокиПоПересчету Цикл 
				ОбластьШапкаПерерасчета = Макет.ПолучитьОбласть("ПерЗемНал_Шапка");
				ОбластьШапкаПерерасчета.Области.ПерЗемНал_НомерСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "НомерСообщ");
				ОбластьШапкаПерерасчета.Области.ПерЗемНал_ДатаСообщ.Значение = ЗначениеПодчиненногоЭлемента(СтрокаПерерасчета0, "ДатаСообщ");
				Результат.Вывести(ОбластьШапкаПерерасчета);
				
				СтрокиСведений = СтрокаПерерасчета0.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СведЗУПер"));
				Если СтрокиСведений.Количество() = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Результат.Вывести(Макет.ПолучитьОбласть("ПерЗемНал_ШапкаТабличнойЧасти"));
				Для Каждого СтрокаДанных Из СтрокиСведений Цикл 
					ОбластьДетализация = Макет.ПолучитьОбласть("ИсчЗемНал_Детализация");
					Для Каждого Подчиненный Из СтрРазделить("НалПер,НалБаза,ДоляЗУ,НалСтав,ВладенЗУ,ПовКоэф,РазмНалЛьг,СумИсчисл", ",") Цикл 
						ОбластьДетализация.Области["ИсчЗемНал_" + Подчиненный].Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, Подчиненный);
					КонецЦикла;
					ОбластьДетализация.Области.ИсчЗемНал_Описание.Значение = ЗначениеПодчиненногоЭлемента(СтрокаДанных, "НомКадастрЗУ") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "ОКТМО") + "; "
						+ ЗначениеПодчиненногоЭлемента(СтрокаДанных, "КодНО");
						
					Результат.Вывести(ОбластьДетализация);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(Детализация) = Тип("СтрокаДереваЗначений") Тогда
			ПечатьДетализацииПоОКТМО(Детализация, Результат, Макет);
		КонецЕсли;
	КонецЕсли;
#КонецОбласти
	
	Возврат Результат;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ЗначениеПодчиненногоЭлемента(СтрокаДанных, ИмяПодчиненного)
	ОтобранныеСтроки = СтрокаДанных.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", ИмяПодчиненного));
	Если ОтобранныеСтроки.Количество() = 1 Тогда 
		Возврат ОтобранныеСтроки[0].ЗначениеЭлемента;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция СтроковоеПредставлениеПериода(КодПериода)
	Если КодПериода = "21" Тогда 
		Возврат "I квартал";
	ИначеЕсли КодПериода = "22" Тогда 
		Возврат "II квартал";
	ИначеЕсли КодПериода = "23" Тогда 
		Возврат "III квартал";
	Иначе
		Возврат КодПериода;
	КонецЕсли;
КонецФункции

Процедура ПечатьДетализацииПоОКТМО(ДанныеПоСуммеНалога, Результат, Макет)
	СтрокиПоСуммеНалога = ДанныеПоСуммеНалога.Родитель.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СумНалогОКТМО"));
	Для Каждого СтрокаСуммы Из СтрокиПоСуммеНалога Цикл 
		ОбластьСуммаНалогаПоОКТМО = Макет.ПолучитьОбласть("СуммаНалогаПоОКТМО");
		ОбластьСуммаНалогаПоОКТМО.Области.СумНалогОКТМО.Значение = ЗначениеПодчиненногоЭлемента(СтрокаСуммы, "ОКТМО")
			+ " : " + ЗначениеПодчиненногоЭлемента(СтрокаСуммы, "СумИсчислОКТМО") + " руб.";
		Результат.Вывести(ОбластьСуммаНалогаПоОКТМО);
		
		СтрокиАвансов = СтрокаСуммы.Строки.НайтиСтроки(Новый Структура("ИмяЭлемента", "СумАвПлатПериод"));
		Для Каждого СтрокаАванса Из СтрокиАвансов Цикл 
			ОбластьАвансыПоОКТМО = Макет.ПолучитьОбласть("АвансыПоОКТМО");
			ОбластьАвансыПоОКТМО.Области.СумАвПлатПериод.Значение = 
				СтроковоеПредставлениеПериода(ЗначениеПодчиненногоЭлемента(СтрокаАванса, "Период"))
				+ " : " + ЗначениеПодчиненногоЭлемента(СтрокаАванса, "СумИсчислАвПлат") + " руб.";
			Результат.Вывести(ОбластьАвансыПоОКТМО);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецЕсли