#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьМаршруты(Параметры.Титул1);
	
	СтавкиНДС = Перечисления.КонтурЛогистика_СтавкиНДС.ПолучитьСписокДоступныхЗначенийСтавкиДляПЭ();
	Элементы.НалоговаяСтавка.СписокВыбора.ЗагрузитьЗначения(СтавкиНДС); 
	
	Исполнитель = Истина;
	ТипВвода = "Выбрать из справочника";
	ТипЮрЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо;
	
	НоваяСтрока = Транспорт.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	
	НоваяСтрокаВ = Водители.Добавить();
	НоваяСтрокаВ.ИдентификаторРодитель = НоваяСтрока.ИдентификаторСтроки;
	Элементы.ДобавитьВодителя.Заголовок = НоваяСтрока.ИдентификаторСтроки;
	
	Если Параметры.РежимРаботы = "ДобавитьУслугу" Тогда
		
		Маршрут = Параметры.Маршрут;
		Элементы.ГруппаТСиВодитель.Видимость = Ложь;
		ВидОперации = "Добавление";
	
	ИначеЕсли Параметры.РежимРаботы = "ДобавитьТСиВодитель" Тогда
			
		Маршрут = Параметры.Маршрут;
		Элементы.ГруппаТСиВодитель.Видимость = Истина;
		Услуга = Справочники.КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.НайтиСоздатьУслугуПеревозкиПоУмолчанию();
		// Услуга
		ТипТранспорта = Перечисления.КонтурЛогистика_ВидыТранспорта._1;
		ВидОперации = "Добавление";	
		
		Если ЗначениеЗаполнено(Маршрут) Тогда
			Элементы.Маршрут.ТолькоПросмотр = Истина; 
		КонецЕсли;	
	
	ИначеЕсли Параметры.РежимРаботы = "ИзменитьУслугу" Тогда
			
		Элементы.ГруппаТСиВодитель.Видимость = Ложь;
		
		ЗаполнитьПоляПоУслуге(Параметры.Услуга);
		Маршрут = Параметры.Маршрут;
		
		ВидОперации = "Изменение";
		ИдентификаторСтроки = Параметры.Услуга.ИдентификаторСтроки;
		
	ИначеЕсли Параметры.РежимРаботы = "ИзменитьТранспорт" Тогда
		
		Элементы.ГруппаТСиВодитель.Видимость = Истина;
		Элементы.ГруппаТС.Видимость = Ложь;
		
		ЗаполнитьПоляПоУслуге(Параметры.Услуга);
		Маршрут = Параметры.Маршрут;
		
		ВидОперации = "Изменение";
		ИдентификаторСтроки = Параметры.Услуга.ИдентификаторСтроки;	
		
		Если ЗначениеЗаполнено(Маршрут) Тогда
			Элементы.Маршрут.ТолькоПросмотр = Истина; 
		КонецЕсли;	
		
		ОтрисоватьДанныеПоТранспорту(Параметры.Транспорт, Параметры.Свойство("ТолькоПросмотрДокумента"));
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВалютаУчета) Тогда
		ВалютаУчета = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С("643", "руб");
	КонецЕсли;
		
	Если Параметры.Свойство("ТолькоПросмотрДокумента") Тогда
		Элементы.ГруппаОсновная.ТолькоПросмотр = Истина;
		Элементы.ФормаУдалитьУслугу.Видимость = Ложь;
		Элементы.ДобавитьТС.Доступность = Ложь;
	КонецЕсли;
	
	Если ВидОперации = "Добавление" Тогда
		Элементы.ФормаУдалитьУслугу.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипТранспортаПриИзменении(Элемент)
	УказыватьТолькоТипТранспорта = (ТипТранспорта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыТранспорта._1"));	
	Элементы.ГруппаОбщаяГруппаТранспорт.Видимость = УказыватьТолькоТипТранспорта;
	Элементы.ДобавитьТС.Доступность = УказыватьТолькоТипТранспорта; 
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ТипВводаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ТипЮрЛицаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВодителя(Команда)
	ДобавитьПолеВодительНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТС(Команда)
	Вызвать_ДобавитьБлокТСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	КонтекстПоУслуге = Новый Структура("Услуга, Маршрут, ТранспортВодители, ВидОперации");
	КонтекстПоУслуге.ВидОперации = ВидОперации;
	КонтекстПоУслуге.Вставить("ИдентификаторСтрокиУслуги", ИдентификаторСтроки); 
	Если ТипЮрЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ЮрЛицо") Тогда
		Телефон = "";
	КонецЕсли;
	
	Реквизиты = "Услуга, Количество, ТипТранспорта, Исполнитель, НазваниеОрганизации, ОрганизацияДиадок, ИНН, КПП, ОГРН, Телефон, Фамилия, Имя, Отчество, ТипЮрЛица";
	ДанныеПередачиУслуга = Новый Структура("ОбщСтУсл, НалСт, Валюта, " + Реквизиты, Стоимость, НалоговаяСтавка, ВалютаУчета);
	
	ЗаполнитьЗначенияСвойств(ДанныеПередачиУслуга, ЭтаФорма);
										 
	КонтекстПоУслуге.Услуга = ДанныеПередачиУслуга;
	КонтекстПоУслуге.Маршрут = Маршрут;									 
	
	Если ТипТранспорта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыТранспорта._1") Тогда

		ДанныеТранспорт = Новый Массив();

		Для Каждого ТС Из Транспорт Цикл

			Если ЗначениеЗаполнено(ТС.ИдентификаторСтроки) И ЗначениеЗаполнено(ТС.Транспорт) Тогда

				ТранспортСтруктура = Новый Структура("МассивВодителей, ТС, ТипТранспорта, ИдентификаторСтроки");
				ТранспортСтруктура.ТС = ТС.Транспорт;
				ТранспортСтруктура.ТипТранспорта = ТипТранспорта;
				ТранспортСтруктура.ИдентификаторСтроки = ТС.ИдентификаторСтроки;

				СтрокиВодители = Водители.НайтиСтроки(Новый Структура("ИдентификаторРодитель", ТС.ИдентификаторСтроки));

				МассивВодителей = Новый Массив();
				Для Каждого СтрокаВодитель Из СтрокиВодители Цикл
					Если ЗначениеЗаполнено(СтрокаВодитель.Водитель) Тогда
						МассивВодителей.Добавить(СтрокаВодитель.Водитель);
					КонецЕсли;
				КонецЦикла;

				ТранспортСтруктура.МассивВодителей = МассивВодителей;
				ДанныеТранспорт.Добавить(ТранспортСтруктура);
				
			КонецЕсли;

		КонецЦикла;

		КонтекстПоУслуге.ТранспортВодители = ДанныеТранспорт;

	КонецЕсли; 
	
	Закрыть(КонтекстПоУслуге);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУслугу(Команда)
	КонтекстПоУслуге = Новый Структура("Услуга, ВидОперации");
	КонтекстПоУслуге.ВидОперации = "Удаление";
	Закрыть(КонтекстПоУслуге);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.ГруппаВыборОрганизации.Видимость = НЕ Исполнитель;
	
	ВыбиратьИзСправочника = (ТипВвода = "Выбрать из справочника"); 

	Элементы.ГруппаВыбратьИзСправочника.Видимость = ВыбиратьИзСправочника;
	Элементы.ГруппаВвестиВручную.Видимость = Не ВыбиратьИзСправочника;
	ЭтоЮрЛицо = (ТипЮрЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ЮрЛицо"));
	Элементы.ГруппаВводВручнуюЮрЛицо.Видимость = ЭтоЮрЛицо;
	Элементы.ГруппаВводФизЛицо.Видимость = (ТипЮрЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо")); 
	Элементы.ГруппаВводИП.Видимость= (ТипЮрЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ИП"));
	Элементы.Телефон.Видимость = Не ЭтоЮрЛицо; 
	
КонецПроцедуры	 

&НаСервере
Процедура ОтрисоватьДанныеПоТранспорту(ДанныеТранспорт, ТолькоПросмотрФормы = Ложь)
	
	Транспорт.Очистить();
	Водители.Очистить();
	
	Для Каждого ТС Из ДанныеТранспорт Цикл
		
		НоваяСтрока = Транспорт.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТС);
		
		ЭлементКомандаДобавить = ДобавитьБлокТСНаСервере(ТС.ИдентификаторСтроки, Ложь);
		ЭлементКомандаДобавить.Видимость = Не ТолькоПросмотрФормы;
		
		ПервыйВодитель = Истина;
		Для Каждого Водитель Из ТС.МассивВодителей Цикл
			
			Если ПервыйВодитель Тогда 
				НоваяСтрокаВодитель = Водители.Получить(Водители.Количество()-1);
				ПервыйВодитель = Ложь;
			Иначе 
				НоваяСтрокаВодитель = Водители.Добавить();
				ДобавитьПолеВодительНаСервере(ЭлементКомандаДобавить, Ложь);
			КонецЕсли;	
	
			НоваяСтрокаВодитель.ИдентификаторРодитель = ТС.ИдентификаторСтроки;
			НоваяСтрокаВодитель.Водитель = Водитель;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	ТипТранспорта = ТС.ТипТранспорта;
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьПолеВодительНаСервере(Знач ЭлементКомандаДобавить = Неопределено, ДобавлятьЭлемент = Истина)
	
	Если ЭлементКомандаДобавить = Неопределено Тогда 
		ЭлементКомандаДобавить = ТекущийЭлемент;
	КонецЕсли;
			
	РодительГруппаТС = ЭлементКомандаДобавить.Родитель.Родитель;
	
	ТекущийИдентификатор = ЭлементКомандаДобавить.Заголовок;
	Если ДобавлятьЭлемент Тогда
		НовыйВодитель = Водители.Добавить();
		НовыйВодитель.ИдентификаторРодитель = ТекущийИдентификатор;
	КонецЕсли;
	
	ИндексВ = Водители.Количество()-1;
	ИндексСтрокой = Формат(ИндексВ, "ЧН=0; ЧГ=");
	
	НоваяГруппа = Элементы.Добавить("ГруппаВодитель" + ИндексСтрокой, Тип("ГруппаФормы"), РодительГруппаТС);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = ЛОЖЬ; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	НовыйЭлемент = Элементы.Добавить("Водитель" + ИндексСтрокой, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Водители[" + ИндексСтрокой + "].Водитель";
	НовыйЭлемент.Заголовок = " ";
	
	НовыйЭлемент.ПараметрыВыбора = Элементы.ГруппаВодитель.ПодчиненныеЭлементы.Водитель.ПараметрыВыбора;
	
	Элементы.Переместить(ЭлементКомандаДобавить, НоваяГруппа);
	
КонецПроцедуры

&НаСервере
Процедура Вызвать_ДобавитьБлокТСНаСервере(Знач Идентификатор = "",  ДобавлятьЭлементы = Истина)
	
	ДобавитьБлокТСНаСервере(Идентификатор,  ДобавлятьЭлементы);
	
КонецПроцедуры	

&НаСервере
Функция ДобавитьБлокТСНаСервере(Знач Идентификатор = "",  ДобавлятьЭлементы = Истина)
	
	РодительГруппа = Элементы.ГруппаОбщаяГруппаТранспорт;
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	Если ДобавлятьЭлементы Тогда
		НоваяСтрока = Транспорт.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Идентификатор;
	КонецЕсли;
	
	НоваяСтрока = Водители.Добавить();
	НоваяСтрока.ИдентификаторРодитель = Идентификатор;
	
	ИндексТС = Транспорт.Количество()-1;
	ИндексСтрокойТС = Формат(ИндексТС, "ЧН=0; ЧГ=");
	
	ИндексВ = Водители.Количество()-1;
	ИндексСтрокойВ = Формат(ИндексВ, "ЧН=0; ЧГ=");
	
	ГруппаТС = Элементы.Добавить("ГруппаТС" + ИндексСтрокойТС, Тип("ГруппаФормы"), РодительГруппа);
	ГруппаТС.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТС.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаТС.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаТС.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("ТС" + ИндексСтрокойТС, Тип("ПолеФормы"), ГруппаТС);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Транспорт[" + ИндексСтрокойТС + "].Транспорт";
	НовыйЭлемент.Заголовок = "Транспортное средство";
	
	НоваяГруппа = Элементы.Добавить("ГруппаВодитель" + ИндексСтрокойВ, Тип("ГруппаФормы"), ГруппаТС);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = ЛОЖЬ; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	НовыйЭлемент = Элементы.Добавить("Водитель" + ИндексСтрокойВ, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Водители[" + ИндексСтрокойВ + "].Водитель";
	НовыйЭлемент.Заголовок = "Водитель";
	
	НовыйЭлемент.ПараметрыВыбора = Элементы.ГруппаВодитель.ПодчиненныеЭлементы.Водитель.ПараметрыВыбора;
	
	НовыйЭлемент = Элементы.Добавить("ДобавитьВодителя" + ИндексСтрокойВ, Тип("КнопкаФормы"), НоваяГруппа);
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Заголовок = Идентификатор;
	НовыйЭлемент.ИмяКоманды = "ДобавитьВодителя";
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьМаршруты(Титул1)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 = &Титул1
	|	И НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Титул1", Титул1);
	
	МассивМаршрутов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Элементы.Маршрут.СписокВыбора.ЗагрузитьЗначения(МассивМаршрутов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляПоУслуге(ПереданнаяУслуга)
	
	Услуга = ПереданнаяУслуга.Услуга;
	ВалютаУчета = ПереданнаяУслуга.Валюта;
	Количество = ПереданнаяУслуга.Количество;
	НалоговаяСтавка = ПереданнаяУслуга.НалСт;
	Стоимость = ПереданнаяУслуга.ОбщСтУсл;
	
	Исполнитель = ПереданнаяУслуга.Исполнитель;
	
	Если Не Исполнитель Тогда
		
		Если ЗначениеЗаполнено(ПереданнаяУслуга.РекИдПредст) Тогда
			ОрганизацияДиадок = ПереданнаяУслуга.РекИдПредст;
			ТипВвода = "Выбрать из справочника";
		Иначе
			ОрганизацияДиадок = ПереданнаяУслуга.РекИдПредст;
			ТипВвода = "Ввести вручную";	
			
			ТипЮрЛица = ПереданнаяУслуга.ТипЮрЛица;
			НазваниеОрганизации = ПереданнаяУслуга.НазваниеОрганизации;
			ИНН = ПереданнаяУслуга.ИНН;
			КПП = ПереданнаяУслуга.КПП;
			ОГРН = ПереданнаяУслуга.ОГРН;
			Телефон = ПереданнаяУслуга.Телефон;
			Фамилия = ПереданнаяУслуга.Фамилия;
			Имя = ПереданнаяУслуга.Имя;
			Отчество = ПереданнаяУслуга.Отчество;
					
		КонецЕсли;	
		
	КонецЕсли;	 
	
КонецПроцедуры	

#КонецОбласти
