#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьУсловноеОформление();
	
	Дата = КонецГода(ТекущаяДатаСеанса());
	
	Если Объект.СтатьяРасходов = Неопределено Тогда
		Объект.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	КонецЕсли;
	Если Объект.СтатьяДоходов = Неопределено Тогда
		Объект.СтатьяДоходов = ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
	КонецЕсли;
		
	ИнициализацияФормыПриСозданииНаСервере();
	
	НастроитьЗависимыеЭлементыФормыНаСервере();
	  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Дата = КонецМесяца(Дата);
	ЗаполнитьТекущиеЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
	
	СтатьяДоходовРасходовПриИзмененииСервер("СтатьяРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидСтатьи", "СтатьяРасходов");
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовДоходовВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Объект.СтатьяРасходов);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДоходовПриИзменении(Элемент)
	
	СтатьяДоходовРасходовПриИзмененииСервер("СтатьяДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДоходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидСтатьи", "СтатьяДоходов");

	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовДоходовВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Объект.СтатьяДоходов);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура АналитикаРасходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст)
		ИЛИ АналитикаРасходовЗаказРеализация
	Тогда
		СтандартнаяОбработка = Ложь;
		АналитикаРасходовПолучениеДанныхВыбора(ДанныеВыбора, Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АналитикаРасходовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст)
		ИЛИ АналитикаРасходовЗаказРеализация
	Тогда
		СтандартнаяОбработка = Ложь;
		АналитикаРасходовПолучениеДанныхВыбора(ДанныеВыбора, Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВБУПриИзменении(Элемент)
	
	Элементы.УточнениеПериода.Доступность = ОтражатьВБУ;
	Если Не ОтражатьВБУ Тогда
		УточнениеПериода = Ложь;
	КонецЕсли;
	ЗаполнитьТекущиеЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВУУПриИзменении(Элемент)
	
	ЗаполнитьТекущиеЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеПериодаПриИзменении(Элемент)
	
	ЗаполнитьТекущиеЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаРасходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект.АналитикаРасходов = ВыбранноеЗначение.АналитикаРасходов;
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОС

&НаКлиенте
Процедура ОсновныеСредстваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВнеоборотныеАктивыКлиентСервер.ОбработкаВыбораЭлемента(Объект.ОсновныеСредства, "ОсновноеСредство", ВыбранноеЗначение).Количество() <> 0 Тогда
		ЗаполнитьТекущиеЗначенияПараметров(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ЗаполнитьТекущиеЗначенияПараметров(Ложь, Элементы.ОсновныеСредства.ТекущиеДанные.ОсновноеСредство);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Обработка.ГрупповоеИзменениеЭлементовАмортизации.ОсновныеСредства";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка из файла'");
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ОСДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
	
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОсновноеСредство) Тогда 
			Продолжить;
		КонецЕсли;
	
		НоваяСтрокаТовары = Объект.ОсновныеСредства.Добавить();
		НоваяСтрокаТовары.ОсновноеСредство = СтрокаТаблицы.ОсновноеСредство;
		НоваяСтрокаТовары.СрокИспользованияБУ = СтрокаТаблицы.СрокИспользованияБУ;
		НоваяСтрокаТовары.СрокИспользованияУУ = СтрокаТаблицы.СрокИспользованияУУ;
		НоваяСтрокаТовары.ОбъемНаработки = СтрокаТаблицы.ОбъемНаработки;
		НоваяСтрокаТовары.ЛиквидационнаяСтоимостьРегл = СтрокаТаблицы.ЛиквидационнаяСтоимостьРегл;
		НоваяСтрокаТовары.ЛиквидационнаяСтоимость = СтрокаТаблицы.ЛиквидационнаяСтоимость;
		
		ОСДобавлены = Истина;
	КонецЦикла;
	
	Если ОСДобавлены Тогда
		Модифицированность = Истина;
		ЗаполнитьТекущиеЗначенияПараметров();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	КоличествоСозданныхДокументов = 0;
	НачатьТранзакцию();
	Попытка
		Для Каждого Строка Из Объект.ОсновныеСредства Цикл
			
			ОтражатьВБУДляСтроки = (Строка.СостояниеБУ <> Перечисления.СостоянияОС.СнятоСУчета
										И Строка.СостояниеБУ <> Перечисления.СостоянияОС.НеПринятоКУчету
										И Строка.СостояниеБУ <> Перечисления.СостоянияОС.ПринятоКЗабалансовомуУчету
										И ОтражатьВБУ);
			ОтражатьВУУДляСтроки = (Строка.СостояниеУУ <> Перечисления.СостоянияОС.СнятоСУчета
										И Строка.СостояниеУУ <> Перечисления.СостоянияОС.НеПринятоКУчету
										И Строка.СостояниеУУ <> Перечисления.СостоянияОС.ПринятоКЗабалансовомуУчету
										И ОтражатьВУУ);

			Если ЗначениеЗаполнено(Строка.ДокументКорректировкиСтоимости)
				Или Строка.Организация <> Объект.Организация
				Или (Не ОтражатьВБУДляСтроки И Не ОтражатьВУУДляСтроки)
				Или Не (ЗначениеЗаполнено(Строка.СрокИспользованияБУ) Или
					ЗначениеЗаполнено(Строка.СрокИспользованияБУ) Или
					ЗначениеЗаполнено(Строка.СрокИспользованияУУ) Или
					ЗначениеЗаполнено(Строка.ОбъемНаработки) Или
					ЗначениеЗаполнено(Строка.ЛиквидационнаяСтоимостьРегл) Или
					ЗначениеЗаполнено(Строка.ЛиквидационнаяСтоимость)) Тогда
				Продолжить;
			Иначе
				НачатьТранзакцию();
				
				Попытка
					// Cоздаем документ ИзменениеПараметровОС2_4
					НовыйДокументИзменениеПараметровОС = Документы.ИзменениеПараметровОС2_4.СоздатьДокумент();
					НовыйДокументИзменениеПараметровОС.Дата = КонецМесяца(Дата);
					НовыйДокументИзменениеПараметровОС.Организация = Объект.Организация;
					НовыйДокументИзменениеПараметровОС.ОтражатьВУпрУчете = ОтражатьВУУДляСтроки;
					НовыйДокументИзменениеПараметровОС.ОтражатьВРеглУчете = ОтражатьВБУДляСтроки;
					НовыйДокументИзменениеПараметровОС.Ответственный = Пользователи.ТекущийПользователь();
					НовыйДокументИзменениеПараметровОС.Комментарий =
						НСтр("ru = 'Документ сформирован автоматически при групповом изменении элементов амортизации'");
					
					Стр = НовыйДокументИзменениеПараметровОС.ОС.Добавить();
					Стр.ОсновноеСредство = Строка.ОсновноеСредство;
					
					Если ЗначениеЗаполнено(Строка.СрокИспользованияБУ) Тогда
						НовыйДокументИзменениеПараметровОС.СрокИспользованияБУФлаг = Истина;
						НовыйДокументИзменениеПараметровОС.СрокИспользованияБУ = Строка.СрокИспользованияБУ;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.СрокИспользованияУУ) Тогда
						НовыйДокументИзменениеПараметровОС.СрокИспользованияУУФлаг = Истина;
						НовыйДокументИзменениеПараметровОС.СрокИспользованияУУ = Строка.СрокИспользованияУУ;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.ОбъемНаработки) Тогда
						НовыйДокументИзменениеПараметровОС.ОбъемНаработкиФлаг = Истина;
						НовыйДокументИзменениеПараметровОС.ОбъемНаработки = Строка.ОбъемНаработки;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.ЛиквидационнаяСтоимостьРегл) Тогда
						НовыйДокументИзменениеПараметровОС.ЛиквидационнаяСтоимостьРеглФлаг = Истина;
						НовыйДокументИзменениеПараметровОС.ЛиквидационнаяСтоимостьРегл = Строка.ЛиквидационнаяСтоимостьРегл;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Строка.ЛиквидационнаяСтоимость) Тогда
						НовыйДокументИзменениеПараметровОС.ЛиквидационнаяСтоимостьФлаг = Истина;
						НовыйДокументИзменениеПараметровОС.ЛиквидационнаяСтоимость = Строка.ЛиквидационнаяСтоимость;
					КонецЕсли;
					
					НовыйДокументИзменениеПараметровОС.Записать(РежимЗаписиДокумента.Проведение);
					
					// Cоздаем документ КорректировкаСтоимостиИАмортизацииОС
					НовыйДокументКорректировкаСтоимости = Документы.КорректировкаСтоимостиИАмортизацииОС.СоздатьДокумент();
					НовыйДокументКорректировкаСтоимости.Дата = КонецМесяца(Дата);
					НовыйДокументКорректировкаСтоимости.Организация = Объект.Организация;
					НовыйДокументКорректировкаСтоимости.ОтражатьВРеглУчете = НовыйДокументИзменениеПараметровОС.ОтражатьВРеглУчете;
					НовыйДокументКорректировкаСтоимости.ОтражатьВУпрУчете = НовыйДокументИзменениеПараметровОС.ОтражатьВУпрУчете;
					НовыйДокументКорректировкаСтоимости.Комментарий =
						НСтр("ru = 'Документ сформирован автоматически при групповом изменении элементов амортизации'");
					НовыйДокументКорректировкаСтоимости.Подразделение = Строка.Подразделение;
					НовыйДокументКорректировкаСтоимости.СобытиеОС = Событие;
					НовыйДокументКорректировкаСтоимости.СтатьяДоходов = Объект.СтатьяДоходов;
					НовыйДокументКорректировкаСтоимости.АналитикаДоходов = Объект.АналитикаДоходов;
					НовыйДокументКорректировкаСтоимости.АналитикаАктивовПассивовДоходов = Объект.АналитикаАктивовПассивовДоходов;
					НовыйДокументКорректировкаСтоимости.СчетУчетаДоходов = Объект.СчетУчетаДоходов;
					НовыйДокументКорректировкаСтоимости.Субконто1Доходов = Объект.Субконто1Доходов;
					НовыйДокументКорректировкаСтоимости.Субконто2Доходов = Объект.Субконто2Доходов;
					НовыйДокументКорректировкаСтоимости.Субконто3Доходов = Объект.Субконто3;
					НовыйДокументКорректировкаСтоимости.СтатьяРасходов = Объект.СтатьяРасходов;
					НовыйДокументКорректировкаСтоимости.АналитикаРасходов = Объект.АналитикаРасходов;
					НовыйДокументКорректировкаСтоимости.АналитикаАктивовПассивов = Объект.АналитикаАктивовПассивов;
					НовыйДокументКорректировкаСтоимости.СчетУчета = Объект.СчетУчета;
					НовыйДокументКорректировкаСтоимости.Субконто1 = Объект.Субконто1;
					НовыйДокументКорректировкаСтоимости.Субконто2 = Объект.Субконто2;
					НовыйДокументКорректировкаСтоимости.Субконто3 = Объект.Субконто3;
					НовыйДокументКорректировкаСтоимости.УточнениеПериода = УточнениеПериода;
					НовыйДокументКорректировкаСтоимости.Заполнить(НовыйДокументИзменениеПараметровОС.Ссылка);
					
					НовыйДокументКорректировкаСтоимости.Записать(РежимЗаписиДокумента.Проведение);
					
					ЗафиксироватьТранзакцию();
					КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1;
				Исключение
					ОтменитьТранзакцию();
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось создать документы по причине: %1'"),
						ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(
						ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
						УровеньЖурналаРегистрации.Предупреждение, 
						, 
						, 
						ТекстСообщения);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат КоличествоСозданныхДокументов;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(Объект.Организация)
		Или Не ЗначениеЗаполнено(Объект.СтатьяДоходов)
		Или Не ЗначениеЗаполнено(Объект.СтатьяРасходов)
		Или Не ЗначениеЗаполнено(Дата) Тогда
			ТекстСообщения = НСтр("ru='Заполните обязательные реквизиты'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
	ИначеЕсли Не ОтражатьВБУ И Не ОтражатьВУУ Тогда
		ТекстСообщения = НСтр("ru='Заполните признак отражения в учете'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	Иначе
		КоличествоСозданныхДокументов = СоздатьДокументыНаСервере();
		ШаблонСообщения = НСтр("ru='Создано %1 документов'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, КоличествоСозданныхДокументов);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЗаполнитьТекущиеЗначенияПараметров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыПодбора = ВнеоборотныеАктивыКлиентСервер.ПараметрыПодбора(Элементы.ОсновныеСредстваОсновноеСредство, ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ОбъектыЭксплуатации.ФормаВыбора", 
					ПараметрыПодбора, Элементы.ОсновныеСредства,,,,, 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтражениеВРеглУчете(Команда)

	ПараметрыОповещения = Новый Структура(
		"Постфикс",
		"");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаОтраженияВРеглУчетеЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	СтруктураЗаполнения = Новый Структура("СтатьяРасходов, АналитикаРасходов, АналитикаАктивовПассивов, СчетУчета, Субконто1, Субконто2, Субконто3");
	
	
	СтруктураЗаполнения.СтатьяРасходов           = Объект["СтатьяРасходов"];
	СтруктураЗаполнения.АналитикаРасходов        = Объект["АналитикаРасходов"];
	СтруктураЗаполнения.АналитикаАктивовПассивов = Объект["АналитикаАктивовПассивов"];
	СтруктураЗаполнения.СчетУчета                = Объект["СчетУчета"];
	СтруктураЗаполнения.Субконто1                = Объект["Субконто1"];
	СтруктураЗаполнения.Субконто2                = Объект["Субконто2"];
	СтруктураЗаполнения.Субконто3                = Объект["Субконто3"];
	
	Параметрыформы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаОтраженияВРеглУчете", СтруктураЗаполнения);
	
	РеглУчетКлиент.ОткрытьНастройкуОтраженияВРеглУчетеАктиваПассива(ЭтаФорма, ОписаниеОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтражениеВРеглУчетеДоходы(Команда)
	
	Постфикс = "Доходов"; 	
	
	ПараметрыОповещения = Новый Структура(
		"Постфикс",
		Постфикс);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаОтраженияВРеглУчетеЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	СтруктураЗаполнения = Новый Структура("СтатьяДоходов, АналитикаДоходов, АналитикаАктивовПассивов, СчетУчета, Субконто1, Субконто2, Субконто3");
	
	СтруктураЗаполнения.СтатьяДоходов           		= Объект["СтатьяДоходов"];
	СтруктураЗаполнения.АналитикаДоходов        		= Объект["АналитикаДоходов"];
	СтруктураЗаполнения.АналитикаАктивовПассивов		= Объект["АналитикаАктивовПассивов" + Постфикс];
	СтруктураЗаполнения.СчетУчета               	 	= Объект["СчетУчета" + Постфикс];
	СтруктураЗаполнения.Субконто1              			= Объект["Субконто1" + Постфикс];
	СтруктураЗаполнения.Субконто2              		 	= Объект["Субконто2" + Постфикс];
	СтруктураЗаполнения.Субконто3	               		= Объект["Субконто3" + Постфикс];
	
	Параметрыформы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаОтраженияВРеглУчете", СтруктураЗаполнения);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СоответствиеИменРеквизитов", 
		Новый Структура("СтатьяДоходов, АналитикаДоходов, АналитикаАктивовПассивовДоходов, СчетУчетаДоходов, Субконто1Доходов, Субконто2Доходов, Субконто3Доходов"));

	РеглУчетКлиент.ОткрытьНастройкуОтраженияВРеглУчетеАктиваПассива(ЭтаФорма, ОписаниеОповещения, ПараметрыФормы, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваНомерСтроки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваОсновноеСредство.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваИнвентарныйНомер.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваОрганизация.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваПодразделение.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСостояниеБУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСостояниеУУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСрокИспользованияБУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСрокИспользованияУУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваОбъемНаработки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваЛиквидационнаяСтоимостьРегл.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваЛиквидационнаяСтоимость.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваДокументКорректировкиСтоимости.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОсновныеСредства.ДокументКорректировкиСтоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ДобавленныйРеквизитФон);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваНомерСтроки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваОсновноеСредство.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваИнвентарныйНомер.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваОрганизация.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваПодразделение.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСостояниеБУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСостояниеУУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСрокИспользованияБУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваСрокИспользованияУУ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваОбъемНаработки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваЛиквидационнаяСтоимостьРегл.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваЛиквидационнаяСтоимость.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОсновныеСредстваДокументКорректировкиСтоимости.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОсновныеСредства.ДокументКорректировкиСтоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ПравоСозданияФон);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеЗначенияПараметров(ТолькоДополнительнаяИнформация = Истина, ВыбранноеОсновноеСредство = Неопределено)
	
	//++Локализация
	
	Если Объект.ОсновныеСредства.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОбъектыЭксплуатации.Ссылка КАК ОсновноеСредство,
	|	ОбъектыЭксплуатации.Ссылка.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ПорядокУчетаОССрезПоследних.ГруппаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(ПорядокУчетаОССрезПоследних.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(ПорядокУчетаОССрезПоследних.ПоказательНаработки, НЕОПРЕДЕЛЕНО) КАК ПоказательНаработки,
	|	ЕСТЬNULL(ПорядокУчетаОССрезПоследних.ОбъемНаработки, НЕОПРЕДЕЛЕНО) КАК ОбъемНаработки,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.СрокИспользования, 0) КАК СрокИспользованияУУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0) КАК СрокИспользованияДляВычисленияАмортизацииУУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.КоэффициентУскорения, 0) КАК КоэффициентУскоренияУУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.МетодНачисленияАмортизации, НЕОПРЕДЕЛЕНО) КАК МетодНачисленияАмортизацииУУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.ЛиквидационнаяСтоимостьРегл, 0) КАК ЛиквидационнаяСтоимостьРегл,
	|	ЕСТЬNULL(ПорядокУчетаОСУУСрезПоследних.НачислятьАмортизациюУУ, ЛОЖЬ) КАК НачислятьАмортизациюУУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОССрезПоследних.ДатаВводаВЭксплуатациюУУ, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1) КАК ПринятКУчетуУпр,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.СрокПолезногоИспользованияБУ, 0) КАК СрокИспользованияБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.СрокПолезногоИспользованияНУ, 0) КАК СрокИспользованияНУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.СрокИспользованияДляВычисленияАмортизации, 0) КАК СрокИспользованияДляВычисленияАмортизацииБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.КоэффициентАмортизацииБУ, 0) КАК КоэффициентАмортизацииБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.КоэффициентУскорения, 0) КАК КоэффициентУскоренияБУ,
	|	ЕСТЬNULL(ПорядокУчетаОСБУСрезПоследних.НачислятьАмортизациюБУ, ЛОЖЬ) КАК НачислятьАмортизациюБУ,
	|	ЕСТЬNULL(ПорядокУчетаОСБУСрезПоследних.НачислятьАмортизациюНУ, ЛОЖЬ) КАК НачислятьАмортизациюНУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОССрезПоследних.МетодНачисленияАмортизацииБУ, НЕОПРЕДЕЛЕНО) КАК МетодНачисленияАмортизации,
	|	ЕСТЬNULL(ПервоначальныеСведенияОССрезПоследних.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1) КАК ПринятКУчетуРегл,
	|	ВЫБОР
	|		КОГДА ПорядокУчетаОСБУСрезПоследних.СостояниеБУ <> ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|			ТОГДА ПорядокУчетаОСБУСрезПоследних.СостояниеБУ
	|		ИНАЧЕ ЕСТЬNULL(ПорядокУчетаОСБУСрезПоследних.СостояниеНУ, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету))
	|	КОНЕЦ КАК СостояниеБУ,
	|	ЕСТЬNULL(ПорядокУчетаОСУУСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеУУ,
	|	ЕСТЬNULL(МестонахождениеОС.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(МестонахождениеОС.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	КорректировкаСтоимостиИАмортизацииОСОС.Ссылка КАК ДокументКорректировкиСтоимости
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСУУ.СрезПоследних(&Период, ОсновноеСредство В (&СписокОС)) КАК ПараметрыАмортизацииОСУУСрезПоследних
	|		ПО (ПараметрыАмортизацииОСУУСрезПоследних.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОС.СрезПоследних(&Период, ОсновноеСредство В (&СписокОС)) КАК ПорядокУчетаОССрезПоследних
	|		ПО (ПорядокУчетаОССрезПоследних.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСУУ.СрезПоследних(&Период, ОсновноеСредство В (&СписокОС)) КАК ПорядокУчетаОСУУСрезПоследних
	|		ПО (ПорядокУчетаОСУУСрезПоследних.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(, ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОССрезПоследних
	|		ПО (ПервоначальныеСведенияОССрезПоследних.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБУ.СрезПоследних(&Период, ОсновноеСредство В (&СписокОС)) КАК ПараметрыАмортизацииОСБУСрезПоследних
	|		ПО (ПараметрыАмортизацииОСБУСрезПоследних.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(&Период, ОсновноеСредство В (&СписокОС)) КАК ПорядокУчетаОСБУСрезПоследних
	|		ПО (ПорядокУчетаОСБУСрезПоследних.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&Период, ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОС
	|		ПО (МестонахождениеОС.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиИАмортизацииОС.ОС КАК КорректировкаСтоимостиИАмортизацииОСОС
	|		ПО (КорректировкаСтоимостиИАмортизацииОСОС.ОсновноеСредство = ОбъектыЭксплуатации.Ссылка)
	|			И (КорректировкаСтоимостиИАмортизацииОСОС.Ссылка.Проведен)
	|			И (&ОтражатьВБУ = КорректировкаСтоимостиИАмортизацииОСОС.Ссылка.ОтражатьВРеглУчете)
	|			И (&ОтражатьВУУ = КорректировкаСтоимостиИАмортизацииОСОС.Ссылка.ОтражатьВУпрУчете)
	|			И (&УточнениеПериода = КорректировкаСтоимостиИАмортизацииОСОС.Ссылка.УточнениеПериода)
	|			И (&Период = КорректировкаСтоимостиИАмортизацииОСОС.Ссылка.Дата)
	|ГДЕ
	|	ОбъектыЭксплуатации.Ссылка В(&СписокОС)";

	
	Запрос = Новый Запрос(ТекстЗапроса);
	Если ВыбранноеОсновноеСредство = Неопределено Тогда
		Запрос.УстановитьПараметр("СписокОС", Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство"));
	Иначе
		Запрос.УстановитьПараметр("СписокОС", ВыбранноеОсновноеСредство);
	КонецЕсли;
	Запрос.УстановитьПараметр("Период", КонецДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("ОтражатьВБУ", ОтражатьВБУ);
	Запрос.УстановитьПараметр("ОтражатьВУУ", ОтражатьВУУ);
	Запрос.УстановитьПараметр("УточнениеПериода", УточнениеПериода);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для каждого ДанныеСтроки Из Объект.ОсновныеСредства Цикл
		ТекущиеЗначения = Результат.Найти(ДанныеСтроки.ОсновноеСредство, "ОсновноеСредство");
		Если ТекущиеЗначения <> Неопределено Тогда
			Если ТолькоДополнительнаяИнформация Тогда
				ДанныеСтроки.ИнвентарныйНомер = ТекущиеЗначения.ИнвентарныйНомер;
				ДанныеСтроки.СостояниеБУ = ТекущиеЗначения.СостояниеБУ;
				ДанныеСтроки.СостояниеУУ = ТекущиеЗначения.СостояниеУУ;
				ДанныеСтроки.Организация = ТекущиеЗначения.Организация;
				ДанныеСтроки.Подразделение = ТекущиеЗначения.Подразделение;
				ДанныеСтроки.ДокументКорректировкиСтоимости = ТекущиеЗначения.ДокументКорректировкиСтоимости;
			Иначе
				ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущиеЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//--Локализация
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтраженияВРеглУчетеЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Постфикс = ПараметрыОповещения.Постфикс;
	
	Объект["СчетУчета" + Постфикс] = Результат.СчетУчета;
	Объект["Субконто1" + Постфикс] = Результат.Субконто1;
	Объект["Субконто2" + Постфикс] = Результат.Субконто2;
	Объект["Субконто3" + Постфикс] = Результат.Субконто3;
	ЭтаФорма.Элементы["НастроитьОтражениеВРеглУчете" + Постфикс].Заголовок = РеглУчетВызовСервера.ПредставлениеОтраженияВРеглУчете(Результат);
	
КонецПроцедуры

&НаСервере
Процедура СтатьяДоходовРасходовПриИзмененииСервер(ИмяСтатьи)
	
	Если ИмяСтатьи = "СтатьяДоходов" Тогда
		
		Если ТипЗнч(Объект.СтатьяДоходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
			
			ДоходыИРасходыСервер.СтатьяАктивовПассивовПриИзменении(
				Объект,
				Объект.СтатьяДоходов,
				Объект.АналитикаАктивовПассивовДоходов);
				
			Объект.АналитикаДоходов = Неопределено;
			
		Иначе
			
			ДоходыИРасходыСервер.СтатьяДоходовПриИзменении(
				Объект,
				Объект.СтатьяДоходов,
				,
				Объект.АналитикаДоходов);
			
			Объект.АналитикаАктивовПассивовДоходов = Неопределено;
			
			АналитикаДоходовОбязательна =
				ЗначениеЗаполнено(Объект.СтатьяДоходов)
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтатьяДоходов, "КонтролироватьЗаполнениеАналитики");
		КонецЕсли;
		
	ИначеЕсли ИмяСтатьи = "СтатьяРасходов" Тогда
		
		Если ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
			
			ДоходыИРасходыСервер.СтатьяАктивовПассивовПриИзменении(
				Объект,
				Объект.СтатьяРасходов,
				Объект.АналитикаАктивовПассивов);
				
			Объект.АналитикаРасходов = Неопределено;
			
		Иначе
			
			ДоходыИРасходыСервер.СтатьяРасходовПриИзменении(
				Объект,
				Объект.СтатьяРасходов,
				Объект.АналитикаРасходов);
			
			Объект.АналитикаАктивовПассивов = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьЗависимыеЭлементыФормыНаСервере("СтатьяРасходов");
	НастроитьЗависимыеЭлементыФормыНаСервере("СтатьяДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовДоходовВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект[ДополнительныеПараметры.ВидСтатьи] = Результат;
		СтатьяДоходовРасходовПриИзмененииСервер(ДополнительныеПараметры.ВидСтатьи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АналитикаРасходовПолучениеДанныхВыбора(ДанныеВыбора, Текст)
	
	ДанныеВыбора = Новый СписокЗначений;
	ПродажиСервер.ЗаполнитьДанныеВыбораАналитикиРасходов(ДанныеВыбора, Текст);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормыПриСозданииНаСервере()

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихАктивовПассивов") Тогда
		Элементы.СтатьяРасходов.Заголовок = НСтр("ru = 'Статья расходов'");
		Элементы.СтатьяДоходов.Заголовок = НСтр("ru = 'Статья доходов'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЗависимыеЭлементыФормыНаСервере(ИзмененныеРеквизиты = "")

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходов") 
		ИЛИ ОбновитьВсе Тогда
		
		Если ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
			
			АналитикаРасходовОбязательна = Ложь;
			АналитикаРасходовЗаказРеализация = Ложь;
			
		Иначе
			
			АналитикаРасходовОбязательна = 
				ЗначениеЗаполнено(Объект.СтатьяРасходов)
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтатьяРасходов, "КонтролироватьЗаполнениеАналитики");
				
			АналитикаРасходовЗаказРеализация = 
				ЗначениеЗаполнено(Объект.СтатьяРасходов)
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтатьяРасходов, "АналитикаРасходовЗаказРеализация");
			
		КонецЕсли;
		
		НаСтатьиАктивовПассивов = (ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
		Элементы.АналитикаРасходов.Видимость = НЕ НаСтатьиАктивовПассивов;
		Элементы.АналитикаРасходов.Доступность = ЗначениеЗаполнено(Объект.СтатьяРасходов);
		Элементы.АналитикаАктивовПассивов.Видимость = НаСтатьиАктивовПассивов;
		Элементы.АналитикаАктивовПассивов.Доступность = 
			ЗначениеЗаполнено(Объект.СтатьяРасходов) 
			И Не ТипЗнч(Объект.АналитикаАктивовПассивов) = Тип("ПеречислениеСсылка.СтатьиБезАналитики");
			
		Элементы.АналитикаРасходов.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Объект.АналитикаРасходов)));
		Элементы.АналитикаАктивовПассивов.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Объект.АналитикаАктивовПассивов)));
			
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("СтатьяДоходов") 
		ИЛИ ОбновитьВсе Тогда
		
		Если ТипЗнч(Объект.СтатьяДоходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
			
			АналитикаДоходовОбязательна = Ложь;
			АналитикаДоходовЗаказРеализация = Ложь;
			
		Иначе
			
			АналитикаДоходовОбязательна = 
				ЗначениеЗаполнено(Объект.СтатьяДоходов)
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтатьяДоходов, "КонтролироватьЗаполнениеАналитики");
							
		КонецЕсли;
		
		НаСтатьиАктивовПассивов = (ТипЗнч(Объект.СтатьяДоходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
		Элементы.АналитикаДоходов.Видимость = НЕ НаСтатьиАктивовПассивов;
		Элементы.АналитикаДоходов.Доступность = ЗначениеЗаполнено(Объект.СтатьяДоходов);
		Элементы.АналитикаАктивовПассивовДоходов.Видимость = НаСтатьиАктивовПассивов;
		Элементы.АналитикаАктивовПассивовДоходов.Доступность = 
			ЗначениеЗаполнено(Объект.СтатьяДоходов) 
			И Не ТипЗнч(Объект.АналитикаАктивовПассивовДоходов) = Тип("ПеречислениеСсылка.СтатьиБезАналитики");
			
		Элементы.АналитикаДоходов.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Объект.АналитикаДоходов)));
		Элементы.АналитикаАктивовПассивовДоходов.ОграничениеТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Объект.АналитикаАктивовПассивовДоходов)));
			
	КонецЕсли;
	
	//++ Локализация
	Если ОбновитьВсе Тогда
		Элементы.НастроитьОтражениеВРеглУчете.Заголовок = РеглУчетВызовСервера.ПредставлениеОтраженияВРеглУчете(Объект);
		Элементы.НастроитьОтражениеВРеглУчетеДоходов.Заголовок = РеглУчетВызовСервера.ПредставлениеОтраженияВРеглУчете(
			Новый Структура("СчетУчета, Субконто1, Субконто2, Субконто3", Объект.СчетУчетаДоходов, Объект.Субконто1Доходов, Объект.Субконто2Доходов, Объект.Субконто3Доходов));
	КонецЕсли;
	
	//-- Локализация
		
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяРасходов")
		ИЛИ ОбновитьВсе Тогда
		НаСтатьиАктивовПассивов = (ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
		Элементы.ГруппаОтражениеВРеглУчете.Видимость = ЭтаФорма.ОтражатьВБУ И НаСтатьиАктивовПассивов;
	КонецЕсли;
	
	Если СтруктураИзмененныхРеквизитов.Свойство("ОтражатьВРеглУчете")
		ИЛИ СтруктураИзмененныхРеквизитов.Свойство("СтатьяДоходов")
		ИЛИ ОбновитьВсе Тогда
		НаСтатьиАктивовПассивов = (ТипЗнч(Объект.СтатьяДоходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
		Элементы.ГруппаОтражениеВРеглУчетеДоходов.Видимость = ЭтаФорма.ОтражатьВБУ И НаСтатьиАктивовПассивов;
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти