&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = Параметры.Организация;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаявления(Пустое)
	
	Если Пустое Тогда
		ОткрытьФорму("Справочник.ЗаявленияОбОтзывеМЧДФНС.ФормаОбъекта", , ЭтотОбъект);
	Иначе
		Если ЗначениеЗаполнено(ЭтотОбъект.Доверенность) Тогда
			ОткрытьФорму("Справочник.ЗаявленияОбОтзывеМЧДФНС.ФормаОбъекта", Новый Структура("Доверенность", Доверенность), ЭтотОбъект);	
		Иначе
			Сообщить("Не указана доверенность.");
		КонецЕсли;
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьИЗаполнитьЗаявлениеОбОтзывеМЧДФНС(Команда)
	
	ОткрытьФормуЗаявления(Ложь);
							
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПустоеЗаявление(Команда)
	
	ОткрытьФормуЗаявления(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Владелец			= Новый Структура("Владелец", Организация);
	ПараметрыВыбора     = Новый Структура("Отбор", Владелец);
	ОткрытьФорму("Справочник.МашиночитаемыеДоверенностиФНС.ФормаВыбора", ПараметрыВыбора, Элемент);
				
КонецПроцедуры