
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	
	ЛогистическаяСущность = ПараметрКоманды;
	
	ТекДанные = Форма.Элементы.СвязанныеОбъекты.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		УИД = "";
		ТипЗначенияУИД = "";
	Иначе
		УИД = ТекДанные.УИД;
		ТипЗначенияУИД = ТекДанные.ТипЗначенияУИД;
	КонецЕсли;
	
	УчетнаяСущность = Неопределено;
	
	НастройкиКонвертации = ОбработкаКомандыНаСервере(ЛогистическаяСущность, УИД, ТипЗначенияУИД, УчетнаяСущность);
	
	Если НастройкиКонвертации.Количество() > 1 Тогда
		
		СписокНастроек = Новый СписокЗначений;
		Для каждого ТекущаяНастройка Из НастройкиКонвертации Цикл
			СписокНастроек.Добавить(ТекущаяНастройка, ПредставлениеНастройкиКонвертации(ТекущаяНастройка));
		КонецЦикла;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЛогистическаяСущность", ЛогистическаяСущность);
		ДополнительныеПараметры.Вставить("УчетнаяСущность", УчетнаяСущность);
		
		ОписаниеОповещения = КонтурЛогистика_СтдОбщегоНазначенияКлиент.ОписаниеОповещения(
			"ОбработчикВыбораНастройкиКонвертацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		КонтурЛогистика_СтдДиалогиКлиент.ПоказатьВыборЭлементаСпискаЗначений(
			СписокНастроек, ОписаниеОповещения, "Выберите настройку конвертации");
		
	КонецЕсли;
	
	Форма.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораНастройкиКонвертацииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СинхронизироватьПоВыбраннойНастройкеКонвертации(
		ВыбранноеЗначение.Значение, ДополнительныеПараметры.ЛогистическаяСущность, ДополнительныеПараметры.УчетнаяСущность);
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьПоВыбраннойНастройкеКонвертации(НастройкаКонвертации, ЛогистическаяСущность, УчетнаяСущность)
	
	// Указываем к контексте явно по какой настройке следует конвертировать объект
	КонтекстНастройкиКонвертации = ПолучитьКонтекстНастройкиКонвертации(ЛогистическаяСущность, УчетнаяСущность);
	КонтекстНастройкиКонвертации.ЕстьКонвертация = Истина;
	КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации = Истина;
	КонтекстНастройкиКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Расширенная;
	КонтекстНастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы = Истина;
	КонтекстНастройкиКонвертации.НастройкаКонвертации = НастройкаКонвертации;
	
	Синхронизировать(КонтекстНастройкиКонвертации, ЛогистическаяСущность, УчетнаяСущность);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеНастройкиКонвертации(Настройка)
	
	Представление = ?(ЗначениеЗаполнено(Настройка.РеквизитТитула), "(" + Настройка.РеквизитТитула + ") ", "") + Настройка.Наименование;
	
	Возврат Представление;
	
Конецфункции

&НаСервере
Функция ОбработкаКомандыНаСервере(ЛогистическаяСущность, УИД, ТипЗначенияУИД, УчетнаяСущность)
	
	НастройкиКонвертации = Новый Массив;
	
	СвязанныеОбъекты = ЛогистическаяСущность.СвязанныеОбъекты;
	
	Если СвязанныеОбъекты.Количество() <> 1 Тогда
		Возврат НастройкиКонвертации;
	КонецЕсли;
	
	УчетнаяСущность = СвязанныеОбъекты[0].СвязанныйОбъект;
	
	Если ЗначениеЗаполнено(УИД) И ЗначениеЗаполнено(ТипЗначенияУИД) Тогда
		УчетнаяСущность = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСсылкуПоУИД(УИД, ТипЗначенияУИД);
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(УчетнаяСущность))
		Или ТипЗнч(УчетнаяСущность) = Тип("Строка") Тогда
		
		КонтекстНастройкиКонвертации = ПолучитьКонтекстНастройкиКонвертации(ЛогистическаяСущность, УчетнаяСущность);
		Если КонтекстНастройкиКонвертации.ЕстьКонвертация
			И КонтекстНастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы Тогда
			
			Синхронизировать(КонтекстНастройкиКонвертации, ЛогистическаяСущность, УчетнаяСущность);
			
		Иначе
			
			Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(УчетнаяСущность)) Тогда
				ТипСправочникаИлиДокументаУС = УчетнаяСущность.Метаданные().Имя;
			Иначе
				ТипСправочникаИлиДокументаУС = Строка(ТипЗнч(УчетнаяСущность));
			КонецЕсли;
			
			ТипСправочникаЛогистика = ЛогистическаяСущность.Метаданные().Имя;
			
			НастройкиКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьНастройкиКонвертацииСОбновлениемРеквизитов(
				ТипСправочникаИлиДокументаУС, ТипСправочникаЛогистика);
			
			Если НастройкиКонвертации.Количество() = 0 Тогда
				
				КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
					ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС);
					
				Если КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация Тогда
						
					КонтекстНастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы = Истина;
					Синхронизировать(КонтекстНастройкиКонвертации, ЛогистическаяСущность, УчетнаяСущность);		
					
				Иначе
				
					Сообщить("" + ЛогистическаяСущность + " не обновлен из связанного объекта.
						|Не найдена настройка конвертации с включеным флагом ""Обновлять реквизиты из учетной системы"".");
					
				КонецЕсли;
				
			ИначеЕсли НастройкиКонвертации.Количество() = 1 Тогда
				
				КонтекстНастройкиКонвертации.ЕстьКонвертация = Истина;
				КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации = Истина;
				КонтекстНастройкиКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Расширенная;
				КонтекстНастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы = Истина;
				КонтекстНастройкиКонвертации.НастройкаКонвертации = НастройкиКонвертации[0];
				
				Синхронизировать(КонтекстНастройкиКонвертации, ЛогистическаяСущность, УчетнаяСущность);
				
			Иначе
				
				Возврат НастройкиКонвертации;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Сообщить("Связный объект не ссылка и не строка. Обновление запрещено.");
		
	КонецЕсли;
	
	Возврат НастройкиКонвертации;
	
КонецФункции

&НаСервере
Функция ПолучитьКонтекстНастройкиКонвертации(ЛогистическаяСущность, УчетнаяСущность)
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(УчетнаяСущность)) Тогда
		ТипСправочникаИлиДокументаУС = УчетнаяСущность.Метаданные().Имя;
	Иначе
		ТипСправочникаИлиДокументаУС = Строка(ТипЗнч(УчетнаяСущность));
	КонецЕсли;
	
	ТипСправочникаЛогистика = ЛогистическаяСущность.Метаданные().Имя;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
		ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС);
	
	Возврат КонтекстНастройкиКонвертации;
	
КонецФункции

&НаСервере
Процедура Синхронизировать(КонтекстНастройкиКонвертации, ЛогистическаяСущность, УчетнаяСущность)
	
	РезультатСинхронизации = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_СинхронизироватьРеквизитыУчетнойИЛогистическойСущностей(
		УчетнаяСущность, ЛогистическаяСущность, КонтекстНастройкиКонвертации);
	
	Если РезультатСинхронизации.Успешно Тогда
		Сообщить("" + ЛогистическаяСущность + " обновлен из связанного объекта.");
	Иначе
		Сообщить("" + ЛогистическаяСущность + " не обновлен из связанного объекта.");
	КонецЕсли;
	
КонецПроцедуры
