
&После("ПередЗаписью")
Процедура ОД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для каждого СтрокаДок Из Распоряжения Цикл
	
		Если ТипЗнч(СтрокаДок.Распоряжение) <> Тип("ДокументСсылка.Рекламация") Тогда
			Продолжить;
		КонецЕсли;

		РекламацияВес = 0;
		РекламацияОбъем = 0;
		Для каждого Т Из СтрокаДок.Распоряжение.Комплектующие Цикл
			ВесОбъем = ОД_ОбщиеФункции.ПолучитьВесОбъемДляСтроки(Т);
			РекламацияВес = РекламацияВес + ВесОбъем.Вес;
			РекламацияОбъем = РекламацияОбъем + ВесОбъем.Объем;
		КонецЦикла;
		
		СтрокаДок.Вес = РекламацияВес;
		СтрокаДок.Объем = РекламацияОбъем;
		
		СтрокаДок.ПолучательОтправитель = СтрокаДок.Распоряжение.Партнер;
	КонецЦикла;
	
	Для каждого СтрокаДок Из Маршрут Цикл
	
		НайденыСтроки = Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаДок.КлючСвязи));
		
		КлючВес = 0;
		КлючОбъем = 0;
		Для каждого Т Из НайденыСтроки Цикл
			КлючВес = КлючВес + Т.Вес;
			КлючОбъем = КлючОбъем + Т.Объем;
		КонецЦикла;
		
		СтрокаДок.Вес = КлючВес;
		СтрокаДок.Объем = КлючОбъем;
	КонецЦикла;
	
	// Вес и Объем в единицах измерения
	Вес   = Маршрут.Итог("Вес") * ДоставкаТоваров.КоэффициентПересчетаВТонны();
	Объем = Маршрут.Итог("Объем") * ДоставкаТоваров.КоэффициентПересчетаВКубическиеМетры();
	
КонецПроцедуры
