#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ЕстьНашиПВ = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиПВВОрганизациях();
	Элементы.ФормаСоздатьПереадресовку.Видимость = ЕстьНашиПВ;	
	
КонецПроцедуры

#КонецОбласти           

&НаКлиенте
Процедура СоздатьПереадресовку(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для оформления переадресовки перейдите в список документов ЭТрН и нажмите ""Переадресовать""");
		
КонецПроцедуры