
&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаКлиенте
Перем РезультатЗапроса;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта = Неопределено Тогда
		КэшМодуляОбъекта = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента() Экспорт
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = ТипЗнч(ЭтаФорма) Тогда
		Результат = ВладелецФормы.МодульКлиента();
	Иначе
		ПутьКФорме = ПутьКФормеМодуляКлиента();
		Результат = ОткрытьФорму(ПутьКФорме);
	КонецЕсли;
	
	КэшМодуляКлиента = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПутьКФормеМодуляКлиента()
	
	Возврат МодульОбъекта().ПутьКФормеМодуляКлиента();
	
КонецФункции

&НаКлиенте
Функция ВидКлиента()
	
	Результат = "";
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = "Толстый клиент (обычное приложение)";
	#КонецЕсли
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Результат = "Толстый клиент (управляемое приложение)";
	#КонецЕсли
	
	#Если ТонкийКлиент  Тогда
		Результат = "Тонкий клиент";
	#КонецЕсли
	
	#Если ВебКлиент   Тогда
		Результат = "Веб-клиент";
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТехИнформация = ТекстИнформацииДляТехПоддержки();
	
КонецПроцедуры

&НаКлиенте
Функция ТекстИнформацииДляТехПоддержки()
	
	ДанныеДляТехподдержки = КонтурЛогистика_ОбщегоНазначенияСервер.ИнформацияДляПоддержки();
	
	ИнформацияОМодуле = ДанныеДляТехподдержки.ИнформацияОМодуле;
	ИнформацияОКонфигурации = ДанныеДляТехподдержки.ИнформацияОКонфигурации;
	ИнформацияОНастройках = ДанныеДляТехподдержки.ИнформацияОНастройкахМодуля;
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	ИнформацияОРасширениях = ДанныеДляТехподдержки.ИнформацияОРасширениях;
	ИнформацияОСервере = ДанныеДляТехподдержки.ИнформацияОСервере;
	
	ТекстИнформации =
	"Техническая информация:
	|
	|Версия модуля: %ВерсияМодуля%
	|Версия плагина криптографии: %ВерсияПлагина%
	|Расположение модуля: %РасположениеМодуля%
	|Имя модуля: %ИмяМодуля%
	|Подключаемый модуль: %ПодключаемыйМодуль%
	|
	|Конфигурация: %Конфигурация%
	|Версия конфигурации: %ВерсияКонфигурации%
	|Тип платформы: %ТипПлатформы%
	|Версия платформы: %ВерсияПриложения%
	|Версия ОС клиента: %ВерсияОС%
	|Версия ОС сервера: %ВерсияОСНаСервере%
	|Вид клиента: %ВидКлиента%
	|Основной режим запуска: %ОсновнойРежимЗапуска%
	|Строка соединения: %СтрокаСоединения%
	|Режим совместимости: %ВерсияРежимаСовместимости%
	|
	|Настройки модуля:
	|Окружение: %Окружение%
	|Идентификатор базы: %ИдентификаторБазы%
	|Идентификатор базы (общепродуктовый): %ОбщепродуктовыйИдентификаторБазы%
	|Логин авторизации Диадок API: %ЛогинАвторизацииДиадокАПИ%
	|Используется подпись на сервере: %РазрешитьПодписьНаСервере%
	|Расположение сертификатов: %РасположениеСертификатов%
	|Используется прокси: %Прокси_Использовать%
	|
	|Дополнительные расширения:
	|%ИнформацияОРасширениях%";
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияМодуля%", ИнформацияОМодуле.ВерсияМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияПлагина%", ИнформацияОМодуле.ВерсияПлагина);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%РасположениеМодуля%", ИнформацияОМодуле.РасположениеМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ИмяМодуля%", ИнформацияОМодуле.ИмяМодуля);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ПодключаемыйМодуль%", ИнформацияОНастройках.ПодключаемыйМодуль);
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%Конфигурация%", ИнформацияОКонфигурации.Конфигурация);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияКонфигурации%", ИнформацияОКонфигурации.ВерсияКонфигурации);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ТипПлатформы%", ИнформацияОСистеме.ТипПлатформы);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияПриложения%", ИнформацияОСистеме.ВерсияПриложения);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияОС%", ИнформацияОСистеме.ВерсияОС);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияОСНаСервере%", ИнформацияОСервере.ВерсияОС);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВидКлиента%", ВидКлиента());
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ОсновнойРежимЗапуска%", ИнформацияОКонфигурации.ОсновнойРежимЗапуска);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%СтрокаСоединения%", ИнформацияОКонфигурации.СтрокаСоединения);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ВерсияРежимаСовместимости%", ИнформацияОКонфигурации.ВерсияРежимаСовместимости);
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%Окружение%", ИнформацияОНастройках.Окружение);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ИдентификаторБазы%", ИнформацияОНастройках.ИдентификаторБазы);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ОбщепродуктовыйИдентификаторБазы%", ИнформацияОНастройках.ОбщепродуктовыйИдентификаторБазы);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ЛогинАвторизацииДиадокАПИ%", ИнформацияОНастройках.ЛогинАвторизацииДиадокАПИ);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%РазрешитьПодписьНаСервере%", ИнформацияОНастройках.РазрешитьПодписьНаСервере);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%РасположениеСертификатов%", ИнформацияОНастройках.РасположениеСертификатов);
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%Прокси_Использовать%", ИнформацияОНастройках.Прокси_Использовать);
	
	ТекстИнформации = СтрЗаменить(ТекстИнформации, "%ИнформацияОРасширениях%", ИнформацияОРасширениях.СписокРасширений);
	
	Возврат ТекстИнформации;
	
КонецФункции