#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		
		ТекущаяЗапись = РегистрыСведений.НастройкиКадровогоУчета.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.Прочитать();
		ДополнительныеСвойства.Вставить("ТекущиеНастройки",
			ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(ТекущаяЗапись, Метаданные()));
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	КадровыйУчет.ПриЗаписиНастроекКадровогоУчета(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли