#Область ОбработчикиСобытийФормы
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СсылкаНаЗагрузку", СсылкаНаЗагрузку);
	Параметры.Свойство("НомерВерсии", НомерВерсии);
	
	Элементы.ТекстРучноеОбновлениеПункт2БезПрав.Видимость = 
		Не КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистраторУчетнойСистемы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОбновление(Команда)
		
	СтруктураОбновления = Новый Структура("СсылкаНаЗагрузку, НомерВерсии", СсылкаНаЗагрузку, НомерВерсии);			
	ВыбратьКаталогИЗагрузитьОбновлениеПодсистемы(СтруктураОбновления);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Если Элементы.ЛоадерЗагрузкаОбновления.Видимость Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗакрытьФормуЗавершение", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Идет загрузка обновления. Закрыть форму?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	Иначе
		Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаОбновления

&НаКлиенте
Процедура ВыбратьКаталогИЗагрузитьОбновлениеПодсистемы(СтруктураОбновления)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл("ЗагрузитьОбновлениеПодсистемыВКаталог", ЭтаФорма, РежимДиалогаВыбораФайла.ВыборКаталога, 
		"Выберите каталог хранения обновлений", КаталогЗагрузкиОбновлений,,	Ложь,, СтруктураОбновления);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновлениеПодсистемыВКаталог(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		КаталогОбновленияВерсии = СформироватьНазваниеКаталогаВерсий(Результат, ДополнительныеПараметры);		
		
		КаталогВерсии = Новый Файл(КаталогОбновленияВерсии);
		Если НЕ КаталогВерсии.Существует() Тогда
			СоздатьКаталог(КаталогОбновленияВерсии);
		КонецЕсли;
		
		НачатьЗагрузкуОбновления(ДополнительныеПараметры.СсылкаНаЗагрузку);

	Иначе
		
		Сообщить("Не выбран каталог загрузки архива версии. Загрузка остановлена.");
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуОбновления(СсылкаНаЗагрузку)
	
	Элементы.ЛоадерЗагрузкаОбновления.Видимость = Истина;
	
	АдресВХранилище_ЗагрузитьОбновление = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыФоновогоЗадания = Новый Структура;	
	ПараметрыФоновогоЗадания.Вставить("СсылкаНаЗагрузку", СсылкаНаЗагрузку);
	
	РезультатЗапуска = КонтурЛогистика_ОбновлениеКлиент.НачатьЗагрузкуДанных(АдресВХранилище_ЗагрузитьОбновление, ПараметрыФоновогоЗадания);
	
	Если РезультатЗапуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапуска.Статус = "Выполнено" Тогда
		ЗаполнитьЗагруженныеДанныеОбновленииНаФормеИзХранилища();
	Иначе
		ИдентификаторФЗ_ЗагрузитьОбновление = РезультатЗапуска.ИдентификаторЗадания;
		
		Если Не ИдентификаторФЗ_ЗагрузитьОбновление = Неопределено Тогда
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ЗагрузитьОбновление", 1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ЗагрузитьОбновление() Экспорт
	
	Если КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ЗагрузитьОбновление, Элементы.ЛоадерЗагрузкаОбновления) Тогда
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ЗагрузитьОбновление", 2, Истина);
	Иначе
		ЗаполнитьЗагруженныеДанныеОбновленииНаФормеИзХранилища();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗагруженныеДанныеОбновленииНаФормеИзХранилища()
	
	ДвоичныеДанныеОбновленияПодсистемы = ПолучитьИзВременногоХранилища(АдресВХранилище_ЗагрузитьОбновление);
	
	Если ДвоичныеДанныеОбновленияПодсистемы <> Неопределено Тогда
			
		АрхивВерсии = КаталогОбновленияВерсии + "\update.zip";		
		ДвоичныеДанныеОбновленияПодсистемы.Записать(АрхивВерсии);		
		
		Архив = Новый ЧтениеZipФайла(АрхивВерсии);	
		Архив.ИзвлечьВсе(КаталогОбновленияВерсии);
		
		ЗапуститьПриложение(КаталогОбновленияВерсии);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьНазваниеКаталогаВерсий(Результат, ДополнительныеПараметры)
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		КаталогЗагрузкиОбновлений = Результат;
	Иначе
		КаталогЗагрузкиОбновлений = Результат[0];
	КонецЕсли;

	НомерВерсии = ДополнительныеПараметры.НомерВерсии;
	
	Возврат КаталогЗагрузкиОбновлений + "\" + НомерВерсии;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросЗакрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

   Закрыть();

КонецПроцедуры

#КонецОбласти