#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда 
		
		ТипДокумента = ДанныеЗаполнения.ТипДокумента;
		
		ТекстФайла = ДанныеЗаполнения.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ДанныеЗаполнения + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		// Идентификатор в Логистике
		kl_id       = ДанныеЗаполнения.kl_id;
		
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		Если XDTO = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда 
			
			КС = КонтурЛогистика_КонструкторыXDTO;
			СодИнфГО = КС.XDTO_Вычислить(XDTO, "Документ.СодИнфГО");
			Если СодИнфГО = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			УИД_ТрН_ИзПула = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "УИД_ТрН"); // мог быть отправлен "из пула", тогда он есть сразу в Т1 
			Если ЗначениеЗаполнено(УИД_ТрН_ИзПула) Тогда 
				УИД = УИД_ТрН_ИзПула;
			КонецЕсли;
			
			НомерТрН 	= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "НомерТрН");
			ДатаТрН_raw = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "ДатаТрН");
			ДатаТрН     = КС.Конвертировать_ДатаТип_вДата(ДатаТрН_raw);
			НомЗак 		= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "НомЗак");
			ДатаЗак_raw	= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "ДатаЗак");
			ДатаЗак     = КС.Конвертировать_ДатаТип_вДата(ДатаЗак_raw);
			
			СвГО = КС.XDTO_Вычислить(СодИнфГО, "СвГО");
			ЭтоЭкспедиция = Ложь;
			Если СвГО <> Неопределено Тогда
				ГОЭксп = КС.XDTO_ПолучитьЗначениеСвойства(СвГО, "ГОЭксп");
				ЭтоЭкспедиция = ГОЭксп = "1";
			КонецЕсли;
			
			// если указана эл. заказ (заявка) то найти её
			ИдЗак =  КС.XDTO_Вычислить(СодИнфГО, "ИдЗак");
			Если ИдЗак <> Неопределено Тогда 
				ИдФайлЗак = КС.XDTO_ПолучитьЗначениеСвойства(ИдЗак, "ИдФайлЗак")
			КонецЕсли;                                                         
			НайденныйФайлЗЗ = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиФайлОбменаПоИмениФайла(ИдФайлЗак);
			Если ЗначениеЗаполнено(НайденныйФайлЗЗ) Тогда 
				ЗаказЗаявкаОснование = НайденныйФайлЗЗ.ГлавныйДокумент;
			КонецЕсли;
			
			ИдентификаторыУчастниковЭДО = КС.ИдентификаторыСторонИзИмениФайлаТитула(
				ДанныеЗаполнения.ИмяФайла, КС.XDTO_ПолучитьЗначениеСвойства(XDTO, "ИдФайл"));
			
			Если СвГО <> Неопределено Тогда
				Грузоотправитель 	= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
					КС.XDTO_ПолучитьЗначениеСвойства(СвГО, "РекИдентГО"), ИдентификаторыУчастниковЭДО.Грузоотправитель, Истина);
				// для юрлиц может быть указан КПП не равный организации ящика	
				ГрузоотправительКПП = КС.XDTO_Вычислить(СвГО, "РекИдентГО.ИдСв.СвЮЛУч.КПП");
			КонецЕсли;
			
			СвПер = КС.XDTO_Вычислить(СодИнфГО, "СвПер");
			Если СвПер <> Неопределено Тогда // в черновике может не быть перевозчика
				Перевозчик 			= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
					СвПер, ИдентификаторыУчастниковЭДО.Грузоперевозчик, Истина);
				// для юрлиц может быть указан КПП не равный организации ящика	
				ПеревозчикКПП = КС.XDTO_Вычислить(СвПер, "ИдСв.СвЮЛУч.КПП");
			КонецЕсли;
				
			СвГП = КС.XDTO_Вычислить(СодИнфГО, "СвГП");
			Если СвГП <> Неопределено Тогда // в черновике может не быть ГП
				Грузополучатель 	= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
												КС.XDTO_ПолучитьЗначениеСвойства(СвГП, "РекИдентГП"), ИдентификаторыУчастниковЭДО.Грузополучатель, Истина);
				// для юрлиц может быть указан КПП не равный организации ящика	
				ГрузополучательКПП = КС.XDTO_Вычислить(СвГП, "РекИдентГП.ИдСв.СвЮЛУч.КПП");	
				
				АдресДостГрXDTO = КС.XDTO_ПолучитьЗначениеСвойства(СвГП, "АдресДостГр");
				МестоДоставки = КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(АдресДостГрXDTO);
				
				Если АдресДостГрXDTO <> Неопределено Тогда
					ГЛНТочкиДоставкиИзФайла = КС.XDTO_ПолучитьЗначениеСвойства(АдресДостГрXDTO, "ГЛН");
					Если ЗначениеЗаполнено(ГЛНТочкиДоставкиИзФайла) Тогда
						GLNТочкиДоставки = СокрЛП(ГЛНТочкиДоставкиИзФайла);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтоЭкспедиция Тогда
				СвЗак = КС.XDTO_Вычислить(СодИнфГО, "СвЗак");
				Если СвЗак <> Неопределено Тогда
					ЭкспедицияЗаказчик = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СвЗак, "РекИдентЗак"));
					ДогУслПерXDTO = КС.XDTO_Вычислить(СвЗак, "ДогУслПер");
					ЭкспедицияДоговор		 = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ДогУслПерXDTO);
				КонецЕсли;
			КонецЕсли;
			
			СвТС = КС.XDTO_Вычислить(СодИнфГО, "СвТС");
			Если СвТС <> Неопределено Тогда // в черновике может не быть ТС
				ТранспортноеСредство = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СвТС, "ТС"));
				ПрицепыXDTOМассив = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_ПолучитьЗначениеСвойства(СвТС, "Прицеп"));
				Если ПрицепыXDTOМассив <> Неопределено Тогда
					КоличествоПрицепов = ПрицепыXDTOМассив.Количество();
					
					Если КоличествоПрицепов > 0 Тогда
						Прицеп = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ПрицепыXDTOМассив[0]);
						
						Если КоличествоПрицепов > 1 Тогда
							Прицеп2 = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ПрицепыXDTOМассив[1]);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СвПогруз = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз");
			Если СвПогруз <> Неопределено Тогда // в черновике может не быть места погрузки
				МестоПогрузки  		= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(
					КС.XDTO_ПолучитьЗначениеСвойства(СвПогруз, "ФАдресПогр"), КС.XDTO_ПолучитьЗначениеСвойства(СвПогруз, "ВладИнфр"));
			КонецЕсли;
			
			СвВодит = КС.XDTO_Вычислить(СодИнфГО, "СвВодит");
			Если СвВодит <> Неопределено Тогда // в черновике может не быть водителя
				
				СвВодитМассив = КС.XDTO_ВычислитьМассивXDTO(СвВодит);				
				Если СвВодитМассив <> Неопределено И СвВодитМассив.Количество() > 0 Тогда
					
					Тлф = КС.XDTO_Вычислить(СвВодитМассив[0], "Тлф");
					Если Тлф <> Неопределено Тогда
						
						ТлфМассив = КС.XDTO_ВычислитьМассивXDTO(Тлф);						
						Если ТлфМассив <> Неопределено И ТлфМассив.Количество() > 0 Тогда
							ТелефонВодителя = ТлфМассив[0];
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ГрузоотправительПодразделение = ДанныеЗаполнения.ОтправительПодразделение;
			ГрузополучательПодразделение = ДанныеЗаполнения.ПолучательПодразделение;
			// ПеревозчикПодразделение = эмм, а откуда брать?  TODO
			
			СвЛицПогрГр_СовпГОП = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.СовпГОП");
			Если СвЛицПогрГр_СовпГОП = "1" Тогда
				
				ПогрузкуОсуществляет = Грузоотправитель;
				ПогрузкуОсуществляетКПП = ГрузоотправительКПП;
				
			Иначе
				
				ПогрузкуОсуществляет = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РекЛицПогрГр"), 
						ИдентификаторыУчастниковЭДО.Грузоотправитель, 
						Истина);
				ПогрузкуОсуществляетКПП = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РекЛицПогрГр.ИдСв.СвЮЛУч.КПП"); 
				
				Если ДанныеЗаполнения.Отправитель = ПогрузкуОсуществляет Тогда 
					ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			ОснПогрГрXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.ОснПогрГр");
			ПогрузкаДоговор		 = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ОснПогрГрXDTO);
			
			РабЛицПогрГрXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РабЛицПогрГр");
			ПогрузкаСотрудник    = КС.Конвертировать_РабЛицПогрГр_вСотрудникаЛогистика(РабЛицПогрГрXDTO);
			
			СрокДоставки		= КС.XDTO_Вычислить(СодИнфГО, "УказГО.СрокДостГр");
			ДатаВремяДоставкиRAW= КС.XDTO_Вычислить(СодИнфГО, "УказГО.ДатВрДостГр");
			Если ЗначениеЗаполнено(ДатаВремяДоставкиRAW) Тогда 
            	ДатаВремяДоставки	= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатаВремяДоставкиRAW);
			КонецЕсли;
			
			МаршрутТекст		= КС.XDTO_Вычислить(СодИнфГО, "УказГО.МршПрвз.МршТекст");
			МаршрутМашиночитаемый = КС.XDTO_Вычислить(СодИнфГО, "УказГО.МршПрвз.МршМашЧит");
			
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 Тогда 
			
		Иначе
			 Сообщить("Обработка заполнения Документа ЭТРН из " + ТипДокумента + " не поддерживается");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		
		РассчитатьПодразделения();
		РассчитатьПартнеров();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьПодразделения()

	Если Не ЗначениеЗаполнено(ГрузоотправительПодразделение) И ЗначениеЗаполнено(Грузоотправитель) Тогда
		ГрузоотправительПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Грузоотправитель, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПеревозчикПодразделение) И ЗначениеЗаполнено(Перевозчик) Тогда
		ПеревозчикПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Перевозчик, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГрузополучательПодразделение) И ЗначениеЗаполнено(Грузополучатель) Тогда
		ГрузополучательПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Грузополучатель, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПогрузкуОсуществляетПодразделение) И ЗначениеЗаполнено(ПогрузкуОсуществляет) Тогда
		ПогрузкуОсуществляетПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(ПогрузкуОсуществляет, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнеров()

	Если Не ЗначениеЗаполнено(ПартнерГрузоотправитель) И ЗначениеЗаполнено(Грузоотправитель) Тогда
		РассчитатьПартнераГО();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПартнерПеревозчик) И ЗначениеЗаполнено(Перевозчик) Тогда
		РассчитатьПартнераПВ();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПартнерГрузополучатель) И ЗначениеЗаполнено(Грузополучатель) Тогда
		РассчитатьПартнераГП();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераГО()

	Если ЗначениеЗаполнено(Грузоотправитель) Тогда 
		ПартнерГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Грузоотправитель);
	Иначе
		ПартнерГрузоотправитель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераПВ()

	Если ЗначениеЗаполнено(Перевозчик) Тогда 
		ПартнерПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Перевозчик);
	Иначе
		ПартнерПеревозчик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераГП()

	Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
		ПартнерГрузополучатель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	// Приоритет: существующие соответствия (ОпределитьПартнера), затем по кэшу партнеров EDI
	ПартнерГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Грузополучатель);
	
	Если Не ЗначениеЗаполнено(ПартнерГрузополучатель) Тогда
		ПартнерГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.EDI_ПартнерПоДокументу(
			ПартнерГрузополучатель,
			Грузополучатель);
	КонецЕсли;

КонецПроцедуры

#КонецЕсли