// Добавление дополнительных реквизитов:
// 1. Проверить снят ли с поддержки объект конфигурации, форма элемента и табличная часть, если реквизит добавляется в нее 
// 2. Для добавления дополнительных реквизитов нужно добавить реквизит в справочник или документ с префиксом в имени "КонтурЛогистика_". 
//	  Синоним будет отображаться на форме, как заголовок реквизита 
// 3. На форме элемента обязательно должен быть элемент вида "Панель" с наименованием "Панель" или "ОсновнаяПанель". Если есть панель с другим наименованием, то его нужно добавить
//    в массив в функцию НаименованияПанелей()
// 4. В процедуру ПриОткрытии() в форме элемента объекта, куда добавляем реквизит добавить код:
//      // КонтурЛогистика
//	    КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФ.ВывестиДополнительныеРеквизиты(ЭтаФорма, Ссылка);
//	    // Конец КонтурЛогистика
// 5. Если добавляемые реквизиты требуется разбить на группы, то нужно добавить описание реквизитов в манифест в процедуру ДобавитьДополнительныеРеквизиты(СписокДопРеквизитов) 
//    или создать свою процедуру (см. СписокДополнительныхРеквизитов()) 

#Область Манифест

Функция СписокДополнительныхРеквизитов() Экспорт
	
	СписокДопРеквизитов = Новый Структура;
	
	ДобавитьДополнительныеРеквизиты_РТУ(СписокДопРеквизитов); 
	ДобавитьДополнительныеРеквизиты_Склады(СписокДопРеквизитов);
	ДобавитьДополнительныеРеквизиты_ФизическиеЛица(СписокДопРеквизитов);
	
	ДобавитьДополнительныеРеквизиты(СписокДопРеквизитов);
		
	Возврат СписокДопРеквизитов;
	
КонецФункции

Процедура ДобавитьДополнительныеРеквизиты_РТУ(СписокДопРеквизитов)
	
	СписокРеквизитовОбъекта = Новый Структура;
	
	// Основные
	
	СписокРеквизитовГруппы = Новый Структура;
	
	// Номер заказа
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Номер заказа:";	
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "НомЗак", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");		
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_НомерЗаказа", ОписаниеРеквизита);
	
	// Дата заказа
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Дата заказа:";	
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДатаЗак", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ДатаЗаказа", ОписаниеРеквизита);
	
	// Перевозчик
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Перевозчик:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "Перевозчик", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Перевозчик", ОписаниеРеквизита);
	
	// Транспотрное средство
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Транспортное средство:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ТранспортноеСредство", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ТранспортноеСредство", ОписаниеРеквизита);
	
	// Прицеп
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Прицеп:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "Прицеп", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Прицеп", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Водитель:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "Водитель", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Водитель", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Заявленная дата подачи ТС:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДатаВремяПодачиПлановая", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ЗаявленнаяДатаПодачиТС", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Фактическая дата подачи ТС:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДатаВремяПрибытия", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ФактическаяДатаПодачиТС", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Фактическая дата убытия ТС:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДатаВремяУбытия", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ФактическаяДатаУбытияТС", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Основная";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_Основная", ОписаниеГруппыОбъекта);
			
	// Группа Сведения о погрузке
	
	СписокРеквизитовГруппы = Новый Структура;
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Лицо осуществляющее погрузку:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ПогрузкуОсуществляет", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ПогрузкуОсуществляет", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта(); 
	ОписаниеРеквизита.Заголовок = "Кладовщик:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ПогрузкаСотрудник", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ПогрузкуОсуществляетСотрудник", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Договор:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ПогрузкаДоговор", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ПогрузкуОсуществляетДоговор", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Сведения о погрузке";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_СведенияОПогрузке", ОписаниеГруппыОбъекта);
	
	// Группа Экспедиция
	
	СписокРеквизитовГруппы = Новый Структура;
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.ЭтоФлажок = Истина;
	ОписаниеРеквизита.Заголовок = "Это экспедиция";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ЭтоЭкспедиция", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ЭтоЭкспедиция", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта(); 
	ОписаниеРеквизита.Заголовок = "Заказчик:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ЭкспедицияЗаказчик", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ЭкспедицияЗаказчик", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Договор:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ЭкспедицияДоговор", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ЭкспедицияДоговор", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Экспедиция";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_ГруппаЭкспедиция", ОписаниеГруппыОбъекта);
	
	// Группа Собственник
	
	СписокРеквизитовГруппы = Новый Структура;
		
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Собственник:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "Собственник", "РеализацияТоваровУслуг", "КонтурЛогистика_ПунктыМаршрута", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Собственник", ОписаниеРеквизита);
		
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта(); 
	ОписаниеРеквизита.Заголовок = "Договор:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДоступКОбъектуДоговор", "РеализацияТоваровУслуг", "КонтурЛогистика_ПунктыМаршрута", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_СобственникДоговор", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Если нет договора с собственником, причина:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДоступКОбъектуТекст", "РеализацияТоваровУслуг", "КонтурЛогистика_ПунктыМаршрута", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_НетДоговораСобственникТекст", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Собственник";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_ГруппаСобственник", ОписаниеГруппыОбъекта); 
			
	// Гуппа Переадресация
	
	СписокРеквизитовГруппы = Новый Структура;
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Кто может переадресовать ТС:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ИнициаторПереадресации", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ИнициаторПереадресации", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта(); 
	ОписаниеРеквизита.Заголовок = "Контакты лица, назначающего переадресовку:";
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_КонтактыИнициатораПереадресации", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Переадресация";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_Переадресация", ОписаниеГруппыОбъекта);
			
	// Табличная часть Товары
	
	СписокРеквизитовТЧ = Новый Структура;
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Состояние груза";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "СостояниеГруза", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовТЧ.Вставить("КонтурЛогистика_СостояниеГруза", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Вид тары";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ВидТары", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовТЧ.Вставить("КонтурЛогистика_ВидТары", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Количество мест";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "КоличествоМест", "РеализацияТоваровУслуг", "ТрН_Титул1", "РеализацияТоваровУслуг");
	СписокРеквизитовТЧ.Вставить("КонтурЛогистика_КоличествоМест", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Опасный груз";
	ОписаниеРеквизита.ЭтоФлажок = Истина;
	СписокРеквизитовТЧ.Вставить("КонтурЛогистика_ЭтоОпасныйГруз", ОписаниеРеквизита);
	
	ОписаниеТЧОбъекта = ОписаниеТЧОбъекта();
	ОписаниеТЧОбъекта.ЗаголовокТЧ = "Дополнительные реквизиты (К.Логистика)";
	ОписаниеТЧОбъекта.ЗаголовокДляНастроек = "Табличная часть ""Товары""";
	ОписаниеТЧОбъекта.Реквизиты = СписокРеквизитовТЧ;
	СписокРеквизитовОбъекта.Вставить("Товары", ОписаниеТЧОбъекта);
	
	СписокДопРеквизитов.Вставить("РеализацияТоваровУслуг", СписокРеквизитовОбъекта);
	
КонецПроцедуры

Процедура ДобавитьДополнительныеРеквизиты_Склады(СписокДопРеквизитов)
	
	СписокРеквизитовОбъекта = Новый Структура;
	
	СписокРеквизитовГруппы = Новый Структура;
		
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Собственник:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "Собственник", "Склады", "КонтурЛогистика_ПунктыМаршрута", "Склады");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Собственник", ОписаниеРеквизита);
		
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта(); 
	ОписаниеРеквизита.Заголовок = "Договор:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДоступКОбъектуДоговор", "Склады", "КонтурЛогистика_ПунктыМаршрута", "Склады");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_СобственникДоговор", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Если нет договора с собственником, причина:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ДоступКОбъектуТекст", "Склады", "КонтурЛогистика_ПунктыМаршрута", "Склады");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_НетДоговораСобственникТекст", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Основная";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_Основная", ОписаниеГруппыОбъекта);
	
	СписокДопРеквизитов.Вставить("Склады", СписокРеквизитовОбъекта);
	
КонецПроцедуры

Процедура ДобавитьДополнительныеРеквизиты_ФизическиеЛица(СписокДопРеквизитов)
	
	СписокРеквизитовОбъекта = Новый Структура;
	
	СписокРеквизитовГруппы = Новый Структура;
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Номер ВУ:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ВУНомер", "ФизическиеЛица", "КонтурЛогистика_Сотрудники", "ФизическиеЛица");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_НомерВУ", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Серия ВУ:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ВУСерия", "ФизическиеЛица", "КонтурЛогистика_Сотрудники", "ФизическиеЛица");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_СерияВУ", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Дата выдачи ВУ:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ВУДатаВыдачи", "ФизическиеЛица", "КонтурЛогистика_Сотрудники", "ФизическиеЛица");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_ДатаВыдачиВУ", ОписаниеРеквизита);
	
	ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	ОписаниеРеквизита.Заголовок = "Телефон:";
	ДобавитьАвтоконвертацию(ОписаниеРеквизита, "ТелефонОсновной", "ФизическиеЛица", "КонтурЛогистика_Сотрудники", "ФизическиеЛица");
	СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Телефон", ОписаниеРеквизита);
	
	ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Основная";
	ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_Основная", ОписаниеГруппыОбъекта);
	
	СписокДопРеквизитов.Вставить("ФизическиеЛица", СписокРеквизитовОбъекта);
	
КонецПроцедуры

Процедура ДобавитьДополнительныеРеквизиты(СписокДопРеквизитов)
	
	// Здесь можно описать дополнительные реквизиты
	
	СписокРеквизитовОбъекта = Новый Структура;
		
	//Пример
	
	//СписокРеквизитовГруппы = Новый Структура;
	
	//// Пример описания реквизита
	//ОписаниеРеквизита = ОписаниеРеквизитаОбъекта();
	//ОписаниеРеквизита.Заголовок = "Собственник:";                                        
	//СписокРеквизитовГруппы.Вставить("КонтурЛогистика_Собственник", ОписаниеРеквизита);   //"КонтурЛогистика_Собственник" - наименование реквизита в метаданных 
		
	//// Добавление рекизита в группу	
	//ОписаниеГруппыОбъекта = ОписаниеГруппыОбъекта();
	//ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Основная";
	//ОписаниеГруппыОбъекта.Реквизиты = СписокРеквизитовГруппы;
	//СписокРеквизитовОбъекта.Вставить("КонтурЛогистика_Основная", ОписаниеГруппыОбъекта);  //"КонтурЛогистика_Основная" - наименование группы элементов на форме (без пробелов и уникальное)
	
	//СписокДопРеквизитов.Вставить("Склады", СписокРеквизитовОбъекта);                      // "Склады" - имя объекта метаданных в который добавляются реквизиты
	
КонецПроцедуры

Функция ОписаниеРеквизитаОбъекта() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Заголовок", "");       // Заголовок реквизита на форме
	Описание.Вставить("ЭтоФлажок", Ложь);	  // Признак флажка 
	Описание.Вставить("Отображать", Истина);  // Не заполнять через манифест! Используется для хранения значение из справочника настроек
	
	Описание.Вставить("СписокСвойствАвтоконвертации", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеГруппыОбъекта() Экспорт 
	
	Описание = Новый Структура;                     
	Описание.Вставить("ЗаголовокГруппы", "");       // Заголовок дополнительной закладки на форме
	Описание.Вставить("Реквизиты", "");             // Список реквизитов в иде структур ОписаниеРеквизитаОбъекта()
	Описание.Вставить("тзРазметка", Неопределено);  // Не заполнять через манифест! Используется в дальнейшем для выравнивания ЭФ
		
	Возврат Описание;
	
КонецФункции

Функция ОписаниеТЧОбъекта() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("ЗаголовокТЧ", "");
	Описание.Вставить("ЗаголовокДляНастроек", "");
	Описание.Вставить("Реквизиты", "");
		
	Возврат Описание;
	
КонецФункции

Функция НаименованияПанелей() Экспорт

	Наименования = Новый Массив;
	Наименования.Добавить("ОсновнаяПанель");  
	Наименования.Добавить("Панель");
	Наименования.Добавить("ПанельПутевогоЛиста");
	Наименования.Добавить("Панель1");
	
	Возврат Наименования;
	
КонецФункции

Функция ОписаниеСтруктурыСвойстваАвтоконвертации()
	
	СвойстваАвтоконвертации = Новый Структура;
	СвойстваАвтоконвертации.Вставить("РеквизитСправочникаИлиДокументаЛогистика", 	"");  // название реквизита в правилах конвертации НКС или НКД
	СвойстваАвтоконвертации.Вставить("ТипОбъекта1С", 								"");  // тип объекта учетной системы в настройках конвертации
	СвойстваАвтоконвертации.Вставить("ТипОбъектаЛогистика", 						"");  // тип объекта логистики в настройках конвертации
	СвойстваАвтоконвертации.Вставить("РеквизитТитула", 								"");  // Реквизит "РеквизитТитула" в НКС
	СвойстваАвтоконвертации.Вставить("ОбъектКонфигурации", 							"");  // Имя объекта конфигурации в котором находится дополнительный реквизит
	
	Возврат СвойстваАвтоконвертации;
	
КонецФункции

Процедура ДобавитьАвтоконвертацию(ОписаниеРеквизита, ИмяРеквизитаВОбъекткМетаданных, ТипОбъекта1С, ТипОбъектаЛогистика, ИмяОбъекаКонфигурации)
	
	ОписаниеСтруктурыСвойстваАвтоконвертации = ОписаниеСтруктурыСвойстваАвтоконвертации();
	ОписаниеСтруктурыСвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика = ИмяРеквизитаВОбъекткМетаданных;
	ОписаниеСтруктурыСвойстваАвтоконвертации.ТипОбъекта1С = ТипОбъекта1С;
	
	Если Лев(ТипОбъектаЛогистика, 16) = "КонтурЛогистика_" Тогда
		ОписаниеСтруктурыСвойстваАвтоконвертации.ТипОбъектаЛогистика = ТипОбъектаЛогистика;
	Иначе
		ОписаниеСтруктурыСвойстваАвтоконвертации.ТипОбъектаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СсылкаПоИмени(ТипОбъектаЛогистика);
	КонецЕсли;
	
	ОписаниеСтруктурыСвойстваАвтоконвертации.ОбъектКонфигурации = ИмяОбъекаКонфигурации;
	
	ОписаниеРеквизита.СписокСвойствАвтоконвертации.Добавить(ОписаниеСтруктурыСвойстваАвтоконвертации);
	
КонецПроцедуры

#КонецОбласти