Функция ПолучитьВесОбъем(п_Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВложенныйЗапрос.Вес) КАК Вес,
		|	СУММА(ВложенныйЗапрос.Объем) КАК Объем
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ДР.Значение КАК ЧИСЛО) КАК Вес,
		|		0 КАК Объем
		|	ИЗ
		|		Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР
		|	ГДЕ
		|		ДР.Ссылка = &Ссылка
		|		И ДР.Свойство = &Свойство1
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		ВЫРАЗИТЬ(ДР.Значение КАК ЧИСЛО)
		|	ИЗ
		|		Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР
		|	ГДЕ
		|		ДР.Ссылка = &Ссылка
		|		И ДР.Свойство = &Свойство2) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Свойство1", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вес Брутто", Истина));
	Запрос.УстановитьПараметр("Свойство2", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Объем", Истина));
	Запрос.УстановитьПараметр("Ссылка", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура();
	
	ТекВес = 0;
	ТекОбъем = 0;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Вес) Тогда
			ТекВес = Выборка.Вес;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Объем) Тогда
			ТекОбъем = Выборка.Объем
		КонецЕсли;
	КонецЕсли;

	Рез.Вставить("Вес",		ТекВес);
	Рез.Вставить("Объем",	ТекОбъем);
	
	Возврат Рез;

КонецФункции // ()

Функция ПолучитьВесОбъемДляСтроки(п_СтрокаТЧ) Экспорт
	
	ТекВес = 0;
	ТекОбъем = 0;
	ТекВесЕдиницы = 0;
	ТекОбъемЕдиницы = 0;

	ВесОбъемСтроки = ПолучитьВесОбъем(п_СтрокаТЧ.Номенклатура);
	
	Если ЗначениеЗаполнено(п_СтрокаТЧ.Количество) Тогда
		ТекВес 				= ВесОбъемСтроки.Вес * п_СтрокаТЧ.Количество;
		ТекВесЕдиницы		= ВесОбъемСтроки.Вес;
		ТекОбъем			= ВесОбъемСтроки.Объем * п_СтрокаТЧ.Количество;
		ТекОбъемЕдиницы		= ВесОбъемСтроки.Объем;
	КонецЕсли;

	Рез = Новый Структура();
	
	Рез.Вставить("Вес",				ТекВес);
	Рез.Вставить("Объем",			ТекОбъем);
	Рез.Вставить("ВесЕдиницы",		ТекВесЕдиницы);
	Рез.Вставить("ОбъемЕдиницы",	ТекОбъемЕдиницы);
	
	Возврат Рез;

КонецФункции // ()

Функция ПолучитьВесОбъемДляДокумента(п_Документ) Экспорт

	Если ТипЗнч(п_Документ) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ТЧ = п_Документ.ВозвращаемыеТовары;
	Иначе
		ТЧ = п_Документ.Товары;
	КонецЕсли;	

	Рез = Новый Структура("Вес, Объем", 0, 0);
	Для каждого Т Из ТЧ Цикл
		ВесОбъем = ПолучитьВесОбъемДляСтроки(Т);
		Рез.Вес		= Рез.Вес + ВесОбъем.Вес;
		Рез.Объем	= Рез.Объем + ВесОбъем.Объем;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции // ПолучитьВесОбъемДляДокумента()

Функция ОстатокТовараПоОрганизации(п_Номенклатура, п_ДатаОстатков, п_Организация = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			&ДатаОстатков,
		|			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		|				И Организация = &Организация) КАК ТоварыОрганизацийОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатков", п_ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Если п_Организация = Неопределено Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "И Организация = &Организация", ""); 	
	Иначе	
		Запрос.УстановитьПараметр("Организация", п_Организация);
	КонецЕсли;
	
	Запрос.Текст = ЗапросТекст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьВесОбъемДляДокумента()

Функция ОстатокКОформлению(п_Номенклатура, п_ДатаОстатков, п_ДокументОтгрузки) Экспорт

	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток КАК КОформлению
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|			,
		|			ДокументОтгрузки = &ДокументОтгрузки
		|				И Номенклатура = &Номенклатура) КАК ТоварыКОтгрузкеОстатки";
	
	//Запрос.УстановитьПараметр("ДатаОстатков", п_ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("ДокументОтгрузки", п_ДокументОтгрузки);
	
	Запрос.Текст = ЗапросТекст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КОформлению;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ПолучитьВесОбъемДляДокумента()

// 20.07.2026
Функция УстановленЗапретОтгрузкиПоСегменту(п_Партнер, п_Соглашение) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартнерыСегмента.Сегмент КАК Сегмент,
	               |	ПартнерыСегмента.Сегмент.ДатаСоздания КАК СегментДатаСоздания
	               |ИЗ
	               |	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
	               |ГДЕ
	               |	ПартнерыСегмента.Сегмент.ЗапретОтгрузки
	               |	И НЕ ПартнерыСегмента.Сегмент.ЭтоГруппа
	               |	И НЕ ПартнерыСегмента.Сегмент.ПометкаУдаления
	               |	И ПартнерыСегмента.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

#Область УправлениеАссортиментом

Функция АссортиментВыделитьЦветом(п_Номенклатура, п_Дата) Экспорт

	РольЭтап = РольЭтап(п_Номенклатура, п_Дата);
	
	Если ПустаяСтрока(РольЭтап.Этап) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда
		Если РольЭтап.Роль = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
		Если РольЭтап.Роль = Перечисления.РолиАссортимента.ДополнительныйАссортимент Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции // ()

Функция РольЭтап(п_Номенклатура, п_Дата)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АссортиментСрезПоследних.Регистратор.Этап КАК Этап,
		|	АссортиментСрезПоследних.РольАссортимента КАК Роль
		|ИЗ
		|	РегистрСведений.Ассортимент.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК АссортиментСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", п_Дата);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Рез = Новый Структура();
	Рез.Вставить("Роль", "");
	Рез.Вставить("Этап", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ()

Функция ОстатокТовара(п_МассивНоменклатуры, п_Дата)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток - СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(&Дата, Номенклатура В (&Номенклатура)) КАК СвободныеОстаткиОстатки";
	
	Запрос.УстановитьПараметр("Дата", п_Дата);
	Запрос.УстановитьПараметр("Номенклатура", п_МассивНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ()

// родной алгоритм
Процедура УправлениеАссортиментомРС(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АссортиментСрезПоследних.Регистратор.Этап КАК Этап,
		|	АссортиментСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.Ассортимент.СрезПоследних(&Дата, Номенклатура В (&Номенклатура)) КАК АссортиментСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", ТекущийОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	
	РезультатЗапроса = Запрос.Выполнить();

	ТЗ = РезультатЗапроса.Выгрузить();
	
	Строки = ТЗ.НайтиСтроки(Новый Структура("Этап", Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв));
	Если Строки.Количество() > 0 Тогда
		Сообщить("Управление ассортиментом. Перенос в архив / отзыв (запрещены закупки и продажи)");
		Для каждого Т Из Строки Цикл
			Сообщить(Т.Номенклатура);
		КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Строки = ТЗ.НайтиСтроки(Новый Структура("Этап", Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж));
	Если Строки.Количество() > 0 Тогда
		Сообщить("Управление ассортиментом. Ввод в ассортимент с отсрочкой начала продаж (разрешены только закупки)");
		Для каждого Т Из Строки Цикл
			Сообщить(Т.Номенклатура);
		КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Строки = ТЗ.НайтиСтроки(Новый Структура("Этап", Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента));
	Если Строки.Количество() > 0 Тогда
		
		ТЗ_Остатки = ОстатокТовара(ТекущийОбъект.Товары.ВыгрузитьКолонку("Номенклатура"), ТекущийОбъект.Дата);
		
		Для каждого Т Из Строки Цикл
			КоличествоДокумента = 0;
			СтрокиДокумента = ТекущийОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Т.Номенклатура));
			Для каждого СтрокаДокумента Из СтрокиДокумента Цикл
				КоличествоДокумента = КоличествоДокумента + СтрокаДокумента.КоличествоУпаковок;
			КонецЦикла;
			
			СтрокиОстатка = ТЗ_Остатки.НайтиСтроки(Новый Структура("Номенклатура", Т.Номенклатура));
			Если СтрокиОстатка.Количество() = 0 Тогда
				Сообщить("Управление ассортиментом. Вывод ассортимента");
				Сообщить("" + Т.Номенклатура + " требуется: " + КоличествоДокумента + " остаток: -");
				Отказ = Истина;
			Иначе
				Остаток = СтрокиОстатка[0].Остаток;
				Если Остаток < КоличествоДокумента Тогда
					Сообщить("Управление ассортиментом. Вывод ассортимента");
					Сообщить("" + Т.Номенклатура + " требуется: " + КоличествоДокумента + " остаток: " + Остаток);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;


КонецПроцедуры

// новый алгоритм
Процедура УправлениеАссортиментом(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда

		Для каждого Т Из ТекущийОбъект.Товары Цикл
			
			РольЭтап = РольЭтап(Т.Номенклатура, ТекущийОбъект.Дата);
			Если ПустаяСтрока(РольЭтап.Этап) Тогда
				Продолжить;
			КонецЕсли;
			
			Если РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: перенос в архив/отзыв");
				Отказ = Истина;
				Прервать;
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: ввод с отсрочкой начала продаж");
				Отказ = Истина;
				Прервать;
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента Тогда
				// все разрешено
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		
		Для каждого Т Из ТекущийОбъект.Товары Цикл

			РольЭтап = РольЭтап(Т.Номенклатура, ТекущийОбъект.Дата);
			Если ПустаяСтрока(РольЭтап.Этап) Тогда
				Продолжить;
			КонецЕсли;
			
			Если РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ПереносВАрхивОтзыв Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: перенос в архив/отзыв");
				Отказ = Истина;
				Прервать;
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортимент Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВводВАссортиментСОтсрочкойНачалаПродаж Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ИзменениеСостоянияАссортимента Тогда
				// все разрешено
			ИначеЕсли РольЭтап.Этап = Перечисления.ЭтапыИзмененияАссортимента.ВыводИзАссортимента Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - ассортимент: вывод");
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

