&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Действие") И Параметры.Действие = "Восстановить" Тогда
		Элементы.ФормаКомандаСоздать.Видимость = Ложь;
		Заголовок = Параметры.Действие;
		ИзОтчета = Истина;
	КонецЕсли;

	Если НЕ Параметры.Свойство("Действие") Тогда
		ИзОтчета = Ложь;
		Элементы.Отчет.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элементы.Список.ТекущиеДанные.Наименование);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана ни одна из настроек");
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ИзОтчета Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть(Элементы.Список.ТекущиеДанные.Наименование);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздать(Команда)

	П_Структура = Новый Структура;
	
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
		П_Структура.Вставить("Отчет", Список.Отбор.Элементы[0].ПравоеЗначение);
		П_Структура.Вставить("Пользователь", ПолучитьТекущегоПользователяНаСервере());
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.НастройкиОтчетаРасчетЗаказа.Форма.ФормаЗаписи", П_Структура,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Функция ПолучитьТекущегоПользователяНаСервере()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции
