////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции для подключаемых команд:
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет действие команды
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения
//  Команда	 - Команда 
//
Процедура ВыполнитьКоманду(Форма, Команда, РеквизитыФормы = Неопределено) Экспорт
	
	Если Команда.Имя = "КонтурЛогистикаДинамическаяКнопкаКакРаботатьСРазделом" Тогда
		
		КонтурЛогистика_ОнбордингКлиент.ЗапуститьОнбординг(Форма);	
		
	ИначеЕсли Команда.Имя = "КонтурЛогистикаДинамическаяКнопкаЦентрПоддержки" Тогда
		
		ТаргетированнаяСсылка = КонтурЛогистика_ОнбордингКлиент.ТаргетированнаяСсылка(Форма.ИмяФормы);
		КонтурЛогистика_ЦентрПоддержкиКлиент.ОткрытьЦентрПоддержки(ТаргетированнаяСсылка);
		
	ИначеЕсли Команда.Имя = "КонтурЛогистикаДинамическаяКнопкаИнформацияЦентрПоддержки" Тогда
		
		ОткрытьФорму("ОбщаяФорма.КонтурЛогистика_ФормаИнформацииДляТехПоддержки");
		
	ИначеЕсли Команда.Имя = "КонтурЛогистикаДинамическаяКнопкаСправка" Тогда
		
		ТаргетированнаяСсылка = КонтурЛогистика_ОнбордингКлиент.ТаргетированнаяСсылка(Форма.ИмяФормы);
		Если ТаргетированнаяСсылка = Неопределено Тогда 
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(КонтурЛогистика_ОнбродингКлиентСервер.СсылкаСправка());
		Иначе
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТаргетированнаяСсылка);
		КонецЕсли;
		
	ИначеЕсли Команда.Имя = "КонтурЛогистикаДинамическаяКнопкаИнформацияПоТитулуВТехподдержку" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Титул", Форма.Объект.Ссылка);
		ПараметрыФормы.Вставить("РеквизитыФормы", РеквизитыФормы);
						
		Если Не КонтурЛогистика_ПечатьСервер.ДостаточноПравДляОткрытияИнформацииПоТитулуДляТехподдержки() Тогда
			Сообщить("У вас недостаточно прав. Обратитесь к администратору.");
			Возврат;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ИнформацияПоТитулуДляТехподдержки", ПараметрыФормы, Форма);
		
	ИначеЕсли Команда.Имя = "КонтурЛогистикаДинамическаяКнопкаНаписатьВПоддержку" Тогда
		
		КонтурЛогистика_ЦентрПоддержкиКлиент.НаписатьПисьмоВТехПоддержку();
			
	Иначе 
		
		Возврат;
		
	КонецЕсли; // ВыполнитьКоманду
	
КонецПроцедуры

#КонецОбласти