#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТоварыХарактеристика.Видимость = 
		(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
			И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики") = Истина);
	
	УстановитьЗначениеПоУмолчаниюДляНовогоДокумента();
	
	Параметры.Свойство("ОткрытоИзТитула", ОткрытоИзТитула);
	Параметры.Свойство("ЭтоШаблонТитула", ЭтоШаблонТитула);
	Параметры.Свойство("ЗаполненностьКакПредупреждение", ЗаполненностьКакПредупреждение);
	
	Если ЗначениеЗаполнено(Объект.Титул1) Тогда
		
		СценарийРедактированияШаблона = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.Титул1, "СценарийРедактированияШаблона");
		
		Если СценарийРедактированияШаблона = Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.НеРедактируется Тогда
			СценарийНеРедактируется = Истина;
		КонецЕсли;
		
		ЭтоВходящийШаблон = Объект.Титул1.ЭтоВходящийШаблон;
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыСозданияМаршрута") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ПараметрыСозданияМаршрута); 
	КонецЕсли;	
			
	ОбновитьДанныеФормы();
		
	УстановитьПоведениеКлючевыхЭлементовФормы();
	
	Если Параметры.Свойство("ОткрытьСтраницуКонтейнер") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСведенияОконтейнерах;
	КонецЕсли;	
	
	// КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПроверитьДокумент();
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров", "");
	Элементы.ИнфПолСтрокаТоваров.ОтборСтрок = ОтборСтрок;
	
	Если ЗначениеЗаполнено(Объект.Титул1) Тогда
		Элементы.ФормаЗаписатьИЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
		 
	Элементы.ФормаДобавитьПартиюВТитул.Видимость = НЕ (ЗначениеЗаполнено(Объект.Титул1) Или ОткрытоИзТитула);	 
	
	УстановитьВозможностьРедактированияСтоимости();
	
	Если Не Объект.УказыватьСтоимостьГрузаВручную Тогда
		Объект.СтоимостьГруза = Итог("СтоимостьГруза");
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	УстановитьДоступностьТЧКонтейнеры();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("КонтурЛогистика_ИзменениеДокумента_ПЭ_Партии");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораНоменклатуры(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда

		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.Номенклатура = ВыбранноеЗначение;

		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
		
		УстановитьВидимостьНоменклатуры();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЕдиницыИзмерения(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда

		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.УпаковкаЕдиницаИзмерения = ВыбранноеЗначение;

		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияСоответствий(Параметр, ДопПараметр) Экспорт

	Если ЗначениеЗаполнено(ДопПараметр) Тогда

		локМассивСтрокСЭтойНоменклатурой = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ДопПараметр));
		локМассивИдентификаторов = Новый Массив();

		Для Каждого СтрокаПереконвертации Из локМассивСтрокСЭтойНоменклатурой Цикл

			СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
			локМассивИдентификаторов.Добавить(СтрокаПереконвертации.ИдентификаторСтроки);

		КонецЦикла;
		
		ЗаполнитьТребуемыеДействияТоваров();
		ПроверитьДокумент(); 

		ПересчитатьЗаголовкиКоличества(ЭтаФорма);
		ПересчитатьВсеИтоги();
		
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПереконвертироватьСтроку(ИдСтрокиТоваров, ТекДанные)

	СконвертироватьСтрокуТоваровКлиент(ИдСтрокиТоваров);
	СформироватьТребуемоеДействиеСтрокиТовара(ТекДанные);
	ПересчитатьВсеИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросаУстановитьЗначениеВТоварах(ВозвратДиалога, ДанныеЗамены) Экспорт
	
	Если ВозвратДиалога = КодВозвратаДиалога.Да Тогда
		УстановитьЗначениеВТоварах(ДанныеЗамены.Реквизит, ДанныеЗамены.Значение);		
	КонецЕсли;
	
	ПроверитьДокумент();
		
КонецПроцедуры	

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ОбновитьДанныеФормы();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СвГОПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СвГППриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АдрГрузПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВрПриемПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатОтгрПо)
		И ЗначениеЗаполнено(Объект.ДатОтгрС) Тогда
		
		Объект.ДатОтгрПо = Объект.ДатОтгрС;
		
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатДоставкиСПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатДостГрПо)
		И ЗначениеЗаполнено(Объект.ДатДостГрС) Тогда
		
		Объект.ДатДостГрПо = Объект.ДатДостГрС;
		
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДогТрЭкспПриИзменении(Элемент)
	
	// TODO выводить предупреждение при изменении реквизитов, если они не заполнены
	
	ДанныеДоговораПоОрганизациям = ПолучитьОрганизацииДоговора(Объект.ДогТрЭксп);
	Если ЗначениеЗаполнено(ДанныеДоговораПоОрганизациям.Заказчик) Тогда
		Объект.СвКлт = ДанныеДоговораПоОрганизациям.Заказчик; 
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеДоговораПоОрганизациям.Экспедитор) Тогда
		Объект.СвЭксп = ДанныеДоговораПоОрганизациям.Экспедитор; 
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УказыватьСтоимостьГрузаВручнуюПриИзменении(Элемент)
	УстановитьВозможностьРедактированияСтоимости();
КонецПроцедуры

&НаКлиенте
Процедура ТипСтоимостиПриИзменении(Элемент)
	Если Не Объект.УказыватьСтоимостьГрузаВручную Тогда
		Объект.СтоимостьГруза = Итог("СтоимостьГруза");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаУчетаГрузаПриИзменении(Элемент)
	ПараметрыВопроса = Новый Структура("Реквизит, Значение");
	ПараметрыВопроса.Реквизит = "ВалютаУчетаГруза";
	ПараметрыВопроса.Значение = Объект.ВалютаУчетаГруза;
	ВопросУстановитьЗначениеВТоварах(ПараметрыВопроса);
КонецПроцедуры

&НаКлиенте
Процедура СвСтрахПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура УчГосСистПриИзменении(Элемент)
	Элементы.ГруппаПодробныеСведенияГосСист.Видимость = Элементы.Товары.ТекущиеДанные.УчГосСист;
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрОтгрСПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ВрОтгрС) Тогда
		Объект.ВрОтгрС = Объект.ВрОтгрС + 1;
	КонецЕсли;	
	
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрОтгрПоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрДоставкиСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрДоставкиПоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВидТСВидТСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВидТСТипКузовПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатОтгрСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСвСтрПроисхПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатОтгрПоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКодТовНомПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДокУчСист_АдрГруз_СопоставитьНажатие(Элемент)
	ДокУчСист_Реквизит_СопоставитьНажатие(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДокУчСист_АдрПунктНазн_СопоставитьНажатие(Элемент)
	ДокУчСист_Реквизит_СопоставитьНажатие(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПрзПрвзПриИзменении(Элемент)
	УстановитьДоступностьТЧКонтейнеры();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтранаГрузаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = ТекущиеДанные.ИдентификаторСтроки;
	МассивСтран = Новый Массив;
	ОтборПоСтрокеТоваров = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	
	Для Каждого СтрокаСтраны Из Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборПоСтрокеТоваров) Цикл
		
		Если ЗначениеЗаполнено(СтрокаСтраны.Страна) Тогда
			МассивСтран.Добавить(СтрокаСтраны.Страна);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	ПараметрыФормы.Вставить("МассивСтран", МассивСтран);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_СтраныМира.Форма.ФормаВыбораСтранПроисхождениеПродукции",
		ПараметрыФормы,
		ЭтаФорма,
		ЭтаФорма,
		"ПослеВыбораСтран");
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаЕдиницаИзмеренияПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыТребуемоеДействие" Тогда

		СтандартнаяОбработка = Ложь;

		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда

			ТекСтрТребуемоеДействие = ТекДанные.ТребуемоеДействие;
			ПараметрыТекСтрока = ВыбраннаяСтрока;
			Если ТекСтрТребуемоеДействие = "Указать Номенклатуру" Тогда

				ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");

				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы("Справочник."
																				   + ТипСправочникаНоменклатура
																				   + ".ФормаВыбора",
																				   ,
																				   ЭтаФорма,
																				   ЭтаФорма,
																				   "ОбработчикВыбораНоменклатуры",
																				   ПараметрыТекСтрока);

			ИначеЕсли ТекСтрТребуемоеДействие = "Указать Единицу измерения" Тогда

				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
				Элементы.Товары.ИзменитьСтроку();

			ИначеЕсли ТекСтрТребуемоеДействие = "Указать Количество" Тогда

				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
				Элементы.Товары.ИзменитьСтроку();

			ИначеЕсли ТекСтрТребуемоеДействие = "Установить соответствие" Или ТекСтрТребуемоеДействие = "Не учитывается" Тогда

				ОткрытьСоответствияТекущейСтроки();

			Иначе // требуемое действие от таблицы ошибок

				ОбработатьТребуемоеДействие(ТекСтрТребуемоеДействие, Неопределено);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.Учитывать = Истина;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ПроверитьДокумент();
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	 
	
	Если Элемент.ТекущиеДанные.ИдентификаторСтроки = "" Тогда 		
		Элемент.ТекущиеДанные.Учитывать = Истина;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров",
												  Элемент.ТекущиеДанные.ИдентификаторСтроки);
	Элементы.СведенияГосСистем.ОтборСтрок = ОтборСтрок;
	Элементы.ИнфУпГруз.ОтборСтрок = ОтборСтрок;
	КоличествоОписанныхУпаковок = ИтогИнфУпГруз(Элемент.ТекущиеДанные.ИдентификаторСтроки);
	Элементы.Марк.ОтборСтрок = ОтборСтрок;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров", Элемент.ТекущиеДанные.ИдентификаторСтроки);
	Элементы.ИнфПолСтрокаТоваров.ОтборСтрок = ОтборСтрок;

	КонтурЛогистика_ПанельОшибокКлиент.УстановитьОтборТаблицыОшибокПоНомеруСтроки(ТаблицаОшибок,
																				  Элементы.Товары.ТекущиеДанные);
																				  
	Элементы.ГруппаПодробныеСведенияГосСист.Видимость = Элементы.Товары.ТекущиеДанные.УчГосСист;
	
	СтранаГруза = КонтурЛогистика_ОбщегоНазначенияКлиент.РассчитатьПредставлениеСтран(
		Объект.СтраныПроисхожденияПродукции, Элемент.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

// Управление положением подробных сведений о товаре

&НаКлиенте
Процедура СвернутьПодробныеСведенияНажатие(Элемент)

	СкрытьПодробностиТоваров = Истина;
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазвернутьПодробностиТоваровНажатие(Элемент)

	СкрытьПодробностиТоваров = Ложь;
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура ИнфПолСтрокаТоваровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемИдНомУчетЕдПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ИнфУпГрузПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)
	Объект.КолМестПарт = Объект.Товары.Итог("КоличествоМест");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъемКубМПриИзменении(Элемент)
	Объект.ОбъемГруза = Объект.Товары.Итог("ОбъемКубМ");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаБруттоКгПриИзменении(Элемент)
	Объект.МассаБруттоКг = Объект.Товары.Итог("МассаБруттоКг");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаНеттоКгПриИзменении(Элемент)
	Объект.МассаНеттоКг = Объект.Товары.Итог("МассаНеттоКг");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбъявлСтГрузПриИзменении(Элемент)
	Если Не Объект.УказыватьСтоимостьГрузаВручную Тогда
		Объект.СтоимостьГруза = Итог("СтоимостьГруза");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТипСтоимостиПриИзменении(Элемент)
	Если Не Объект.УказыватьСтоимостьГрузаВручную Тогда
		Объект.СтоимостьГруза = Итог("СтоимостьГруза");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияОКонтейнерах
&НаКлиенте
Процедура СведенияОКонтейнерахПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ПредоставленКлиентом = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ПредоставлениеКонтейнера.ПредоставленКлиентом");
		Элемент.ТекущиеДанные.Номер = Элемент.ТекущиеДанные.НомерСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКонтейнерахПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепроверить(Команда)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПартиюВТитул(Команда)
	
	Если МожноДобавлять() Тогда
		
		Если Модифицированность = Истина Тогда 
			// todo вывести предупреждение о записи
			 Записать();
		КонецЕсли;	 
		
		Результат = ВыполнитьОперациюДобавленияНаСервере(Объект.Ссылка);
		ПоручениеЭкспедитору = Результат.Документ_ПЭ1; 
		
		ВывестиРезультатПользователю(Результат.Описание);
	
	Иначе
		 	
		ТекстПредупреждения = "В документе не заполнены основные реквизиты."; 	
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения, 
									Заголовок = "Контур.Логистика");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_ЗаявкаНаМаршрут"), Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)

	ПерезаполнитьПоДокОснованиюСервер();
	ОбновитьДанныеФормы();

	ПолностьюОбновитьПредставлениеДанных();
	ПересчитатьВсеИтоги();
	
	СкрытьПоказатьЗначенияДокУчСист();

КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНеучитываемые(Команда)

	СкрытьНеучитываемые = Не СкрытьНеучитываемые;
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибокТовары(Команда)

	ОтборТаблицыОшибокЗначениеТовары = "";

	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда

		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);

		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;

	КонецЕсли;

	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)

	ОбработчикПеречитатьОбъект();

КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

#Область ОбработчикиКомандТабличнойЧастиТовары
	
&НаКлиенте
Процедура ТоварыДобавить(Команда)

	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	НоваяСтрока.Учитывать = Истина;

	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() Тогда
		НоваяСтрока.Характеристика =  КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПустаяХарактеристика();
	КонецЕсли;
	
	ПроверитьДокумент();
	СформироватьТребуемоеДействиеСтрокиТовара(НоваяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкопировать(Команда)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.Учитывать = Истина;
	
	Если ТекСтрока <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,, "ИдентификаторСтроки");
	КонецЕсли;
	
	ПроверитьДокумент();
	СформироватьТребуемоеДействиеСтрокиТовара(ТекСтрока);
	
КонецПроцедуры	

&НаКлиенте
Процедура СделатьНесопоставленныеНеУчитываемыми(Команда)
	
	Отбор = Новый Структура("КоличествоМест,МассаБруттоКг,ОтгрузочноеНаименование,Учитывать", 0, 0, "", Истина);
	НесопоставленныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
	
	Если НесопоставленныеСтроки.Количество() > 0 Тогда

		Для Каждого текСтр Из НесопоставленныеСтроки Цикл
			СделатьСтрокуТовараНеучитываемой(текСтр);
		КонецЦикла;

		ПроверитьДокумент();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияНоменклатуры(Команда)

	ОткрытьСоответствияТекущейСтроки();

КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораСтран(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = Результат.Идентификатор;
	ОтборПоСтрокеТоваров = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	СтрокиКУдалению = Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборПоСтрокеТоваров);
	
	Для Каждого СтрокаСтраны Из СтрокиКУдалению Цикл
		Объект.СтраныПроисхожденияПродукции.Удалить(СтрокаСтраны);
	КонецЦикла;
	
	Для Каждого Страна Из Результат.МассивСтран Цикл
		
		НоваяСтрока = Объект.СтраныПроисхожденияПродукции.Добавить();
		НоваяСтрока.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		НоваяСтрока.Страна = Страна;
		
	КонецЦикла;
	
	СтранаГруза = КонтурЛогистика_ОбщегоНазначенияКлиент.РассчитатьПредставлениеСтран(
		Объект.СтраныПроисхожденияПродукции, ИдентификаторСтрокиТоваров);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Функция Итог(ПолеИтога)

	Итого = 0;

	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Если СтрокаТовары.ТипСтоимости = Объект.ТипСтоимости Тогда
			Итого = Итого + СтрокаТовары[ПолеИтога];
		КонецЕсли;
	КонецЦикла;

	Возврат Итого;

КонецФункции

&НаКлиенте
Функция ИтогИнфУпГруз(ИдентификаторСтрокиТоваров)

	Итого = 0;

	Для Каждого СтрокаОписанияУпаковки Из Объект.ИнфУпГруз Цикл
		Если СтрокаОписанияУпаковки.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров Тогда
			Итого = Итого + СтрокаОписанияУпаковки.КолУпак;
		КонецЕсли;
	КонецЦикла;

	Возврат Итого;

КонецФункции

&НаСервере
Процедура ОбновитьДанныеФормы()

	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Титул1) Тогда 
		ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Титул1, Истина);
		ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Титул1, Ложь);
		КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
	Иначе 
		ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	КонецЕсли;
		
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);

	Элементы.ОткрытьНастройкуКонвертации.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.Разделитель.Видимость = ЗначениеЗаполнено(Объект.Разделитель);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	
	КоличествоСтрок = 0;
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.Товары Цикл
		
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСтрок = КоличествоСтрок + 1;
		
	КонецЦикла;
	
	Форма.Элементы.ТоварыКоличество.Заголовок = Форма.Объект.Товары.Итог("Количество");
	Форма.Элементы.ГруппаТовары.Заголовок = "Грузы (" + КоличествоСтрок + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПолностьюОбновитьПредставлениеДанных();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	ЗаполнитьТребуемыеДействияТоваров();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();

КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()

	РезультатПроверки = ПроверитьДокументСервер();

	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьПиктограммыОшибокТабличнойЧасти(Объект.Товары, ТаблицаОшибок, "Товары",
																			   "КартинкаОшибок");
	Элементы.КоманднаяПанельИндикаторВалидации.Видимость = Истина;

	УправлениеВидимостьюИДоступностью(); 	// доступность команд

	Возврат РезультатПроверки;

КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ДополнительныеПараметры = Новый Структура("РазрешеноРедактироватьКлючевыеРеквизиты", РазрешеноРедактироватьКлючевыеРеквизиты());
	ДополнительныеПараметры.Вставить("ЭтоШаблонТитула", ЭтоШаблонТитула);
	ДополнительныеПараметры.Вставить("ЗаполненностьКакПредупреждение", ЗаполненностьКакПредупреждение);
	РезультатПроверки = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок, ДополнительныеПараметры);

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Картинка = 0;
	КонецЦикла;
	
	Объект.Валидация = (РезультатПроверки.КоличествоОшибок = 0);

	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьТребуемыеДействияТоваров()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл

		СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)

	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре

	Если Не СтрокаТовара.Учитывать Тогда
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда

		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";

			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";

			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) Тогда

				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;

			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
			Если СтрокаТовара.Свернута Тогда 
				СтрокаТовара.ТребуемоеДействие = СтрокаТовара.ТребуемоеДействие + ", свернута";
			КонецЕсли;
			
		Иначе
			
			Если СтрокаТовара.КартинкаОшибок = 2 Тогда
				СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
		КонецЕсли;

	Иначе

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвернутостьПодробностейОТоварах() Экспорт

	Элементы.ГруппаПодробныеСведенияСвернутая.Видимость = СкрытьПодробностиТоваров;
	Элементы.ГруппаПодробныеСведения.Видимость = Не Элементы.ГруппаПодробныеСведенияСвернутая.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	Если ПолеТаблицыОшибок <> Неопределено Тогда
		КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ВходящееПоручение = (ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен")
	 		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки") 
	 		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением"));
	
	УстановитьТолькоПросмотр = Не (ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
									Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка"))
						Или (ЭтоВходящийШаблон И СценарийНеРедактируется); 
	
	ТолькоПросмотр = УстановитьТолькоПросмотр;
	Элементы.ПерезаполнитьПоДокОснованию.Доступность = Не УстановитьТолькоПросмотр;
		
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = Не ВходящееПоручение;
	Элементы.ОткрытьНастройкуКонвертации.Видимость = Не ВходящееПоручение;

	УстановитьПоложениеСохраняемыхЭлементов();
	УстановитьФорматыКолонокСКоличеством();

	УстановитьВидимостьЭлементов();
	УстановитьДоступностьРедактированияДляСценария();
	// УстановитьЗаголовкиГруппамДопПолей();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРедактированияДляСценария()
	
	Если (ЭтоВходящийШаблон И СценарийНеРедактируется) И Не ЗначениеЗаполнено(Объект.ВалютаУчетаГруза)
	     И ТолькоПросмотр Тогда
		
		ТолькоПросмотр = Ложь;

		Элементы.ГруппаШапкаДокумента.ТолькоПросмотр = Истина;
		Элементы.СтраницаШапка.ТолькоПросмотр = Истина;
		Элементы.СтраницаТребования.ТолькоПросмотр = Истина;
		Элементы.СтраницаСведенияОконтейнерах.ТолькоПросмотр = Истина;
		Элементы.ГруппаСтраницаДопПараметры.ТолькоПросмотр = Истина;
	
		// ГруппаТовары целиком не блокируем — иначе закроется валюта
		Элементы.ГруппаМестОбъем.ТолькоПросмотр = Истина;
		Элементы.ГруппаВесОбщий.ТолькоПросмотр = Истина;
		Элементы.ТипСтоимости.ТолькоПросмотр = Истина;
		Элементы.СтоимостьГруза.ТолькоПросмотр = Истина;
		Элементы.ВалютаУчетаГруза.ТолькоПросмотр = Ложь;

		Элементы.ГруппаПанельТоваров.ТолькоПросмотр = Истина;

		УстановитьТолькоПросмотрКолонокТоваровКромеВалюты();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТолькоПросмотрКолонокТоваровКромеВалюты()
	
	Родитель = Элементы.Товары;
	
	Для Каждого Элемент Из Родитель.ПодчиненныеЭлементы Цикл
		Элемент.ТолькоПросмотр = Истина;
	КонецЦикла;
	
	Элементы.ТоварыВалютаУчетаГруза.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()

	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок()

	КонтурЛогистика_ОбработкаДокументовКлиент.УстановитьВидимостьНеучитываемыхИФильтраОшибок(Объект.Товары,
																							 СкрытьНеучитываемые,
																							 Элементы.Товары,
																							 Элементы.ТоварыИтоги);
	
	// лишним не будет
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = ЗначениеЗаполнено(ОтборТаблицыОшибокЗначениеТовары);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()
	
	ОНК = КонтурЛогистика_ОбщегоНазначенияКлиент;

	ОНК.УстановитьФорматКолонкиКоличества(Объект.Товары, "МассаНеттоКг", Элементы.ТоварыМассаНеттоКг);
	ОНК.УстановитьФорматКолонкиКоличества(Объект.Товары, "МассаБруттоКг", Элементы.ТоварыМассаБруттоКг);
	ОНК.УстановитьФорматКолонкиКоличества(Объект.Товары, "Количество", Элементы.ТоварыКоличество);
	ОНК.УстановитьФорматКолонкиКоличества(Объект.Товары, "ОбъемКубМ", Элементы.ТоварыОбъемКубМ);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	УстановитьВидимостьНоменклатуры();
			
	Элементы.ОткрытьНастройкуКонвертации.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНоменклатуры()
	
	ОНК = КонтурЛогистика_ОбщегоНазначенияКлиент;
	
	// видимость номенклатуры в зависимости от того есть ли там номенклатура (она есть если отправляли Т1 из этой базы) 
	ОНК.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаНоменклатура);
	ОНК.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыХарактеристика);
	ОНК.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаЕдиницы);	
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда

		Объект.Товары.Очистить();
				
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДанныеЗаполнения = Новый Структура("ДокументОснование, Перезаполнить, Разделитель",
			ДокОбъект.ДокументОснование, Истина, ДокОбъект.Разделитель);
		ДокОбъект.Заполнить(ДанныеЗаполнения);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуТовараНеучитываемой(Знач ТекДанныеТоваров)

	СделатьНоменклатуруНеучитываемой(ТекДанныеТоваров.Номенклатура, ТекДанныеТоваров.УпаковкаЕдиницаИзмерения);
	
	// эта номенклатура может быть еще в других строках
	// требуется переконвертировать все строки с этой номенклатурой
	МассивСтрокСЭтойНоменклатурой = Объект.ТоварыДокумента1С.НайтиСтроки(Новый Структура("Номенклатура",
																						 ТекДанныеТоваров.Номенклатура));

	Для Каждого СтрокаПереконвертации Из МассивСтрокСЭтойНоменклатурой Цикл

		СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьНоменклатуруНеучитываемой(Номенклатура, УпаковкаЕдиницаИзмерения)
	СтруктураПрисвоения = Новый Структура("Учитывать,УпаковкаЕдиницаИзмерения", Ложь, УпаковкаЕдиницаИзмерения);
	РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.ПрисвоитьСоответствиеНоменклатуры(Номенклатура, СтруктураПрисвоения);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе

		текНоменклатура 	= ТекущиеДанные.Номенклатура;
		текЕдиница 			= ТекущиеДанные.УпаковкаЕдиницаИзмерения;
		текХарактеристика 	= ТекущиеДанные.Характеристика;
		
		КонтурЛогистика_КонвертацияКлиент.ОткрытьСоответствияНоменклатуры(текНоменклатура, текЕдиница, текХарактеристика, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуПриРучномИзменении(ПараметрИдСтрокиТоваров)
	
	СконвертироватьСтрокуТоваровКлиент(ПараметрИдСтрокиТоваров);
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	ПересчитатьВсеИтоги();

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуТоваровКлиент(ИдентификаторСтрокиТоваров)

	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);

	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСтрока.УпаковкаЕдиницаИзмерения) Тогда
		СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров)

	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СконвертироватьСтрокуТоваров1СвЛогистика(СтрокаТоваров.НомерСтроки);

	ЗаполнитьЗначенияСвойств(СтрокаТоваров, ДокОбъект.Товары[СтрокаТоваров.НомерСтроки - 1]);
	// маркировки проч не переносим т.к. можно потерять данные

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";

	ИначеЕсли Элемент.Имя = "ДокУчСист_АдрГруз_Сопоставить"
		Или Элемент.Имя = "ДокУчСист_АдрПунктНазн_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры
															   
&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);

		ПолностьюОбновитьПредставлениеДанных();

		ОбновитьДанныеФормы();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)

	ДокОбъект = РеквизитФормыВЗначение("Объект");

	ПерезаполнитьЭТРН = Ложь;

	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	// надо понять, требуется ли переконвертировать ЭТРН или надо конвертнуть только титул	
	СоотвРеквизита = СоответствиеКонвертируемыхРеквизитовИзДокУчСист().Получить(ИмяРеквизита);
	Если СоотвРеквизита <> Неопределено Тогда
		Если Найти(СоотвРеквизита, "ДокументЭТРН") Тогда
			ПерезаполнитьЭТРН = Истина;
		КонецЕсли;
	КонецЕсли;

	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует",
									   Объект.ДокументОснование,
									   Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1,
									   ПерезаполнитьЭТРН);
	ДокОбъект.Заполнить(ДанныеЗаполнения);

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);

	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда

		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);

	Иначе
		
		// открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("АдрГруз", "АдрГруз");
	МассивКонвертируемыхРеквизитов.Вставить("АдрПунктНазн", "АдрПунктНазн");
		
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	Элементы.ДокУчСист_АдрГруз_Сопоставить.Видимость = Ложь;
	Элементы.ДокУчСист_АдрПунктНазн_Сопоставить.Видимость = Ложь;
	Элементы.ДокУчСист_АдрГруз.Видимость = Ложь;
	Элементы.ДокУчСист_АдрПунктНазн.Видимость = Ложь;
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		
		Если Представления.Свойство(Эл.Ключ, Значение) Тогда
			
			// Есть значение в реквизите ДокУчСист_ххх извлеченного из Документа учетной системы
			
			ЭтаФорма["ДокУчСист_" + Эл.Ключ] = Значение;
			
			// определим доступность команды сопоставления
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				
				ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
				
				РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
				
				Если РеквизитИзвлеченИзДокумента Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
					
					Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
						
						ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
						НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
						
					Иначе
						
						НужноСопоставить = Ложь;
						
					КонецЕсли;
					
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить ИЛИ РеквизитыУчетногоДокументаВидимы;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
					
				Иначе // не извлечен из документа Уч сист
					
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
					
					Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
						
						Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Не извлечен или не заполнен в док. основании. Открыть исходный документ";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)

	СоответствиеКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из СоответствиеКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить(Эл.Ключ);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат СтруктураПредставлений;
	КонецЕсли;
	
	ИменаРеквизитов = Новый Массив;

	Для Каждого ТекущееЗначение Из СоответствиеКонвертируемыхРеквизитов Цикл
		ИменаРеквизитов.Добавить(ТекущееЗначение.Ключ);
	КонецЦикла;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_ЗаявкаНаМаршрут, ДокументОснование);
	
	СтруктураПредставлений = КонтурЛогистика_ОбработкаДокументовСервер.ВычислитьРеквизитыДокументаОснования(
		ИменаРеквизитов, ДокументТитулОбъект, КонтекстНастройкиКонвертации);
	
	Возврат СтруктураПредставлений;

КонецФункции

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)

	Перем ТекТовар;

	Если НоваяСтрока Тогда

		ТекТовар = Элементы.Товары.ТекущиеДанные;

		Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = ТекТовар.ИдентификаторСтроки;

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОрганизацииДоговора(Договор)
	
	РезультатФункции = Новый Структура("Заказчик, Экспедитор");
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.КонтурЛогистика_Договоры") Тогда
		РезультатФункции.Заказчик = Договор.Организация;
		РезультатФункции.Экспедитор = Договор.Контрагент;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции	

&НаКлиенте
Функция МожноДобавлять()
	Возврат ЗначениеЗаполнено(Объект.НомДок) И ЗначениеЗаполнено(Объект.ДатаДок) И ЗначениеЗаполнено(Объект.СвКлт)
		И ЗначениеЗаполнено(Объект.СвЭксп);
КонецФункции	

&НаСервереБезКонтекста
Функция ВыполнитьОперациюДобавленияНаСервере(ДокументСсылка)
	
	Результат = Документы.КонтурЛогистика_ПЭ_Титул1.ОтразитьПартиюТовараВ_ПЭ(ДокументСсылка);
	
	// ДобавитьРазборРезультатаПоиска
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура ВывестиРезультатПользователю(Текст)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	
	Сообщение.Сообщить();
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьВозможностьРедактированияСтоимости()
	Элементы.СтоимостьГруза.ТолькоПросмотр = Не Объект.УказыватьСтоимостьГрузаВручную;
КонецПроцедуры	

&НаСервере
Процедура УстановитьЗначениеПоУмолчаниюДляНовогоДокумента()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ЗаполнитьДефолты(Объект);
		
		Если Не ЗначениеЗаполнено(Объект.ТипСтоимости) Тогда
			Объект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ОбъявленнаяСтоимость;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ВалютаУчетаГруза) Тогда
			Объект.ВалютаУчетаГруза = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С("643", "руб");
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ВопросУстановитьЗначениеВТоварах(Параметры)

	ТекстВопроса = "Перезаполнить значение в табличной части?";
	РежимДиалога = РежимДиалогаВопрос.ДаНет;
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, РежимДиалога, , , ЭтаФорма, 
			"ОбработчикВопросаУстановитьЗначениеВТоварах", Параметры);
			
	ПроверитьДокумент();		

КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьЗначениеВТоварах(Реквизит, Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Для Каждого Товар Из Объект.Товары Цикл
			Товар[Реквизит] = Значение;
		КонецЦикла;	
	КонецЕсли; 	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПересчитатьВсеИтоги()
	
	Объект.КолМестПарт = Объект.Товары.Итог("КоличествоМест");
	Объект.ОбъемГруза = Объект.Товары.Итог("ОбъемКубМ");
	Объект.МассаБруттоКг = Объект.Товары.Итог("МассаБруттоКг");
	Объект.МассаНеттоКг = Объект.Товары.Итог("МассаНеттоКг");
	Объект.СтоимостьГруза = Итог("СтоимостьГруза");
	
КонецПроцедуры	

&НаКлиенте
Процедура НомДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВидТСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьДатыОтгрузкиПоУмолчаниюНаСервере()
	
	СтруктураДефолтов = Новый Структура;
	СтруктураДефолтов.Вставить("ПЭ_ДатОтгрСДнейПлюсОтТек", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ДатОтгрСДнейПлюсОтТек"));
	СтруктураДефолтов.Вставить("ПЭ_ДнейНаПогрузку", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ДнейНаПогрузку"));
	
	Возврат СтруктураДефолтов;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДатыОтгрузкиПоУмолчанию(Команда)
	
	СтруктураДефолтов = ЗаполнитьДатыОтгрузкиПоУмолчаниюНаСервере();
	
	СекундСутки = 86400;
	
	Если СтруктураДефолтов.ПЭ_ДатОтгрСДнейПлюсОтТек >= 0 Тогда 
		Объект.ДатОтгрС = ТекущаяДата() + СтруктураДефолтов.ПЭ_ДатОтгрСДнейПлюсОтТек * СекундСутки; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатОтгрС) И СтруктураДефолтов.ПЭ_ДнейНаПогрузку >= 0 Тогда 
		Объект.ДатОтгрПо = Объект.ДатОтгрС + СтруктураДефолтов.ПЭ_ДнейНаПогрузку * СекундСутки; 
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоведениеКлючевыхЭлементовФормы()
	
	Если РазрешеноРедактироватьКлючевыеРеквизиты() Тогда
		Элементы.СвКлт.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.СвЭксп.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.ДогТрЭксп.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьДоступностьТЧКонтейнеры()
	Элементы.СведенияОКонтейнерах.Доступность = Не Объект.ПрзПрвз = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВариантыПодачиКонтейнера.НетКонтейнера") 
КонецПроцедуры	

&НаСервере
Функция РазрешеноРедактироватьКлючевыеРеквизиты()
	
	Возврат Не(ОткрытоИзТитула Или ЗначениеЗаполнено(Объект.Титул1));
	
КонецФункции	

#КонецОбласти
