#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Титул", Титул);	
	
	Если Не ЗначениеЗаполнено(Титул) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТитула = Титул.Метаданные().Имя;
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Отчет ИнформацияДляТехподдержки", "Сформировать",	ИмяТитула, ИмяТитула);
	
	НачалоЗамера = ТекущаяДатаСеанса();
	
	Попытка
		ДанныеДляОтчета = КонтурЛогистика_ПечатьСервер.ДанныеДляИнформацииПоТитулуВТехподдержку(Титул, Параметры.РеквизитыФормы);
	Исключение
		
		ОтправитьМетрикуФормированияОтчета(ИмяТитула, ТекущаяДатаСеанса() - НачалоЗамера, "ERROR");
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		Отказ = Истина;
		
		Возврат;
		
	КонецПопытки;
	
	ОтправитьМетрикуФормированияОтчета(ИмяТитула, ТекущаяДатаСеанса() - НачалоЗамера, "SUCCESS");
	
	НомерЛиста = 1;
	Для каждого Данные Из ДанныеДляОтчета Цикл
		ЭтаФорма["Лист" + Строка(НомерЛиста) + "_" + Данные.Ключ] = Данные.Значение.ТабличныйДокумент;
		НомерЛиста = НомерЛиста + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФорматВыгрузки", "excel");
	
	#Если ВебКлиент Тогда			
		
		Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСФайламиПодключено", ЭтаФорма, ДополнительныеПараметры);	
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
									
	#Иначе
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
			"ВыборКаталогаВыгрузкиЗаверешение", ЭтаФорма, РежимДиалогаВыбораФайла.ВыборКаталога,
			"Укажите каталог для сохранения файлов обмена",,,,, ДополнительныеПараметры);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВMXL(Команда)
	
	ДополнительныеПараметры = Новый Структура("ФорматВыгрузки", "mxl");
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
		"ВыборКаталогаВыгрузкиЗаверешение", ЭтаФорма, РежимДиалогаВыбораФайла.ВыборКаталога,
		"Укажите каталог для сохранения файлов обмена",,,,, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦентрПоддержки(Команда)
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СформироватьАрхивZip");
	ДополнительныеПараметры.Вставить("ДвоичныеДанныеАрхива");
	ДополнительныеПараметры.Вставить("ФорматВыгрузки", "excel");
	ВыборКаталогаВыгрузкиЗаверешение(КаталогВременныхФайлов(), ДополнительныеПараметры);
	
	КонтурЛогистика_ЦентрПоддержкиКлиент.ОткрытьЦентрПоддержки(, "Чат", ДополнительныеПараметры.ДвоичныеДанныеАрхива);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКаталогаВыгрузкиЗаверешение(Результат, ДополнительныеПараметры) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Каталог = Результат;
	Иначе
		Каталог = Результат[0];
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("СформироватьАрхивZip") Тогда
		ФайлДляВыгрузки = ПолучитьИмяВременногоФайла("zip");		
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ФайлДляВыгрузки);			
	КонецЕсли;
	
	НаименованиеЛистов = НаименованиеЛистов();
	
	ИмяФайла = ИмяФайла(Титул);
	
	Если КонтурЛогистика_СтдСтрКлиентСервер.ВерсияПлатформыБольшеИлиРавна("8.3.12")
		И ДополнительныеПараметры.ФорматВыгрузки = "excel" Тогда
	
		Пакет = Вычислить("Новый ПакетОтображаемыхДокументов");
				
		ИменаРеквизитовФормы = ИменаРеквизитовФормы();
		Для каждого ИмяРеквизитаФормы Из ИменаРеквизитовФормы Цикл
			
			Если Лев(ИмяРеквизитаФормы, 4) <> "Лист" Тогда
				Продолжить;
			КонецЕсли;
			
			Лист = КонтурЛогистика_СтдСтрКлиентСервер.СтрРазделитьЛок(ИмяРеквизитаФормы, "_")[0];			
			
			ЭлементПакета = Пакет.Состав.Добавить();
			ЭлементПакета.Наименование = НаименованиеЛистов[Лист];
			ЭлементПакета.Данные = АдресТабДок(ЭтаФорма[ИмяРеквизитаФормы]);
			
		КонецЦикла;
		
		СоздатьКаталогСохранения(Каталог);
		
		ПутьКФайлу = Каталог + "\" + ИмяФайла + ".xlsx";
		Пакет.Записать(ПутьКФайлу, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		
		Если ДополнительныеПараметры.Свойство("СформироватьАрхивZip") Тогда
			ЗаписьZipФайла.Добавить(ПутьКФайлу);	
		КонецЕсли;
		
	Иначе	
		
		Каталог = Каталог + "\" + ИмяФайла;
		СоздатьКаталогСохранения(Каталог);
	
		ИменаРеквизитовФормы = ИменаРеквизитовФормы();
		Для каждого ИмяРеквизитаФормы Из ИменаРеквизитовФормы Цикл
			
			Если Лев(ИмяРеквизитаФормы, 4) <> "Лист" Тогда
				Продолжить;
			КонецЕсли;
			
			Лист = КонтурЛогистика_СтдСтрКлиентСервер.СтрРазделитьЛок(ИмяРеквизитаФормы, "_")[0];
			ИмяЛиста = НаименованиеЛистов[Лист];
			
			Если ДополнительныеПараметры.ФорматВыгрузки = "excel" Тогда
				ПутьКФайлу = Каталог + "\" + ИмяЛиста + ".xlsx";
				ЭтаФорма[ИмяРеквизитаФормы].Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);
			Иначе
				ПутьКФайлу = Каталог + "\" + ИмяЛиста + ".mxl";
				ЭтаФорма[ИмяРеквизитаФормы].Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.MXL);
			КонецЕсли;
			
			Если ДополнительныеПараметры.Свойство("СформироватьАрхивZip") Тогда
				ЗаписьZipФайла.Добавить(ПутьКФайлу);	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	Если ДополнительныеПараметры.Свойство("СформироватьАрхивZip") Тогда
		ЗаписьZipФайла.Записать();		
		ДополнительныеПараметры.ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ФайлДляВыгрузки);
	Иначе
		ЗапуститьПриложение(Каталог);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИменаРеквизитовФормы()	
	
	Результат = Новый Массив;
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого РеквизитФормы Из РеквизитыФормы Цикл
		Результат.Добавить(РеквизитФормы.Имя);
	КонецЦикла;	
	
	Возврат Результат;		
КонецФункции

&НаСервереБезКонтекста
Функция ИмяФайла(Титул)
	
	ТипЛогистики = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(Титул);
	ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистики);
	
	НомерДокумента = НомерДокумента(Титул, ТипЛогистики);
	
	ИмяФайла = ТипТитула + " № " + СокрЛП(НомерДокумента);
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УбратьНедопустимыеСимволыФС(ИмяФайла);
	
КонецФункции

&НаСервереБезКонтекста
Функция НомерДокумента(Титул, ТипЛогистики)
	
	НомерТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипЛогистики);
	
	Результат = "";
	
	Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Титул) Тогда
		Возврат Титул.ДокументЭТРН.НомерТрН;
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Титул) Тогда
		Если НомерТитула = "1" Тогда
			Результат = Титул.НомерПЛ;
		Иначе
			Результат = Титул.Титул1.НомерПЛ;
		КонецЕсли;
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Титул) Тогда
		Если НомерТитула = "1" Тогда
			Результат = Титул.НомЗак;
		Иначе
			Результат = Титул.Титул1.НомЗак;
		КонецЕсли;
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЭ(Титул) Тогда
		Если НомерТитула = "1" Тогда
			Результат = Титул.НомДок;
		Иначе
			Результат = Титул.Титул1.НомДок;
		КонецЕсли;
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЭР(Титул)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулСР(Титул) Тогда
		
		Результат = Титул.НомерДок;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СокрЛП(Титул.Номер);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьКаталогСохранения(ИмяКаталога)
	
	КаталогНаДиске = Новый Файл(ИмяКаталога);
    Если Не КаталогНаДиске.Существует() Тогда
       	СоздатьКаталог(ИмяКаталога);
	КонецЕсли;
	
Конецпроцедуры

&НаКлиенте
Функция НаименованиеЛистов()
	
	Результат = Новый Структура;
	Результат.Вставить("Лист1", "Общая тех. информация");
	Результат.Вставить("Лист2", "Титул");
	Результат.Вставить("Лист3", "Ошибка");
	Результат.Вставить("Лист4", "Организации");
	Результат.Вставить("Лист5", "Доп модули");
	Результат.Вставить("Лист6", "Группы доступа");
	Результат.Вставить("Лист7", "Файлы обмена");
	Результат.Вставить("Лист8", "Робот");
	Результат.Вставить("Лист9", "История состояний");
	Результат.Вставить("Лист10", "Custom data");
	Результат.Вставить("Лист11", "Все титулы");
	
	Возврат Результат;	
		
КонецФункции

&НаКлиенте
Процедура РасширениеРаботыСФайламиПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда	 
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
		Возврат;		  
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
		"ВыборКаталогаВыгрузкиЗаверешение", ЭтаФорма, РежимДиалогаВыбораФайла.ВыборКаталога,
		"Укажите каталог для сохранения файлов обмена",,,,, ДополнительныеПараметры);
		
КонецПроцедуры

&НаСервере
Процедура ОтправитьМетрикуФормированияОтчета(ИмяТитула, ВремяФормирования, Статус)
	
	Переменные = Новый Структура;
	Переменные.Вставить("Time", ВремяФормирования);
	Переменные.Вставить("Status", Статус);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(Переменные, "Отчет ИнформацияДляТехподдержки", "Сформирован", ИмяТитула, ИмяТитула); 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресТабДок(ТабДок)	
	Возврат ПоместитьВоВременноеХранилище(ТабДок, Новый УникальныйИдентификатор); 	
КонецФункции

#КонецОбласти