
Функция ПолучитьПараметрыФормы()

	УстановитьПривилегированныйРежим(Истина);	
	
	ДокШаблон = Документы.ЗаказКлиента.НайтиПоНомеру("КН00-005403", Дата('20210101000000'));
	
	Рез = Новый Структура();
	//Рез.Вставить("Склад",				Справочники.Склады.НайтиПоНаименованию("Склады для продажи", Истина));
	Рез.Вставить("Склад",				ДокШаблон.Склад);
	Рез.Вставить("Валюта",				Справочники.Валюты.НайтиПоКоду("643"));
	Рез.Вставить("НалогообложениеНДС",	Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
	Рез.Вставить("Документ",			ДокШаблон);
	Рез.Вставить("Соглашение",			ДокШаблон.Соглашение);

	Возврат Рез;

КонецФункции // ()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПарамФормы = ПолучитьПараметрыФормы();
	
	ПараметрыФормы = Новый Структура;

	ПараметрыФормы.Вставить("Документ",                                			ПарамФормы.Документ);
	ПараметрыФормы.Вставить("Соглашение",               						ПарамФормы.Соглашение);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС",          						Ложь);
	ПараметрыФормы.Вставить("НалогообложениеНДС",       						ПарамФормы.НалогообложениеНДС);
	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",								Истина);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти",	Истина);
	ПараметрыФормы.Вставить("Склад",                                   			ПарамФормы.Склад);
	ПараметрыФормы.Вставить("Валюта",                                  			ПарамФормы.Валюта);
	ПараметрыФормы.Вставить("Заголовок",                               			"Номенклатура");
	ПараметрыФормы.Вставить("Дата",                                    			ТекущаяДата());
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы); //, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры
