#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СформироватьНаименование(Перезаполнить = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Наименование)
	    Или Перезаполнить Тогда
		
		Наименование = "";
		
		Если ЗначениеЗаполнено(СрокДостГр) Тогда 
			Наименование = Наименование + "Доставить за" + Строка(СрокДостГр) + "сут. ";
		КонецЕсли; 
		   
		Если ЗначениеЗаполнено(ОгрСкор) Тогда
			
			Если Не ЗначениеЗаполнено(Наименование) Тогда
				Символ  = "О";
			Иначе 
				Символ = " о";	
			КонецЕсли;	  
			Наименование = Наименование + Символ + "рг. ск. " + Строка(ОгрСкор) + " ";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТемпНеНиже) 
			 Или ЗначениеЗаполнено(ТемпНеВыше) Тогда
				
				Символ = "t "; 
				 
				Если ЗначениеЗаполнено(ТемпНеНиже) Тогда 
					Символ = Символ + " от " + Строка(ТемпНеНиже);
				КонецЕсли;
					 
				Если ЗначениеЗаполнено(ТемпНеВыше) Тогда 
					Символ = Символ + " до " + Строка(ТемпНеВыше);
				КонецЕсли;	 
				
				Наименование = Наименование + Символ;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 	

#КонецЕсли