
#Область СобытияФормы

&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаКлиенте
Процедура ОД_ПослеЗаписиПосле(ПараметрыЗаписи)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаСервере
Процедура ОД_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// 17.05.2026 /100/
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Не объединять реализации", Истина);
	ФлагНеОбъединяитьРеализации = УправлениеСвойствами.ЗначениеСвойства(Объект.Партнер, Свойство);
	Если ФлагНеОбъединяитьРеализации <> Неопределено 
		И ФлагНеОбъединяитьРеализации Тогда
		ОснованияКоличество = ОснованияКоличество(Объект.Ссылка);
		Если ОснованияКоличество > 1 Тогда
			Отказ = Истина;
			Сообщить("Не объединять реализации по нескольким заказам клиента!!!");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаКлиенте
&После("ОбработкаВыбораПодборНаКлиенте")
Процедура ОД_ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)


	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаСервере
&После("ПриУдаленииКомплектующихНаСервере")
Процедура ОД_ПриУдаленииКомплектующихНаСервере(ИмяТЧ, ДополнительныйПараметр)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура ОД_Подключаемый_ВыполнитьКоманду(Команда)

	ИмяПФ = "ЗаявкаАвтотранспортаВер2";
	
	Если Команда.Имя = "ПодменюПечатьОбычное_" + ИмяПФ Тогда
		
		ДанныеЗаданиеНаПеревозку = ЗаданиеНаПеревозку(Объект.Ссылка);
		
		Если ПустаяСтрока(ДанныеЗаданиеНаПеревозку.КлючСвязи) Тогда
			Сообщить("! не определен документ Задание на перевозку");
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		
		ТекущийОбъектПечати = Новый Массив;
		ТекущийОбъектПечати.Добавить(ДанныеЗаданиеНаПеревозку.ЗаданиеНаПеревозку);
		ТекущийОбъектПечати.Добавить(ДанныеЗаданиеНаПеревозку.КлючСвязи);
		
		ТекМенеджерПечати = "Обработка." + ИмяПФ;
		ИД_ПечатнойФормы = "ВнешняяПечатнаяФорма." + ИмяПФ; 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТекМенеджерПечати, ИД_ПечатнойФормы, ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
	Иначе	
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область НаборыКомплекты

Процедура ЗаполнитьНаборыКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ_Товары.Номенклатура КАК Номенклатура,
		|	ТЗ_Товары.НоменклатураНабора КАК НоменклатураНабора,
		|	ТЗ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТЗ_Товары.СуммаСНДС КАК СуммаСНДС
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(ВТ_Товары.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_Товары.СуммаСНДС) КАК Сумма,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВТ_Товары.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок) КАК КоличествоВНаборе,
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Наборы.Набор КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Сумма / (ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе)
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
		|		ПО ВТ_Наборы.ВариантКомплектации = ВТ_ВариантыКомплектации.ВариантКомплектации";
	
	Запрос.УстановитьПараметр("ТЗ_Товары", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();

	Наборы.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Наборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	НаборыКомплектыКоличество = Наборы.Количество();

КонецПроцедуры

#КонецОбласти

#Область Дополнительно

Функция ПолучитьЗаказКлиента(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Ссылка = &Реализация
		|		И РеализацияТоваровУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		РеализацияТоваровУслугТовары.ЗаказКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|	ГДЕ
		|		РеализацияТоваровУслугТовары.Ссылка = &Реализация
		|		И РеализацияТоваровУслугТовары.Ссылка.Проведен) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.ЗаказКлиента.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Реализация", п_Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ()

Функция ЗаданиеНаПеревозку(п_Реализация)
	
	Рез = Новый Структура();
	Рез.Вставить("ЗаданиеНаПеревозку", "");
	Рез.Вставить("КлючСвязи", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПеревозку,
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	
	
	ТекЗаказКлиента = ПолучитьЗаказКлиента(п_Реализация);
	
	Если НЕ ЗначениеЗаполнено(ТекЗаказКлиента) Тогда
		Возврат Рез;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Распоряжение", ТекЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()

Функция ОснованияКоличество(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", п_Реализация);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать().Количество();

КонецФункции // ()

#КонецОбласти
