#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет шапку и связанные табличные части по заявке на маршрут из поручения
//
// Параметры:
//  ДокументЗаявкаНаМаршрут - ДокументСсылка.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
//
Процедура ЗаполнитьПоЗаявкеНаМаршрут(ДокументЗаявкаНаМаршрут) Экспорт
	
	ЗаявкаНаМаршрут = ДокументЗаявкаНаМаршрут;
	НомПартГруз = ДокументЗаявкаНаМаршрут.НомПарт;
	ИдентПартГруз = ДокументЗаявкаНаМаршрут.ИдПарт;
	КоличествоМест = ДокументЗаявкаНаМаршрут.КолМестПарт;
	МассаБруттоКг = ДокументЗаявкаНаМаршрут.МассаБруттоКг;
	МассаНеттоКг = ДокументЗаявкаНаМаршрут.МассаНеттоКг;
	ТипСтоимости = ДокументЗаявкаНаМаршрут.ТипСтоимости;
	Стоимость = ДокументЗаявкаНаМаршрут.СтоимостьГруза;
	Валюта = ДокументЗаявкаНаМаршрут.ВалютаУчетаГруза;
	СостояниеГруза = Документы.КонтурЛогистика_СкладскаяРасписка.СостояниеГруза();
	СпособДоставкиГруза = Документы.КонтурЛогистика_СкладскаяРасписка.СпособДоставкиГруза();
	
	ЗаполнитьТабличнуюЧастьСРПоСвГруз(ДокументЗаявкаНаМаршрут);
	ЗаполнитьУсловияПриема(ДокументЗаявкаНаМаршрут);
	СкопироватьКонтейнерыГрузаВДокумент(ДокументЗаявкаНаМаршрут);
	
	Для Каждого ТекущаяСтрока Из ДокументЗаявкаНаМаршрут.РеквЗакПост Цикл
		НоваяСтрокаРеквизитов = РеквЗаказПок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизитов, ТекущаяСтрока);
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ДокументЗаявкаНаМаршрут.СопрДокПарт Цикл
		НоваяСтрокаСопрДок = СопрДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСопрДок, ТекущаяСтрока);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТипСтоимости) Тогда
		ТипыСтоимости = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(
			Товары.Выгрузить().ВыгрузитьКолонку("ТипСтоимости"));
		Если ТипыСтоимости.Количество() = 1 Тогда
			ТипСтоимости = ТипыСтоимости[0];
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюты = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(Товары.Выгрузить().ВыгрузитьКолонку("Валюта"));
		Если Валюты.Количество() = 1 Тогда
			Валюта = Валюты[0];
		КонецЕсли;
	КонецЕсли;
	
	// ИнфПоля
	ПараметрыОтбораМаршрута = Новый Структура("ИдентификаторСтрокиТоваров", "");
	Для Каждого ТекущаяСтрока Из ДокументЗаявкаНаМаршрут.ИнфПол.НайтиСтроки(ПараметрыОтбораМаршрута) Цикл
		НоваяСтрока = ИнфПол.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет табличную часть Товары данными из документа КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
//
Процедура ЗаполнитьТабличнуюЧастьСРПоСвГруз(ДокументСсылка) Экспорт
	
	КопируемыеРеквизитыСтрокиТовара = "Номенклатура, Характеристика, Количество, УпаковкаЕдиницаИзмерения, Учитывать,
		|ОтгрузочноеНаименование, КоличествоМест, ОбъемКубМ, ПрзИзъятВещ, ТипСтоимости, КодТНВЭД, МассаБруттоКг, МассаНеттоКг";
	
	Для Каждого ТекущийТовар Из ДокументСсылка.Товары Цикл
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, ТекущийТовар, КопируемыеРеквизитыСтрокиТовара);
		
		НоваяСтрокаТовара.ОписаниеОпасногоГруза = ТекущийТовар.СвОпаснГруз;
		НоваяСтрокаТовара.ПодлежитУчетуВГосСист = ТекущийТовар.УчГосСист;
		НоваяСтрокаТовара.Стоимость = ТекущийТовар.СтоимостьГруза;
		НоваяСтрокаТовара.Валюта = ТекущийТовар.ВалютаУчетаГруза;
		НоваяСтрокаТовара.ОсобыеОтметки = "Отсутствует";
		
		СкопироватьТаблицу("СведенияГосСистем", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		СкопироватьТаблицу("Марк", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		СкопироватьТаблицу("ИнфУпГруз", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		
		// ИнфПоля
		ПараметрыОтбораМаршрута = Новый Структура("ИдентификаторСтрокиТоваров", ТекущийТовар.ИдентификаторСтроки);
		Для Каждого ТекущаяСтрока Из ДокументСсылка.ИнфПол.НайтиСтроки(ПараметрыОтбораМаршрута) Цикл
			НоваяСтрока = ИнфПол.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ИдентификаторСтрокиТоваров = НоваяСтрокаТовара.ИдентификаторСтроки;
		КонецЦикла;
		
		// Страны происхождения продукции
		СкопироватьТаблицу("СтраныПроисхожденияПродукции", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				Экспедитор,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Если ПараметрыФайлаРеквизиты = Неопределено Тогда
		ПараметрыФайлаРеквизиты = Новый Структура;
	КонецЕсли;
	
	Попытка
		Заблокировать();
	Исключение
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если Не РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	РезультатВалидации = Документы.КонтурЛогистика_СкладскаяРасписка.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфЭксп = ТекущаяДатаСеанса();
	ВрИнфЭксп = ТекущаяДатаСеанса();
	
	Попытка
		
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфЭксп, ВрИнфЭксп);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
			
			ТекстОшибок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста);
			Результат.МассивОшибок.Добавить(ТекстОшибок);
			Результат.Успешно = Ложь;
			
			Возврат Результат;
			
		КонецЕсли;
		
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
			РезультатФормированияТекста, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка,
			ПараметрыФайлаРеквизиты, Ссылка);
		
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(
				Ссылка, Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена,, Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
			Если ПараметрыФайлаРеквизиты.Свойство("ТребуетсяПодпись") И ПараметрыФайлаРеквизиты.ТребуетсяПодпись Тогда
				ПервыйФайлДокумента = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйФайлДокумента(Ссылка);
				
				Если ЗначениеЗаполнено(ПервыйФайлДокумента)
					И (ПервыйФайлДокумента.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.Получен
						Или ПервыйФайлДокумента.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.Отправлен) Тогда
					
					ФайлОбъект = РезультатСозданияФайла.Файл.ПолучитьОбъект();
					ФайлОбъект.ШаблонОснование = ПервыйФайлДокумента;
					ФайлОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать();
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		
		Разблокировать();
		
		Результат.Успешно = Ложь;
		Результат.МассивОшибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	НомерТитула = "";
	Формат = "5.01";
	ТипДокументооборота = "__SR";
	ТипКодировки = "utf-8";
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ОтправительШаблона) Тогда
		Если ОтправительШаблона = Клиент Тогда
			Получатель = Экспедитор;
		Иначе
			Получатель = Клиент;
		КонецЕсли;
		Отправитель = ОтправительШаблона;
	Иначе
		Получатель = Клиент;
		Отправитель = Экспедитор;
	КонецЕсли;
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаСР(Получатель, Отправитель, GUID);
	Результат.Вставить("ИдФайл", XDTO_Файл.ИдФайл);
	
	// Подписант
	ПодписантСтруктура = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		Экспедитор, ПользовательПодписант, ДатаДок, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант = КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда
		Результат.Вставить("ИдентификаторМЧД", ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ = КС.XDTO_Документ(
		НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	XDTO_Файл.Документ.НаимДок = Документы.КонтурЛогистика_СкладскаяРасписка.НаимДок();
	
	// Содержание складской расписки
	XDTO_СодИнфЭксп = КС.XDTO_СодИнфЭксп(НомерТитула, ТипДокументооборота, Формат, ЭтотОбъект);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфЭксп", XDTO_СодИнфЭксп);
	
	// Текст файла
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат, ТипКодировки);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID", GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура СконвертироватьСтрокуТоваров1СвЛогистика(НомерСтроки) Экспорт
	
	СтрокаТоваров = Товары.Найти(НомерСтроки, "НомерСтроки");
	
	ТЗ_ТоварыВременная = Товары.ВыгрузитьКолонки();
	
	СтрокаТоваровВременная = ТЗ_ТоварыВременная.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТоваровВременная, СтрокаТоваров);
	
	КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
	
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаТоваровВременная);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Загружен из сервиса, создаем из файла обмена
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	// Из поручения экспедитору
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул2") Тогда
		
		ЗаполнитьПоДокументуПоручениеЭкспедитору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И (ТипЗнч(ДанныеЗаполнения.ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1")
			Или ТипЗнч(ДанныеЗаполнения.ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул2")) Тогда
		
		ЗаполнитьПоДокументуПоручениеЭкспедитору(ДанныеЗаполнения.ПредыдущийТитул);
		
	// Из заявки на маршрут
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут") Тогда
		
		ЗаполнитьШапкуПоПервойЗаявке(ДанныеЗаполнения);
		ЗаполнитьПоЗаявкеНаМаршрут(ДанныеЗаполнения);
		ОбновитьИтогиПартииВШапке();
		
	// Из мастера по массиву маршрутов — поддерживается только первый элемент
	ИначеЕсли ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Массив")
		И ДанныеЗаполнения.Количество() <> 0 Тогда
		
		ЗаполнитьПоПервойЗаявкеИзМассива(ДанныеЗаполнения);
		
	// Из экспедиторской расписки
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ЭкспедиторскаяРасписка") Тогда
		
		ЗаполнитьПоЭкспедиторскойРасписке(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ЭкспедиторскаяРасписка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ЭкспедиторскаяРасписка) Тогда
		
		ЗаявкаНаМаршрут = Неопределено;
		ИдентификаторСтрокиМаршрута = "";
		ДанныеЗаполнения.Свойство("ЗаявкаНаМаршрут", ЗаявкаНаМаршрут);
		ДанныеЗаполнения.Свойство("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиМаршрута);
		ЗаполнитьПоЭкспедиторскойРасписке(ДанныеЗаполнения.ЭкспедиторскаяРасписка, ЗаявкаНаМаршрут, ИдентификаторСтрокиМаршрута);
		
	// Новая СР на основании существующей СР
	ИначеЕсли ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Основание")
		И ДанныеЗаполнения.Свойство("СоздатьНовуюСкладскуюРасписку")
		И ДанныеЗаполнения.СоздатьНовуюСкладскуюРасписку Тогда
		
		Склад = Неопределено;
		ДанныеЗаполнения.Свойство("Склад", Склад);
		Документы.КонтурЛогистика_СкладскаяРасписка.ЗаполнитьНовуюСкладскуюРаспискуНаОсновании(
			ЭтотОбъект, ДанныеЗаполнения.Основание, Склад);
		
	// Копирование
	ИначеЕсли ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Титул")
		И ДанныеЗаполнения.Свойство("Скопировать")
		И ДанныеЗаполнения.Скопировать Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Титул);
		Для Каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл
			Для Каждого Стр Из ДанныеЗаполнения.Титул[ТЧ.Имя] Цикл
				НоваяСтрока = ЭтотОбъект[ТЧ.Имя].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			КонецЦикла;
		КонецЦикла;
		
		Номер = "";
		Дата = ТекущаяДатаСеанса();
		ДатаДок = ТекущаяДатаСеанса();
		КонтурЛогистика_ОбработкаДокументовСервер.ДобавитьНомерКопииКНомеруДокумента(
			НомерДок, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка);
		
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоПользователю();
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"СкладскаяРасписка_ОбработкаЗаполнения_После", Истина, ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	УИД_СкладР = "";
	kl_id = "";
	ДатИнфЭксп = Неопределено;
	ВрИнфЭксп = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("СкладскаяРасписка_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДокументуПоручениеЭкспедитору(ДокументСсылка)
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1") Тогда
		ПЭ_Титул1 = ДокументСсылка;
	Иначе
		ПЭ_Титул1 = ДокументСсылка.Титул1;
	КонецЕсли;
	
	Запрос = Документы.КонтурЛогистика_ПЭ_Титул1.ПолучитьЗапросСпискаДокументовМаршрута(ПЭ_Титул1);
	Маршруты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если Маршруты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьШапкуПоПервойЗаявке(Маршруты[0]);
	ЗаполнитьПоЗаявкеНаМаршрут(Маршруты[0]);
	ОбновитьИтогиПартииВШапке();
	
КонецПроцедуры

Процедура ЗаполнитьПоПервойЗаявкеИзМассива(Маршруты)
	
	ПервыйЭлемент = Маршруты[0];
	
	Если ТипЗнч(ПервыйЭлемент) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут") Тогда
		ЗаявкаНаМаршрут = ПервыйЭлемент;
	ИначеЕсли ТипЗнч(ПервыйЭлемент) = Тип("Структура")
		И ПервыйЭлемент.Свойство("ЗаявкаНаМаршрут")
		И ЗначениеЗаполнено(ПервыйЭлемент.ЗаявкаНаМаршрут) Тогда
		ЗаявкаНаМаршрут = ПервыйЭлемент.ЗаявкаНаМаршрут;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьШапкуПоПервойЗаявке(ЗаявкаНаМаршрут);
	ЗаполнитьПоЗаявкеНаМаршрут(ЗаявкаНаМаршрут);
	ОбновитьИтогиПартииВШапке();
	
КонецПроцедуры

Процедура ЗаполнитьШапкуПоПервойЗаявке(ПерваяЗаявкаНаМаршрут)
	
	ПЭ_Титул1 = ПерваяЗаявкаНаМаршрут.Титул1;
	
	НомерДок = ПЭ_Титул1.НомДок;
	ДатаДок = ТекущаяДатаСеанса();
	Клиент = ПЭ_Титул1.СвКлиент;
	Экспедитор = ПЭ_Титул1.СвЭксп;
	ЭкспедицияДоговор = ПЭ_Титул1.ДогТрЭксп;
	СвСтрах = ПерваяЗаявкаНаМаршрут.СвСтрах;
	
	ПользовательПодписант = ПЭ_Титул1.ПользовательПодписант;
	ПараметрНастроекПодписания = ПЭ_Титул1.ПараметрНастроекПодписания;
	
КонецПроцедуры

Процедура ОбновитьИтогиПартииВШапке()
	
	МассаБруттоКг = Товары.Итог("МассаБруттоКг");
	МассаНеттоКг = Товары.Итог("МассаНеттоКг");
	КоличествоМест = Товары.Итог("КоличествоМест");
	Стоимость = Товары.Итог("Стоимость");
	
	Если Не ЗначениеЗаполнено(ТипСтоимости) Тогда
		ТипыСтоимости = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(
			Товары.Выгрузить().ВыгрузитьКолонку("ТипСтоимости"));
		Если ТипыСтоимости.Количество() = 1 Тогда
			ТипСтоимости = ТипыСтоимости[0];
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюты = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(Товары.Выгрузить().ВыгрузитьКолонку("Валюта"));
		Если Валюты.Количество() = 1 Тогда
			Валюта = Валюты[0];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЭкспедиторскойРасписке(ДокументЭР, ЗаявкаНаМаршрут = Неопределено,
	ИдентификаторСтрокиЗаявкиНаМаршрут = "")
	
	ЭкспедиторскаяРасписка = ДокументЭР;
	ПЭ_Титул1 = ДокументЭР.ПЭ_Титул1;
	
	НомерДок = ДокументЭР.НомерДок;
	ДатаДок = ТекущаяДатаСеанса();
	Клиент = ДокументЭР.Клиент;
	Экспедитор = ДокументЭР.Экспедитор;
	ЭкспедицияДоговор = ДокументЭР.ЭкспедицияДоговор;
	ОтправительШаблона = ДокументЭР.ОтправительШаблона;
	ПользовательПодписант = ДокументЭР.ПользовательПодписант;
	ПараметрНастроекПодписания = ДокументЭР.ПараметрНастроекПодписания;
	СпособДоставкиГруза = Документы.КонтурЛогистика_СкладскаяРасписка.СпособДоставкиГруза();
	
	СтрокаМаршрутаЭР = НайтиСтрокуМаршрутаЭР(ДокументЭР, ЗаявкаНаМаршрут, ИдентификаторСтрокиЗаявкиНаМаршрут);
	Если СтрокаМаршрутаЭР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьШапкуПартииИзСтрокиМаршрутаЭР(СтрокаМаршрутаЭР);
	
	ЗаполнитьУсловияПриема(, ДокументЭР, СтрокаМаршрутаЭР);
	ЗаполнитьТоварыИзЭР(ДокументЭР, СтрокаМаршрутаЭР.ИдентификаторСтроки);
	ЗаполнитьРеквизитыЗаказаИзЭР(ДокументЭР, СтрокаМаршрутаЭР.ИдентификаторСтроки);
	ЗаполнитьСопрДокПартИзЭР(ДокументЭР, СтрокаМаршрутаЭР.ИдентификаторСтроки);
	ЗаполнитьИнфПолМаршрутаИзЭР(ДокументЭР, СтрокаМаршрутаЭР.ИдентификаторСтроки);
	
	ЗаполнитьСопрДокИзЭР(ДокументЭР);
	ЗаполнитьИнфПолДокументаИзЭР(ДокументЭР);
	ОбновитьИтогиПартииВШапке();
	
КонецПроцедуры

Функция НайтиСтрокуМаршрутаЭР(ДокументЭР, ЗаявкаНаМаршрут, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	Если ЗначениеЗаполнено(ИдентификаторСтрокиЗаявкиНаМаршрут) Тогда
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ИдентификаторСтрокиЗаявкиНаМаршрут);
		НайденныеСтроки = ДокументЭР.ЗаявкиНаМаршрут.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0];
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаМаршрут) Тогда
		
		ИдентификаторПартии = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ЗаявкаНаМаршрут, "ИдПарт");
		
		Для Каждого СтрокаМаршрута Из ДокументЭР.ЗаявкиНаМаршрут Цикл
			
			Если ЗначениеЗаполнено(СтрокаМаршрута.ЗаявкаНаМаршрут)
				И СтрокаМаршрута.ЗаявкаНаМаршрут = ЗаявкаНаМаршрут Тогда
				Возврат СтрокаМаршрута;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИдентификаторПартии)
				И ИдентификаторПартии = СтрокаМаршрута.Идентификатор Тогда
				Возврат СтрокаМаршрута;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ДокументЭР.ЗаявкиНаМаршрут.Количество() > 0 Тогда
		
		Возврат ДокументЭР.ЗаявкиНаМаршрут[0];
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьШапкуПартииИзСтрокиМаршрутаЭР(СтрокаМаршрута)
	
	ЗаявкаНаМаршрут = СтрокаМаршрута.ЗаявкаНаМаршрут;
	НомПартГруз = СтрокаМаршрута.Номер;
	ИдентПартГруз = СтрокаМаршрута.Идентификатор;
	КоличествоМест = СтрокаМаршрута.КоличествоМест;
	МассаБруттоКг = СтрокаМаршрута.МассаБруттоКг;
	МассаНеттоКг = СтрокаМаршрута.МассаНеттоКг;
	ТипСтоимости = СтрокаМаршрута.ТипСтоимости;
	Стоимость = СтрокаМаршрута.Стоимость;
	Валюта = СтрокаМаршрута.Валюта;
	СостояниеГруза = СтрокаМаршрута.СостояниеГруза;
	СостояниеТары = СтрокаМаршрута.СостояниеТары;
	СостояниеУпаковки = СтрокаМаршрута.СостояниеУпаковки;
	СостояниеМаркировки = СтрокаМаршрута.СостояниеМаркировки;
	СостояниеОпломбирования = СтрокаМаршрута.СостояниеОпломбирования;
	
КонецПроцедуры

Процедура ЗаполнитьУсловияПриема(ДокументЗаявкаНаМаршрут = Неопределено,
	ДокументЭР = Неопределено, СтрокаМаршрутаЭР = Неопределено)
	
	НоваяСтрока = УсловияПриемаГрХран.Добавить();
	НоваяСтрока.ФДатХран = ТекущаяДатаСеанса();
	НоваяСтрока.ФВрХран = ТекущаяДатаСеанса();
	
	Если СтрокаМаршрутаЭР <> Неопределено Тогда
		
		НоваяСтрока.СостояниеГруза = СтрокаМаршрутаЭР.СостояниеГруза;
		НоваяСтрока.СостояниеТары = СтрокаМаршрутаЭР.СостояниеТары;
		НоваяСтрока.СостояниеУпаковки = СтрокаМаршрутаЭР.СостояниеУпаковки;
		НоваяСтрока.СостояниеМаркировки = СтрокаМаршрутаЭР.СостояниеМаркировки;
		НоваяСтрока.СостояниеОпломбирования = СтрокаМаршрутаЭР.СостояниеОпломбирования;
		НоваяСтрока.ЛицоПриемки = ДокументЭР.ЛицоПриемки;
		НоваяСтрока.ДоговорЛицаПриемки = ДокументЭР.ДоговорЛицаПриемки;
		
	Иначе
		
		НоваяСтрока.СостояниеГруза = СостояниеГруза;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыИзЭР(ДокументЭР, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	НайденныеСтроки = ДокументЭР.Товары.НайтиСтроки(ПараметрыОтбора);
	ИсключаемыеРеквизиты = "ИдентификаторСтроки, НомерСтроки";
	
	Для Каждого СтрокаТовараЭР Из НайденныеСтроки Цикл
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, СтрокаТовараЭР,, ИсключаемыеРеквизиты);
		
		СкопироватьТаблицу("СведенияГосСистем", НоваяСтрокаТовара.ИдентификаторСтроки,
			СтрокаТовараЭР.ИдентификаторСтроки, ДокументЭР);
		СкопироватьТаблицу("Марк", НоваяСтрокаТовара.ИдентификаторСтроки,
			СтрокаТовараЭР.ИдентификаторСтроки, ДокументЭР);
		СкопироватьТаблицу("ИнфУпГруз", НоваяСтрокаТовара.ИдентификаторСтроки,
			СтрокаТовараЭР.ИдентификаторСтроки, ДокументЭР);
		
		// Страны происхождения продукции
		СкопироватьТаблицу("СтраныПроисхожденияПродукции", НоваяСтрокаТовара.ИдентификаторСтроки,
			СтрокаТовараЭР.ИдентификаторСтроки, ДокументЭР);
		
		// ИнфПоля
		ПараметрыОтбораМаршрута = Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовараЭР.ИдентификаторСтроки);
		Для Каждого ТекущаяСтрока Из ДокументЭР.ИнфПол.НайтиСтроки(ПараметрыОтбораМаршрута) Цикл
			НоваяСтрока = ИнфПол.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ИдентификаторСтрокиТоваров = НоваяСтрокаТовара.ИдентификаторСтроки;
		КонецЦикла;
		
	КонецЦикла;
	
	СкопироватьКонтейнерыГрузаВДокумент(ДокументЭР, ИдентификаторСтрокиЗаявкиНаМаршрут);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗаказаИзЭР(ДокументЭР, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	
	Для Каждого ТекущаяСтрока Из ДокументЭР.РеквЗакПост.НайтиСтроки(ПараметрыОтбора) Цикл
		НоваяСтрока = РеквЗаказПок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСопрДокПартИзЭР(ДокументЭР, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	
	Для Каждого ТекущаяСтрока Из ДокументЭР.СопрДокПарт.НайтиСтроки(ПараметрыОтбора) Цикл
		НоваяСтрока = СопрДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСопрДокИзЭР(ДокументЭР)
	
	Для Каждого ТекущаяСтрока Из ДокументЭР.СопрДок Цикл
		НоваяСтрока = СопрДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнфПолМаршрутаИзЭР(ДокументЭР, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	ПараметрыОтбораМаршрута = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	
	Для Каждого ТекущаяСтрока Из ДокументЭР.ИнфПол.НайтиСтроки(ПараметрыОтбораМаршрута) Цикл
		Если ТекущаяСтрока.ИдентификаторСтрокиТоваров <> "" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ИнфПол.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнфПолДокументаИзЭР(ДокументЭР)
	
	ПараметрыОтбораДокумента = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", "");
	
	Для Каждого ТекущаяСтрока Из ДокументЭР.ИнфПол.НайтиСтроки(ПараметрыОтбораДокумента) Цикл
		НоваяСтрока = ИнфПол.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьТаблицу(ТаблицаКопирования, ИдентификаторСтрокиТоваров, ИдентификаторСтрокиГруза, ДокументСсылка)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиГруза);
	Строки = ДокументСсылка[ТаблицаКопирования].НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаКопирования Из Строки Цикл
		
		СтрокаПриемник = ЭтотОбъект[ТаблицаКопирования].Добавить();
		СтрокаПриемник.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаКопирования,, "ИдентификаторСтрокиТоваров");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьКонтейнерыГрузаВДокумент(ДокументСсылка, ИдентификаторСтрокиЗаявкиНаМаршрут = Неопределено)
	
	Если ИдентификаторСтрокиЗаявкиНаМаршрут = Неопределено Тогда
		СтрокиКонтейнеров = ДокументСсылка.СведенияОКонтейнерах;
		ПризнакПеревозки = ДокументСсылка.ПрзПрвз;
	Иначе
		// ЭР
		ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
		СтрокиКонтейнеров = ДокументСсылка.СведенияОКонтейнерах.НайтиСтроки(ПараметрыОтбора);
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ИдентификаторСтрокиЗаявкиНаМаршрут);
		ЗаявкиНаМаршрут = ДокументСсылка.ЗаявкиНаМаршрут.НайтиСтроки(ПараметрыОтбора);
		Если ЗаявкиНаМаршрут.Количество() = 0 Тогда
			ПризнакПеревозки = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.НетКонтейнера;
		Иначе
			ПризнакПеревозки = ЗаявкиНаМаршрут[0].ПризнакПеревозки;
		КонецЕсли;
	КонецЕсли;
	
	ГруженныйКонтейнер = (ПризнакПеревозки = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.ПриемКПеревозкеГруженогоКонтейнера);
	
	Для Каждого СтрокаКонтейнера Из СтрокиКонтейнеров Цикл
		
		Если КонтейнерУжеДобавлен(СтрокаКонтейнера.Номер, СтрокаКонтейнера.ИдентификационныйНомер) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СведенияОКонтейнерах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКонтейнера);
		НоваяСтрока.ГруженныйКонтейнер = ГруженныйКонтейнер;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КонтейнерУжеДобавлен(НомерКонтейнера, ИдентификационныйНомерКонтейнера)
	
	Для Каждого ТекущаяСтрока Из СведенияОКонтейнерах Цикл
		
		Если ТекущаяСтрока.Номер = НомерКонтейнера
			И СокрЛП(ТекущаяСтрока.ИдентификационныйНомер) = СокрЛП(ИдентификационныйНомерКонтейнера) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	Перем СодИнфЭксп;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
	Если XDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыУчастниковЭДО = КС.ИдентификаторыСторонИзИмениФайлаТитула(
		ФайлСсылка.ИмяФайла, КС.XDTO_ПолучитьЗначениеСвойства(XDTO, "ИдФайл"));
	
	ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодИнфЭксп, ИдентификаторыУчастниковЭДО);
	ЗаполнитьСвГрузИзXDTO(СодИнфЭксп);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, СодИнфЭксп, ИдентификаторыУчастниковЭДО)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ЭлДокумент = КС.XDTO_Вычислить(XDTO, "Документ");
	Если ЭлДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДатИнфЭксп = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(ЭлДокумент, "ДатИнфЭксп"));
	ВрИнфЭксп = КС.Конвертировать_ВремяТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(ЭлДокумент, "ВрИнфЭксп"));
	
	СодИнфЭксп = КС.XDTO_Вычислить(ЭлДокумент, "СодИнфЭксп");
	Если СодИнфЭксп = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УИД_СкладР_raw = КС.XDTO_Вычислить(СодИнфЭксп, "УИД_СкладР");
	Если ЗначениеЗаполнено(УИД_СкладР_raw) Тогда
		УИД_СкладР = УИД_СкладР_raw;
	КонецЕсли;
	
	НомерДок = КС.XDTO_Вычислить(СодИнфЭксп, "НомДок");
	ДатаДок = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "ДатаДок"));
	
	УИД_ПорЭксп_raw = КС.XDTO_Вычислить(СодИнфЭксп, "УИД_ПорЭксп");
	Если ЗначениеЗаполнено(УИД_ПорЭксп_raw) Тогда
		ПЭ_Титул1 = Документы.КонтурЛогистика_ПЭ_Титул1.НайтиПоРеквизиту("УИД_ПорЭксп", УИД_ПорЭксп_raw);
	КонецЕсли;
	
	УИД_ЭкспРас_raw = КС.XDTO_Вычислить(СодИнфЭксп, "УИД_ЭкспРас");
	Если ЗначениеЗаполнено(УИД_ЭкспРас_raw) Тогда
		ЭкспедиторскаяРасписка = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.НайтиПоРеквизиту("УИД_ЭкспР", УИД_ЭкспРас_raw);
	КонецЕсли;
	
	УИД_ПредСкладР_raw = КС.XDTO_Вычислить(СодИнфЭксп, "УИД_ПредСкладР");
	Если ЗначениеЗаполнено(УИД_ПредСкладР_raw) Тогда
		СкладскаяРасписка = Документы.КонтурЛогистика_СкладскаяРасписка.НайтиПоРеквизиту("УИД_СкладР", УИД_ПредСкладР_raw);
	КонецЕсли;
	
	СвКлнт = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СвКлнт");
	Клиент = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		СвКлнт, ИдентификаторыУчастниковЭДО.Клиент, Истина);
	
	СвЭксп = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СвЭксп");
	Экспедитор = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		СвЭксп, ИдентификаторыУчастниковЭДО.Экспедитор, Истина);
	
	ДогТрЭксп = КС.XDTO_Вычислить(СодИнфЭксп, "ДогТрЭксп");
	ЭкспедицияДоговор = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ДогТрЭксп, "Рекв");
	
	СопрДок.Очистить();
	КС.ЗаполнитьРеквДокТип(СодИнфЭксп, "СопрДок", ЭтотОбъект);
	
	СведСклад = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СведСклад");
	Если СведСклад <> Неопределено Тогда
		
		XDTO_АдресПользТип = КС.XDTO_ПолучитьЗначениеСвойства(СведСклад, "АдрСклад");
		XDTO_АдресТип = КС.XDTO_ПолучитьЗначениеСвойства(XDTO_АдресПользТип, "Адрес");
		XDTO_ВладИнфр = КС.XDTO_ПолучитьЗначениеСвойства(XDTO_АдресПользТип, "ВладИнфр");
		Склад = КС.Конвертировать_АдресТип_вПунктМаршрутаЛогистика(XDTO_АдресТип,,, XDTO_ВладИнфр);
		
		СвВладСклад = КС.XDTO_ПолучитьЗначениеСвойства(СведСклад, "СвВладСклад");
		Если СвВладСклад <> Неопределено Тогда
			ВладелецСклада = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(СвВладСклад);
			
			// Обновим собственника
			Если ЗначениеЗаполнено(Склад) И ЗначениеЗаполнено(ВладелецСклада) И Склад.Собственник <> ВладелецСклада Тогда
				СкладОбъект = Склад.ПолучитьОбъект();
				СкладОбъект.Собственник = ВладелецСклада;
				СкладОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	КС.ЗаполнитьИнфПолИзXDTO(СодИнфЭксп, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьСвГрузИзXDTO(Знач СодИнфЭксп)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	УсловияПриемаГрХран.Очистить();
	РеквЗаказПок.Очистить();
	Товары.Очистить();
	СведенияГосСистем.Очистить();
	ИнфУпГруз.Очистить();
	СведенияОКонтейнерах.Очистить();
	Марк.Очистить();
	СтраныПроисхожденияПродукции.Очистить();
	
	СвГруз = КС.XDTO_Вычислить(СодИнфЭксп, "СвГруз");
	Если СвГруз = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомПартГруз = КС.XDTO_Вычислить(СвГруз, "НомПартГруз");
	ИдентПартГруз = КС.XDTO_Вычислить(СвГруз, "ИдентПартГруз");
	КоличествоМест = КС.XDTO_ВычислитьЧисло(СвГруз, "КолМестПарт");
	
	ЗаполнитьСтоимость(СвГруз, ЭтотОбъект, "ПартияСР");
	
	ВесГрузПарт = КС.XDTO_Вычислить(СвГруз, "ВесГрузПарт");
	Если ВесГрузПарт <> Неопределено Тогда
		МассаБруттоКг = КС.XDTO_ВычислитьЧисло(ВесГрузПарт, "ВесБрутто");
		МассаНеттоКг = КС.XDTO_ВычислитьЧисло(ВесГрузПарт, "ВесНетто");
	КонецЕсли;
	
	ЗаполнитьУсловияПриемаГрИзXDTO(СвГруз);
	
	РеквЗаказПост_raw = КС.XDTO_Вычислить(СвГруз, "РеквЗаказПок");
	Если РеквЗаказПост_raw <> Неопределено Тогда
		Для Каждого ТекущийРеквизит Из КС.XDTO_ВычислитьМассивXDTO(РеквЗаказПост_raw) Цикл
			СтрокаДатаТип = КС.XDTO_ПолучитьЗначениеСвойства(ТекущийРеквизит, "РеквДатаДок");
			
			НовыйРеквизитЗаказа = РеквЗаказПок.Добавить();
			НовыйРеквизитЗаказа.РеквНаимДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНаимДок");
			НовыйРеквизитЗаказа.РеквНомерДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНомерДок");
			НовыйРеквизитЗаказа.РеквДатаДок = КС.Конвертировать_ДатаТип_вДата(СтрокаДатаТип);
		КонецЦикла;
	КонецЕсли;
	
	СопрДокПарт_raw = КС.XDTO_Вычислить(СвГруз, "СопрДок");
	Если СопрДокПарт_raw <> Неопределено Тогда
		Для Каждого ТекущийРеквизит Из КС.XDTO_ВычислитьМассивXDTO(СопрДокПарт_raw) Цикл
			СтрокаДатаТип = КС.XDTO_ПолучитьЗначениеСвойства(ТекущийРеквизит, "РеквДатаДок");
			
			// СопрДок из СвГруз, так же будут попадать в СопрДок как из СодИнфЭксп
			НоваяСтрокаСопрДок = СопрДок.Добавить();
			НоваяСтрокаСопрДок.РеквНаимДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНаимДок");
			НоваяСтрокаСопрДок.РеквНомерДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНомерДок");
			НоваяСтрокаСопрДок.РеквДатаДок = КС.Конвертировать_ДатаТип_вДата(СтрокаДатаТип);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентПартГруз) Тогда
		ЗаявкаНаМаршрут = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.НайтиЗаявкуНаМаршрут(ИдентПартГруз);
		Если Не ЗначениеЗаполнено(ПЭ_Титул1) И ЗначениеЗаполнено(ЗаявкаНаМаршрут) Тогда
			ПЭ_Титул1 = ЗаявкаНаМаршрут.Титул1;
		КонецЕсли;
	КонецЕсли;
	
	XDTO_СвСтрах = КС.XDTO_Вычислить(СвГруз, "СвСтрах");
	Если XDTO_СвСтрах <> Неопределено Тогда
		СвСтрах = Справочники.КонтурЛогистика_СведенияОСтрахованииГрузов.НайтиСоздатьПоОбъектуXDTO(XDTO_СвСтрах);
	КонецЕсли;
	
	ЗаполнитьТоварыИзXDTO(СвГруз);
	ЗаполнитьСведенияОКонтейнерахИзСвГруз(СвГруз);
	ЗаполнитьИнфПолСвГрузИзXDTO(СвГруз);
	
КонецПроцедуры

Процедура ЗаполнитьУсловияПриемаГрИзXDTO(Знач СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	УслПриемГр_raw = КС.XDTO_Вычислить(СвГруз, "УслПриемГр");
	УслПриемГрМассив = КС.XDTO_ВычислитьМассивXDTO(УслПриемГр_raw);
	
	Для Каждого ТекущаяСтрока Из УслПриемГрМассив Цикл
		
		НоваяСтрока = УсловияПриемаГрХран.Добавить();
		НоваяСтрока.СрокХран = КС.XDTO_Вычислить(ТекущаяСтрока, "СрокХран");
		НоваяСтрока.ФДатХран = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(ТекущаяСтрока, "ФДатХран"));
		
		ФВрХран_raw = КС.XDTO_ПолучитьЗначениеСвойства(ТекущаяСтрока, "ФВрХран");
		Если ЗначениеЗаполнено(ФВрХран_raw) Тогда
			НоваяСтрока.ФВрХран = КС.Конвертировать_ВремяТип_вДата(ФВрХран_raw);
		КонецЕсли;
		
		НоваяСтрока.СостояниеГруза = КС.XDTO_Вычислить(ТекущаяСтрока, "ФСостГрузХран");
		НоваяСтрока.СостояниеТары = КС.XDTO_Вычислить(ТекущаяСтрока, "ФСостТарХран");
		НоваяСтрока.СостояниеУпаковки = КС.XDTO_Вычислить(ТекущаяСтрока, "ФСостУпХран");
		НоваяСтрока.СостояниеМаркировки = КС.XDTO_Вычислить(ТекущаяСтрока, "ФСостМаркХран");
		НоваяСтрока.СостояниеОпломбирования = КС.XDTO_Вычислить(ТекущаяСтрока, "ФСостПломбХран");
		
		СвЛицПриемГрХран = КС.XDTO_ПолучитьЗначениеСвойства(ТекущаяСтрока, "СвЛицПриемГрХран");
		Если СвЛицПриемГрХран <> Неопределено Тогда
			НоваяСтрока.ЛицоПриемки = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(СвЛицПриемГрХран);
		КонецЕсли;
		
		ОснДовПриемГрХран = КС.XDTO_Вычислить(ТекущаяСтрока, "ОснДовПриемГрХран");
		Если ОснДовПриемГрХран <> Неопределено Тогда
			НоваяСтрока.ДоговорЛицаПриемки = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ОснДовПриемГрХран, "Рекв");
		КонецЕсли;
		
	КонецЦикла;
	
	Если УсловияПриемаГрХран.Количество() > 0 Тогда
		ПерваяСтрока = УсловияПриемаГрХран[0];
		СостояниеГруза = ПерваяСтрока.СостояниеГруза;
		СостояниеТары = ПерваяСтрока.СостояниеТары;
		СостояниеУпаковки = ПерваяСтрока.СостояниеУпаковки;
		СостояниеМаркировки = ПерваяСтрока.СостояниеМаркировки;
		СостояниеОпломбирования = ПерваяСтрока.СостояниеОпломбирования;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыИзXDTO(Знач СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ОпГруз = КС.XDTO_Вычислить(СвГруз, "ОпГрузХран");
	ОпГрузов = КС.XDTO_ВычислитьМассивXDTO(ОпГруз);
	
	Для Каждого ТекущаяСтрока Из ОпГрузов Цикл
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаТовара.Учитывать = Истина;
		НоваяСтрокаТовара.ОтгрузочноеНаименование = КС.XDTO_Вычислить(ТекущаяСтрока, "НаимГруз");
		НоваяСтрокаТовара.КоличествоМест = КС.XDTO_ВычислитьЧисло(ТекущаяСтрока, "КолМестГр");
		
		// Способ доставки груза
		СпДостГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "СпДостГруз");
		Если ЗначениеЗаполнено(СпДостГруз) Тогда
			СпособДоставкиГруза = СпДостГруз;
		КонецЕсли;
		
		НоваяСтрокаТовара.ОбъемКубМ = КС.XDTO_ВычислитьЧисло(ТекущаяСтрока, "Объем");
		НоваяСтрокаТовара.ОсобыеОтметки = КС.XDTO_Вычислить(ТекущаяСтрока, "Отмет");
		
		ПрзОпаснГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "ПрзОпаснГруз");
		Если ПрзОпаснГруз = "1" Тогда
			
			СвОпаснГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "СвОпаснГруз");
			СвОпаснГрузов = КС.XDTO_ВычислитьМассивXDTO(СвОпаснГруз);
			
			Если СвОпаснГрузов.Количество() <> 0 Тогда
				
				ТекущийСвОпаснГруз = СвОпаснГрузов[0];
				НомерООН = КС.XDTO_Вычислить(ТекущийСвОпаснГруз, "ИдОпаснООН");
				ОписаниеОпасногоГруза = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.ПолучитьОписаниеОпасногоГруза(НомерООН);
				Если ЗначениеЗаполнено(ОписаниеОпасногоГруза) Тогда
					НоваяСтрокаТовара.ОписаниеОпасногоГруза = ОписаниеОпасногоГруза;
				Иначе
					НоваяСтрокаТовара.ОписаниеОпасногоГруза = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.СоздатьНовыйПоXDTO(
						ТекущийСвОпаснГруз);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрокаТовара.ПрзИзъятВещ = (КС.XDTO_Вычислить(ТекущаяСтрока, "ПрзИзъятВещ") = "1");
		
		НаличиеУпаковки = (КС.XDTO_Вычислить(ТекущаяСтрока, "НалУпак") = "1");
		НоваяСтрокаТовара.НаличиеУпаковки = НаличиеУпаковки;
		Если НаличиеУпаковки Тогда
			ЗаполнитьИнформациюОбУпаковкеГруза(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		КонецЕсли;
		
		УчГосСист = КС.XDTO_Вычислить(ТекущаяСтрока, "УчГосСист");
		НоваяСтрокаТовара.ПодлежитУчетуВГосСист = (УчГосСист <> "0");
		Если НоваяСтрокаТовара.ПодлежитУчетуВГосСист Тогда
			ЗаполнитьСведенияОГосударственныхСистемах(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		КонецЕсли;
		
		ЗаполнитьСтоимость(ТекущаяСтрока, НоваяСтрокаТовара, "ГрузСР");
		НоваяСтрокаТовара.КодТНВЭД = КС.XDTO_Вычислить(ТекущаяСтрока, "КодТовНом");
		
		ЗаполнитьМарк(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		
		Справочники.КонтурЛогистика_СтраныМира.ЗаполнитьСтраныПроисхожденияПродукции(
			ЭтотОбъект, НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		
		ВесГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "ВесГруз");
		НоваяСтрокаТовара.МассаБруттоКг = КС.XDTO_ВычислитьЧисло(ВесГруз, "ВесБрутто");
		НоваяСтрокаТовара.МассаНеттоКг = КС.XDTO_ВычислитьЧисло(ВесГруз, "ВесНетто");
		
		ЗаполнитьИнфПолТовараИзXDTO(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтоимость(ОпГруз, ЗаполняемыйОбъект, ИмяМеста)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Если ИмяМеста = "ПартияСР" Тогда
		ИмяСвойстваДействительнойСтоимости = "ДейстСтГрузПарт";
		ИмяСвойстваОбъявленнойСтоимости = "ОбъявлСтГрузПарт";
	ИначеЕсли ИмяМеста = "ГрузСР" Тогда
		ИмяСвойстваДействительнойСтоимости = "ДейстСтГруз";
		ИмяСвойстваОбъявленнойСтоимости = "ОбъявлСтГруз";
	Иначе
		ВызватьИсключение "Не заполнен параметр ИмяМеста в методе ЗаполнитьСтоимость";
	КонецЕсли;
	
	СтоимостьОбъявл = КС.XDTO_Вычислить(ОпГруз, ИмяСвойстваОбъявленнойСтоимости, Неопределено);
	СтоимостьДейст = КС.XDTO_Вычислить(ОпГруз, ИмяСвойстваДействительнойСтоимости, Неопределено);
	
	Если СтоимостьОбъявл <> Неопределено Тогда
		Стоимость_raw = СтоимостьОбъявл;
		ЗаполняемыйОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ОбъявленнаяСтоимость;
	ИначеЕсли СтоимостьДейст <> Неопределено Тогда
		Стоимость_raw = СтоимостьДейст;
		ЗаполняемыйОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ДействительнаяСтоимость;
	Иначе
		Возврат;
	КонецЕсли;
	
	КодВалюты = КС.XDTO_Вычислить(Стоимость_raw, "КодОКВ");
	НаименованиеВалюты = КС.XDTO_Вычислить(Стоимость_raw, "НаимОКВ");
	
	ЗаполняемыйОбъект.Валюта = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С(КодВалюты, НаименованиеВалюты);
	ЗаполняемыйОбъект.Стоимость = КС.XDTO_ВычислитьЧисло(Стоимость_raw, "СтГр");
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОбУпаковкеГруза(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВидУпак", "ВидУпак", "ОКВГУМТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВесУпак", "ВесУпак", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "КолУпак", "КолУп", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВысЗнач", "ГабарУпак.ВысЗнач", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДлЗнач", "ГабарУпак.ДлЗнач", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ШирЗнач", "ГабарУпак.ШирЗнач", "Число");
	
	МассивЗначений = КС.XDTO_Вычислить(ОпГруз, "ИнфУпГруз", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаТЧ = ИнфУпГруз.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Значение, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОГосударственныхСистемах(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НаимГосСист", "НаимГосСист", "НаимГосСист");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НаимГосСистИное", "НаимГосСистИное", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "УчетЕд", "УчетЕд", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИнаяИнф", "ИнаяИнф", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИдНомУчетЕд", "ИдНомУчетЕд", "");
	
	МассивЗначений = КС.XDTO_Вычислить(ОпГруз, "СвГосСист", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаТЧ = СведенияГосСистем.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Значение, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМарк(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ЭлементXDTO = КС.XDTO_Вычислить(ОпГруз, "Марк");
	МассивXDTO = КС.XDTO_ВычислитьМассивXDTO(ЭлементXDTO);
	
	Для Каждого Значение Из МассивXDTO Цикл
		
		Если Значение = "Отсутствует" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Марк.Добавить();
		НоваяСтрока.МаркировкаГруза = Значение;
		НоваяСтрока.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОКонтейнерахИзСвГруз(Знач СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЗначений = КС.XDTO_Вычислить(СвГруз, "СвКонтейн", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		
		СтрокаТЧ = СведенияОКонтейнерах.Добавить();
		СтрокаТЧ.Номер = КС.XDTO_ВычислитьЧисло(Значение, "НомКонтейн");
		СтрокаТЧ.ИдентификационныйНомер = КС.XDTO_Вычислить(Значение, "ИдКонтейнМежд");
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификационныйНомер) Тогда
			СтрокаТЧ.ИдентификационныйНомер = КС.XDTO_Вычислить(Значение, "ИдКонтейнНест");
		КонецЕсли;
		СтрокаТЧ.ИСО = КС.XDTO_Вычислить(Значение, "ИСОКонтейн");
		
		ПредКонтейн = КС.XDTO_Вычислить(Значение, "ПредКонтейн");
		СтрокаТЧ.ПредоставленКлиентом = Перечисления.КонтурЛогистика_ПредоставлениеКонтейнера.Десериализовать(ПредКонтейн);
		
		СтрокаТЧ.ВесГруза = КС.XDTO_ВычислитьЧисло(Значение, "СумВесГруз");
		СтрокаТЧ.ВесТары = КС.XDTO_ВычислитьЧисло(Значение, "ВесТара");
		СтрокаТЧ.КоличествоПломб = КС.XDTO_ВычислитьЧисло(Значение, "КолПломб");
		
		НомераПломбЛок = КС.XDTO_Вычислить(Значение, "НомПломб", Новый Массив);
		НомераПломбЛок = КС.XDTO_ВычислитьМассивXDTO(НомераПломбЛок);
		СтрокаТЧ.НомераПломб = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(НомераПломбЛок, ";");
		
		СтрокаТЧ.Высота = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ВысЗнач");
		СтрокаТЧ.Длина = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ДлЗнач");
		СтрокаТЧ.Ширина = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ШирЗнач");
		
		ЗагрКонтейн = КС.XDTO_Вычислить(Значение, "ЗагрКонтейн");
		СтрокаТЧ.ГруженныйКонтейнер = (ЗагрКонтейн = "1");
		
		ИспКонтейн = КС.XDTO_Вычислить(Значение, "ИспКонтейн");
		Если ЗначениеЗаполнено(ИспКонтейн) Тогда
			СтрокаТЧ.ИспользованиеКонтейнера = Перечисления.КонтурЛогистика_ИспользованияКонтейнера.Десериализовать(ИспКонтейн);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнфПолСвГрузИзXDTO(Знач СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ИнфПол_raw = КС.XDTO_Вычислить(СвГруз, "ИнфПол");
	ИнфПолМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПол_raw);
	
	Для Каждого ЭлементИнфПолXDTO Из ИнфПолМассив Цикл
		
		ИнфПолТекстИнф_raw = КС.XDTO_Вычислить(ЭлементИнфПолXDTO, "ТекстИнф");
		ИнфПолТекстИнфМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПолТекстИнф_raw);
		
		Для Каждого ЭлементИнфПолТекстИнфXDTO Из ИнфПолТекстИнфМассив Цикл
			НоваяСтрокаИнфПол = ИнфПол.Добавить();
			НоваяСтрокаИнфПол.Идентиф = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Идентиф");
			НоваяСтрокаИнфПол.Значение = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Значение");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнфПолТовараИзXDTO(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ИнфПол_raw = КС.XDTO_Вычислить(ОпГруз, "ИнфПол");
	ИнфПолМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПол_raw);
	
	Для Каждого ЭлементИнфПолXDTO Из ИнфПолМассив Цикл
		
		ИнфПолТекстИнф_raw = КС.XDTO_Вычислить(ЭлементИнфПолXDTO, "ТекстИнф");
		ИнфПолТекстИнфМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПолТекстИнф_raw);
		
		Для Каждого ЭлементИнфПолТекстИнфXDTO Из ИнфПолТекстИнфМассив Цикл
			НоваяСтрокаИнфПол = ИнфПол.Добавить();
			НоваяСтрокаИнфПол.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
			НоваяСтрокаИнфПол.Идентиф = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Идентиф");
			НоваяСтрокаИнфПол.Значение = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Значение");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуСоответствия(МассивЭлементов, Реквизит1С, РеквизитСхемы, Тип)
	
	КонтурЛогистика_КонструкторыXDTO.ДобавитьСтрокуСоответствия(МассивЭлементов, Реквизит1С, РеквизитСхемы, Тип);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
