
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Текст", Текст);
	Параметры.Свойство("ТекстШаблоновПодсказок", ТекстШаблоновПодсказок);
	
	Элементы.ПодсказкиИШаблоны.Видимость = ЗначениеЗаполнено(ТекстШаблоновПодсказок);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкиИШаблоны(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", ТекстШаблоновПодсказок);
	ПараметрыФормы.Вставить("Заголовок", "Подсказки и шаблоны");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_ФормаТекстовогоСообщения",
		ПараметрыФормы);
	
КонецПроцедуры
