#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;
&НаКлиенте
Перем ПередЗаписьюПовторныйВызов; // Используется для не модальных вопросов перед записью
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ОповещениеПослеЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Состояние		= Перечисления.Рекл_СостоянияРекламации.Создана;	
		Объект.Ответственный	= ПараметрыСеанса.ТекущийПользователь;
		
		ПриЧтенииСозданииНаСервере();		
		
	Иначе
		ЗаполнитьУстановитьРеквизитыДоставкиСервер("СпособДоставки");
		ВнутреннееПотреблениеТоваров = ПолучитьВнутреннееПотреблениеТоваров();
		Если ЗначениеЗаполнено(ВнутреннееПотреблениеТоваров) Тогда
			Рез = ЕстьРасхождениеПоКоличеству(ВнутреннееПотреблениеТоваров);
			Если НЕ Рез Тогда
				Элементы.ПодменюСоздатьНаОсновании.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерТелефон	= ПолучитьТелефонПользователя(Объект.Менеджер);
	
	УстановитьВидимостьСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Если НЕ ЗначениеЗаполнено(Объект.ВидРемонта) Тогда
			Отказ = Истина;
			Сообщить("Не указан Вид ремонта (вкладка Основное)");
			Возврат;
		КонецЕсли;		
		
		Для каждого Т Из Объект.Комплектующие Цикл
			Если Т.Количество = 0 Тогда
				Отказ = Истина;
				Сообщить("На вкладке Списание на заполнено количество. Номер строки: " + Т.НомерСтроки);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Т Из Объект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(Т.ФотоЭтикетки) Тогда
				Отказ = Истина;
				Сообщить("На вкладке Изделие на заполнено Фото этикетки. Номер строки: " + Т.НомерСтроки);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения"  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	//// Конец СтандартныеПодсистемы.Свойства
   //ПроверяемыеРеквизиты.Очистить();

   //ПроверяемыеРеквизиты.Добавить("СпособДоставки");
   
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	
	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)

	Объект.ВремяДоставкиС = ПолучитьЗначениеСвойства("Время доставки с");
	Объект.ВремяДоставкиПо = ПолучитьЗначениеСвойства("Время доставки по");

	Объект.Менеджер = ПолучитьОсновногоМенеджера(Объект.Партнер);
	МенеджерТелефон	= ПолучитьТелефонПользователя(Объект.Менеджер);

КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект[ИмяРеквизитаАдресаДоставки],
		Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект[ИмяРеквизитаАдресаДоставки],
		Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"],
		Объект[ИмяРеквизитаАдресаДоставки + "Значение"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		ИмяРеквизитаАдресаДоставки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяРеквизитаАдресаДоставки(Элемент)
	
	Если СтрНайти(Элемент.Имя, "АдресДоставкиПеревозчика") > 0 Тогда
		ИмяРеквизитаАдреса = "АдресДоставкиПеревозчика";
	Иначе
		ИмяРеквизитаАдреса = "АдресДоставки";
	КонецЕсли;
	
	Возврат ИмяРеквизитаАдреса;
	
КонецФункции

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	МенеджерТелефон	= ПолучитьТелефонПользователя(Объект.Менеджер);
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПартнерПриИзменении(Элемент)

	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элемент.Имя);
	
	Объект.ВремяДоставкиС = ПолучитьЗначениеСвойства("Время доставки с");
	Объект.ВремяДоставкиПо = ПолучитьЗначениеСвойства("Время доставки по");

КонецПроцедуры

&НаКлиенте
Процедура СостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если QWERTY_Сервер.Получить_РольДоступна("РабочееМестоРуководительСервисногоОтдела") Тогда
		Элементы.Состояние.СписокВыбора.Очистить();
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.Создана"));
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.ПереданоВСборку"));
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.КПеревозке"));
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.ОжидаетсяВозврат"));
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.Закрыта"));
	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоПомощникРуководителяСервисногоОтдела") Тогда
		Элементы.Состояние.СписокВыбора.Очистить();
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.КПеревозке"));
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.ОжидаетсяВозврат"));
	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоРуководительСклада") Тогда
		Элементы.Состояние.СписокВыбора.Очистить();
		Элементы.Состояние.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.Рекл_СостоянияРекламации.Отгружена"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Номенклатура) Тогда
		Элементы.Товары.ТекущиеДанные.Бренд = ПолучитьБренд(Элементы.Товары.ТекущиеДанные.Номенклатура);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьРасхождениеПоКоличеству(п_ВнутреннееПотреблениеТоваров)

	КолВПТ	= п_ВнутреннееПотреблениеТоваров.Товары.Итог("Количество");
	Кол		= Объект.Комплектующие.Итог("Количество");
	
	Возврат КолВПТ <> Кол;

КонецФункции // ()


Функция ПолучитьВнутреннееПотреблениеТоваров()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
		|ГДЕ
		|	ВнутреннееПотреблениеТоваров.ДокументОснование = &ДокументОснование
		|	И НЕ ВнутреннееПотреблениеТоваров.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ВнутреннееПотреблениеТоваров.ПустаяСсылка();

КонецФункции // ()

Функция ПолучитьБренд(п_Номенклатура)

	Возврат п_Номенклатура.Производитель;

КонецФункции // ()

Функция ПолучитьОсновногоМенеджера(п_Партнер)
	
	Если ЗначениеЗаполнено(п_Партнер) Тогда
		Возврат п_Партнер.ОсновнойМенеджер;
	КонецЕсли;

КонецФункции // ()

Функция ПолучитьТелефонПользователя(п_Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|ГДЕ
		|	ПользователиКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)";
	
	Запрос.УстановитьПараметр("Ссылка", п_Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерТелефона;
	КонецЦикла;
	
КонецФункции // ()

Процедура ПриЧтенииСозданииНаСервере()

	ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, Объект);

	ДоставкаТоваров.ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(Элементы, Объект);

КонецПроцедуры

Функция ПолучитьДОиО(НаименованиеОбработки) Экспорт
	рез = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки, Истина); 
	Возврат рез;
КонецФункции

Процедура УстановитьВидимостьСостояний()
	
	Элементы.Состояние.СписокВыбора.Очистить();

	Элементы.Состояние.СписокВыбора.Добавить(Перечисления.Рекл_СостоянияРекламации.Создана);
	Элементы.Состояние.СписокВыбора.Добавить(Перечисления.Рекл_СостоянияРекламации.ПереданоВСборку);
	Элементы.Состояние.СписокВыбора.Добавить(Перечисления.Рекл_СостоянияРекламации.КПеревозке);
	Элементы.Состояние.СписокВыбора.Добавить(Перечисления.Рекл_СостоянияРекламации.Отгружена);
	Элементы.Состояние.СписокВыбора.Добавить(Перечисления.Рекл_СостоянияРекламации.ОжидаетсяВозврат);
	Элементы.Состояние.СписокВыбора.Добавить(Перечисления.Рекл_СостоянияРекламации.Закрыта);

КонецПроцедуры


#Область ВопросОЗаписиДокумента

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействия(п_Команда, ОповещениеЗавершения = Неопределено)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	ДополнительныеПараметры.Вставить("ИмяКоманды", п_Команда);
	
	Если Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно записать документ. Выполнить запись документа и продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьСЗапросомДальнейшегоДействияПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе 
		ПроверитьСЗапросомДальнейшегоДействияПродолжение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияПродолжение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;			
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьСЗапросомДальнейшегоДействияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);				
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьСЗапросомДальнейшегоДействияЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;			
	
	Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#Область Доставка

Функция ПолучитьЗначениеСвойства(п)
	
	Св = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(п, Истина);
	Рез = УправлениеСвойствами.ЗначениеСвойства(Объект.Партнер, Св);

	Возврат Рез;

КонецФункции // ()

&НаСервере
Процедура ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы);

	ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ИмяЭлементаФормы, Объект);

КонецПроцедуры

#КонецОбласти