
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодсистемы"));
	
	Элементы.ГруппаПредупреждение.Видимость = Ложь;
	
	ЗначениеОтображениеПанелиЛок = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ОтображатьПанельВУчетныхДокументах");
	
	ВерсияОбщепродуктовогоРасширения = ВерсияОбщепродуктовогоРасширения();
	
	Если ВерсияОбщепродуктовогоРасширения = Неопределено Или ЗначениеОтображениеПанелиЛок = Неопределено Тогда
		
		// Поймем какое расширение используется
		НастройкаОтображатьПанельВУчетныхДокументах = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
			"ИмяПредопределенногоДляРасширения", "ОтображатьПанельВУчетныхДокументах_СтараяВерсия");
		
		Если Не НастройкаОтображатьПанельВУчетныхДокументах.Пустая()
			И НастройкаОтображатьПанельВУчетныхДокументах.Значение = Истина Тогда
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятиеРешенияЕстьСтарая;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятиеРешенияНовая;
		КонецЕсли;
		
	Иначе
		
		// Сведения по последней версии
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		СведенияПоВерсии = КонтурЛогистика_ОбновлениеСервер.ПолучитьСведенияПоследнейВерсииОбщепродуктовогоРасширения(ИмяСобытия);
		Если СведенияПоВерсии <> Неопределено Тогда
			
			// Сравним версии
			ВышлоНовая = (КонтурЛогистика_СтдСтрКлиентСервер.СравнитьВерсииЛок(СведенияПоВерсии.version, ВерсияОбщепродуктовогоРасширения) = 1);
			
		КонецЕсли;
		
		ЗначениеОтображениеПанели = ЗначениеОтображениеПанелиЛок;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятияРешенияОбновление;
		
	КонецЕсли;
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятияРешенияОбновление
		И Не ВышлоНовая Тогда
		
		Закрыть();
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ПолучитьНастройкуПоИмениПредопределенного("ОтображатьПанельВУчетныхДокументах"));
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_Настройки.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятиеРешенияНовая Тогда
		
		ПодключитьОбработчикОжидания("УстановитьНовоеРасширение", 0.5, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредупреждениеОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтображениеПанелиПриИзменении(Элемент)
	
	УстановитьЗначениеНастройки(ЗначениеОтображениеПанели);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьНовоеРасширение();
	
КонецПроцедуры

&НаКлиенте
Процедура Отказаться(Команда)
	
	УстановитьНастройку("ОтображатьПанельВУчетныхДокументах", Ложь);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьПозже(Команда)
	
	УстановитьНастройку("ОтображатьПанельВУчетныхДокументах", Неопределено);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятиеРешенияНовая Тогда
		
		Элементы.Установить.КнопкаПоУмолчанию = Истина;
		
		Элементы.Установить.Видимость = Ложь;
		Элементы.Отказаться.Видимость = Ложь;
		Элементы.СпроситьПозже.Видимость = Ложь;
		Элементы.ОбновитьРасширение.Видимость = Ложь;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятиеРешенияЕстьСтарая Тогда
		
		Элементы.Установить.КнопкаПоУмолчанию = Истина;
		
		Элементы.Установить.Видимость = Истина;
		Элементы.Отказаться.Видимость = Ложь;
		Элементы.СпроситьПозже.Видимость = Истина;
		Элементы.ОбновитьРасширение.Видимость = Ложь;
		
	Иначе
		
		Элементы.ОбновитьРасширение.КнопкаПоУмолчанию = Истина;
		
		Элементы.Установить.Видимость = Ложь;
		Элементы.Отказаться.Видимость = Ложь;
		Элементы.СпроситьПозже.Видимость = Ложь;
		Элементы.ОбновитьРасширение.Видимость = ВышлоНовая;
		
		Элементы.ДекорацияИнформацияОбновлениеТребуется.Видимость = ВышлоНовая;
		Элементы.ДекорацияИнформацияОбновлениеНеТребуется.Видимость = Не ВышлоНовая;
		
	КонецЕсли;
	
	ТолькоПросмотр = Не ТекПользовательПродвинутый;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовоеРасширение()
	
	Результат = КонтурЛогистика_ОбновлениеСервер.УстановитьОбщепродуктовоеРасширение();
	
	Если Результат Тогда
		
		Элементы.ГруппаПредупреждение.Видимость = Результат;
		
		УстановитьНастройку("ОтображатьПанельВУчетныхДокументах", Истина);
		
		КонтурЛогистика_ИнтеграцияТиповыеСервер.СоздатьНастройкиОтображенияУчетныхДокументовВРасширении();
		
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПринятиеРешенияЕстьСтарая Тогда
			УстановитьНастройку("ОтображатьПанельВУчетныхДокументах_СтараяВерсия", Ложь);
		КонецЕсли;
		
		Если Элементы.ГруппаПредупреждение.Видимость Тогда
			Элементы.ГруппаКомандПринятияРешенияНовая.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		Сообщить("Не удалось установить. Ошибки зафиксированы в журнале регистраций");
		
		Элементы.Установить.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение)
	
	СтартовыйПомощникОткрываетПользовательСБазовымиПравами = 
		КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийПользовательСБазовымиПравамиМожетРедактироватьСтартовыйПомощник();
	
	Если ЗначениеЗаполнено(СтартовыйПомощникОткрываетПользовательСБазовымиПравами)
		И СтартовыйПомощникОткрываетПользовательСБазовымиПравами = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ЗначениеЗаполнено(СтартовыйПомощникОткрываетПользовательСБазовымиПравами)
		И СтартовыйПомощникОткрываетПользовательСБазовымиПравами = Истина Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВерсияОбщепродуктовогоРасширения()
	
	ОтборРасширения = Новый Структура;
	ОтборРасширения.Вставить("Имя", "КонтурИнтеграция");
	Попытка
		НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Если НайденныеРасширения.Количество() > 0 Тогда
		Возврат НайденныеРасширения[0].Версия;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначениеНастройки(НовоеЗначение)
	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ОтображатьПанельВУчетныхДокументах", НовоеЗначение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкуПоИмениПредопределенного(ИмяПредопределенного)
	
	Возврат Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	
КонецФункции

#КонецОбласти