&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.ЛоадерВыполнитьОбмен.Видимость = Ложь;
	Элементы.ФормаВыполнитьОбменФормаЗадач.Картинка = БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен;
	
	ТипЛогистика = Параметры.ТипЛогистика;
	ТипЛогистикаДоИзменения = ТипЛогистика;
	СпецСценарий = Параметры.СпецСценарий;
	
	БазовыйТекстЗапроса = ЗадачиДинамическийСписок.ТекстЗапроса;
	БазовыйТекстЗапросаТитул2 = ЗадачиДинамическийСписокПоПредыдущемуТитулу.ТекстЗапроса;
	БазовыйТекстЗапросаТитул3 = ЗадачиДинамическийСписокПоПредыдущемуТитулу.ТекстЗапроса;
	БазовыйТекстЗапросаТрнТитул3ПослеТитула7 = ЗадачиДинамическийСписокТрнТитул3ПослеТитула7.ТекстЗапроса;
	БазовыйТекстЗапросаТрнТитул7ПослеТитула4 = ЗадачиДинамическийСписокТрнТитул7ПослеТитула4.ТекстЗапроса;
	
	Период = Параметры.Период;
	ПериодВходящий = Период;
	КонтурЛогистика_ОбщегоНазначенияСервер.ПреобразоватьПериод(Период);
	
	Если ЗначениеЗаполнено(Параметры.ОтборСостояние) Тогда 
		ОтборСостояние = Параметры.ОтборСостояние;
	Иначе
		ОтборСостояние = Перечисления.КонтурЛогистика_ОтборыПоСостояниюЗадач.МоиЗадачи;
	КонецЕсли;
	
	Элементы.СостояниеОбмена.Видимость = Ложь; // будет показан после открытия если требуется
	Элементы.ГруппаОтборыНастройкиТело.Видимость = Ложь;
	
	// TODO реализовать
	// ЗадачиДинамическийСписок.ТекстЗапроса = КонтурЛогистика_КонвертацияСервер.ТекстЗапросаДинамическогоСпискаЗадач();
	
	ОбработатьНовыйТипДокументаЛогистикаСервер();
	УсловноеОформлениеТребуемогоДействияЗЗ();
	
	УправлениеОтображениемКомандыПропуститьОбработкуВходящегоДокумента();
	
	ЕстьНашиПВ = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиПВВОрганизациях();
	Элементы.ФормаГруппаПеревозчик.Видимость = ЕстьНашиПВ;	
	Элементы.ФормаГруппаПеревозчик1.Видимость = ЕстьНашиПВ;	
	Элементы.ЗадачиДинамическийСписокКонтекстноеМенюГруппаПеревозчик.Видимость = ЕстьНашиПВ;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПоручениеЭкспедитору")
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка")
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяСкладскаяРасписка") Тогда
		
		ДействуютЭкспедиторскиеДокументы = КонтурЛогистика_ОбщегоНазначенияСервер.ДействуютЭкспедиторскиеДокументы();
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ДокументЛогистика") Тогда
		ОтборДокументыЛогистики = Параметры.Отбор.ДокументЛогистика;
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		Элементы.ТекущийВариантФильтра.КнопкаСпискаВыбора = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ОшибкаНастройкиТекущегоТипа Тогда 
		
		ОбновитьКонтент();
		
		УстановитьОтборДинСписка();
		
		ПодключитьОбработчикОжидания("ВыполнитьПроверкуАктуальностиГраницы", 5*60, Ложь);
		ПодключитьОбработчикОжидания("ОбработатьПриминениеФильтров", 0.1, Истина);
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ВыполнитьПроверкуСертификатов", 60*60, Ложь);
	ПодключитьОбработчикОжидания("ПроверитьНаличиеУведомлений", 3, Истина);
	
	ОбновитьБаннерЭкспедиторскихДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуСертификатов()
	
	Оповестить("ВыполнитьПроверкуСертификатов");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуАктуальностиГраницы()
	
	ДанныеГраницы = ПолучитьМинимальнуюДатуГраницыСинхронизации();
	
	ПредставлениеДанных = КонтурЛогистика_ОбщегоНазначенияКлиент.ПредставлениеДанныхГраницыСинхронизации(ДанныеГраницы);
	ЗаполнитьЗначенияСвойств(Элементы.СостояниеОбмена, ПредставлениеДанных);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНовыйТипДокументаЛогистикаСервер()
	
	МассивДоступныхТитулов = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьМассивТитуловОформляемыхТекущимПользователем();
	
	Элементы.ТипЛогистика.СписокВыбора.Очистить();
	Элементы.ТипЛогистика.СписокВыбора.ЗагрузитьЗначения(МассивДоступныхТитулов);
	Элементы.ФормаНовыйТитул.Видимость = (Не (Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипЛогистика)
				Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2")) 
			Или	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1"));
	
	УстановитьТипДокументаКонфигурации();
	
	СформироватьТекстЗапросаСпискаЗадачИнтеграция();
	
	ПодготовитьДанныеФормы();
	
	Если Не ОшибкаНастройкиТекущегоТипа Тогда 
		УстановитьПараметрыДинамическогоСписка();
		УстановитьВидимостьДоступностьЭлементов();
		ПереименоватьЗаголовкиКолонокДинСписка();
	КонецЕсли;

	Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3") Тогда
		
		ДоступностьЧерновикаТрН = Истина;
	Иначе
		ДоступностьЧерновикаТрН = Ложь;
	КонецЕсли;
	
	Если ДоступностьЧерновикаТрН
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1") Тогда
		
		ДоступностьОтправкиЧерновика = Истина;
	Иначе
		ДоступностьОтправкиЧерновика = Ложь;
	КонецЕсли;
	
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СоздатьЧерновик", ДоступностьЧерновикаТрН);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", ДоступностьОтправкиЧерновика);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", ДоступностьОтправкиЧерновика);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный1", ДоступностьОтправкиЧерновика);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке1", ДоступностьОтправкиЧерновика);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", ДоступностьЧерновикаТрН);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителю", ДоступностьЧерновикаТрН);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание1", ДоступностьЧерновикаТрН);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителю1", ДоступностьЧерновикаТрН);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СоздатьЧерновик", ДоступностьЧерновикаТрН);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", ДоступностьОтправкиЧерновика);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", ДоступностьОтправкиЧерновика);
	
	ДоступностьКоманд = НЕ Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЭ(ТипЛогистика);
	
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_УдалитьДокументыЛогистика", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_УдалитьДокументыДиадок", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыДиадок1", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ПоказатьЭТРН", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюВводДокументовИзПредыдущего", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ВвестиСледующийТитул", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыЛогистика", ДоступностьКоманд);
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ВвестиСледующийТитул", ДоступностьКоманд);
	
	// до появления в вебе логистики
	ИзменитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ОткрытьВВебЛогиситка", ДоступностьКоманд);
	
	ОбновитьОтображениеПоГруппамДоступа();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьЭлемента(ИмяЭлемента, ЗначениеДоступности)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Видимость = ЗначениеДоступности;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипДокументаКонфигурации()
	
	// Работа с разными типами документов
	// Требуется выбрать новый ТипДокументаКонфигурации (док. учетной системы)
	// в связи с изменившимися ключевыми реквизитами.
	
	ВыбранныйТипДокументаКонфигурации = ТипДокументаКонфигурации;
	
	Если ЗначениеЗаполнено(СпецСценарий) Тогда
		ТипДокументаКонфигурации = "Предыдущий титул";
		Элементы.ТипДокументаКонфигурации.СписокВыбора.Очистить();
		Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить("Предыдущий титул", "Предыдущий титул"); 
		Элементы.СпецСценарий.Видимость = Истина;
		Возврат;
	Иначе
		Элементы.СпецСценарий.Видимость = Ложь;
	КонецЕсли;
	
	ТипыДокументов1СМассив = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТипыЗначенияДокумента1С(ТипЛогистика, СпецСценарий, Истина);
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗадачи;
	Элементы.ТипДокументаКонфигурации.СписокВыбора.Очистить();
	
	ЭтоПервыйТитул = (Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипЛогистика) = "1");
	Если ЭтоПервыйТитул Тогда
		
		Элементы.ТипДокументаКонфигурации.ТолькоПросмотр = Ложь;
		Элементы.ТипДокументаКонфигурации.КнопкаСпискаВыбора = Истина;
		Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить("Все типы", "Все типы");
		ТипДокументаКонфигурации = "Все типы";
		
	Иначе
		
		Если ТипыДокументов1СМассив.Количество() = 1 Тогда
			Элементы.ТипДокументаКонфигурации.ТолькоПросмотр = Истина;
			ТипДокументаКонфигурации = ТипыДокументов1СМассив[0];
			Если Не ЗначениеЗаполнено(ТипДокументаКонфигурации) Тогда
				ТипДокументаКонфигурации = "Предыдущий титул";
			КонецЕсли;
		Иначе
			Элементы.ТипДокументаКонфигурации.ТолькоПросмотр = Ложь;
			Элементы.ТипДокументаКонфигурации.КнопкаСпискаВыбора = Истина;
			Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить("Все типы", "Все типы");
			ТипДокументаКонфигурации = "Все типы";
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого текТипЗначенияОбъекта Из ТипыДокументов1СМассив Цикл
		
		Если ЗначениеЗаполнено(текТипЗначенияОбъекта) Тогда
			
			ТипДокументаКонфигурацииОб = Метаданные.Документы.Найти(текТипЗначенияОбъекта);
			
			Если ТипДокументаКонфигурацииОб <> Неопределено Тогда
				Если ПравоДоступа("Чтение", ТипДокументаКонфигурацииОб) И ПравоДоступа("Просмотр", ТипДокументаКонфигурацииОб) Тогда
					Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить(
						текТипЗначенияОбъекта, ТипДокументаКонфигурацииОб.Синоним);
				Иначе
					Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить(
						текТипЗначенияОбъекта, ТипДокументаКонфигурацииОб.Синоним + " (нет доступа)");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоПервыйТитул Тогда
		Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить("Другие", "Другие");
	Иначе
		Элементы.ТипДокументаКонфигурации.СписокВыбора.Добавить("Предыдущий титул", "Предыдущий титул");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранныйТипДокументаКонфигурации) Тогда
		ТипДокументаКонфигурации = ВыбранныйТипДокументаКонфигурации;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстЗапросаСпискаЗадачИнтеграция()
	
	Если ЗначениеЗаполнено(ТипДокументаКонфигурации) И ТипДокументаКонфигурации <> "Предыдущий титул" Тогда
		
		ТипДокументаКонфигурацииОб = Метаданные.Документы.Найти(ТипДокументаКонфигурации);
		
		Если ТипДокументаКонфигурацииОб <> Неопределено
			И (Не ПравоДоступа("Чтение", ТипДокументаКонфигурацииОб) Или Не ПравоДоступа("Просмотр", ТипДокументаКонфигурацииОб)) Тогда
			
			УстановитьБаннерПроблемы("Нет прав для работы с документом " + ТипДокументаКонфигурации);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипДокументаКонфигурации = "Предыдущий титул" Тогда
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			ТипЛогистика,, СпецСценарий);
		
	Иначе
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			ТипЛогистика, ТипДокументаКонфигурации, СпецСценарий);
		
	КонецЕсли;
	
	РезультатаФормированияЗапроса = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
		ТипЛогистика, ТипДокументаКонфигурации, СпецСценарий, КонтекстНастройкиКонвертации);
	
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"СписокЗадач_ЗаменитьТекстЗапросаСпискаЗадачИнтеграция", Ложь,
		Новый Структура("РезультатаФормированияЗапроса, ТипЛогистика", РезультатаФормированияЗапроса, ТипЛогистика));
	
	ЗадачиДинамическийСписок.ТекстЗапроса = РезультатаФормированияЗапроса.ПолныйТекстЗапроса;
	
	ИмяДокументаЛогистика = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);
	
	Если Не ЗначениеЗаполнено(ТипДокументаКонфигурации) Тогда
		УстановитьБаннерПроблемы("Настройте конвертацию документов");
		Возврат;
	КонецЕсли;
	
	Попытка
		
		// Проверим, успешно ли соберется запрос - если запрос плохой - то тут будет падение
		//@skip-warning
		ПараметрыДинСписка = ЗадачиДинамическийСписок.Параметры;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗадачи;
		Элементы.ПояснениеОшибки.Заголовок = "";
		ОшибкаНастройкиТекущегоТипа = Ложь;
		Элементы.ЗадачиДинамическийСписок.Видимость = Истина;
		
		Для Каждого ПараметрЗапроса Из РезультатаФормированияЗапроса.СтруктураПараметровЗапроса Цикл
			ТекущийПараметрКомапановки = Новый ПараметрКомпоновкиДанных(ПараметрЗапроса.Ключ);
			Если ЗадачиДинамическийСписок.Параметры.НайтиЗначениеПараметра(ТекущийПараметрКомапановки) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
		
		ДобавитьОтборыДополнительныхКолонокНаФорму();
		
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		УстановитьБаннерПроблемы(ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБаннерПроблемы(Знач ТекстОшибки)
	
	ИмяДокументаЛогистика = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.БаннерНеНастроено;
		Элементы.ПояснениеОшибки.Заголовок = ТекстОшибки;
		ОшибкаНастройкиТекущегоТипа = Истина;
		Элементы.ЗадачиДинамическийСписок.Видимость = Ложь;
		ЗадачиДинамическийСписок.ТекстЗапроса = "Выбрать * Из Документ." + ИмяДокументаЛогистика;
		
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеФормы()
	
	УстановитьТипыРеквизитовФормы();
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ТипЛогистика, ТипДокументаКонфигурации, СпецСценарий);
	
	// Установить упорядочивание по Требуемому действию 
	// для исключения того что в новом запросе будет отсутствовать поле, по которому было упорядочивание
	УпорядочитьПоТребуемомуДействию();
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда 
		Период.ДатаНачала = НачалоДня(ТекущаяДата() - 5 * 24 * 3600);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда 
		Период.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыРеквизитовФормы()

	// дополнительно ограничить типы у реквизитов формы
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	// органичить доступ до элементов в зависимость от типа титула
	
	// Эти титулы вводятся по исходному документу учетной системы и для них не нужен предыдущий титул
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул3
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул5
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул7
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул9
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка
		ИЛИ ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка
		
		Тогда
		
		// Покажем команды ввода из док 1С учетной системы
		ВводИз1С = Истина;
		
	Иначе // титулы вводятся из предыдущего титула
		
		// Покажем команды ввода из предыдущего титула
		ВводИз1С = Ложь;
		
	КонецЕсли;
	
	ЭтоТРН = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипЛогистика);
	ЭтоПЛ = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипЛогистика);
	ЭтоЗЗ = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипЛогистика);
	ЭтоПЭ = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЭ(ТипЛогистика);
	ЭтоЭР = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЭР(ТипЛогистика);
	ЭтоСР = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоСР(ТипЛогистика);
	
	Элементы.УправлениеПодменюВводИзДокумента1С.Видимость = ВводИз1С;
	Элементы.УправлениеПодменюВводИзПредыдущего.Видимость = Не ВводИз1С;
	
	Если КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Входящее Тогда
		
		КартинкаДействияПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.КартинкаЗначения(Неопределено);
		ЗаголовокКнопкиПоУмолчанию = "Обработать";
		
	ИначеЕсли КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.ИсходящееВходящее Тогда
		
		КартинкаДействияПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.КартинкаЗначения(Неопределено);
		ЗаголовокКнопкиПоУмолчанию = "Выполнить";
	
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		И Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ЕстьМаппингОтправителяШаблонаВТ1() Тогда
		
		КартинкаДействияПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.КартинкаЗначения(Неопределено);
		ЗаголовокКнопкиПоУмолчанию = "Выполнить";
		
	ИначеЕсли (ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3)
		И (КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновик_ОтправкаПодписанного
			Или КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного
			Или КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного
			Или КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_ОтправкаПодписанного
			Или КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного) Тогда
		
		КартинкаДействияПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.КартинкаЗначения(Неопределено);
		ЗаголовокКнопкиПоУмолчанию = "Выполнить";
		
	ИначеЕсли (ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1)
		И КонтекстНастройкиКонвертации.Сценарий
			= Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновик_ОтправкаПодписанного Тогда
		
		КартинкаДействияПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.КартинкаЗначения(Неопределено);
		ЗаголовокКнопкиПоУмолчанию = "Выполнить";
		
	Иначе
		
		КартинкаДействияПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.КартинкаЗначения(
			КонтекстНастройкиКонвертации.СценарийПоУмолчанию);
		ЗаголовокКнопкиПоУмолчанию = Строка(КонтекстНастройкиКонвертации.СценарийПоУмолчанию);
		
	КонецЕсли;
	
	Элементы.ФормаВыполнитьДействиеПоУмолчанию.Картинка = КартинкаДействияПоУмолчанию;
	Элементы.ФормаВыполнитьДействиеПоУмолчанию.Заголовок = ЗаголовокКнопкиПоУмолчанию;
	
	Элементы.ФормаВыполнитьДействиеПоУмолчанию.КнопкаПоУмолчанию = Истина;
	
	СколькоАвтоотправок = Справочники.КонтурЛогистика_СценарииАвтоматическойРаботы.СколькоВключеноАвтоотправокПоТипу(ТипЛогистика);
	Если СколькоАвтоотправок = 0 Тогда 
		Элементы.СправочникКонтурЛогистика_СценарииАвтоматическойРаботыОткрытьСписок.Заголовок = "нет автоотправки";
		Элементы.СправочникКонтурЛогистика_СценарииАвтоматическойРаботыОткрытьСписок.Картинка = Новый Картинка;
		Элементы.ГруппаСценарииАвтоматическойРаботы.Видимость = Ложь;
	Иначе
		Элементы.СправочникКонтурЛогистика_СценарииАвтоматическойРаботыОткрытьСписок.Заголовок = "автоотправка " + СколькоАвтоотправок;
		Элементы.СправочникКонтурЛогистика_СценарииАвтоматическойРаботыОткрытьСписок.Картинка = БиблиотекаКартинок.КонтурЛогистика_Робот;
		Элементы.ГруппаСценарииАвтоматическойРаботы.Видимость = Истина;
		
		ОшибкиСценариеАвтоматическойРаботы = РегистрыСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.
			ПредставлениеКоличестваОшибок(ТипЛогистика);
	КонецЕсли;
	
	ОшибкиГСМ = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ПредставлениеКоличестваОшибок(Период, ТипЛогистика);
	
	// Проблемы со строкой поиска из-за программной модификации запроса и невозможности определить поля
	// Ошибка при выполнении запроса. по причине: Невозможно применить элемент отбора в наборе данных...
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка Тогда
		ЭтоТ1 = Истина;
	Иначе
		ЭтоТ1 = Ложь;
	КонецЕсли;
	
	Элементы.СтрокаПоискаСписка.Видимость = Не ЭтоТ1;
	
	Если ЭтоТ1
		И КонтекстНастройкиКонвертации.ТипДокумента1С <> "Все типы"
		И КонтекстНастройкиКонвертации.ТипДокумента1С <> Неопределено Тогда
		
		ЭтоТ1ПоДокументу1С = Истина;
	Иначе
		ЭтоТ1ПоДокументу1С = Ложь;
	КонецЕсли;
	
	Элементы.ОткрытьСписокИсходныхДокументов.Видимость = ЗначениеЗаполнено(ТипДокументаКонфигурации) 
		И ТипДокументаКонфигурации <> "Предыдущий титул";
	
	МожноДелатьОтказВПодписи = ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
								Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02;
	
	Если МожноДелатьОтказВПодписи
		И (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
			Или РольДоступна("КонтурЛогистика_ОтказДокументов")) Тогда
		ФормаОтказатьсяВПодписи = Истина;
	Иначе
		ФормаОтказатьсяВПодписи = Ложь;
	КонецЕсли;
	УстановитьВидимостьЭлемента("ФормаОтказатьсяВПодписи", ФормаОтказатьсяВПодписи);
	
	// команды доступные только для трн
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СоздатьПереадресацию", ЭтоТРН);
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СоздатьПереадресацию1", ЭтоТРН);
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СоздатьЭстафету", ЭтоТРН);
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СоздатьЭстафету1", ЭтоТРН);
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ВнестиИсправлениеТитула", ЭтоТРН);
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_Создать1ТрнПоВыделенным", ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_Создать1ПлПоВыделенным", ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
	
	// команды доступные только для ЗЗ
	УстановитьВидимостьЭлемента("ФормаВвестиТРНизЗЗ", ЭтоЗЗ);
	
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации) Тогда
		УстановитьВидимостьДоступностьДополнительныхКолонок(КонтекстНастройкиКонвертации);
	Иначе
		НастроенныеТипыДокументов1СМассив = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТипыЗначенияДокумента1С(
			ТипЛогистика, СпецСценарий);
		Для Каждого ТипДокумента Из НастроенныеТипыДокументов1СМассив Цикл
			Если Не ЗначениеЗаполнено(ТипДокумента) Тогда
				Продолжить;
			КонецЕсли;
			
			КонтекстНастройкиКонвертацииЛок = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
				ТипЛогистика, ТипДокумента, СпецСценарий);
			
			// Берем настройки колонок только из первой настройки. Подразумеваем, что они настроены одинаково.
			УстановитьВидимостьДоступностьДополнительныхКолонок(КонтекстНастройкиКонвертацииЛок);
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка") Тогда
		УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СкопироватьТитул", Истина);
	Иначе
		УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СкопироватьТитул", Ложь);
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовДинамисечкогоСписка(ВводИз1С, ЭтоТ1ПоДокументу1С, ЭтоТРН, ЭтоПЛ, ЭтоЗЗ, ЭтоПЭ, ЭтоЭР, ЭтоСР);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовДинамисечкогоСписка(ВводИз1С, ЭтоТ1ПоДокументу1С, ЭтоТРН, ЭтоПЛ, ЭтоЗЗ, ЭтоПЭ, ЭтоЭР, ЭтоСР)
	
	Элементы.ЗадачиДинамическийСписокКонтекстноеМенюВводДокументовИзДокумента1С.Видимость = ВводИз1С;
	Элементы.ЗадачиДинамическийСписокКонтекстноеМенюВводДокументовИзПредыдущего.Видимость = Не ВводИз1С;
	ПутиРеквизитовУчетногоДокумента = КонтекстНастройкиКонвертации.ПутиРеквизитовУчетногоДокумента;
	
	// Совместимость с 8.2
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокНомерТрН", Истина);
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокДокументЭТРН", ЭтоПЭ Или ЭтоСР);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокОрганизация", ЭтоПЭ);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокГруппа2", 
			Не ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2"));
	
	Если ЭтоПЛ Или ЭтоЗЗ Или ЭтоЭР Или ЭтоСР Тогда
		
		УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокПолучатель", Ложь);
		УстановитьВидимостьЭлемента("ОтборГрузополучатель", Ложь);
		
	Иначе
		
		Если (Не ЭтоТ1ПоДокументу1С
			Или ЗначениеЗаполнено(ПутиРеквизитовУчетногоДокумента.ПутьГрузополучатель))
			И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
			И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6 Тогда
			
			ВидимостьПолучатель = Истина;
		Иначе
			ВидимостьПолучатель = Ложь;
		КонецЕсли;
		
		УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокПолучатель", ВидимостьПолучатель);
		УстановитьВидимостьЭлемента("ОтборГрузополучатель", ВидимостьПолучатель);
		
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтрагент", ЭтоЭР Или ЭтоСР);
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5 Тогда
		
		ВидимостьВодителяЛогистика = Истина;
	Иначе
		ВидимостьВодителяЛогистика = Ложь;
	КонецЕсли;
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокВодительЛогистика", ВидимостьВодителяЛогистика);
	
	Если (Не ЭтоТ1ПоДокументу1С Или ЗначениеЗаполнено(ПутиРеквизитовУчетногоДокумента.ПутьВодитель))
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		И Не ЭтоПЭ
		И Не ЭтоЭР
		И Не ЭтоСР Тогда
		
		ВидимостьВодитель = Истина;
	Иначе
		ВидимостьВодитель = Ложь;
	КонецЕсли;
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокВодитель", ВидимостьВодитель);
	
	Если (Не ЭтоТ1ПоДокументу1С Или ЗначениеЗаполнено(ПутиРеквизитовУчетногоДокумента.ПутьТранспортноеСредство))
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		И Не ЭтоПЭ
		И Не ЭтоЭР
		И Не ЭтоСР Тогда
		
		ВидимостьТС = Истина;
	Иначе
		ВидимостьТС = Ложь;
	КонецЕсли;
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокТранспортноеСредство", ВидимостьТС);
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокСтоимостьБезНДС",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6);
	
	Если (Не ЭтоТ1ПоДокументу1С Или ЗначениеЗаполнено(ПутиРеквизитовУчетногоДокумента.ПутьМестоПогрузки))
		И Не ЭтоПЛ
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2 Тогда
		
		ВидимостьМестоПогрузки = Истина;
		ВидимостьМестоДоставки = Не ЭтоЭР И Не ЭтоСР;
	Иначе
		ВидимостьМестоПогрузки = Ложь;
		ВидимостьМестоДоставки = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокМестоПогрузки", ВидимостьМестоПогрузки);
	УстановитьВидимостьЭлемента("ОтборСкладОтправитель", ВидимостьМестоПогрузки);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокМестоДоставки", ВидимостьМестоДоставки);
	УстановитьВидимостьЭлемента("ОтборСкладПолучатель", ВидимостьМестоДоставки);
	
	Если (Не ЭтоТ1ПоДокументу1С Или ЗначениеЗаполнено(ПутиРеквизитовУчетногоДокумента.ПутьГрузоотправитель)) И Не ЭтоПЛ И Не ЭтоСР Тогда
		ВидимостьОтправитель = Истина;
	Иначе
		ВидимостьОтправитель = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокОтправитель", ВидимостьОтправитель);
	УстановитьВидимостьЭлемента("ОтборГрузоотправитель", ВидимостьОтправитель);
	
	Если (Не ЭтоТ1ПоДокументу1С Или ЗначениеЗаполнено(ПутиРеквизитовУчетногоДокумента.ПутьПеревозчик))
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5  Тогда
		
		ВидимостьПеревозчик = Истина;
	Иначе
		ВидимостьПеревозчик = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокПеревозчик", ВидимостьПеревозчик);
	УстановитьВидимостьЭлемента("ОтборПеревозчик", ВидимостьПеревозчик);

	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
		
		ВидимостьУчетныйДокумент = Ложь;
	Иначе
		ВидимостьУчетныйДокумент = Истина;
	КонецЕсли;
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокГруппа2", ВидимостьУчетныйДокумент);
	
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокВидПеревозки",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокМедРаботник",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокДатВрПрМО",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокДатаИВремяОформления",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокОтветственныйЗаОформление",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокОдометрРаботник",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокПоказанияОдометра",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02);
	
	Если ЭтоТРН Тогда
		// Документ логистика
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
			МестоРасположения = Элементы.ЗадачиДинамическийСписокНомер;
		Иначе
			МестоРасположения = Элементы.ЗадачиДинамическийСписокГруппа3;
		КонецЕсли;
		Элементы.Переместить(Элементы.ЗадачиДинамическийСписокГруппа1, Элементы.ЗадачиДинамическийСписок, МестоРасположения);
	ИначеЕсли ЭтоПЛ Тогда
		// Документ логистика
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
			МестоРасположения = Элементы.ЗадачиДинамическийСписокГруппа3;
		Иначе
			МестоРасположения = Элементы.ЗадачиДинамическийСписокНомер;
		КонецЕсли;
		Элементы.Переместить(Элементы.ЗадачиДинамическийСписокГруппа1, Элементы.ЗадачиДинамическийСписок, МестоРасположения);
	КонецЕсли;
	
	// Сортировка колонок
	ЭлементДоп1 = Элементы.Найти("ЗадачиДинамическийСписокДоп1");	// Если есть доп колонки, то перед ними
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодитель", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокТранспортноеСредство", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВидПеревозки", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда		
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодитель", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокМедРаботник", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокДатВрПрМО", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3 Тогда
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокТранспортноеСредство", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокДатаИВремяОформления", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокОтветственныйЗаОформление", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодитель", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02 Тогда
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокТранспортноеСредство", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокДатаИВремяОформления", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокОтветственныйЗаОформление", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодитель", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокПоказанияОдометра", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5 Тогда		
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодитель", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокТранспортноеСредство", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокОдометрРаботник", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокПоказанияОдометра", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02 Тогда		
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодитель", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокТранспортноеСредство", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокПоказанияОдометра", Элементы.ЗадачиДинамическийСписок, ЭлементДоп1);
	ИначеЕсли ЭтоТРН Тогда
		МестоНазначения = Элементы.Найти("ЗадачиДинамическийСписокМестоПогрузки");
		
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
			Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6 Тогда
			
			ПереместитьЭлементСписка("ЗадачиДинамическийСписокСтоимостьБезНДС", Элементы.ЗадачиДинамическийСписок, МестоНазначения);
		КонецЕсли;
		
		ПереместитьЭлементСписка("ЗадачиДинамическийСписокВодительЛогистика", Элементы.ЗадачиДинамическийСписок, МестоНазначения);
	КонецЕсли;
	
	// Контекстное меню
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ВнестиИсправлениеТитула", ЭтоТРН);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СоздатьПереадресацию", ЭтоТРН);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СоздатьЭстафету", ЭтоТРН);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ПечатьТранспортнойНакладной",
		ЭтоТРН Или ЭтоПЛ Или ЭтоЭР Или ЭтоПЭ Или ЭтоСР);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ПоказатьПечатнуюФормуТранспортнойНакладной",
		ЭтоТРН Или ЭтоПЛ Или ЭтоЭР Или ЭтоПЭ Или ЭтоСР);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_Создать1ТрнПоВыделенным",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_Создать1ПлПоВыделенным",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_Создать1ЗзПоВыделенным",
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1);
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы",
		СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы);
	УстановитьВидимостьЭлемента("ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы",
		СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы);
	
	// Отборы ПЛ по реквизитам учетного документа
	УстановитьВидимостьЭлемента("ОтборВодитель", Ложь);
	УстановитьВидимостьЭлемента("ОтборТранспортноеСредство", Ложь);
	УстановитьВидимостьЭлемента("ОтборМедРаботник", Ложь);
	УстановитьВидимостьЭлемента("ОтборОтветственныйЗаОформление", Ложь);
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		СоздатьРеквизитыОтбораСписка("Водитель");
		СоздатьРеквизитыОтбораСписка("ТранспортноеСредство");
		
		СоздатьЭлементФормыРеквизитаОтбораСписка("ОтборВодитель", "Водитель");
		СоздатьЭлементФормыРеквизитаОтбораСписка("ОтборТранспортноеСредство", "Транспортное средство");
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
		
		СоздатьРеквизитыОтбораСписка("Водитель");
		СоздатьРеквизитыОтбораСписка("МедРаботник");
		
		СоздатьЭлементФормыРеквизитаОтбораСписка("ОтборВодитель", "Водитель");
		СоздатьЭлементФормыРеквизитаОтбораСписка("ОтборМедРаботник", "Мед. работник");
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02 Тогда
		СоздатьРеквизитыОтбораСписка("ОтветственныйЗаОформление");
		СоздатьРеквизитыОтбораСписка("ТранспортноеСредство");
		
		СоздатьЭлементФормыРеквизитаОтбораСписка("ОтборОтветственныйЗаОформление", "Тех. работник");
		СоздатьЭлементФормыРеквизитаОтбораСписка("ОтборТранспортноеСредство", "Транспортное средство");
	КонецЕсли;
	
	Если ЭтоЭР Или ЭтоПЭ Или ЭтоСР Тогда
		ЗаголовокОтборПеревозчик = "Экспедитор";
	Иначе
		ЗаголовокОтборПеревозчик = "Перевозчик";
	КонецЕсли;
	УстановитьЗаголовокЭлемента("ОтборПеревозчик", ЗаголовокОтборПеревозчик);
	УстановитьВидимостьЭлемента("ОтборКонтрагент", ЭтоЭР);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыОтбораСписка(ИмяРеквизита)
	
	ИмяРеквизитаФормы = "Отбор" + ИмяРеквизита;
	Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = ИмяРеквизитаФормы Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПоиска = ЗадачиДинамическийСписок.Отбор.ДоступныеПоляОтбора.Элементы.Найти(ИмяРеквизита);
	Если РезультатПоиска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, ИмяРеквизитаФормы, РезультатПоиска.Тип);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементФормыРеквизитаОтбораСписка(ИмяЭлемента, Заголовок)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	СобытияЭФ = Новый Структура;
	СобытияЭФ.Вставить("ПриИзменении", "УстановитьОтборДинСписка");
	
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("КнопкаОчистки", Истина);
	СвойстваЭФ.Вставить("ПодсказкаВвода", "<все>");
	СвойстваЭФ.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(ЭтаФорма, ИмяЭлемента, Элементы.Группа2,
		Заголовок, 1, ИмяЭлемента, СвойстваЭФ, СобытияЭФ);
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьЭлементСписка(ИмяЭлемента, Родитель, Назначение = Неопределено)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(НайденныйЭлемент, Родитель, Назначение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлемента(ИмяЭлемента, ЗначениеВидимости)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	
	Если НайденныйЭлемент = Неопределено Тогда
		Если Не ЗначениеВидимости Тогда
			Возврат;
		КонецЕсли;
		
		// ЭТрН
		Если ИмяЭлемента = "ЗадачиДинамическийСписокСтоимостьБезНДС" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Стоимость перевозки");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокВодительЛогистика" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Водитель");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокВодитель" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Водитель");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокМестоПогрузки" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Место погрузки");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокМестоДоставки" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Место доставки");
		// ЭПЛ
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокВидПеревозки" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Вид перевозки");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокТранспортноеСредство" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Транспортное средство");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокДатаИВремяОформления" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Дата и время техосмотра");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокОтветственныйЗаОформление" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Тех. работник");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокОдометрРаботник" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Ответственный");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокПоказанияОдометра" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Показания одометра");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокМедРаботник" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Мед. работник");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокДатВрПрМО" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Дата и время медосмотра");
		ИначеЕсли ИмяЭлемента = "ЗадачиДинамическийСписокДокументЭТРН" Тогда
			СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, "Маршрут");
		КонецЕсли;
	Иначе
		НайденныйЭлемент.Видимость = ЗначениеВидимости;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокЭлемента(ИмяЭлемента, НовыйЗаголовок)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	
	Если НайденныйЭлемент <> Неопределено Тогда
		
		НайденныйЭлемент.Заголовок = НовыйЗаголовок;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьКолонкуДинамическогоСписка(ИмяЭлемента, ЗаголовокЭлемента)
	
	НовыйЭлемент = Неопределено;
	Префикс = "ЗадачиДинамическийСписок";
	ТипКолонки = 0;
	
	Попытка
		НовыйЭлемент = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКолонкаТаблицыФормы(ЭтаФорма, ИмяЭлемента,
			Элементы.ЗадачиДинамическийСписок, ТипКолонки, ЗаголовокЭлемента, СтрЗаменить(ИмяЭлемента, Префикс, Префикс + "."));
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьДополнительныхКолонок(КонтекстНастройкиКонвертации)
	
	Если КонтекстНастройкиКонвертации.ДополнительныеКолонки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СпецСценарий <> Перечисления.КонтурЛогистика_СпецСценарииЗадач.ПЛТитул1ПослеСменыВодителя
		И ТипДокументаКонфигурации <> "Все типы"
		И ТипДокументаКонфигурации <> "Другие" Тогда
		
		НомерСтроки = 0;
		Для Каждого ТекущаяКолонка Из КонтекстНастройкиКонвертации.ДополнительныеКолонки Цикл
			
			НомерСтроки = НомерСтроки + 1;
			НомерКолонки = Формат(НомерСтроки, "ЧГ=0");
			ИмяДопКолонки = "ЗадачиДинамическийСписокДоп" + НомерКолонки;
			ПутьКДанным = "ЗадачиДинамическийСписок.Доп" + НомерКолонки;
			
			НайденныйЭлемент = Элементы.Найти(ИмяДопКолонки);
			Если НайденныйЭлемент <> Неопределено Тогда
				НайденныйЭлемент.Видимость = Истина;
				НайденныйЭлемент.Заголовок = ТекущаяКолонка.Заголовок;
				Продолжить;
			КонецЕсли;
			
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКолонкаТаблицыФормы(
				ЭтаФорма, ИмяДопКолонки, Элементы.ЗадачиДинамическийСписок,
				0, ТекущаяКолонка.Заголовок, ПутьКДанным);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Удалим лишние
	Для Счет = (КонтекстНастройкиКонвертации.ДополнительныеКолонки.Количество() + 1) По 99 Цикл
		НомерКолонки = Формат(Счет, "ЧГ=0");
		ИмяДопКолонки = "ЗадачиДинамическийСписокДоп" + НомерКолонки;
		
		НайденныйЭлемент = Элементы.Найти(ИмяДопКолонки);
		Если НайденныйЭлемент = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		НайденныйЭлемент.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УпорядочитьПоТребуемомуДействию()
	
	Перем УсловиеСортировки, Элемент, ЭлементыПользовательскихНастроек;
	
	Если ОшибкаНастройкиТекущегоТипа Тогда 
		Возврат;
	КонецЕсли;
	
	ЭлементыПользовательскихНастроек = ЗадачиДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого Элемент Из ЭлементыПользовательскихНастроек Цикл
		Если ТипЗнч(Элемент) = ТипЗнч(ЗадачиДинамическийСписок.КомпоновщикНастроек.Настройки.Порядок) Тогда
			Элемент.Элементы.Очистить();
			УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ТребуемоеДействие");
			УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
			УсловиеСортировки.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	// Введенные титулы могут по дате отличаться от предыдущих - расширим диапазон анализа текущего документа
	Если ЗадачиДинамическийСписок.Параметры.Элементы.Найти("НачалоПериодаПоследующийТитул") <> Неопределено Тогда 	
		Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда 
			ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследующийТитул", Период.ДатаНачала);
		Иначе
			ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследующийТитул", Период.ДатаНачала - 5 * 86400);
		КонецЕсли;
	КонецЕсли;
	
	// Определяем дополнительные параметры запроса в зависимости от типа титула и специального сценария
	ПараметрыСписка = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПараметрыСпискаПоТипуЛогистики(ТипЛогистика, СпецСценарий);
	Для Каждого ТекущийПараметр Из ПараметрыСписка Цикл
		
		УстанавливаемыйПараметр = Новый ПараметрКомпоновкиДанных(ТекущийПараметр.Ключ);
		НайденныйПараметр = ЗадачиДинамическийСписок.Параметры.НайтиЗначениеПараметра(УстанавливаемыйПараметр);
		
		Если НайденныйПараметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);
		
	КонецЦикла;
	
	// Введенные титулы могут по дате отличаться от предыдущих - расширим диапазон анализа текущего документа
	СекундВЧасе = 60 * 60;
	СмещениеОкончанияПериода = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СмещениеОкончанияПериодаСпискаЗадач") * СекундВЧасе;
	ОкончаниеПериода = Период.ДатаОкончания + СмещениеОкончанияПериода;
	ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ОкончаниеПериода", ОкончаниеПериода);
	Если ЗадачиДинамическийСписок.Параметры.Элементы.Найти("ОкончаниеПериодаПоследующийТитул") <> Неопределено Тогда
		ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ОкончаниеПериодаПоследующийТитул", ОкончаниеПериода + 5 * 86400);
	КонецЕсли;
	
	Если ЗадачиДинамическийСписок.Параметры.Элементы.Найти("ТекущийПользователь") <> Неопределено Тогда
		ЗадачиДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
 	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтент()
	
	Если Не ОшибкаНастройкиТекущегоТипа Тогда
		
		УстановитьПараметрыДинамическогоСписка();
		текСинонимДокумента = "";
		Если ТипДокументаКонфигурации <> "Все типы"
			И ТипДокументаКонфигурации <> "Другие" Тогда
			
			текСинонимДокумента = СинонимДокумента1СПоИмени(ТипДокументаКонфигурации);
		Иначе
			текСинонимДокумента = ТипДокументаКонфигурации;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СпецСценарий) Тогда 
			
			Заголовок = "Задачи: " 
					+ ТипЛогистика
					+ " "
					+ СпецСценарий;
		Иначе
			
			Заголовок = "Задачи: " 
					+ ТипЛогистика 
					+ " по " 
					+ текСинонимДокумента;
			
		КонецЕсли;
		
		Элементы.ЗадачиДинамическийСписок.Обновить();
		
		УстановитьВидимостьДоступностьЭлементов();
		ВыполнитьПроверкуАктуальностиГраницы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокИсходныхДокументов(Команда)
	
	Если ТипДокументаКонфигурации = "Все типы"
		Или ТипДокументаКонфигурации = "Другие" Тогда
		
		ТипыДокументов1СМассив = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТипыЗначенияДокумента1С(ТипЛогистика);
		
		Для Каждого ВозможныйТипДокументаКонфигурации Из ТипыДокументов1СМассив Цикл
			Если ЗначениеЗаполнено(ВозможныйТипДокументаКонфигурации) Тогда 
				ОткрытьФорму("Документ." + ВозможныйТипДокументаКонфигурации + ".ФормаСписка");
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ОткрытьФорму("Документ." + ТипДокументаКонфигурации + ".ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкамКонвертации(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_МастерНастройкиСпискаЗадач", Новый Структура("ТипДокументаЛогистика, СпецСценарий", ТипЛогистика, СпецСценарий),
		ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьПереинициализироватьФорму");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКонфигурацийНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
		ВыбранныйЭлемент.Значение, ЭтаФорма, "ОбработчикОбновитьПереинициализироватьФорму");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЛогистикаПриИзменении(Элемент = Неопределено)
	
	Если Элемент <> Неопределено И Не ТитулДоступенПользователю(ТипЛогистика) Тогда
		ТекстСообщения = "Вам не доступны документы: " + Строка(ТипЛогистика) + ". Обратитесь к администратору.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстСообщения);
		
		ТипЛогистика = ТипЛогистикаДоИзменения;
		
		Возврат;
	КонецЕсли;
	
	Если Элемент <> Неопределено Тогда
		// Отключим спец сценарий
		СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ПустаяСсылка");
	КонецЕсли;
	
	ОтборДокументыЛогистики.Очистить();
	
	УдалитьИсполняемыеНастройки();
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	ОбработатьНовыйТипДокументаЛогистикаСервер();
	
	Если Не ОшибкаНастройкиТекущегоТипа Тогда 
		ОбновитьКонтент();
		
		ИдентификаторВарианта = ЗаполнитьСписокВыбораВариантовФильтровНаСервере(Истина);
		Если ЗначениеЗаполнено(ИдентификаторВарианта) Тогда
			ПрименитьВариантФильтраПоИдентификатору(ИдентификаторВарианта);
		Иначе
			ТекущийВариантФильтра = "";
			УстановитьОтборДинСписка();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьБаннерЭкспедиторскихДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБаннерЭкспедиторскихДокументов()
	
	Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка") Тогда
		
		Элементы.ГруппаБаннерЭкспедиторскиеДокументы.Видимость = Не ДействуютЭкспедиторскиеДокументы;
	Иначе
		Элементы.ГруппаБаннерЭкспедиторскиеДокументы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	ЗадачиДинамическийСписок.Отбор.Элементы.Очистить();
	
	Если ОтборДокументыЛогистики.Количество() <> 0 Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗадачиДинамическийСписок, "ДокументЛогистика", ОтборДокументыЛогистики,
			ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпецСценарий) Тогда
		
		КоличествоДопКолонок = КонтекстНастройкиКонвертации.ДополнительныеКолонки.Количество();
		
		Для инд = 1 По КоличествоДопКолонок Цикл
			
			ДопКолонкаИмя = "Доп" + Строка(инд);
			
			Если ЕстьРеквизитФормы("ОтборДопКолонка" + ДопКолонкаИмя) И ЗначениеЗаполнено(ЭтаФорма["ОтборДопКолонка" + ДопКолонкаИмя]) Тогда
				
				ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ДопКолонкаИмя);
				ЭлементОтбора.ПравоеЗначение = ЭтаФорма["ОтборДопКолонка" + ДопКолонкаИмя];
				
				Если ТипЗнч(ЭтаФорма["ОтборДопКолонка" + ДопКолонкаИмя]) = Тип("Строка") Тогда
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
				Иначе
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
				
				ЭлементОтбора.Использование = Истина;
				
			КонецЕсли;
			
		КонецЦикла; 
	
	КонецЕсли;
	
	УстановитьЭлементОтбораСКонвертацией("Отправитель", ОтборГрузоотправитель);
	УстановитьЭлементОтбораСКонвертацией("Перевозчик", ОтборПеревозчик);
	УстановитьЭлементОтбораСКонвертацией("Получатель", ОтборГрузополучатель);
	
	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ПравоеЗначение = ОтборКонтрагент;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
	УстановитьЭлементОтбораСКонвертацией("МестоПогрузки", ОтборПогрузка);
	УстановитьЭлементОтбораСКонвертацией("МестоДоставки", ОтборВыгрузка);
	
	Если Элементы.Найти("ОтборВодитель") <> Неопределено И ЗначениеЗаполнено(ЭтаФорма["ОтборВодитель"]) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Водитель");
		ЭлементОтбора.ПравоеЗначение = ЭтаФорма["ОтборВодитель"];
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если Элементы.Найти("ОтборТранспортноеСредство") <> Неопределено И ЗначениеЗаполнено(ЭтаФорма["ОтборТранспортноеСредство"]) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТранспортноеСредство");
		ЭлементОтбора.ПравоеЗначение = ЭтаФорма["ОтборТранспортноеСредство"];
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если Элементы.Найти("ОтборМедРаботник") <> Неопределено И ЗначениеЗаполнено(ЭтаФорма["ОтборМедРаботник"]) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МедРаботник");
		ЭлементОтбора.ПравоеЗначение = ЭтаФорма["ОтборМедРаботник"];
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если Элементы.Найти("ОтборОтветственныйЗаОформление") <> Неопределено И ЗначениеЗаполнено(ЭтаФорма["ОтборОтветственныйЗаОформление"]) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтветственныйЗаОформление");
		ЭлементОтбора.ПравоеЗначение = ЭтаФорма["ОтборОтветственныйЗаОформление"];
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборТребуемоеДействие) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуемоеДействие");
		ЭлементОтбора.ПравоеЗначение = ОтборТребуемоеДействие;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	Иначе
		
		Если ОтборСостояние <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все") Тогда
			
			Если ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.МоиЗадачи") Тогда
				
				Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2")
					Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4") Тогда
					
					ГруппаОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
					
					ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОсобенностиДокументооборота");
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
				Иначе
					ГруппаОтбора = ЗадачиДинамическийСписок.Отбор;
				КонецЕсли;
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуемоеДействие");
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлементОтбора.ПравоеЗначение = МассивТребуемыхДействийМои();
				
			Иначе
				
				ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуемоеДействие");
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.РаботаЗавершена");
				
				Если ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные") Тогда
					
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					ЭлементОтбора.ПравоеЗначение = МассивТребуемыхДействийАктивные();
					
				ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.НаКонтроле") Тогда
					
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					ЭлементОтбора.ПравоеЗначение = МассивТребуемыхДействийНаКонтроле();
					
				ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Ошибки") Тогда
					
					ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ИсправитьОшибки");
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					
				Иначе
					
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе			
		
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ЗадачиДинамическийСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементОтбораСКонвертацией(ПолеЗапроса, ЗначениеОтбора)
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		
		ЭлементОтбора = ЗадачиДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеЗапроса);
		
		Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1") Тогда
			
			ЭлементОтбора.ПравоеЗначение = КонтурЛогистика_КонвертацияСервер.ПолучитьСвязанныеОбъекты(ЗначениеОтбора);
			ЭлементОтбора.ПравоеЗначение.Добавить(ЗначениеОтбора);
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МассивТребуемыхДействийНаКонтроле()

	МассивТД = Новый Массив;
	
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ДождатьсяПрибытия"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОжиданиеДругогоУчастника"));
	
	Возврат МассивТД;

КонецФункции

&НаКлиенте
Функция МассивТребуемыхДействийАктивные()
	
	МассивТД = Новый Массив;
	
	// мои
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Оформить"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Переотправить"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ЗапроситьОбъяснение"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ИсправитьОшибки"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОбрабатываетсяСервером"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Отправляется"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПровестиДокумент"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Распечатать"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПроверитьОтветДругогоУчастника"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВвестиНаОсновании"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю"));
	
	// сторонние
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ДождатьсяПрибытия"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОжиданиеДругогоУчастника"));

	// требующие обработки сервером
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВыполнитьОбмен"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки"));
	
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Обработать"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОбработанСПредупреждением"));	
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик"));
	
	Возврат МассивТД;
	
КонецФункции

&НаКлиенте
Функция МассивТребуемыхДействийМои()
	
	МассивТД = Новый Массив;
	
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Оформить"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Переотправить"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ЗапроситьОбъяснение"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ИсправитьОшибки"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОбрабатываетсяСервером"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Отправляется"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПровестиДокумент"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Распечатать"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПроверитьОтветДругогоУчастника"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВвестиНаОсновании"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю"));
	
	// спорно что в этой категории
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВыполнитьОбмен"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки"));
	
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Обработать"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик"));
	
	Возврат МассивТД;
	
КонецФункции

&НаСервереБезКонтекста
Функция СинонимДокумента1СПоИмени(ИмяДокументаВМетаданных)

	Если Не ЗначениеЗаполнено(ИмяДокументаВМетаданных) Тогда 
		Возврат "документ неизвестен";
	КонецЕсли;
	
	Если ИмяДокументаВМетаданных = "Предыдущий титул" Тогда 
		Возврат "Предыдущий титул";
	КонецЕсли;
	
	Попытка
	
		текСиноним = Метаданные.Документы[ИмяДокументаВМетаданных].Синоним;
	
	Исключение
		
		текСиноним = ИмяДокументаВМетаданных;
		
	КонецПопытки;
	
	Возврат текСиноним;
	
КонецФункции

&НаКлиенте
Процедура ТипДокументаКонфигурацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТипДокументаКонфигурации = ВыбранноеЗначение;
	СформироватьТекстЗапросаСпискаЗадачИнтеграция();
	ОбновитьКонтент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПеревозчикПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладОтправительПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборГрузополучательПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборГрузоотправительПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладПолучательПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьПереинициализироватьФорму(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ОбработатьНовыйТипДокументаЛогистикаСервер();
	
	Если Не ОшибкаНастройкиТекущегоТипа Тогда 
		ОбновитьКонтент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьДинамическийСписок(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ОбновитьКонтент();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗадачиДинамическийСписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЛогистическийТип = Неопределено;
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		Если ЛогистическийТип = Неопределено И ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ДокументЛогистика) Тогда
			ТипДокументаСтрокой = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(
				СтрокаСписка.Значение.Данные.ДокументЛогистика);
			ЛогистическийТип = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЛогистическийТипПоТипуДокумента(ТипДокументаСтрокой);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.Документ1С) Тогда 
			ПредставлениеДокумента1С = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(СтрокаСписка.Значение.Данные.Номер) + " от " + Формат(СтрокаСписка.Значение.Данные.Дата,"ДФ=dd.MM");
			ОфДок1С = СтрокаСписка.Значение.Оформление.Получить("Документ1С");
			Если ЗначениеЗаполнено(ОфДок1С) Тогда
				ОфДок1С.УстановитьЗначениеПараметра("Текст", ПредставлениеДокумента1С);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ДокументЛогистика)
			И НЕ ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ПредыдущийТитул) Тогда
			
			ПредставлениеДокументаЛогистика = ""; 
			ПредставлениеПредыдущегоТитула = ""; 
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ДокументЛогистика) Тогда
			
			ПредставлениеДокументаЛогистика = "" // может быть ТрН или ЗН или СВ
			+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(СтрокаСписка.Значение.Данные.НомерТрН) 
			+ " от " 
			+ Формат(СтрокаСписка.Значение.Данные.ДатаТрН, "ДФ=dd.MM");
			ПредставлениеПредыдущегоТитула = "";
			
		Иначе
			ПредставлениеПредыдущегоТитула = ""  // может быть ТрН или ЗН или СВ
			+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(СтрокаСписка.Значение.Данные.НомерТрН) 
			+ " от " 
			+ Формат(СтрокаСписка.Значение.Данные.ДатаТрН, "ДФ=dd.MM");
			ПредставлениеДокументаЛогистика = "";
		КонецЕсли;
		
		ОфДокЛогистика = СтрокаСписка.Значение.Оформление.Получить("ДокументЛогистика");
		Если ЗначениеЗаполнено(ОфДокЛогистика) Тогда 
			ОфДокЛогистика.УстановитьЗначениеПараметра("Текст", ПредставлениеДокументаЛогистика);
		КонецЕсли;
		ОфПредыдущийТитул = СтрокаСписка.Значение.Оформление.Получить("ПредыдущийТитул");
		Если ЗначениеЗаполнено(ОфПредыдущийТитул) Тогда 
			ОфПредыдущийТитул.УстановитьЗначениеПараметра("Текст", ПредставлениеПредыдущегоТитула);
		КонецЕсли;
		
		Если ЛогистическийТип = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
			Или ЛогистическийТип = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3 Тогда
			
			СтрокаСписка.Значение.Данные.ТребуемоеДействие =
				КонтурЛогистика_ОбработкаДокументовСервер.ТребуемоеДействиеРазрешенияРаботыСДокументамиПользователя(
					СтрокаСписка.Значение.Данные.ТребуемоеДействие, СтрокаСписка.Значение.Данные.ДокументЛогистика);
		КонецЕсли;
						
	КонецЦикла;
	
	// Получим водителей
	ДокументыОбработки = Новый Массив;
	ИмяПоляСДокументом = "";
	ИмяПоляСВодителем = "";
	Для Каждого СтрокаСписка Из Строки Цикл
		
		Если ИмяПоляСДокументом = "" Тогда
			ТипДокумента = ТипЗнч(СтрокаСписка.Значение.Данные.ДокументЛогистика);
			Если (ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2")
				Или ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
				Или ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4")
				Или ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул5"))
				И СтрокаСписка.Значение.Данные.Свойство("ВодительЛогистика") Тогда
				
				ИмяПоляСДокументом = "ДокументЭТРН";
				ИмяПоляСВодителем = "ВодительЛогистика";
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2")
				И СтрокаСписка.Значение.Данные.Свойство("Водитель") Тогда
				
				ИмяПоляСДокументом = "ДокументЛогистика";
				ИмяПоляСВодителем = "Водитель";
			Иначе
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		ДокументОбработки = СтрокаСписка.Значение.Данные[ИмяПоляСДокументом];
		Если ЗначениеЗаполнено(ДокументОбработки) Тогда
			ДокументыОбработки.Добавить(ДокументОбработки);
		КонецЕсли;
		
	КонецЦикла;
	Если ДокументыОбработки.Количество() <> 0 Тогда
		Водители = ВодителиИзДокументовЛогистики(ДокументыОбработки);
		Для Каждого СтрокаСписка Из Строки Цикл
			СтрокаСписка.Значение.Данные[ИмяПоляСВодителем] = Водители.Получить(СтрокаСписка.Значение.Данные[ИмяПоляСДокументом]);
		КонецЦикла;
	КонецЕсли;
	
	#Если Не ТолстыйКлиентОбычноеПриложение И Не ТолстыйКлиентУправляемоеПриложение Тогда
		КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"СписокЗадач_ЗадачиДинамическийСписокПриПолученииДанныхНаСервере", Ложь, Строки);
	#Иначе
		ПодключаемыйМодуль = КонтурЛогистика_ПодключаемыйМодульПовтИсп.ПодключаемыйМодуль();
		Если ПодключаемыйМодуль <> Неопределено Тогда
			ПодключаемыйМодуль.ОбработатьСобытиеКонтурЛогистика(
				"СписокЗадач_ЗадачиДинамическийСписокПриПолученииДанныхНаСервере", Ложь, Строки);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВодителиИзДокументовЛогистики(ДокументыОбработки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыОбработки", ДокументыОбработки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН КАК ДокументОбработки,
	|	КонтурЛогистика_ТрН_Титул1.Водитель КАК Водитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН В(&ДокументыОбработки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2Водители.Ссылка,
	|	МАКСИМУМ(КонтурЛогистика_ЗЗ_Титул2Водители.СвВодит)
	|ИЗ
	|	Документ.КонтурЛогистика_ЗЗ_Титул2.Водители КАК КонтурЛогистика_ЗЗ_Титул2Водители
	|ГДЕ
	|	КонтурЛогистика_ЗЗ_Титул2Водители.Ссылка В(&ДокументыОбработки)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ЗЗ_Титул2Водители.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ДокументОбработки, Выборка.Водитель);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗадачиДинамическийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекКолонка = Поле;
		ИмяКолонки = ТекКолонка.Имя;
		
		Если ИмяКолонки = "ЗадачиДинамическийСписокДокумент1С" Тогда 
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Документ1С) Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
				ТекущиеДанные.Документ1С,
				ЭтаФорма,
				"ОбработчикОбновитьДинамическийСписок");
			КонецЕсли;
			
		ИначеЕсли ИмяКолонки = "ЗадачиДинамическийСписокСтатус" И ТекущиеДанные.КомментарииВодителя = Истина Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
					ТекущиеДанные.ДокументЭТРН,
					ЭтаФорма,
					"ОбработчикОбновитьДинамическийСписок");
					
		ИначеЕсли ИмяКолонки = "ЗадачиДинамическийСписокСтатус" И ТекущиеДанные.КартинкаПереадресовокЗамен > 0 Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
					ТекущиеДанные.ДокументЭТРН,
					ЭтаФорма,
					"ОбработчикОбновитьДинамическийСписок");			
					
		ИначеЕсли ИмяКолонки = "ЗадачиДинамическийСписокСтатус" 
			И ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ОтборГлавныйДокумент", ТекущиеДанные.ДокументЭТРН);
			ПараметрыФормы.Вставить("ОтборСостояние", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все"));
	
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ФайлыОбмена.ФормаСписка",
						ПараметрыФормы, ЭтаФорма, ЭтаФорма);
					
		ИначеЕсли ИмяКолонки = "ЗадачиДинамическийСписокДокументЛогистика" Тогда 
			
			ПоказываемТитул = Неопределено;
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда 
				ПоказываемТитул = ТекущиеДанные.ДокументЛогистика;
			ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПредыдущийТитул) Тогда
				ПоказываемТитул = ТекущиеДанные.ПредыдущийТитул;
			ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументЭТРН) Тогда
				ПоказываемТитул = ТекущиеДанные.ДокументЭТРН;
			КонецЕсли;
		
			Если ЗначениеЗаполнено(ПоказываемТитул) Тогда
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
					ПоказываемТитул,
					ЭтаФорма,
					"ОбработчикОбновитьДинамическийСписок");
			КонецЕсли;
			
		ИначеЕсли ИмяКолонки = "ЗадачиДинамическийСписокТребуемоеДействие"
			И ТекущиеДанные.Свойство("ОсобенностиДокументооборота")
			И ЗначениеЗаполнено(ТекущиеДанные.ОсобенностиДокументооборота)
			И Не ТекущиеДанные.ОсобенностиДокументооборота = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыОсобенностейДокументооборота.Шаблон") Тогда
			
			ВыполнитьОбработкуОсобенностиДокументооборота(ТекущиеДанные);
			
		ИначеЕсли ИмяКолонки = "ЗадачиДинамическийСписокДокументЭТРН" Тогда 
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЭТРН) Тогда
				ПоказываемТитул = ТекущиеДанные.ДокументЭТРН;
			КонецЕсли;
		
			Если ЗначениеЗаполнено(ПоказываемТитул) Тогда
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
					ПоказываемТитул,
					ЭтаФорма,
					"ОбработчикОбновитьДинамическийСписок");
			КонецЕсли;	
			
		Иначе
			
			ВыполнитьТребуемоеДействие(ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиДинамическийСписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ИсторияСостоянийДокумента.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Попытка
		ВидимостьИстории = (ЗначениеЗаполнено(Элемент.ТекущиеДанные.ГлавныйДокумент));
	Исключение
		ВидимостьИстории = Ложь;
	КонецПопытки;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ИсторияСостоянийДокумента.Видимость = ВидимостьИстории;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьТребуемоеДействие(ТекущиеДанные)

	Документ 				= ТекущиеДанные.Документ1С;
	ДокументЛогистика 		= ТекущиеДанные.ДокументЛогистика;
	ПредыдущийТитул 		= ТекущиеДанные.ПредыдущийТитул;
	ТребуемоеДействие 		= ТекущиеДанные.ТребуемоеДействие;
	
	ДопПараметрыДействия = Новый Структура;
	
	// Требуемое действие может смениться в любую миллисекунду
	Если ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Оформить") Тогда
		
		Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02") Тогда 
			ДопПараметрыДействия.Вставить("Водитель", ТекущиеДанные.Водитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Документ) Тогда 
			КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаПоДокументу1С(
				ТипЛогистика, Документ, ЭтаФорма);
		Иначе
			
			Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
					ТекущиеДанные.ДокументЛогистика, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
			Иначе
				КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(
					ТипЛогистика, ПредыдущийТитул, ЭтаФорма, ДопПараметрыДействия);
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.РаботаЗавершена")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ИсправитьОшибки")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Переотправить") Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.ДокументЛогистика, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Отправляется")
		ИЛИ ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОбрабатываетсяСервером") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОтборСвязанныйДокумент", ТекущиеДанные.ДокументЛогистика);
		ПараметрыФормы.Вставить("ОтборСостояние", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все"));
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ФайлыОбмена.ФормаСписка", ПараметрыФормы, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПровестиДокумент") Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			Документ, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Распечатать") Тогда
		
		МассивДокументовЛогистика = Новый Массив;
		МассивДокументовЛогистика.Добавить(ТекущиеДанные.ДокументЛогистика);
		
		КонтурЛогистика_ПечатьКлиент.РаспечататьТрН(МассивДокументовЛогистика);
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВыполнитьОбмен") Тогда
		
		ВыполнитьОбменФормаЗадач();
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОжиданиеДругогоУчастника")
		ИЛИ ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ДождатьсяПрибытия")
		ИЛИ ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки")
		ИЛИ ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОбработанСПредупреждением") Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.ДокументЛогистика, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПроверитьОтветДругогоУчастника") Тогда
		
		Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1") Тогда
			
			ПараметрыФормы = Новый Структура("Ключ, ПроверкаОтвета", НайтиТитул(ДокументЛогистика, ТипЛогистика), Истина);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ЗЗ_Титул2.Форма.ФормаДокумента",
				ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка") Тогда
			
			ПараметрыФормы = Новый Структура("Ключ, ПроверкаОтвета", ДокументЛогистика, Истина);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.Форма.ФормаДокумента",
				ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка") Тогда
			
			ПараметрыФормы = Новый Структура("Ключ, ПроверкаОтвета", ДокументЛогистика, Истина);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_СкладскаяРасписка.Форма.ФормаДокумента",
				ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2") Тогда
			
			ПараметрыФормы = Новый Структура("Ключ, ПроверкаОтвета", ДокументЛогистика, Истина);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаДокумента",
				ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВвестиНаОсновании") Тогда 
		
		Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1") Тогда 
			
			ПараметрыФормы = Новый Структура("Основание", ДокументЛогистика);
			
			СуществующаяЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиЭТрНпоЗаказЗаявке(ДокументЛогистика);
			Если ЗначениеЗаполнено(СуществующаяЭТРН) Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(СуществующаяЭТРН, ЭтаФорма);
			Иначе
				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
					"Документ.КонтурЛогистика_ТрН_Титул1.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2") Тогда
			
			// нет потребности, вводится из списка ЗЗт1
			
		КонецЕсли;
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Обработать")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю") Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", ДокументЛогистика);
		
		ИмяОткрываемойФормы = "Документ." + КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика)
			+ ".ФормаОбъекта";
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			ИмяОткрываемойФормы, ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинамическийСписок");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОжиданиеДругогоСотрудника") Тогда
		
		Сообщить("У вас нет прав на выполнение требуемого действия. Ожидаем другого сотрудника.");
		
	Иначе
		
		// ОжиданиеДругогоУчастника - TODO решить что с ним делать
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не реализована обработка требуемого действия такого типа (" + ТребуемоеДействие + ") ";
		Сообщение.Поле = "ЗадачиДинамическийСписокТребуемоеДействие";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуОсобенностиДокументооборота(ТекущиеДанные)
	
	Если ТекущиеДанные.ОсобенностиДокументооборота = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_ТипыОсобенностейДокументооборота.ОбработатьИсправлениеТитула1") Тогда
		
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2");
		ПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1"),
			ТекущиеДанные.ДокументЭТРН);
		ДопПараметрыДействия = Новый Структура;
		
		КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(
			ТипЛогистика, ПредыдущийТитул, ЭтаФорма, ДопПараметрыДействия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнениеОбменаВФоне()
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.МенеджерФоновыхЗаданийДоступен() Тогда
		
		КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме(
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
			"Выполнение обмена",
			Новый Структура,
			"Выполнение обмена",
			Истина);
		
	Иначе
		КонтурЛогистика_API_Диадок.ОбработатьВсеЛентыСобытий()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт 

	Элементы.ЗадачиДинамическийСписок.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьКонтент();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ВвестиДокумент" 
		ИЛИ ИмяСобытия = "КонтурЛогистика_ЗакрытиеФормыСлеженияЗаФайлами" 
		ИЛИ ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		ИЛИ ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" Тогда
		
		Если Не МассоваяОбработка Тогда
			ОбновитьКонтент();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗавершениеФоновогоЗадания"
		
		И Параметр.Свойство("КлючФЗ")
		И (Лев(Параметр.КлючФЗ, 17) = "Выполнение обмена" ИЛИ (Параметр.КлючФЗ = "Удаление ошибок МЧД")) Тогда
		
		ОбновитьКонтент();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуСпискаЗадач" Тогда
		
		ОбновитьФорму();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйТитул(Команда)
	
	Если ЗначениеЗаполнено(ТипЛогистика) Тогда 
		ПараметрыФормы  = Новый Структура("СозданВручную", Истина); 
		ПолноеИмяФормы = "Документ." + КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика) + ".ФормаОбъекта";
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ПолноеИмяФормы, ПараметрыФормы); 
		
		Label = ОпределитьНазваниеДокументаДляМетрики(ТипЛогистика);
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Ручное создание документов", "Создать", 
			"ОбщиеФормы.КонтурЛогистика_Задачи.Форма.Форма", Label);
		
	Иначе
	    КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не указан Тип логистического документа");
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Функция ОпределитьНазваниеДокументаДляМетрики(ТипЛогистика)
	
	Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1") Тогда 
		Результат = "ПЭ";
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка") Тогда	
		Результат = "ЭР";
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка") Тогда
		Результат = "СР";
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1") Тогда 
		Результат = "ЭТрН";
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1")
		Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2") Тогда 
		Результат = "ЗЗ";
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2") 
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5") Тогда 
		Результат = "ПЛ_01";
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02")	 Тогда 
		Результат = "ПЛ_02";
	Иначе 
		Результат = "НовыйТип";	
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
 	ОбновитьФорму();
	
КонецПроцедуры

// Управление обменом
&НаКлиенте
Процедура ВыполнитьОбменФормаЗадач(Команда = Неопределено)
	
	АдресРезультатаВыполнитьОбмен = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
			,
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
			"Фоновое задание Выполнение обмена",
			АдресРезультатаВыполнитьОбмен);
	
	Если РезультатЗапуска.Статус = "Выполняется" Тогда
		
		ИдентификаторФЗ_ВыполнитьОбмен = РезультатЗапуска.ИдентификаторЗадания;
		Элементы.ФормаВыполнитьОбменФормаЗадач.Заголовок = "Обмен выполняется";
		Элементы.ФормаВыполнитьОбменФормаЗадач.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПесочныеЧасы;
		Элементы.ФормаВыполнитьОбменФормаЗадач.ЦветТекста = WebЦвета.Серый;
		//Элементы.ЛоадерВыполнитьОбмен.Видимость = Истина;
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", 0.1, Истина);
		
	ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
		
		ПроверитьФоновоеЗаданиеВыполнитьОбмен();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеВыполнитьОбмен() Экспорт
	
	ИнтервалОбработчикаОжидания = 2;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ВыполнитьОбмен,
		Элементы.ЛоадерВыполнитьОбмен);
	
	Если ЗаданиеЕщеВыполняется Тогда 
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		// Проверим результат выполнения фонового задания
		Результат = ПолучитьИзВременногоХранилища(АдресРезультатаВыполнитьОбмен);
		Если Результат <> Неопределено И Не Результат.Успешно Тогда
			ПротоколВыполненияОбмена = "";
			Для Каждого ТекущееСообщение Из Результат.МассивОшибок Цикл
				ПротоколВыполненияОбмена = ПротоколВыполненияОбмена + ТекущееСообщение + Символы.ПС;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ПротоколВыполненияОбмена) Тогда
				ПодключитьОбработчикОжидания("ПоказатьПротоколВыполненияОбмена", 1, Истина);
			КонецЕсли;
		КонецЕсли;
		
		//Элементы.ЛоадерВыполнитьОбмен.Видимость = Ложь;
		Элементы.ФормаВыполнитьОбменФормаЗадач.Заголовок = "Обмен с сервером";
		Элементы.ФормаВыполнитьОбменФормаЗадач.Картинка = БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен;
		Элементы.ФормаВыполнитьОбменФормаЗадач.ЦветТекста = Новый Цвет(77,77,77);
		
		ОбновитьКонтент();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПротоколВыполненияОбмена()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Протокол выполнения обмена");
	ПараметрыФормы.Вставить("Текст", ПротоколВыполненияОбмена);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ФормаТекстовогоСообщения", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛоадерВыполнитьОбменНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ИдентификаторФЗ_ВыполнитьОбмен) Тогда 
		КонтурЛогистика_ДлительныеОперацииКлиент.СледитьЗаФоновымЗаданиемВФорме(ИдентификаторФЗ_ВыполнитьОбмен, "Фоновое задание Выполнение обмена", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийТитул(Команда)
	
	СледующийТипТитула = ОпределитьСледующийТипЛогистика(ТипЛогистика, СпецСценарий);
	Если ЗначениеЗаполнено(СледующийТипТитула) И СледующийТипТитула <> ТипЛогистика Тогда
		
		Если ТитулДоступенПользователю(СледующийТипТитула) Тогда
			ТипЛогистика = СледующийТипТитула;
			ТипЛогистикаДоИзменения = ТипЛогистика;
			
			Если СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул7ПослеТитула4")
				И СледующийТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3") Тогда
				
				СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул3ПослеТитула7");
				
			ИначеЕсли СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул3ПослеТитула7")
				И СледующийТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4") Тогда
				
				СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул4ПоВозврату");
				
			Иначе
				СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ПустаяСсылка");
			КонецЕсли;
		Иначе
			ТекстСообщения = "Вам не доступны документы: " + Строка(СледующийТипТитула) + ". Обратитесь к администратору.";
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	ТипЛогистикаПриИзменении(Неопределено);
	
	УправлениеОтображениемКомандыПропуститьОбработкуВходящегоДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийТитул(Команда)
	
	ПредыдущийТипТитула = ОпределитьПредыдущийТипЛогистика(ТипЛогистика, СпецСценарий);
	Если ЗначениеЗаполнено(ПредыдущийТипТитула) И ПредыдущийТипТитула <> ТипЛогистика Тогда
		
		Если ТитулДоступенПользователю(ПредыдущийТипТитула) Тогда
			ТипЛогистика = ПредыдущийТипТитула;
			ТипЛогистикаДоИзменения = ТипЛогистика;
			
			Если СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул3ПослеТитула7")
				И ПредыдущийТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7") Тогда
				
				СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул7ПослеТитула4");
				
			ИначеЕсли СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул4ПоВозврату")
				И ПредыдущийТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3") Тогда
				
				СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул3ПослеТитула7");
				
			Иначе
				СпецСценарий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпецСценарииЗадач.ПустаяСсылка");
			КонецЕсли;
		Иначе
			ТекстСообщения = "Вам не доступны документы: " + Строка(ПредыдущийТипТитула) + ". Обратитесь к администратору.";
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	ТипЛогистикаПриИзменении(Неопределено);
	
	УправлениеОтображениемКомандыПропуститьОбработкуВходящегоДокумента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьСледующийТипЛогистика(ТипЛогистика, СпецСценарий = Неопределено)

	Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СледующийТипДокумента(ТипЛогистика, СпецСценарий);

КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьПредыдущийТипЛогистика(ТипЛогистика, СпецСценарий = Неопределено)

	Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПредыдущийТипДокумента(ТипЛогистика, СпецСценарий);

КонецФункции

&НаСервереБезКонтекста
Функция НайтиТитул(ДокументЛогистика, ТипЛогистика)
	
	НайденныйТитул = Неопределено;
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда 
		
		СледующийТипЛогистика = ОпределитьСледующийТипЛогистика(ТипЛогистика);
		
		НайденныйТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(СледующийТипЛогистика, ДокументЛогистика);
		
	КонецЕсли;
	
	Возврат НайденныйТитул;

КонецФункции	

&НаСервере
Процедура УсловноеОформлениеТребуемогоДействияЗЗ()

	//ВключитьОформление = ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
	//						И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ОформитьЭТрНПослеЗЗ");

	//ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();						
	//
	//ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗадачиДинамическийСписокТребуемоеДействие");
	//
	//ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	// ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипЛогистика");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1;
	//
	//ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗадачиДинамическийСписок.ТребуемоеДействие");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.Требуемы.ЗЗ_Титул1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьсяВПодписи(Команда)
	
	ТекДанные = Элементы.ЗадачиДинамическийСписок.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекДанные.Статус) 
		Или ТекДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик") Тогда 
		
		ТитулСсылка = ТекДанные.ДокументЛогистика;
		
		Если Не ЗначениеЗаполнено(ТитулСсылка) Тогда 
			МассивДокументов = СоздатьДокументЛогистикиПоПредыдущемуТитулу(ТекДанные.ПредыдущийТитул, ТипЛогистика);
			Если ЗначениеЗаполнено(МассивДокументов) Тогда 
				ТитулСсылка = МассивДокументов[0];
			КонецЕсли;	
		КонецЕсли;	
		
		КонтурЛогистика_ОбработкаДокументовКлиент.ОтказатьсяВПодписи(ТитулСсылка, Новый Структура("Источник", ЭтаФорма));
		
	Иначе	
		
		ВызватьИсключение "Отказываться от Титула можно в статусах ""Новый"" и ""Черновик""";
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДокументЛогистикиПоПредыдущемуТитулу(ПредыдущийТитул, ТипЛогистика)
	
	МассивДокументов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредыдущийТитул);
	
	РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(МассивДокументов, ТипЛогистика, Ложь);
	
	Возврат РезультатВвода.ВведенныеДокументы;
	
КонецФункции	

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСостояние(Команда)
	
	Если Команда.Имя = "УстановитьОтборСостояниеАктивные" Тогда 
		ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные"); 
	ИначеЕсли Команда.Имя = "УстановитьОтборСостояниеСделать" Тогда 
		ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.МоиЗадачи"); 
	ИначеЕсли Команда.Имя = "УстановитьОтборСостояниеНаКонтроле" Тогда 
		ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.НаКонтроле"); 
	ИначеЕсли Команда.Имя = "УстановитьОтборСостояниеВсе" Тогда 
		ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все"); 
	ИначеЕсли Команда.Имя = "УстановитьОтборСостояниеЗавершенные" Тогда 
		ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Завершенные"); 
	ИначеЕсли Команда.Имя = "УстановитьОтборСостояниеОшибки" Тогда 
		ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Ошибки"); 
	КонецЕсли;
	
	ОбновитьОтображениеКнопокОтбораСостояния();
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКнопокОтбораСостояния()
	
	Элементы.УстановитьОтборСостояниеАктивные.Картинка = Новый Картинка;
	Элементы.УстановитьОтборСостояниеСделать.Картинка = Новый Картинка;
	Элементы.УстановитьОтборСостояниеНаКонтроле.Картинка = Новый Картинка;
	Элементы.УстановитьОтборСостояниеВсе.Картинка = Новый Картинка;
	Элементы.УстановитьОтборСостояниеЗавершенные.Картинка = Новый Картинка;
	Элементы.УстановитьОтборСостояниеОшибки.Картинка = Новый Картинка;
	
	ОбычныйШрифт = Элементы.УстановитьОтборСостояниеЭталонШрифта.Шрифт;
	Элементы.УстановитьОтборСостояниеАктивные.Шрифт = ОбычныйШрифт;
	Элементы.УстановитьОтборСостояниеСделать.Шрифт = ОбычныйШрифт;
	Элементы.УстановитьОтборСостояниеНаКонтроле.Шрифт = ОбычныйШрифт;
	Элементы.УстановитьОтборСостояниеВсе.Шрифт = ОбычныйШрифт;
	Элементы.УстановитьОтборСостояниеЗавершенные.Шрифт = ОбычныйШрифт;
	Элементы.УстановитьОтборСостояниеОшибки.Шрифт = ОбычныйШрифт;
	
	ИмяКнопки = ИмяКнопкиОтбораСостояния();
	Если Не ЗначениеЗаполнено(ИмяКнопки) Тогда
		Возврат;
	КонецЕсли;
	
	ЖирныйШрифт = Элементы.УстановитьОтборСостояниеЭталонШрифтаЖирный.Шрифт;
	НажатаяКнопка = Элементы[ИмяКнопки];
	НажатаяКнопка.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
	НажатаяКнопка.Шрифт = ЖирныйШрифт;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяКнопкиОтбораСостояния()
	
	Если ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные") Тогда
		Возврат "УстановитьОтборСостояниеАктивные";
	ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.МоиЗадачи") Тогда
		Возврат "УстановитьОтборСостояниеСделать";
	ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.НаКонтроле") Тогда
		Возврат "УстановитьОтборСостояниеНаКонтроле";
	ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все") Тогда
		Возврат "УстановитьОтборСостояниеВсе";
	ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Завершенные") Тогда
		Возврат "УстановитьОтборСостояниеЗавершенные";
	ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Ошибки") Тогда
		Возврат "УстановитьОтборСостояниеОшибки";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УправлениеОтображениемКомандыПропуститьОбработкуВходящегоДокумента()
	
	КонтурЛогистика_РаботаСЭлементамиФормыСервер.ОтображениеКомандыПропуститьОбработкуВходящегоДокумента(
		ЭтаФорма, КонтекстНастройкиКонвертации.ОбратныйМаппинг);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПоУмолчанию(Команда)
	
	Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул3")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул5")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул7")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул9")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1")
		ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1")
		
		Тогда
		
		// доступны команды ввода из док 1С учетной системы
		ВозможенВводИз1С = Истина;
		
	Иначе // титулы вводятся из предыдущего титула
		
		// не доступны команды ввода из док 1С учетной системы
		ВозможенВводИз1С = Ложь;
		
	КонецЕсли;
	
	// раскидаем на 3 разных потока УчДок / Титул / ПредыдущийТитул
	МассивОписанийДокументовПодсистемыЛогистика = Новый Массив;
	МассивОписанийДокументовУчетнойСистемы = Новый Массив;
	МассивПредыдущихДокументовПодсистемыЛогистика = Новый Массив;
		
	ВыделенныеСтрокиЗадач = ЭтаФорма.Элементы.ЗадачиДинамическийСписок.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтрокиЗадач Цикл 
		
		ДанныеСтроки = ЭтаФорма.Элементы.ЗадачиДинамическийСписок.ДанныеСтроки(ВыделеннаяСтрока);
		
		ОписаниеДокумента = Новый Структура;
		ОписаниеДокумента.Вставить("ТребуемоеДействие", ДанныеСтроки.ТребуемоеДействие);
		ОписаниеДокумента.Вставить("Документ", ДанныеСтроки.ДокументЛогистика);
		ОписаниеДокумента.Вставить("Документ1С", ДанныеСтроки.Документ1С);
		ОписаниеДокумента.Вставить("ПредыдущийТитул", ДанныеСтроки.ПредыдущийТитул);
		ДанныеЗаполненияСтруктура = Новый Структура;
		Если ДанныеСтроки.Свойство("Водитель") Тогда 
			ДанныеЗаполненияСтруктура.Вставить("Водитель", ДанныеСтроки.Водитель);
		КонецЕсли;
		ОписаниеДокумента.Вставить("ДанныеЗаполнения", ДанныеЗаполненияСтруктура);
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ДокументЛогистика) Тогда	
			МассивОписанийДокументовПодсистемыЛогистика.Добавить(ОписаниеДокумента);
			
		ИначеЕсли ВозможенВводИз1С Тогда 
			МассивОписанийДокументовУчетнойСистемы.Добавить(ОписаниеДокумента);
			
		ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ПредыдущийТитул) Тогда 
			МассивПредыдущихДокументовПодсистемыЛогистика.Добавить(ОписаниеДокумента);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассоваяОбработка = (ВыделенныеСтрокиЗадач.Количество() > 5);
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	// действия с самим титулом
	Если МассивОписанийДокументовПодсистемыЛогистика.Количество() > 0 Тогда
		
		МассивТитулов = Новый Массив;
		Для Каждого ОписаниеДокумента Из МассивОписанийДокументовПодсистемыЛогистика Цикл 
			МассивТитулов.Добавить(ОписаниеДокумента.Документ);
		КонецЦикла;
		
		КонтурЛогистика_ОбработкаДокументовКлиент.ВыполнитьТекущиеТребуемыеДействия(МассивТитулов, ПараметрыВыполненияКоманды);
		
	КонецЕсли;
	
	// действия по вводу документа титула из документа 1С
	Если МассивОписанийДокументовУчетнойСистемы.Количество() > 0 Тогда
		
		МассивДокументовУчСист = Новый Массив;
		Для Каждого ОписаниеДокумента Из МассивОписанийДокументовУчетнойСистемы Цикл 
			МассивДокументовУчСист.Добавить(ОписаниеДокумента.Документ1С); // документ1С - это докумнет учетной системы
		КонецЦикла;
		
		ВведенныеДокументыПодсистемы = Новый Массив;
		
		Для Каждого ДокументУчСист Из МассивДокументовУчСист Цикл 
			
			// требуется понять какое действие делать: отправлять подписанный или неподписанный
			ТипыЛогистика = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьТипыЛогистики(ДокументУчСист, ТипЛогистика);
			ДействиеПоУмолч = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьДействиеПоУмолчаниюДокУчСист(ДокументУчСист, ТипыЛогистика);
			
			МассивДокументовУчетнойСистемы = Новый Массив;
			МассивДокументовУчетнойСистемы.Добавить(ДокументУчСист);
			
			ВведенныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументы(МассивДокументовУчетнойСистемы, ТипЛогистика);
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВведенныеДокументыПодсистемы, ВведенныйДокумент, Истина);
			
		КонецЦикла;
		
		КонтурЛогистика_ОбработкаДокументовКлиент.ВыполнитьТекущиеТребуемыеДействия(ВведенныеДокументыПодсистемы, ПараметрыВыполненияКоманды);
		
	КонецЕсли;
	
	// действия по вводу документа титула из предыдущего документа титула
	Если МассивПредыдущихДокументовПодсистемыЛогистика.Количество() > 0 Тогда
		
		МассивПредыдущихТитулов = Новый Массив;
		Для Каждого ОписаниеДокумента Из МассивПредыдущихДокументовПодсистемыЛогистика Цикл 
			МассивПредыдущихТитулов.Добавить(ОписаниеДокумента.ПредыдущийТитул);
		КонецЦикла;
		ДанныеЗаполненияМассивСтруктур = Новый Массив;
		Для Каждого ОписаниеДокумента Из МассивПредыдущихДокументовПодсистемыЛогистика Цикл 
			ДанныеЗаполненияМассивСтруктур.Добавить(ОписаниеДокумента.ДанныеЗаполнения);
		КонецЦикла;
		
		МассивВведенныхТитулов = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеДокументыТитулыПакетно(ТипЛогистика, МассивПредыдущихТитулов, ДанныеЗаполненияМассивСтруктур);
		Если МассивВведенныхТитулов.Количество() > 0 Тогда 
			КонтурЛогистика_ОбработкаДокументовКлиент.ВыполнитьТекущиеТребуемыеДействия(МассивВведенныхТитулов, ПараметрыВыполненияКоманды);
		КонецЕсли;

	КонецЕсли;
	
	Если МассоваяОбработка Тогда
		МассоваяОбработка = Ложь;
		
		// Обновим единоразово контент после массовой обработки титулов
		ОбновитьКонтент();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМинимальнуюДатуГраницыСинхронизации()
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьОбщуюМинимальнуюДатуГраницыСинхронизации();
	
КонецФункции

&НаСервереБезКонтекста
Функция ТитулДоступенПользователю(ТипДокумента)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ДоступыПользователя = КонтурЛогистика_ОбщегоНазначенияСервер.ДоступыПользователя(ТекущийПользователь);
	
	ПолныйДоступ = ДоступыПользователя.ПолныйДоступ;
	
	Если ПолныйДоступ Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДоступКТитулам = ДоступыПользователя.ДоступКТитулам;
	
	ТолькоПросмотрЭлементов = ДоступКТитулам.ТолькоПросмотр.Получить(ТипДокумента);
	СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(ТипДокумента);
	
	Возврат (ТолькоПросмотрЭлементов Или СозданиеРедактированиеЭлементов);
	
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеПоГруппамДоступа()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ДоступыПользователя = КонтурЛогистика_ОбщегоНазначенияСервер.ДоступыПользователя(ТекущийПользователь);
	
	Если ДоступыПользователя.ПолныйДоступ Тогда
		Возврат;
	КонецЕсли;
	
	ДоступКТитулам = ДоступыПользователя.ДоступКТитулам;
	
	СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(ТипЛогистика);
	Для Каждого ТекущийЭлемент Из ГруппаЭлементовРаботыСДокументом() Цикл
		ТекущийЭлемент.Доступность = СозданиеРедактированиеЭлементов;
	КонецЦикла;
	
	// Титул 7
	Титул7 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7;
	СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(Титул7);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_СоздатьПереадресацию.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_СоздатьПереадресацию1.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СоздатьПереадресацию.Доступность = СозданиеРедактированиеЭлементов;
	
	// Титул 8
	Титул8 = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8;
	СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(Титул8);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_СоздатьЭстафету.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_СоздатьЭстафету1.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиДинамическийСписокКонтекстноеМенюОбщаяКомандаКонтурЛогистика_СоздатьЭстафету.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаСервере
Функция ГруппаЭлементовРаботыСДокументом()
	
	ГруппаЭлементов = Новый Массив;
	
	ГруппаЭлементов.Добавить(Элементы.ФормаВыполнитьДействиеПоУмолчанию);
	
	// Группа Управление (Т1)
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_Создать1ТрнПоВыделенным");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_Создать1ПлПоВыделенным");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_СоздатьЧерновик");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ВнестиИсправлениеТитула");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыДиадок");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание");
	
	// Группа Управление (Другие)
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ВвестиСледующийТитул");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный1");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке1");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить1");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке1");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыДиадок1");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента1");
	
	// Группа Еще
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПоказатьФайлыОбмена");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаНовыйТитул");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ПропуститьДокумент");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ИзменитьСтатусДокумента");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ИзменитьСостояниеДокумента");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыЛогистика");
	ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, "ФормаОбщаяКомандаКонтурЛогистика_ЗаполнитьДокументУчетнойСистемыПоТитулу");
	
	Возврат ГруппаЭлементов;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементФормыВГруппуПоИмени(ГруппаЭлементов, ИмяЭлементаФормы)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлементаФормы);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаЭлементов.Добавить(НайденныйЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиСценариеАвтоматическойРаботыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипЛогистика", ТипЛогистика);
	
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиГСМНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДанных", ТипДанныхГСМНаСервере());
	ПараметрыФормы.Вставить("ТипЛогистика", ТипЛогистика);
	ПараметрыФормы.Вставить("ОтборСтатус", "Ошибка");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_ПроизвольныеДанные.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипДанныхГСМНаСервере()
	
	Возврат РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеУведомлений()
	
	КонтурЛогистика_ОбновлениеКлиент.ПроверитьНаличиеУведомлений(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборыДополнительныхКолонокНаФорму()
	
	Для каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Лев(Реквизит.Имя, 15) = "ОтборДопКолонка" Тогда	
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.УдлРеквизитИЭлемент(ЭтаФорма, Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СпецСценарий)
		Или КонтекстНастройкиКонвертации.ДополнительныеКолонки.Количество() = 0 Тогда
		
		Возврат;
	КонецЕсли;
	
	НомерСтроки = 1;
	Для каждого ДопКолонка Из КонтекстНастройкиКонвертации.ДополнительныеКолонки Цикл
		
		ИмяДопРеквизита = "ОтборДопКолонкаДоп" + Формат(НомерСтроки, "ЧГ=0");
		
		Если Элементы.Найти(ИмяДопРеквизита) <> Неопределено Тогда
			Элементы[ИмяДопРеквизита].Видимость = ДопКолонка.Отбор;
		ИначеЕсли Не ДопКолонка.Отбор Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЕстьРеквизитФормы(ИмяДопРеквизита) Тогда
			
			Типы = Новый Массив;
			стрТипы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ДопКолонка.Тип, ";");
			Для каждого стрТип Из стрТипы Цикл
				Типы.Добавить(Тип(стрТип));
			КонецЦикла;
			ОписаниеТипов = Новый ОписаниеТипов(Типы);
			
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, ИмяДопРеквизита, ОписаниеТипов);
			
		КонецЕсли;
		
		Если Элементы.Найти(ИмяДопРеквизита) = Неопределено Тогда
			
			СобытияЭФ = Новый Структура;  
			СобытияЭФ.Вставить("ПриИзменении", "УстановитьОтборДинСписка");
			
			СвойстваЭФ = Новый Структура;  
			СвойстваЭФ.Вставить("КнопкаОчистки", Истина);
			СвойстваЭФ.Вставить("РастягиватьПоГоризонтали", Истина);
			СвойстваЭФ.Вставить("Подсказка", "Доп" + Формат(НомерСтроки, "ЧГ=0"));
			СвойстваЭФ.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
			
			Если НомерСтроки % 3 = 1 Или НомерСтроки = 1 Тогда
				Родитель = Элементы.ОтборДопКолонки1;
			ИначеЕсли НомерСтроки % 3 = 2 Или НомерСтроки = 2 Тогда
				Родитель = Элементы.ОтборДопКолонки2;
			Иначе
				Родитель = Элементы.ОтборДопКолонки3;
			КонецЕсли;
			
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(
				ЭтаФорма, ИмяДопРеквизита, Родитель, ДопКолонка.Заголовок, 1, ИмяДопРеквизита, СвойстваЭФ, СобытияЭФ);
			
			НомерСтроки = НомерСтроки + 1;
			
		Иначе
			
			Элементы[ИмяДопРеквизита].Заголовок = ДопКолонка.Заголовок;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьРеквизитФормы(Имя)
	
	Для каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура БаннерЭкспедиторскиеДокументыЗакрыть(Команда)
	
	Элементы.ГруппаБаннерЭкспедиторскиеДокументы.Видимость = Ложь;
	
	// Чтобы заново не выводить баннер пока открыта эта форма
	ДействуютЭкспедиторскиеДокументы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБаннерЭкспедиторскиеДокументыСсылкаНажатие(Элемент)
	
	Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1") Тогда
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Просмотр баннера по ЭЭД", "Переход по гиперссылке", "ОбщаяФорма.КонтурЛогистика_Задачи", "ПЭ1");
				
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2") Тогда
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Просмотр баннера по ЭЭД", "Переход по гиперссылке", "ОбщаяФорма.КонтурЛогистика_Задачи", "ПЭ2");
		
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка") Тогда
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Просмотр баннера по ЭЭД", "Переход по гиперссылке", "ОбщаяФорма.КонтурЛогистика_Задачи", "ЭР");
		
	ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка") Тогда
		
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Просмотр баннера по ЭЭД", "Переход по гиперссылке", "ОбщаяФорма.КонтурЛогистика_Задачи", "СР");
		
	КонецЕсли;
	
	ТекстСсылка = "https://support.kontur.ru/logistika-1s/ekspeditorskie_dokumenty";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТекстСсылка);
	
КонецПроцедуры

#Область ПоказатьТекстЗапроса

&НаСервере
Функция ДанныеЗапроса()
	
	СписокПараметров = Новый СписокЗначений;
	Для каждого Параметр Из ЗадачиДинамическийСписок.Параметры.Элементы Цикл
		
		Если Не Параметр.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		СписокПараметров.Добавить(Параметр.Значение, Строка(Параметр.Параметр));
		
	КонецЦикла;
	
	Отборы = Новый СписокЗначений;
	ДобавитьЭлементыОтбораКомпоновкиДанных(Отборы, ЗадачиДинамическийСписок.Отбор.Элементы);
	Для каждого ПользовательскаяНастройка Из  ЗадачиДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ПользовательскаяНастройка) = Тип("ОтборКомпоновкиДанных") Тогда
			ДобавитьЭлементыОтбораКомпоновкиДанных(Отборы, ПользовательскаяНастройка.Элементы);	
		КонецЕсли;
	КонецЦикла;
	 		
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ТекстЗапроса", ЗадачиДинамическийСписок.ТекстЗапроса);
	ДанныеЗапроса.Вставить("ПараметрыЗапроса", СписокПараметров);
	ДанныеЗапроса.Вставить("Отборы", Отборы);
	
	Возврат ДанныеЗапроса;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементыОтбораКомпоновкиДанных(Отборы, Элементы)
	
	Для каждого Отбор Из Элементы Цикл
		
		Если Не Отбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ДанныеОтбора = Новый Структура;
			ДанныеОтбора.Вставить("Имя", Строка(Отбор.ТипГруппы));
			ДанныеОтбора.Вставить("ЭтоГруппа", Истина);
			ДанныеОтбора.Вставить("Элементы", Новый СписокЗначений);
						
			Отборы.Добавить(ДанныеОтбора, Строка(Отбор.ТипГруппы));
			
			ДобавитьЭлементыОтбораКомпоновкиДанных(ДанныеОтбора.Элементы, Отбор.Элементы);
		Иначе
			ДанныеОтбора = Новый Структура;
			ДанныеОтбора.Вставить("Имя", Строка(Отбор.ЛевоеЗначение));
			ДанныеОтбора.Вставить("ВидСравнения", Отбор.ВидСравнения);
			ДанныеОтбора.Вставить("Значение", Отбор.ПравоеЗначение);
			ДанныеОтбора.Вставить("ЭтоГруппа", Ложь);
			
			Отборы.Добавить(ДанныеОтбора, Строка(Отбор.ЛевоеЗначение));	
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекстЗапроса(Команда)
			
	ПараметрыФормы = ДанныеЗапроса();	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ФормаТекстаЗапроса", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиТРНизЗЗ(Команда)
	
	МассивЗЗ = Новый Массив;
	
	ВыделенныеСтрокиЗадач = ЭтаФорма.Элементы.ЗадачиДинамическийСписок.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтрокиЗадач Цикл 
		
		ДанныеСтроки = ЭтаФорма.Элементы.ЗадачиДинамическийСписок.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ДокументЛогистика) Тогда 
			Если (ТипЗнч(ДанныеСтроки.ДокументЛогистика) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1")
				Или ТипЗнч(ДанныеСтроки.ДокументЛогистика) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2"))
			Тогда 
				МассивЗЗ.Добавить(ДанныеСтроки.ДокументЛогистика);
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ПредыдущийТитул) Тогда	
			
			Если (ТипЗнч(ДанныеСтроки.ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1")
				Или ТипЗнч(ДанныеСтроки.ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2"))
			Тогда 
				МассивЗЗ.Добавить(ДанныеСтроки.ПредыдущийТитул);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЗЗ.Количество() > 0 Тогда 
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник", ЭтаФорма);
		КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиТРНизЗЗ(МассивЗЗ, ПараметрыВыполненияКоманды);
	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПереименоватьЗаголовкиКолонокДинСписка()
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокПеревозчик", "Экспедитор");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокНомерТрН", "Номер поручения");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокумент1С", "Учетный документ");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЭТРН", "Маршрут");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЛогистика", "Документ Логистика");
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2 Тогда
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокПеревозчик", "Экспедитор");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокНомерТрН", "Номер поручения");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЛогистика", "Поручение Титул2");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЭТРН", "Поручение Титул1");
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокПеревозчик", "Экспедитор");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокНомерТрН", "Номер");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЭТРН", "Учетный документ");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЛогистика", "Документ Логистика");
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка Тогда
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокПеревозчик", "Экспедитор");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокНомерТрН", "Номер");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЭТРН", "Маршрут/партия груза");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокМестоПогрузки", "Склад");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЛогистика", "Документ Логистика");
		УстановитьЗаголовокЭлемента("ОтборСкладОтправитель", "Склад");
	Иначе
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокПеревозчик", "Перевозчик");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокНомерТрН", "Номер");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокумент1С", "Учетный документ");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЛогистика", "Документ Логистика");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокДокументЭТРН", "Учетный документ");
		УстановитьЗаголовокЭлемента("ЗадачиДинамическийСписокМестоПогрузки", "Место погрузки");
		УстановитьЗаголовокЭлемента("ОтборСкладОтправитель", "Место погрузки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
КонецПроцедуры
 

#Область ВариантыФильтров

&НаКлиенте
Процедура ОбработатьПриминениеФильтров()
	
	МожноАвтоприменитьВариант = (ОтборДокументыЛогистики.Количество() = 0);
	ИдентификаторВарианта = ЗаполнитьСписокВыбораВариантовФильтровНаСервере(МожноАвтоприменитьВариант);
	ЕстьВыбранныйВариант = ЗначениеЗаполнено(ИдентификаторВарианта);
	Если ЕстьВыбранныйВариант Тогда
		ПрименитьВариантФильтраПоИдентификатору(ИдентификаторВарианта);
	КонецЕсли;
	
	Элементы.СброситьОтборыНастройки.Доступность = ЕстьВыбранныйВариант;
	
	// При открытии приходится устанавливать два раза иначе не появляются быстрые отборы (не понятно почему)
	Если ЕстьВыбранныйВариант Тогда
		ПрименитьВариантФильтраПоИдентификатору(ИдентификаторВарианта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьВариантФильтраПоИдентификатору(ИдентификаторВарианта)
	
	Если Не ЗначениеЗаполнено(ИдентификаторВарианта) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСнимка = ДанныеВариантаФильтраНаСервере(ИдентификаторВарианта);
	Если ДанныеСнимка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьРеквизитыСнимкаФильтровНаСервере(ДанныеСнимка);
	ОбновитьКонтент();
	ОбновитьОтображениеКнопокОтбораСостояния();
	УстановитьОтборДинСписка();
	ЗапомнитьПоследнийВариантФильтраНаСервере(ИдентификаторВарианта);
	ТекущийВариантФильтра = ИдентификаторВарианта;
	
	ВосстановитьИсполняемыеНастройки(ДанныеСнимка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийВариантФильтраПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ТекущийВариантФильтра) Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьВариантФильтраПоИдентификатору(ТекущийВариантФильтра);
	
	СброситьСписокНастроекБылОткрыт();
	
	Элементы.СброситьОтборыНастройки.Доступность = Истина;
	
	ОтправитьМетрикуПоведения(ТипЛогистика, "Применить");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийВариантФильтраНачалоВыбора(Элемент, ДанныеВыбора, СтандажртнаяОбработка)
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		// Особенности 8.2
		СтандажртнаяОбработка = Ложь;
		ПодключитьОбработчикОжидания("ОткрытьФормуФильтровЗадач", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
	СписокНастроекБылОткрыт = Не СписокНастроекБылОткрыт;
	
	Если СписокНастроекБылОткрыт = Ложь Тогда
		
		ПодключитьОбработчикОжидания("ОткрытьФормуФильтровЗадач", 0.1, Истина);
		
	Иначе
		
		// Сброс признака произойдет через три секунды. Это нужно для следующего сценария:
		// если пользователь не нажмет кнопку «Показать все» в течение этого времени,
		// то при повторном выборе должен снова открыться выпадающий список, а не весь перечень элементов.
		ПодключитьОбработчикОжидания("СброситьСписокНастроекБылОткрыт", 3, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуФильтровЗадач()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНастроекВариантовФильтров", КлючНастроекВариантовФильтров());
	ПараметрыФормы.Вставить("КлючОбъектаВариантовФильтров", КлючОбъектаВариантовФильтров());
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_ВсеФильтрыСпискаЗадач", ПараметрыФормы,
		ЭтаФорма, ЭтаФорма, "ТекущийВариантФильтраРедактированиеФильтровЗавершение",,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьСписокНастроекБылОткрыт()
	
	СписокНастроекБылОткрыт = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийВариантФильтраРедактированиеФильтровЗавершение(Результат, ДополнителныеПараметры) Экспорт
	
	// Заполним список вариантов, вдруго его изменили при редактировании в форме
	ПрименитьПоследний = Ложь;
	ЗаполнитьСписокВыбораВариантовФильтровНаСервере(ПрименитьПоследний);
	
	// Ничего не выбрали
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Установим новый выбранный
	ТекущийВариантФильтра = Результат;
	
	// Применим настройки выбранного
	ПрименитьВариантФильтраПоИдентификатору(ТекущийВариантФильтра);
	
	// Доступна команда сброса
	Элементы.СброситьОтборыНастройки.Доступность = Истина;
	
	СброситьСписокНастроекБылОткрыт();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийВариантФильтраОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СброситьСписокНастроекБылОткрыт();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантФильтра(Команда)
	
	Если ЗначениеЗаполнено(ТекущийВариантФильтра) Тогда
		
		СписокВариантов = Новый СписокЗначений;
		СписокВариантов.Добавить("Перезаписать", "Перезаписать");
		СписокВариантов.Добавить("Новый", "Новый");
		
		Оповещение = Новый ОписаниеОповещения("СохранитьВариантФильтраЗавершение", ЭтаФорма);
		
		ПоказатьВыборИзСписка(Оповещение, СписокВариантов, Элементы.СохранитьВариантФильтра);
		
	Иначе
		
		СохранитьВариантФильтраКак();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантФильтраЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "Перезаписать" Тогда
		
		// Перезапишем текущий
		ИдентификаторВарианта = СохранитьВариантФильтровНаСервере(ТекущийВариантФильтра, "", Ложь);
		ТекущийВариантФильтра = ИдентификаторВарианта;
		ЗаполнитьСписокВыбораВариантовФильтровНаСервере(Ложь);
		
	Иначе
		
		// Создадим новый
		СохранитьВариантФильтраКак();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьОтборыНастройки(Команда)
	
	Элементы.ГруппаОтборыНастройкиТело.Видимость = Не Элементы.ГруппаОтборыНастройкиТело.Видимость;
	
	Элементы.СкрытьПоказатьОтборыНастройки.Пометка = Элементы.ГруппаОтборыНастройкиТело.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьОтборыНастройки(Команда)
	
	ТекущийВариантФильтра = "";
	ЗапомнитьПоследнийВариантФильтраНаСервере(ТекущийВариантФильтра);
	
	ТипДокументаКонфигурации = "";
	УстановитьТипДокументаКонфигурации();
	
	Период = ПериодВходящий;
	
	ОтборГрузоотправитель = Неопределено;
	ОтборПеревозчик = Неопределено;
	ОтборГрузополучатель = Неопределено;
	ОтборКонтрагент = Неопределено;
	ОтборПогрузка = Неопределено;
	ОтборВыгрузка = Неопределено;
	ОтборТребуемоеДействие = Неопределено;
	
	Для Каждого ИмяРеквизита Из ИменаДинамическихРеквизитовОтбора() Цикл
		
		Если Не ЕстьРеквизитФормы(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизита]) Тогда
			ЭтаФорма[ИмяРеквизита] = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	// 1. Находим коллекцию пользовательских отборов списка
	КоллекцияОтборов = Неопределено;
	Для Каждого ЭлементНастройки Из ЗадачиДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
			КоллекцияОтборов = ЭлементНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если в пользовательских настройках нет коллекции, берем основную настройки компоновщика
	Если КоллекцияОтборов = Неопределено Тогда
		КоллекцияОтборов = ЗадачиДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	КонецЕсли;
	
	// 2. Очищаем старые отборы (чтобы не дублировать)
	КоллекцияОтборов.Элементы.Очистить();
	
	СформироватьТекстЗапросаСпискаЗадачИнтеграция();
	ОбновитьКонтент();
	ОбновитьОтображениеКнопокОтбораСостояния();
	УстановитьОтборДинСписка();
	ТекущийВариантФильтра = "";
	
	Элементы.СброситьОтборыНастройки.Доступность = Ложь;
	
	ОтправитьМетрикуПоведения(ТипЛогистика, "Сбросить");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантФильтраКак()
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводСтроки_КонтурЛогистика(
		"Фильтр 1", "Название настройки", Ложь, ЭтаФорма, "НазваниеНастройкиЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеНастройкиЗавершение(ИмяВарианта, ДополнительныеПараметры) Экспорт
	
	Если ИмяВарианта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВарианта = СокрЛП(ИмяВарианта);
	Если Не ЗначениеЗаполнено(ИмяВарианта) Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Укажите название настройки");
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(ИмяВарианта) > 70 Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Длина названия настройки не должна быть длинее 70 символов");
		Возврат;
	КонецЕсли;
	
	// Проверим что имя уникально
	Для Каждого ТекущаяСтрока Из Элементы.ТекущийВариантФильтра.СписокВыбора Цикл
		
		Если ТекущаяСтрока.Представление <> ИмяВарианта Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ИдентификаторВарианта", ТекущаяСтрока.Значение);
		ПараметрыОбработчика.Вставить("ИмяВарианта", ИмяВарианта);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
			"Перезаписать существующий?", РежимДиалогаВопрос.ДаНет,
			"Фильтр с таким названием уже существует",, ЭтаФорма,
			"ПерезаписатьСуществующуюНастройкуЗавершение", ПараметрыОбработчика);
		
		Возврат;
		
	КонецЦикла;
	
	ТекущийВариантФильтра = СохранитьВариантФильтровНаСервере("", ИмяВарианта, Истина);
	ЗаполнитьСписокВыбораВариантовФильтровНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьСуществующуюНастройкуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВариантФильтра = СохранитьВариантФильтровНаСервере(
		ДополнительныеПараметры.ИдентификаторВарианта, ДополнительныеПараметры.ИмяВарианта, Ложь);
	ЗаполнитьСписокВыбораВариантовФильтровНаСервере(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючОбъектаВариантовФильтров()
	
	Возврат "КонтурЛогистика_Задачи_ВариантыФильтров";
	
КонецФункции

&НаСервере
Функция КлючНастроекВариантовФильтров()
	
	Возврат Строка(ТипЛогистика);
	
КонецФункции

&НаСервере
Функция ПустойКонтейнерВариантовФильтров()
	
	Результат = Новый Структура;
	Результат.Вставить("ВерсияФормата", 1);
	Результат.Вставить("Варианты", Новый Массив);
	Результат.Вставить("ПоследнийИдентификатор", "");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПрочитатьВариантыФильтров()
	
	Сохраненное = ХранилищеОбщихНастроек.Загрузить(
		КлючОбъектаВариантовФильтров(),
		КлючНастроекВариантовФильтров());
	
	Если ТипЗнч(Сохраненное) <> Тип("Структура") Тогда
		Возврат ПустойКонтейнерВариантовФильтров();
	КонецЕсли;
	
	Если Не Сохраненное.Свойство("Варианты") Или ТипЗнч(Сохраненное.Варианты) <> Тип("Массив") Тогда
		Возврат ПустойКонтейнерВариантовФильтров();
	КонецЕсли;
	
	Если Не Сохраненное.Свойство("ПоследнийИдентификатор") Тогда
		Сохраненное.Вставить("ПоследнийИдентификатор", "");
	КонецЕсли;
	
	Если Не Сохраненное.Свойство("ВерсияФормата") Тогда
		Сохраненное.Вставить("ВерсияФормата", 1);
	КонецЕсли;
	
	Возврат Сохраненное;
	
КонецФункции

&НаСервере
Процедура ЗаписатьВариантыФильтров(Контейнер)
	
	ХранилищеОбщихНастроек.Сохранить(
		КлючОбъектаВариантовФильтров(),
		КлючНастроекВариантовФильтров(),
		Контейнер);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораВариантовФильтровНаСервере(ПрименитьПоследний)
	
	Контейнер = ПрочитатьВариантыФильтров();
	СписокВыбора = Элементы.ТекущийВариантФильтра.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого Вариант Из Контейнер.Варианты Цикл
		
		Если ТипЗнч(Вариант) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Вариант.Свойство("Идентификатор") Или Не Вариант.Свойство("Имя") Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(Вариант.Идентификатор, Вариант.Имя);
		
	КонецЦикла;
	
	ИдентификаторКПрименению = "";
	Если ПрименитьПоследний И ЗначениеЗаполнено(Контейнер.ПоследнийИдентификатор) Тогда
		ИдентификаторКПрименению = Контейнер.ПоследнийИдентификатор;
	ИначеЕсли ЗначениеЗаполнено(ТекущийВариантФильтра) Тогда
		ИдентификаторКПрименению = ТекущийВариантФильтра;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКПрименению) Тогда
		
		Найден = Ложь;
		Для Каждого ЭлементСписка Из СписокВыбора Цикл
			Если ЭлементСписка.Значение = ИдентификаторКПрименению Тогда
				Найден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не Найден Тогда
			ИдентификаторКПрименению = "";
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущийВариантФильтра = ИдентификаторКПрименению;
	
	Элементы.СброситьОтборыНастройки.Доступность = ЗначениеЗаполнено(ТекущийВариантФильтра);
	
	Возврат ИдентификаторКПрименению;
	
КонецФункции

&НаСервере
Функция ДанныеВариантаФильтраНаСервере(ИдентификаторВарианта)
	
	Контейнер = ПрочитатьВариантыФильтров();
	
	Для Каждого Вариант Из Контейнер.Варианты Цикл
		
		Если ТипЗнч(Вариант) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Вариант.Свойство("Идентификатор")
			И Вариант.Идентификатор = ИдентификаторВарианта
			И Вариант.Свойство("Данные") Тогда
			
			Возврат Вариант.Данные;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СобратьСнимокФильтров()
	
	Данные = Новый Структура;
	Данные.Вставить("Период", Период);
	Данные.Вставить("ТипДокументаКонфигурации", ТипДокументаКонфигурации);
	Данные.Вставить("ОтборГрузоотправитель", ОтборГрузоотправитель);
	Данные.Вставить("ОтборПеревозчик", ОтборПеревозчик);
	Данные.Вставить("ОтборГрузополучатель", ОтборГрузополучатель);
	Данные.Вставить("ОтборКонтрагент", ОтборКонтрагент);
	Данные.Вставить("ОтборПогрузка", ОтборПогрузка);
	Данные.Вставить("ОтборВыгрузка", ОтборВыгрузка);
	Данные.Вставить("ОтборТребуемоеДействие", ОтборТребуемоеДействие);
	
	ДинамическиеОтборы = Новый Структура;
	Для Каждого ИмяРеквизита Из ИменаДинамическихРеквизитовОтбора() Цикл
		
		Если Не ЕстьРеквизитФормы(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизита]) Тогда
			ДинамическиеОтборы.Вставить(ИмяРеквизита, ЭтаФорма[ИмяРеквизита]);
		КонецЕсли;
		
	КонецЦикла;
	Данные.Вставить("ДинамическиеОтборы", ДинамическиеОтборы);
	
	Попытка
		Данные.Вставить("ИсполняемыеНастройки", ТекущиеИсполняемыеНастройкиПользователя());
	Исключение
		Данные.Вставить("ИсполняемыеНастройки", Неопределено);
	КонецПопытки;
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Функция ТекущиеИсполняемыеНастройкиПользователя()
	
	// Получаем всё, что сейчас видит пользователь на экране (включая Alt+F)
	ИсполняемыеНастройки = Элементы.ЗадачиДинамическийСписок.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	МассивОтборов = Новый Массив;
	
	Для Каждого Элемент Из ИсполняемыеНастройки.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.Использование Тогда
			
			// Не берем, то что в фиксированных настройках
			ЕстьСовпадения = Ложь;
			Для Каждого ТенкущийФиксированныйОтбор Из ЗадачиДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
				Если ТенкущийФиксированныйОтбор.ЛевоеЗначение = Элемент.ЛевоеЗначение Тогда
					ЕстьСовпадения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьСовпадения Тогда
				Продолжить;
			КонецЕсли;
			
			// Сохраняем свойства отбора в простую структуру
			СвойстваОтбора = Новый Структура;
			СвойстваОтбора.Вставить("ЛевоеЗначение", Элемент.ЛевоеЗначение);
			СвойстваОтбора.Вставить("ВидСравнения", Элемент.ВидСравнения);
			СвойстваОтбора.Вставить("ПравоеЗначение", Элемент.ПравоеЗначение);
			
			МассивОтборов.Добавить(СвойстваОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОтборов;
	
КонецФункции

&НаСервере
Функция ИменаДинамическихРеквизитовОтбора()
	
	Результат = Новый Массив;
	Результат.Добавить("ОтборВодитель");
	Результат.Добавить("ОтборТранспортноеСредство");
	Результат.Добавить("ОтборМедРаботник");
	Результат.Добавить("ОтборОтветственныйЗаОформление");
	
	инд = 1;
	Пока ЕстьРеквизитФормы("ОтборДопКолонкаДоп" + Строка(инд)) Цикл
		Результат.Добавить("ОтборДопКолонкаДоп" + Строка(инд));
		инд = инд + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначениеОтбораИзСнимка(Данные, ИмяРеквизита)
	
	Если Не Данные.Свойство(ИмяРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭтаФорма[ИмяРеквизита] = Данные[ИмяРеквизита];
	Исключение
		// Ссылка могла стать недействительной — пропускаем значение.
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьРеквизитыСнимкаФильтровНаСервере(Данные)
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтарыйТипДокументаКонфигурации = ТипДокументаКонфигурации;
	
	ОтборГрузоотправитель = Неопределено;
	ОтборПеревозчик = Неопределено;
	ОтборГрузополучатель = Неопределено;
	ОтборКонтрагент = Неопределено;
	ОтборПогрузка = Неопределено;
	ОтборВыгрузка = Неопределено;
	ОтборТребуемоеДействие = Неопределено;
	
	Для Каждого ИмяРеквизита Из ИменаДинамическихРеквизитовОтбора() Цикл
		Если ЕстьРеквизитФормы(ИмяРеквизита) Тогда
			ЭтаФорма[ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если Данные.Свойство("Период") Тогда
		Период = Данные.Период;
		КонтурЛогистика_ОбщегоНазначенияСервер.ПреобразоватьПериод(Период);
	КонецЕсли;
	
	Если Данные.Свойство("ТипДокументаКонфигурации") Тогда
		ТипДокументаКонфигурации = Данные.ТипДокументаКонфигурации;
	КонецЕсли;
	
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборГрузоотправитель");
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборПеревозчик");
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборГрузополучатель");
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборКонтрагент");
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборПогрузка");
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборВыгрузка");
	УстановитьЗначениеОтбораИзСнимка(Данные, "ОтборТребуемоеДействие");
	
	Если Данные.Свойство("ДинамическиеОтборы") И ТипЗнч(Данные.ДинамическиеОтборы) = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначение Из Данные.ДинамическиеОтборы Цикл
			
			Если Не ЕстьРеквизитФормы(КлючИЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ЭтаФорма[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			Исключение
				// Ссылка или тип значения устарели — пропускаем.
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтарыйТипДокументаКонфигурации <> ТипДокументаКонфигурации Тогда
		СформироватьТекстЗапросаСпискаЗадачИнтеграция();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьИсполняемыеНастройки(Данные)
	
	// 1. Находим коллекцию пользовательских отборов списка
	КоллекцияОтборов = Неопределено;
	Для Каждого ЭлементНастройки Из ЗадачиДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
			КоллекцияОтборов = ЭлементНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если в пользовательских настройках нет коллекции, берем основную настройки компоновщика
	Если КоллекцияОтборов = Неопределено Тогда
		КоллекцияОтборов = ЗадачиДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	КонецЕсли;
	
	// 2. Очищаем старые отборы (чтобы не дублировать)
	КоллекцияОтборов.Элементы.Очистить();
	
	Если Данные.Свойство("ИсполняемыеНастройки") И Данные.ИсполняемыеНастройки <> Неопределено Тогда
		ИсполняемыеНастройки = Данные.ИсполняемыеНастройки;
	Иначе
		Возврат;
	КонецЕсли;
	
	// 3. Переносим сохраненные отборы обратно в список
	Для Каждого СтрОтбора Из ИсполняемыеНастройки Цикл
		
		НовыйЭлемент = КоллекцияОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = СтрОтбора.ЛевоеЗначение;
		НовыйЭлемент.ВидСравнения = СтрОтбора.ВидСравнения;
		НовыйЭлемент.ПравоеЗначение = СтрОтбора.ПравоеЗначение;
		НовыйЭлемент.Использование = Истина;
		
		// !!! ГЛАВНОЕ ИСПРАВЛЕНИЕ: Даем отбору уникальный строковый ключ
		// Без этого ключа платформа применит фильтр, но не выведет его на форму!
		УникальныйХеш = СокрЛП(СтрОтбора.ЛевоеЗначение) + "_" + Строка(Новый УникальныйИдентификатор);
		НовыйЭлемент.ИдентификаторПользовательскойНастройки = УникальныйХеш;
		
		// Делаем отбор видимым для пользователя на панели быстрых отборов (по желанию)
		НовыйЭлемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИсполняемыеНастройки()
	
	// 1. Находим коллекцию пользовательских отборов списка
	КоллекцияОтборов = Неопределено;
	Для Каждого ЭлементНастройки Из ЗадачиДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
			КоллекцияОтборов = ЭлементНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если в пользовательских настройках нет коллекции, берем основную настройки компоновщика
	Если КоллекцияОтборов = Неопределено Тогда
		КоллекцияОтборов = ЗадачиДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	КонецЕсли;
	
	// 2. Очищаем старые отборы (чтобы не дублировать)
	КоллекцияОтборов.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Функция СохранитьВариантФильтровНаСервере(ИдентификаторВарианта, ИмяВарианта, ЭтоНовый)
	
	Контейнер = ПрочитатьВариантыФильтров();
	Данные = СобратьСнимокФильтров();
	
	Если ЭтоНовый Или Не ЗначениеЗаполнено(ИдентификаторВарианта) Тогда
		
		ИдентификаторВарианта = Строка(Новый УникальныйИдентификатор);
		Вариант = Новый Структура;
		Вариант.Вставить("Идентификатор", ИдентификаторВарианта);
		Вариант.Вставить("Имя", ИмяВарианта);
		Вариант.Вставить("Данные", Данные);
		Контейнер.Варианты.Добавить(Вариант);
		
	Иначе
		
		Найден = Ложь;
		Для Каждого Вариант Из Контейнер.Варианты Цикл
			
			Если ТипЗнч(Вариант) = Тип("Структура")
				И Вариант.Свойство("Идентификатор")
				И Вариант.Идентификатор = ИдентификаторВарианта Тогда
				
				Вариант.Данные = Данные;
				Если ЗначениеЗаполнено(ИмяВарианта) Тогда
					Вариант.Имя = ИмяВарианта;
				КонецЕсли;
				Найден = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Найден Тогда
			
			ИдентификаторВарианта = Строка(Новый УникальныйИдентификатор);
			Вариант = Новый Структура;
			Вариант.Вставить("Идентификатор", ИдентификаторВарианта);
			Вариант.Вставить("Имя", ?(ЗначениеЗаполнено(ИмяВарианта), ИмяВарианта, "Вариант"));
			Вариант.Вставить("Данные", Данные);
			Контейнер.Варианты.Добавить(Вариант);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Контейнер.ПоследнийИдентификатор = ИдентификаторВарианта;
	
	ЗаписатьВариантыФильтров(Контейнер);
	
	ОтправитьМетрикуСохранения(Контейнер, ЭтоНовый);
	
	Возврат ИдентификаторВарианта;
	
КонецФункции

&НаСервере
Процедура ОтправитьМетрикуСохранения(Контейнер, ЭтоНовый)
	
	// Соберем заполненные отборы
	ПараметрыФильтра = Новый Массив;
	Для Каждого ТекущаяСтрока Из Контейнер.Варианты Цикл
		
		Если ТекущаяСтрока.Идентификатор <> Контейнер.ПоследнийИдентификатор Тогда
			Продолжить;
		КонецЕсли;
		
		Данные = ТекущаяСтрока.Данные;
		
		ПроверяемыеРеквизиты = Новый Массив;
		ПроверяемыеРеквизиты.Добавить("ОтборГрузоотправитель");
		ПроверяемыеРеквизиты.Добавить("ОтборПеревозчик");
		ПроверяемыеРеквизиты.Добавить("ОтборГрузополучатель");
		ПроверяемыеРеквизиты.Добавить("ОтборКонтрагент");
		ПроверяемыеРеквизиты.Добавить("ОтборПогрузка");
		ПроверяемыеРеквизиты.Добавить("ОтборВыгрузка");
		ПроверяемыеРеквизиты.Добавить("ОтборТребуемоеДействие");
		
		Для Каждого ТекущийРеквизит Из ПроверяемыеРеквизиты Цикл
			Если ЗначениеЗаполнено(Данные[ТекущийРеквизит]) Тогда
				ПараметрыФильтра.Добавить(ТекущийРеквизит);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущийОтбор Из Данные.ДинамическиеОтборы Цикл
			ПараметрыФильтра.Добавить(Строка(ТекущийОтбор.Ключ));
		КонецЦикла;
		
		Если Данные.ИсполняемыеНастройки <> Неопределено Тогда
			Для Каждого ТекущийОтбор Из Данные.ИсполняемыеНастройки Цикл
				ПараметрыФильтра.Добавить(Строка(ТекущийОтбор.ЛевоеЗначение));
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	// Метрика поведения
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("ПараметрыФильтра", ПараметрыФильтра);
	
	Бирка = ?(ЭтоНовый, "Новый", "Перезапись");
	
	ОтправитьМетрикуПоведения(ТипЛогистика, "Сохранить", Бирка, ДопИнформация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьМетрикуПоведения(ТипЛогистика, ИмяДействия, Бирка = Неопределено, ДопИнформация = Неопределено)
	
	ИмяТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);
	
	Если ДопИнформация = Неопределено Тогда
		ДопИнформация = Новый Структура;
	КонецЕсли;
	
	ДопИнформация.Вставить("Титул", ИмяТитула);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Фильтры в списке задач", ИмяДействия,
		"ОбщаяФорма.КонтурЛогистика_Задачи", Бирка,, ДопИнформация);
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьПоследнийВариантФильтраНаСервере(ИдентификаторВарианта)
	
	Контейнер = ПрочитатьВариантыФильтров();
	Контейнер.ПоследнийИдентификатор = ИдентификаторВарианта;
	ЗаписатьВариантыФильтров(Контейнер);
	
КонецПроцедуры

#КонецОбласти