
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("DiadocBoxId", DiadocBoxId);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияКакЗарегистрироватьОрганизациюШаг2СсылкаНажатие(Элемент)
	
	ТекстСсылка = "https://support.kontur.ru/logistika/81069-avtoregistraciya_organizacii_dlya_administratora_diadoka";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТекстСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакЗарегистрироватьОрганизациюШаг3СсылкаНажатие(Элемент)
	
	ТекстСсылка = "https://support.kontur.ru/logistika-1s/82041-avtorizaciya_v_module#header_82041_3";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТекстСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКАдминистраторам(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиКАдминистраторам(DiadocBoxId);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Авторизация", "Перейти к администраторам",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаКакЗарегистрироватьОрганизацию");
	
КонецПроцедуры

#КонецОбласти



