Перем ПараметрыПечати Экспорт;
Перем ТемаПисьма;

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.1");
    
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
    ПараметрыРегистрации.Версия = ЭтотОбъект.Метаданные().Комментарий;
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	
    ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаданиеНаПеревозку");
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказКлиента");
	ПараметрыРегистрации.Назначение.Добавить("Документ.РеализацияТоваровУслуг");
	
    КомандаПечати = ПараметрыРегистрации.Команды.Добавить();
	КомандаПечати.Идентификатор = "ЗаявкаАвтотранспортаВер2";
	КомандаПечати.Представление = НСтр("ru = '* Заявка автотранспорта (вер.2)'");
    КомандаПечати.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    КомандаПечати.ПоказыватьОповещение = Ложь;
    КомандаПечати.Модификатор = "ПечатьMXL";
	
    Возврат ПараметрыРегистрации;
    
КонецФункции

#КонецОбласти

#Область Печать

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТемаПисьма = "";
	            
	Если НЕ УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаАвтотранспортаВер2") Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйДокумент = МассивОбъектов[0];
	ПервыйДокументТип = ТипЗнч(ПервыйДокумент);
	
	Если ПервыйДокументТип = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
	
		// вызов:
		// - из документа Задание на перевозку
			// если пользователь выбрал точки маршрута, то добавим для них ключи связи
		КлючДобавлен = Ложь;
		МассивОбъектовПечати = Новый Массив;
		Для каждого ТекДок Из МассивОбъектов Цикл
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
				МассивОбъектовПечати.Добавить(ТекДок);
				Для каждого Пункт Из ТекДок.Маршрут Цикл
					Если Пункт.Доставлено Тогда
						МассивОбъектовПечати.Добавить(Пункт.КлючСвязи);
						КлючДобавлен = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
			
		// если пользователь не выбрал точки маршрута, то добавим все ключи связи
		Если НЕ КлючДобавлен Тогда
			Для каждого Пункт Из ТекДок.Маршрут Цикл
				МассивОбъектовПечати.Добавить(Пункт.КлючСвязи);
			КонецЦикла;
		КонецЕсли;
		
		ПараметрыПечати = Новый Структура;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявкаАвтотранспортаВер2",
			НСтр("ru='* Заявка автотранспорта (вер.2)'"),
			СформироватьПечатнуюФорму(МассивОбъектовПечати, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли ПервыйДокументТип = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	
		// вызов:
		// - из обработки РМ Обработка документов, 
			// придет массив РТиУ без ключей связи, 
			// здесь РТиУ заменим на Задание на перевозку и добавим ключи связи 
		
		// - из документа РТиУ, печать комплектов и для обычной печати
			// придет один РТиУ без ключа связи
			// здесь РТиУ заменим на Задание на перевозку и добавим один ключ связи 
		МассивОбъектовПечати = Новый Массив;
		Для каждого ТекДок Из МассивОбъектов Цикл
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ДанныеЗаданиеНаПеревозку = ЗаданиеНаПеревозкуДляРеализации(ТекДок);
				
				Если ПустаяСтрока(ДанныеЗаданиеНаПеревозку.КлючСвязи) Тогда
					Сообщить("! не определен документ Задание на перевозку: " + ТекДок);
					Продолжить;
				КонецЕсли;
				
				МассивОбъектовПечати.Добавить(ДанныеЗаданиеНаПеревозку.ЗаданиеНаПеревозку);
				МассивОбъектовПечати.Добавить(ДанныеЗаданиеНаПеревозку.КлючСвязи);
			КонецЕсли;
		КонецЦикла;
	
		ПараметрыПечати = Новый Структура;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявкаАвтотранспортаВер2",
			НСтр("ru='* Заявка автотранспорта (вер.2)'"),
			СформироватьПечатнуюФорму(МассивОбъектовПечати, ОбъектыПечати, ПараметрыПечати));
			
	ИначеЕсли ПервыйДокументТип = Тип("ДокументСсылка.ЗаказКлиента") Тогда
	
		// - из документа Заказ клиента
				// придет документ Задание на перевозку и один ключ связи
		МассивОбъектовПечати = Новый Массив;
		Для каждого ТекДок Из МассивОбъектов Цикл
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				ДанныеЗаданиеНаПеревозку = ЗаданиеНаПеревозкуДляЗаказаКлиента(ТекДок);
				
				Если ПустаяСтрока(ДанныеЗаданиеНаПеревозку.КлючСвязи) Тогда
					Сообщить("! не определен документ Задание на перевозку: " + ТекДок);
					Продолжить;
				КонецЕсли;
				
				МассивОбъектовПечати.Добавить(ДанныеЗаданиеНаПеревозку.ЗаданиеНаПеревозку);
				МассивОбъектовПечати.Добавить(ДанныеЗаданиеНаПеревозку.КлючСвязи);
			КонецЕсли;
		КонецЦикла;
	
		ПараметрыПечати = Новый Структура;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявкаАвтотранспортаВер2",
			НСтр("ru='* Заявка автотранспорта (вер.2)'"),
			СформироватьПечатнуюФорму(МассивОбъектовПечати, ОбъектыПечати, ПараметрыПечати));

	КонецЕсли;
		
	//ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	//ПараметрыВывода.ПараметрыОтправки.Тема = ТемаПисьма;
	
КонецПроцедуры // Печать()

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаАвтотранспорта";
	
	НомерДокумента = 0;
	
	УстановитьПривилегированныйРежим(Истина);

	ТЗ_ОрганизацияИКлюч = Новый ТаблицаЗначений;
	ТЗ_ОрганизацияИКлюч.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ_ОрганизацияИКлюч.Колонки.Добавить("КлючСвязи", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТЗ_ОрганизацияИКлюч.Колонки.Добавить("СпособДоставки", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыДоставки"));
	
	КлючиСвязи = Новый Массив;
	Для каждого Т Из МассивОбъектов Цикл
		Если ТипЗнч(Т) = Тип("Строка") Тогда
			КлючиСвязи.Добавить(Т);
		КонецЕсли;
	КонецЦикла;

	Для каждого Т Из МассивОбъектов Цикл
		Если ТипЗнч(Т) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
			Для каждого ТекСтрокаТЧ Из Т.Распоряжения Цикл
				ТекРаспоряжение = ТекСтрокаТЧ.Распоряжение;
				Если ТипЗнч(ТекРаспоряжение) = Тип("ДокументСсылка.ЗаказКлиента") 
					Или ТипЗнч(ТекРаспоряжение) = Тип("ДокументСсылка.Рекламация") 
					Или ТипЗнч(ТекРаспоряжение) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
					Если КлючиСвязи.Найти(ТекСтрокаТЧ.КлючСвязи) <> Неопределено Тогда
						НоваяСтрока = ТЗ_ОрганизацияИКлюч.Добавить();
						НоваяСтрока.Организация = ТекРаспоряжение.Организация;
						НоваяСтрока.КлючСвязи = ТекСтрокаТЧ.КлючСвязи;
						Если ТипЗнч(ТекРаспоряжение) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
							//НоваяСтрока.СпособДоставки = Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки;
						Иначе
							НоваяСтрока.СпособДоставки = ТекРаспоряжение.СпособДоставки;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_Организации = ТЗ_ОрганизацияИКлюч.Скопировать();
	ТЗ_Организации.Свернуть("Организация");
	
	Для каждого ДокЗаданиеНаПеревозку Из МассивОбъектов Цикл
		Если ТипЗнч(ДокЗаданиеНаПеревозку) <> Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
			Продолжить;
		КонецЕсли;

		НомерДокумента = НомерДокумента + 1;
		Если НомерДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Сч = 1;
		Для каждого ТочкаМаршрута Из ДокЗаданиеНаПеревозку.Маршрут Цикл
			
			ТребуетсяРазбивкаПоОрганизациям = ТребуетсяРазбивкаПоОрганизациям(ТочкаМаршрута);
			
			Если ТребуетсяРазбивкаПоОрганизациям Тогда
				// по ключам организации
				Для каждого СтрокаТЗ_Организации Из ТЗ_Организации Цикл
					КлючиТекОрганизации = ТЗ_ОрганизацияИКлюч.НайтиСтроки(Новый Структура("Организация", СтрокаТЗ_Организации.Организация));
					
					МассивКлючейТекОрганизации = Новый Массив;
					Для каждого СтрокаТЗ_КлючиОрганизации Из КлючиТекОрганизации Цикл
						Если МассивКлючейТекОрганизации.Найти(СтрокаТЗ_КлючиОрганизации.КлючСвязи) = Неопределено Тогда
							МассивКлючейТекОрганизации.Добавить(СтрокаТЗ_КлючиОрганизации.КлючСвязи);
						КонецЕсли;
					КонецЦикла;
						
					Для каждого ДокЗадание Из МассивОбъектов Цикл
						Если ТипЗнч(ДокЗадание) <> Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
							Продолжить;
						КонецЕсли;
						
						НомерДокумента = НомерДокумента + 1;
						Если НомерДокумента > 1 Тогда
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;

						Если МассивКлючейТекОрганизации.Найти(ТочкаМаршрута.КлючСвязи) <> Неопределено Тогда
							Парам = Новый Структура();
							Парам.Вставить("ТабличныйДокумент", ТабличныйДокумент);
							Парам.Вставить("ТочкаМаршрута", ТочкаМаршрута);
							Парам.Вставить("ДокЗаданиеНаПеревозку", ДокЗадание);
							Парам.Вставить("Сч", Сч);
							Парам.Вставить("Организация", СтрокаТЗ_Организации.Организация);
							
							ЗаполнитьТабличныйДокументЗаданиеНаПеревозку(Парам);
							Сч = Сч + 1;
						КонецЕсли;
					КонецЦикла;
						
				КонецЦикла;
				
			Иначе
				// по всем ключам
				Если КлючиСвязи.Найти(ТочкаМаршрута.КлючСвязи) <> Неопределено  Тогда
					Парам = Новый Структура();
					Парам.Вставить("ТабличныйДокумент", ТабличныйДокумент);
					Парам.Вставить("ТочкаМаршрута", ТочкаМаршрута);
					Парам.Вставить("ДокЗаданиеНаПеревозку", ДокЗаданиеНаПеревозку);
					Парам.Вставить("Сч", Сч);
					Парам.Вставить("Организация", "");
					ЗаполнитьТабличныйДокументЗаданиеНаПеревозку(Парам);
					Сч = Сч + 1;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; // по маршрутам
	КонецЦикла;	// по заданиям на перевозку
	
	//Для каждого СтрокаТЗ_Организации Из ТЗ_Организации Цикл
	//	КлючиТекОрганизации = ТЗ_ОрганизацияИКлюч.НайтиСтроки(Новый Структура("Организация", СтрокаТЗ_Организации.Организация));
	//	
	//	МассивКлючейТекОрганизации = Новый Массив;
	//	Для каждого СтрокаТЗ_КлючиОрганизации Из КлючиТекОрганизации Цикл
	//		МассивКлючейТекОрганизации.Добавить(СтрокаТЗ_КлючиОрганизации.КлючСвязи);
	//	КонецЦикла;
	//		
	//	Для каждого ДокЗаданиеНаПеревозку Из МассивОбъектов Цикл
	//		Если ТипЗнч(ДокЗаданиеНаПеревозку) <> Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		НомерДокумента = НомерДокумента + 1;
	//		Если НомерДокумента > 1 Тогда
	//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//		КонецЕсли;

	//		Сч = 1;
	//		Для каждого ТочкаМаршрута Из ДокЗаданиеНаПеревозку.Маршрут Цикл
	//			Если МассивКлючейТекОрганизации.Найти(ТочкаМаршрута.КлючСвязи) <> Неопределено Тогда
	//				ЗаполнитьТабличныйДокументЗаданиеНаПеревозку(ТабличныйДокумент, ТочкаМаршрута, ДокЗаданиеНаПеревозку, Сч);
	//			КонецЕсли;
	//			Сч = Сч + 1;
	//		КонецЦикла;
	//	КонецЦикла;
	//		
	//КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументЗаданиеНаПеревозку(Парам)

	ТабДок					= Парам.ТабличныйДокумент;
	п_ТочкаМаршрута			= Парам.ТочкаМаршрута;
	Сч						= Парам.Сч;
	п_ЗаданиеНаПеревозку	= Парам.ДокЗаданиеНаПеревозку;
	п_Организация			= Парам.Организация;
	
	ДанныеТочкиМаршрута = ДанныеТочкиМаршрута(п_ЗаданиеНаПеревозку, п_ТочкаМаршрута, п_Организация);
	ДоставкаДоТК = ДанныеТочкиМаршрута.Итог("ДоставкаДоТК");

	Если ДоставкаДоТК > 0 Тогда

		Макет = ПолучитьМакет("ПФ_MXL_ЗаявкаТК");
				
		ОбластьТаблица		= Макет.ПолучитьОбласть("Таблица");
		ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");
	    
		ОбластьТаблица.Параметры.Водитель	= п_ЗаданиеНаПеревозку.Водитель;
		ОбластьТаблица.Параметры.Транспорт	= п_ЗаданиеНаПеревозку.ТранспортноеСредство;
		
		ТЗВрем = ДанныеТочкиМаршрута.Скопировать();
		ТЗВрем.Свернуть("Получатель");
		М_Получатели = ТЗВрем.ВыгрузитьКолонку("Получатель");
		Если М_Получатели.Количество() = 1 Тогда
			
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(п_ЗаданиеНаПеревозку.Номер) + "/" + Сч;	
			ТекстЗаголовка = "Заявка автотранспорта № " + НомерДокумента + " от " + Формат(п_ЗаданиеНаПеревозку.Дата, "ДЛФ=DD");
			ОбластьТаблица.Параметры.ТекстЗаголовка = ТекстЗаголовка;

			ОбластьТаблица.Параметры.РеализацияНомер					= КолонкуМассивВСтроку(ДанныеТочкиМаршрута, "РеализацияНомер");
			ОбластьТаблица.Параметры.Менеджер							= КолонкуВСтроку(ДанныеТочкиМаршрута, "Менеджер");
			ОбластьТаблица.Параметры.МенеджерТелефон					= КолонкуВСтроку(ДанныеТочкиМаршрута, "МенеджерТелефон");
			ОбластьТаблица.Параметры.ТранспортнаяКомпания				= КолонкуВСтроку(ДанныеТочкиМаршрута, "Перевозчик");
			ОбластьТаблица.Параметры.АдресТК							= КолонкуВСтроку(ДанныеТочкиМаршрута, "АдресДоставки");
			ОбластьТаблица.Параметры.КонтактыТК							= КолонкуВСтроку(ДанныеТочкиМаршрута, "Контакты");
			ОбластьТаблица.Параметры.ВремяДоставкиТК					= КолонкуВСтроку(ДанныеТочкиМаршрута, "ВремяДоставки");
			//ОбластьТаблица.Параметры.ДополнительнаяИнформацияДоставкиТК	= КолонкуВСтроку(ДанныеТочкиМаршрута, "ДополнительнаяИнформацияДоставки");
			
			ОбластьТаблица.Параметры.Клиент											= КолонкуВСтроку(ДанныеТочкиМаршрута, "Получатель");
			ОбластьТаблица.Параметры.ИНН											= КолонкуВСтроку(ДанныеТочкиМаршрута, "ИНН");
			ОбластьТаблица.Параметры.Адрес											= КолонкуВСтроку(ДанныеТочкиМаршрута, "ДанныеПолучателя");
			ОбластьТаблица.Параметры.Контакты										= КолонкуВСтроку(ДанныеТочкиМаршрута, "ДанныеПолучателяКонтакты");
			//ОбластьТаблица.Параметры.ВремяДоставкиКарточкаАдреса					= КолонкуВСтроку(ДанныеТочкиМаршрута, "ВремяДоставкиКонтакты");
			ОбластьТаблица.Параметры.ДополнительнаяИнформацияДоставкиКарточкаАдреса	= КолонкуВСтроку(ДанныеТочкиМаршрута, "ДополнительнаяИнформацияДоставкиКонтакты");

			ОбластьТаблица.Параметры.Мест	= ДанныеТочкиМаршрута.Итог("Мест");
			ОбластьТаблица.Параметры.Вес	= ДанныеТочкиМаршрута.Итог("Вес");
			ОбластьТаблица.Параметры.Объем	= ДанныеТочкиМаршрута.Итог("Объем");
			
			ОбластьТаблица.Параметры.ДополнительныеУслуги	= КолонкуМассивВСтроку(ДанныеТочкиМаршрута, "ДополнительныеУслуги");
			ОбластьТаблица.Параметры.Страховка				= ДанныеТочкиМаршрута.Итог("Страховка");
			ОбластьТаблица.Параметры.Плательщик				= КолонкуВСтроку(ДанныеТочкиМаршрута, "Плательщик");
			ОбластьТаблица.Параметры.Отправитель			= КолонкуВСтроку(ДанныеТочкиМаршрута, "Отправитель");

			ТабДок.Вывести(ОбластьТаблица);
			ТабДок.Вывести(ОбластьРазделитель);
		Иначе
			Для каждого Получатель Из М_Получатели Цикл
				
				СтрокиМаршрута = ДанныеТочкиМаршрута.НайтиСтроки(Новый Структура("Получатель", Получатель));
				
				М_ТекстЗаголовка = Новый Массив;
				М_РеализацияНомер = Новый Массив;
				МаршрутМенеджер = "";
				МаршрутМенеджерТелефон = "";
				МаршрутТранспортнаяКомпания = "";
				МаршрутАдресТК = "";
				МаршрутКонтактыТК = "";
				МаршрутВремяДоставкиТК = "";
				МаршрутКлиент = "";
                МаршрутИНН = "";
				МаршрутОтправитель = "";
				МаршрутДанныеПолучателя = "";
				МаршрутДанныеПолучателяКонтакты = "";
				МаршрутДополнительнаяИнформацияДоставкиКонтакты = "";
				МаршрутМест = 0;
				МаршрутВес = 0;
				МаршрутОбъем = 0;
				М_ДополнительныеУслуги = Новый Массив;
				МаршрутСтраховка = 0;
				МаршрутПлательщик = "";
				
				Для каждого СтрокаМаршрута Из СтрокиМаршрута Цикл
					
					РаспоряжениеНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаМаршрута.Распоряжение.Номер);
					НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(п_ЗаданиеНаПеревозку.Номер) + "/" + Сч + "/" + РаспоряжениеНомер;	
					ТекстЗаголовка = "Заявка автотранспорта № " + НомерДокумента + " от " + Формат(п_ЗаданиеНаПеревозку.Дата, "ДЛФ=DD");
					М_ТекстЗаголовка.Добавить(ТекстЗаголовка);	
					
					М_РеализацияНомер.Добавить(СтрСоединить(СтрокаМаршрута.РеализацияНомер, ", "));
                                                            
					МаршрутМенеджер									= СтрокаМаршрута.Менеджер;
					МаршрутМенеджерТелефон							= СтрокаМаршрута.МенеджерТелефон;
					МаршрутТранспортнаяКомпания						= СтрокаМаршрута.Перевозчик;
					МаршрутАдресТК									= СтрокаМаршрута.АдресДоставки;
					МаршрутКонтактыТК								= СтрокаМаршрута.Контакты;
					МаршрутВремяДоставкиТК							= СтрокаМаршрута.ВремяДоставки;
					МаршрутКлиент									= СтрокаМаршрута.Получатель;
					МаршрутИНН										= СтрокаМаршрута.ИНН;
					МаршрутОтправитель								= СтрокаМаршрута.Отправитель;
					МаршрутДанныеПолучателя							= СтрокаМаршрута.ДанныеПолучателя;
					МаршрутДанныеПолучателяКонтакты					= СтрокаМаршрута.ДанныеПолучателяКонтакты;
					МаршрутДополнительнаяИнформацияДоставкиКонтакты	= СтрокаМаршрута.ДополнительнаяИнформацияДоставкиКонтакты;
					
					МаршрутМест		= МаршрутМест + СтрокаМаршрута.Мест;
					МаршрутВес		= МаршрутВес + СтрокаМаршрута.Вес;
					МаршрутОбъем	= МаршрутОбъем + СтрокаМаршрута.Объем;
					//
					М_ДополнительныеУслуги.Добавить(СтрСоединить(СтрокаМаршрута.ДополнительныеУслуги, ", "));
					МаршрутСтраховка	= МаршрутСтраховка + СтрокаМаршрута.Страховка;
					МаршрутПлательщик	= СтрокаМаршрута.Плательщик;
					
				КонецЦикла;
				
				ОбластьТаблица.Параметры.ТекстЗаголовка 								= СтрСоединить(М_ТекстЗаголовка, Символы.ВК);
				ОбластьТаблица.Параметры.РеализацияНомер								= СтрСоединить(М_РеализацияНомер, ", ");
				ОбластьТаблица.Параметры.Менеджер										= МаршрутМенеджер;
				ОбластьТаблица.Параметры.МенеджерТелефон								= МаршрутМенеджерТелефон;
				ОбластьТаблица.Параметры.ТранспортнаяКомпания							= МаршрутТранспортнаяКомпания;
				ОбластьТаблица.Параметры.АдресТК										= МаршрутАдресТК;
				ОбластьТаблица.Параметры.КонтактыТК										= МаршрутКонтактыТК;
				ОбластьТаблица.Параметры.ВремяДоставкиТК								= МаршрутВремяДоставкиТК;
				ОбластьТаблица.Параметры.Клиент											= МаршрутКлиент;
				ОбластьТаблица.Параметры.ИНН											= МаршрутИНН;
				ОбластьТаблица.Параметры.Отправитель									= МаршрутОтправитель;
				ОбластьТаблица.Параметры.Адрес											= МаршрутДанныеПолучателя;
				ОбластьТаблица.Параметры.Контакты										= МаршрутДанныеПолучателяКонтакты;
				ОбластьТаблица.Параметры.ДополнительнаяИнформацияДоставкиКарточкаАдреса	= МаршрутДополнительнаяИнформацияДоставкиКонтакты;
				
				ОбластьТаблица.Параметры.Мест	= МаршрутМест;
				ОбластьТаблица.Параметры.Вес	= МаршрутВес;
				ОбластьТаблица.Параметры.Объем	= МаршрутОбъем;
				
				ОбластьТаблица.Параметры.ДополнительныеУслуги	= СтрСоединить(М_ДополнительныеУслуги, ", ");
				ОбластьТаблица.Параметры.Страховка				= МаршрутСтраховка;
				ОбластьТаблица.Параметры.Плательщик				= МаршрутПлательщик;

				ТабДок.Вывести(ОбластьТаблица);
				ТабДок.Вывести(ОбластьРазделитель);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;
		КонецЕсли;
		
	Иначе

		Макет = ПолучитьМакет("ПФ_MXL_Заявка");
				
		ОбластьТаблица		= Макет.ПолучитьОбласть("Таблица");
		ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");
	    
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(п_ЗаданиеНаПеревозку.Номер) + "/" + Сч;	
		ТекстЗаголовка = "Заявка автотранспорта № " + НомерДокумента + " от " + Формат(п_ЗаданиеНаПеревозку.Дата, "ДЛФ=DD");
		ОбластьТаблица.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		ОбластьТаблица.Параметры.Водитель	= п_ЗаданиеНаПеревозку.Водитель;
		ОбластьТаблица.Параметры.Транспорт	= п_ЗаданиеНаПеревозку.ТранспортноеСредство;
		
		ОбластьТаблица.Параметры.РеализацияНомер = КолонкуМассивВСтроку(ДанныеТочкиМаршрута, "РеализацияНомер");

		ДанныеТочкиМаршрута.Сортировать("СпособДоставки Убыв");
		
		ТекРаспоряжение = ДанныеТочкиМаршрута[0].Распоряжение;
		
		Если ТипЗнч(ТекРаспоряжение) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			
			ТекКлиент = ПолучательИзЗВП(ТекРаспоряжение);
			
			ОбластьТаблица.Параметры.Клиент				= ТекКлиент;
			ОбластьТаблица.Параметры.АдресДоставки		= ТекРаспоряжение.АдресДоставки;
			
			ТекМенеджер = ОсновнойМенеджерКлиента(ТекКлиент);
			
			Если ЗначениеЗаполнено(ТекМенеджер) Тогда
				ОбластьТаблица.Параметры.Менеджер			= ТекМенеджер;
				ОбластьТаблица.Параметры.МенеджерТелефон	= ПолучитьТелефонФизЛица(ТекМенеджер.ФизическоеЛицо);
			КонецЕсли;
		Иначе
			ОбластьТаблица.Параметры.Менеджер							= КолонкуВСтроку(ДанныеТочкиМаршрута, "Менеджер");
			ОбластьТаблица.Параметры.МенеджерТелефон					= КолонкуВСтроку(ДанныеТочкиМаршрута, "МенеджерТелефон");
			ОбластьТаблица.Параметры.Клиент								= КолонкуВСтроку(ДанныеТочкиМаршрута, "Получатель");
			ОбластьТаблица.Параметры.АдресДоставки						= КолонкуВСтроку(ДанныеТочкиМаршрута, "АдресДоставки");
			ОбластьТаблица.Параметры.Контакты							= КолонкуВСтроку(ДанныеТочкиМаршрута, "Контакты");
			ОбластьТаблица.Параметры.ВремяДоставки						= КолонкуВСтроку(ДанныеТочкиМаршрута, "ВремяДоставки");
			ОбластьТаблица.Параметры.ДополнительнаяИнформацияДоставки	= КолонкуВСтроку(ДанныеТочкиМаршрута, "ДополнительнаяИнформацияДоставки");
		КонецЕсли;	

		ОбластьТаблица.Параметры.Сумма								= ДанныеТочкиМаршрута.Итог("Сумма");
		ОбластьТаблица.Параметры.Мест								= ДанныеТочкиМаршрута.Итог("Мест");
		ОбластьТаблица.Параметры.Вес								= ДанныеТочкиМаршрута.Итог("Вес");
		ОбластьТаблица.Параметры.Объем								= ДанныеТочкиМаршрута.Итог("Объем");

		ТабДок.Вывести(ОбластьТаблица);
		ТабДок.Вывести(ОбластьРазделитель);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	СЗ = Новый СписокЗначений;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, СЗ, п_ЗаданиеНаПеревозку);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

КонецПроцедуры

Функция  ПолучитьТелефонФизЛица(п_ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	ФизическиеЛицаКонтактнаяИнформация.Тип КАК Тип,
		|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	Запрос.УстановитьПараметр("Ссылка", п_ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерТелефона;
	КонецЕсли;
	
	Возврат "";

КонецФункции // ()

Функция ПолучитьНомераРеализации(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.Номер КАК Номер
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|		РеализацияТоваровУслуг.Дата КАК Дата,
		|		РеализацияТоваровУслуг.Номер КАК Номер
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
		|		И РеализацияТоваровУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		РеализацияТоваровУслугТовары.Ссылка,
		|		РеализацияТоваровУслугТовары.Ссылка.Дата,
		|		РеализацияТоваровУслугТовары.Ссылка.Номер
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|	ГДЕ
		|		РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
		|		И РеализацияТоваровУслугТовары.Ссылка.Проведен) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", п_ЗаказКлиента);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивСтрок = Новый Массив;

	// при частичной отгрузке контролируем дату документа
	НачалоТекДня = НачалоДня(ТекущаяДатаСеанса());
	
	Если Выборка.Количество() > 1 Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Дата < НачалоТекДня Тогда
				Продолжить;
			КонецЕсли;
			
			НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
			Если МассивСтрок.Найти(НомерДок) = Неопределено Тогда
				МассивСтрок.Добавить(НомерДок);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
			Если МассивСтрок.Найти(НомерДок) = Неопределено Тогда
				МассивСтрок.Добавить(НомерДок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции // ()

Функция ПолучитьДополнительныеУслугиДоставки(п_Док)

	М = Новый Массив;
	
	Если п_Док.ДоставкаОбрешетка Тогда
		М.Добавить("Обрешетка");
	КонецЕсли;

	Если п_Док.ДоставкаСтраховка Тогда
		М.Добавить("Страховка");
	КонецЕсли;

	Если п_Док.ДоставкаПаллетныйБорт Тогда
		М.Добавить("Паллетный борт");
	КонецЕсли;
	
	Возврат М;

КонецФункции

Функция СуммаКПолучению(п_ЗаказКлиента)
	
	Рез = УправлениеСвойствами.ЗначениеСвойства(п_ЗаказКлиента, "ПолучитьДС");
	
	Возврат Рез;
	
КонецФункции // ()

Функция СуммаКПолучению_РассчитатьПоПКО(п_ЗаказКлиента)
	
	Рез = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СуммаДокумента), 0) КАК Сумма
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|ГДЕ
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа = &Заказ
		|	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Заказ", п_ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Рез = Выборка.Сумма;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", п_ЗаказКлиента);
	
	М_Реализация = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.СуммаДокумента), 0) КАК Сумма
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|ГДЕ
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа В(&Реализация)
		|	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен";

	Запрос.УстановитьПараметр("Реализация", М_Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Рез = Рез + Выборка.Сумма;
	КонецЦикла;
		
	Возврат Рез;
	
КонецФункции // ()

Функция ДанныеТочкиМаршрута(п_ЗаданиеНаПеревозку, п_ТочкаМаршрута, п_Организация)
	
	Рез = Новый Структура();
	
	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи = &КлючСвязи
		|	И ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Организация = &Организация";
	
	Запрос.УстановитьПараметр("КлючСвязи", п_ТочкаМаршрута.КлючСвязи);

	Если ПустаяСтрока(п_Организация) Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "И ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.Организация = &Организация", "");
	Иначе
		Запрос.УстановитьПараметр("Организация", п_Организация);
	КонецЕсли;	
	
	Запрос.Текст = ЗапросТекст;
	
	Распоряжения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Распоряжение");
	
    НомераРеализацииОбщий = Новый Массив;
    ДополнительныеУслугиОбщие = Новый Массив;

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Распоряжение",								Документы.ТипВсеСсылки());
	ТЗ.Колонки.Добавить("РеализацияНомер",							Новый ОписаниеТипов("Массив"));
	ТЗ.Колонки.Добавить("СпособДоставки",							Новый ОписаниеТипов("ПеречислениеСсылка.СпособыДоставки"));
	ТЗ.Колонки.Добавить("Перевозчик",								Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТЗ.Колонки.Добавить("Получатель",								Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТЗ.Колонки.Добавить("ИНН",										ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("Менеджер",									Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ.Колонки.Добавить("МенеджерТелефон",							ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("АдресДоставки",							ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("ДанныеПолучателя",							ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("ДанныеПолучателяКонтакты",					ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("Контакты",									ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("ВремяДоставки",							ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("ВремяДоставкиКонтакты",					ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("ДополнительныеУслуги",						Новый ОписаниеТипов("Массив"));
	ТЗ.Колонки.Добавить("ДополнительнаяИнформацияДоставки",			ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("ДополнительнаяИнформацияДоставкиКонтакты",	ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("Мест",										ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ТЗ.Колонки.Добавить("Сумма",									ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТЗ.Колонки.Добавить("Страховка",								ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТЗ.Колонки.Добавить("Вес",										ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ТЗ.Колонки.Добавить("Объем",									ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ТЗ.Колонки.Добавить("ДоставкаДоТК",								ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТЗ.Колонки.Добавить("Плательщик",								ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТЗ.Колонки.Добавить("Отправитель",								ОбщегоНазначения.ОписаниеТипаСтрока(1000));

	Для каждого Распоряжение Из Распоряжения Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Распоряжение = Распоряжение;
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента")
			ИЛИ ТипЗнч(Распоряжение) = Тип("ДокументСсылка.Рекламация") Тогда

			НоваяСтрока.РеализацияНомер 	= ПолучитьНомераРеализации(Распоряжение);
			НоваяСтрока.СпособДоставки		= Распоряжение.СпособДоставки;
			НоваяСтрока.Перевозчик			= Распоряжение.ПеревозчикПартнер;
			НоваяСтрока.Получатель			= Распоряжение.Партнер;
			НоваяСтрока.ДанныеПолучателя	= Распоряжение.ДанныеПолучателя;
			
			Если ЗначениеЗаполнено(Распоряжение.Менеджер.ФизическоеЛицо) Тогда
				НоваяСтрока.Менеджер		= Распоряжение.Менеджер.ФизическоеЛицо;
				НоваяСтрока.МенеджерТелефон	= ПолучитьТелефонФизЛица(Распоряжение.Менеджер.ФизическоеЛицо);
			Иначе
				Сообщить("Установите Физическое лицо у пользователя (менеджера): " + Распоряжение);
			КонецЕсли;

			Если Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
				ИЛИ Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда 
				НоваяСтрока.ДоставкаДоТК = 1;
				НоваяСтрока.АдресДоставки = Распоряжение.АдресДоставкиПеревозчика;
			ИначеЕсли Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента 
				ИЛИ Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки Тогда
				НоваяСтрока.АдресДоставки = Распоряжение.АдресДоставки;
			КонецЕсли;

			Если ЗначениеЗаполнено(НоваяСтрока.АдресДоставки) Тогда
				ДопКИ_ИзАдреса = ОД_Логистика.ПолучитьКонтактыИзАдреса(НоваяСтрока.АдресДоставки);
				НоваяСтрока.Контакты = ДопКИ_ИзАдреса.Телефон + ", " + ДопКИ_ИзАдреса.КонтактноеЛицо;
			КонецЕсли;

			Если ЗначениеЗаполнено(НоваяСтрока.ДанныеПолучателя) Тогда
				ДопКИ_ИзАдреса = ОД_Логистика.ПолучитьКонтактыИзАдреса(НоваяСтрока.ДанныеПолучателя);
				НоваяСтрока.ДанныеПолучателяКонтакты = ДопКИ_ИзАдреса.Телефон + ", " + ДопКИ_ИзАдреса.КонтактноеЛицо;
				НоваяСтрока.ВремяДоставкиКонтакты = "с " + Формат(ДопКИ_ИзАдреса.ВремяДоставкиС, "ДФ=ЧЧ:мм") + " по " + Формат(ДопКИ_ИзАдреса.ВремяДоставкиПо, "ДФ=ЧЧ:мм");
				НоваяСтрока.ДополнительнаяИнформацияДоставкиКонтакты = ДопКИ_ИзАдреса.ДополнительнаяИнформацияПоДоставке;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Распоряжение.ВремяДоставкиС) 
				И ЗначениеЗаполнено(Распоряжение.ВремяДоставкиПо) Тогда
				НоваяСтрока.ВремяДоставки = "с " + Формат(Распоряжение.ВремяДоставкиС, "ДФ=ЧЧ:мм")+ " по " + Формат(Распоряжение.ВремяДоставкиПо, "ДФ=ЧЧ:мм");
			КонецЕсли;

			НоваяСтрока.ДополнительнаяИнформацияДоставки = Распоряжение.ДополнительнаяИнформацияПоДоставке;
			
			ВесОбъем = ОД_ОбщиеФункции.ПолучитьВесОбъемДляДокумента(Распоряжение);
			НоваяСтрока.Вес		= ВесОбъем.Вес;
			НоваяСтрока.Объем	= ВесОбъем.Объем;

			НоваяСтрока.ДополнительныеУслуги = ПолучитьДополнительныеУслугиДоставки(Распоряжение);
			
			НоваяСтрока.Сумма = СуммаКПолучению(Распоряжение);
			
			Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				НоваяСтрока.Мест = Распоряжение.Товары.Итог("КоличествоУпаковок");
				Если ЗначениеЗаполнено(Распоряжение.Проект) Тогда
					НоваяСтрока.Плательщик = Распоряжение.Организация.Наименование;
				Иначе
					НоваяСтрока.Плательщик = Распоряжение.Партнер.Наименование;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.Рекламация") Тогда
				НоваяСтрока.Мест = Распоряжение.Товары.Итог("Количество");
			КонецЕсли;

			НоваяСтрока.Страховка = Страховка(Распоряжение);
			
			Если Распоряжение.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо
				ИЛИ Распоряжение.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				НоваяСтрока.ИНН = "ИНН "+ Распоряжение.Контрагент.ИНН;
			Иначе
				ДанныеПаспорта = ДанныеПаспорта(Распоряжение.Контрагент);
				НоваяСтрока.ИНН = "ИНН "+ Распоряжение.Контрагент.ИНН + " (Паспорт" + ДанныеПаспорта + ")";
			КонецЕсли;

			НоваяСтрока.Отправитель = "" + Распоряжение.Организация.НаименованиеПолное + ", ИНН: " + Распоряжение.Организация.ИНН;
			
		ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			
			НоваяСтрока.РеализацияНомер.Добавить(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Распоряжение.Номер));
			
			НоваяСтрока.Мест =  Распоряжение.Товары.Итог("КоличествоУпаковок");
			
			ВесОбъем = ОД_ОбщиеФункции.ПолучитьВесОбъемДляДокумента(Распоряжение);
			НоваяСтрока.Вес		= ВесОбъем.Вес;
			НоваяСтрока.Объем	= ВесОбъем.Объем;
		КонецЕсли;

	КонецЦикла;
	
	ТЗ.Свернуть("Распоряжение,
		| РеализацияНомер,
		| СпособДоставки,
		| Перевозчик,
		| Получатель,
		| ИНН,
		| ДанныеПолучателя,
		| ДанныеПолучателяКонтакты,
		| Менеджер,
		| МенеджерТелефон,
		| АдресДоставки,
		| Контакты,
		| ВремяДоставки,
		| ВремяДоставкиКонтакты,
		| ДополнительныеУслуги,
		| ДополнительнаяИнформацияДоставки,
		| ДополнительнаяИнформацияДоставкиКонтакты,
		| Плательщик,
		| Отправитель",
			"Мест, Сумма, Страховка, Вес, Объем, ДоставкаДоТК");
	
	Возврат ТЗ;
	
КонецФункции // ()

Функция КолонкуВСтроку(ТЗ, Колонка)
	
	М = Новый Массив;
	Для каждого Т Из ТЗ Цикл
		Если ЗначениеЗаполнено(Т[Колонка])
			И М.Найти(Т[Колонка]) = Неопределено Тогда
			М.Добавить(Т[Колонка]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(М, ", ");

КонецФункции // ()

Функция КолонкуМассивВСтроку(ТЗ, Колонка)

	М = Новый Массив;
	Для каждого Т Из ТЗ Цикл
		Для каждого Номер Из Т[Колонка] Цикл
			Если ЗначениеЗаполнено(Номер)
				И М.Найти(Номер) = Неопределено Тогда
				М.Добавить(Номер);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СтрСоединить(М, ", ");

КонецФункции // ()

Функция Страховка(п_ЗаказКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
		|	РеализацияТоваровУслугТовары.Ссылка.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", п_ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	// при частичной отгрузке контролируем дату документа
	НачалоТекДня = НачалоДня(ТекущаяДатаСеанса());
	СуммаОтгрузки = 0;
	
	Если Выборка.Количество() > 1 Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Дата < НачалоТекДня Тогда
				Продолжить;
			КонецЕсли;
			СуммаОтгрузки = СуммаОтгрузки + Выборка.СуммаДокумента;
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			СуммаОтгрузки = СуммаОтгрузки + Выборка.СуммаДокумента;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СуммаОтгрузки;

КонецФункции // ()

Функция ДанныеПаспорта(п_Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Серия КАК Серия,
		|	ДокументыФизическихЛиц.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &ФизЛицо
		|	И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("Паспорт гражданина РФ", Истина));
	Запрос.УстановитьПараметр("ФизЛицо", п_Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Серия + " " + Выборка.Номер;
	КонецЕсли;

КонецФункции // ()

Функция ПолучательИзЗВП(п_ЗаказНаВнутреннееПотребление)
	
	Для каждого Т Из п_ЗаказНаВнутреннееПотребление.Товары Цикл
		Возврат Т.АналитикаРасходов;
	КонецЦикла;

КонецФункции // ()

Функция ОсновнойМенеджерКлиента(п_Клиент)
	
	Если ЗначениеЗаполнено(п_Клиент) Тогда
		Возврат п_Клиент.ОсновнойМенеджер;
	КонецЕсли;

КонецФункции // ()

Функция ПолучитьЗаказКлиента(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Ссылка = &Реализация
		|		И РеализацияТоваровУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		РеализацияТоваровУслугТовары.ЗаказКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|	ГДЕ
		|		РеализацияТоваровУслугТовары.Ссылка = &Реализация
		|		И РеализацияТоваровУслугТовары.Ссылка.Проведен) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.ЗаказКлиента.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Реализация", п_Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ()

Функция ЗаданиеНаПеревозкуДляРеализации(п_Реализация)
	
	Рез = Новый Структура();
	Рез.Вставить("ЗаданиеНаПеревозку", "");
	Рез.Вставить("КлючСвязи", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПеревозку,
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	
	
	ТекЗаказКлиента = ПолучитьЗаказКлиента(п_Реализация);
	
	Если НЕ ЗначениеЗаполнено(ТекЗаказКлиента) Тогда
		Возврат Рез;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Распоряжение", ТекЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()

Функция ЗаданиеНаПеревозкуДляЗаказаКлиента(п_ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПеревозку,
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", п_ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Рез = Новый Структура();
	Рез.Вставить("ЗаданиеНаПеревозку", "");
	Рез.Вставить("КлючСвязи", "");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()

Функция ТребуетсяРазбивкаПоОрганизациям(п_ТочкаМаршрута)

	Рез = Новый Структура();
	
	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение.СпособДоставки КАК СпособДоставки
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи = &КлючСвязи";
	
	Запрос.УстановитьПараметр("КлючСвязи", п_ТочкаМаршрута.КлючСвязи);
	
	Запрос.Текст = ЗапросТекст;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
			ИЛИ Выборка.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции // ()


#КонецОбласти

