
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	// Зинаков 25.09.2023 - 26.02.2024
	Если РольДоступна("РабочееМестоМенеджераПоЗакупкам") Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;

	// 20.03.2025
	Если РольДоступна("РабочееМестоРуководительСервисногоОтдела") Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ДоступнаяГруппа = QWERTY_Сервер.ПолучитьДоступнуюГруппуНоменклатурыРуководительСервисногоОтдела();
			Если ДоступнаяГруппа.Найти(Объект.Ссылка) = Неопределено Тогда
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если РольДоступна("РабочееМестоПомощникРуководителяСервисногоОтдела") Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ДоступнаяГруппа = QWERTY_Сервер.ПолучитьДоступнуюГруппуНоменклатурыПомощникРуководителяСервисногоОтдела();
			Если ДоступнаяГруппа.Найти(Объект.Ссылка) = Неопределено Тогда
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

