#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//++ НЕ УТ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если (ТекущаяДатаСеанса() >= РеглУчетКлиентСервер.НачалоПримененияФСБУ5_2019()
			ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет"))
		И НЕ ЭтоГруппа Тогда
		
		СпособПогашенияСтоимостиБУ = Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче;
		СпособПогашенияСтоимостиНУ = Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче;
		УчитыватьНаработку = Ложь;
	КонецЕсли;

КонецПроцедуры

//-- НЕ УТ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	//++ НЕ УТ
	Если НЕ ЭтоГруппа И НЕ УчитыватьНаработку Тогда
		ОбъемНаработки = 0;
		ЕдиницаИзмеренияНаработки = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	//-- НЕ УТ

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		
		НепроверяемыеРеквизиты.Добавить("СпособПогашенияСтоимостиБУ");
		НепроверяемыеРеквизиты.Добавить("СпособПогашенияСтоимостиНУ");
		НепроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияНаработки");
		НепроверяемыеРеквизиты.Добавить("ОбъемНаработки");
		//++ НЕ УТ
	Иначе
		Если ИнвентарныйУчет И УчитыватьНаработку Тогда
			НепроверяемыеРеквизиты.Добавить("СрокЭксплуатации");
		Иначе
			НепроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияНаработки");
			НепроверяемыеРеквизиты.Добавить("ОбъемНаработки");
		КонецЕсли;
		//-- НЕ УТ
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТ
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		ВидыСчетаДляОчистки = Новый Массив;
		Если ЗначениеЗаполнено(СчетУчета) Тогда
			ВидыСчетаДляОчистки.Добавить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатации);
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетЗабалансовогоУчета) Тогда
			ВидыСчетаДляОчистки.Добавить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииЗаБалансом);
		КонецЕсли;
		Если ВидыСчетаДляОчистки.Количество() Тогда
			РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ОчиститьПриЗаписиАналитикиУчета(Ссылка, ВидыСчетаДляОчистки);
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли