
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	Если ЗначениеЗаполнено(ОбъектУчетнойСистемы) Тогда
		
		СуществующееСопоставление = КонтурЛогистика_КонвертацияСервер.КонвертироватьОбъектУчетнойСистемы_В_ОбъектЛогистика(ОбъектУчетнойСистемы, "ОрганизацияДиадок");
		
		Элементы.СуществующееСопоставление.Видимость = ЗначениеЗаполнено(СуществующееСопоставление);
		
		Элементы.ГруппаСвязанныйОбъект.Видимость = Истина;
		Элементы.ОбъектУчетнойСистемы.ТолькоПросмотр = Истина;
		ОбъектУчетнойСистемыУстановитьСвязь = Истина;
		Элементы.Список.МножественныйВыбор = Ложь;
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		
		Если ТипЗнч(ОбъектУчетнойСистемы) = Тип("Строка") Тогда 
			
			ИНН = ОбъектУчетнойСистемы;
			
		Иначе
			
			Если КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьРеквизитОбъекта_("ИНН", ОбъектУчетнойСистемы.Метаданные()) Тогда
				ИНН = ОбъектУчетнойСистемы.ИНН
			КонецЕсли;
			
			Если КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьРеквизитОбъекта_("КПП", ОбъектУчетнойСистемы.Метаданные()) Тогда
				КПП = ОбъектУчетнойСистемы.КПП;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе	
		
		Элементы.ГруппаСвязанныйОбъект.Видимость = Ложь;
		
	КонецЕсли;
	
	ОтборНаш = "Все";
	
	УстановитьОтборДинСписка();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаВыбора(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("РежимОграниченияДоступаПоОрганизации")
		И ПараметрыСеанса.КонтурЛогистика_ОграничениеДоступаНаУровнеЗаписейВключено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Ссылка", ПараметрыСеанса.КонтурЛогистика_ДоступныеОрганизации, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		
		Элементы.ГруппаШапка.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("СкрытьОтбор") Тогда
		Элементы.ГруппаШапка.Видимость = Ложь;		
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИНН");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.ПравоеЗначение = ИНН;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФрагментНаименования) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.ПравоеЗначение = ФрагментНаименования;
		
	КонецЕсли;
	
	Если ОтборНаш = "Наши" Тогда 
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;  
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Наш");
		ЭлементОтбора.ПравоеЗначение 	= Истина;
		
	ИначеЕсли ОтборНаш = "ГотовыКЭПД" Тогда 
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;  
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусГотовностиКЭПД");
		ЭлементОтбора.ПравоеЗначение 	= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыГотовностиКЭПД.Ready");
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда = Неопределено)
	
	УстановитьОтборДинСписка();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВДиадоке(Команда)
	
	// открыть форму поиска в ДД
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбораПоИННКПП",
		Новый Структура("РежимПоиска", Истина)	, ЭтаФорма, ЭтаФорма, "ОбработчикВыборИзДД",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикВыборИзДД(ВыбранноеЗначение = Неопределено, Параметр2 = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если Не ЗначениеЗаполнено(СуществующееСопоставление) Тогда 
			УстановитьСвязьСервер(ВыбранноеЗначение);
		КонецЕсли;
		ОповеститьОВыборе(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НайтиОрганизациюВДиадокеИЗаписатьВСправочник(ИНН, КПП = Неопределено)
	
	ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииЛюбойОрганизации();
	ПараметрыСервиса = КонтурЛогистика_API_Диадок.ЛогистикаПараметрыСервиса_Диадок(ДанныеАутентификации.DiadocBoxId);
	
	ДанныеДД = КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.Ядро().АПИ_GetOrganization(ПараметрыСервиса,,,, ИНН, КПП);
	
	ОрганизацияСсылка = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеДД);
	
КонецПроцедуры 


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОбъектУчетнойСистемы) Тогда
		
		СтандартнаяОбработка = Ложь;
		Выбрать(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда = Неопределено)
	
	Если ЗначениеЗаполнено(ОбъектУчетнойСистемы) Тогда
		
		Если ЗначениеЗаполнено(СуществующееСопоставление) Тогда
			                 
			ТекстВопроса = Строка(ОбъектУчетнойСистемы) +" уже сопоставлен с " + Строка(СуществующееСопоставление)+". Создать еще одно сопоставление?";
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Создать");	
			Кнопки.Добавить("Отменить");
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, Кнопки, , , ЭтаФорма, "ОбработчикВопросаПоСопоставлению");
			
		Иначе	
			
			Если ОбъектУчетнойСистемыУстановитьСвязь = Истина Тогда 
				УстановитьСвязьСОбъектом();
			КонецЕсли;
			
			ЗакрытьФормуВыборомЗначения();
			
		КонецЕсли;
		
	Иначе
		
		ЗакрытьФормуВыборомЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНашПриИзменении(Элемент)
	УстановитьОтборДинСписка()
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросаПоСопоставлению(ПараметрОбработчика, ДополнительныеПараметры) Экспорт
	
	Если ПараметрОбработчика = "Создать" Тогда
		
		Если ОбъектУчетнойСистемыУстановитьСвязь = Истина Тогда 
			УстановитьСвязьСОбъектом();
		КонецЕсли;
		
		ЗакрытьФормуВыборомЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвязьСОбъектом()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не могу определить выбранную строку");
		Возврат;
		
	КонецЕсли;
	
	УстановитьСвязьСервер(ТекДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьСервер(ОрганизацияДиадокСсылка)

	Если ОрганизацияДиадокСсылка.ПометкаУдаления Тогда
		ВызватьИсключение "Невозможно создать сопоставление т.к. Организация Диадок помечена на удаление. Выберите другую Организацию или снимите пометку удаления.";	
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыСервер.УстановитьСвязьОбъектовЛогистикаУчСист(ОрганизацияДиадокСсылка, ОбъектУчетнойСистемы);
			
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуВыборомЗначения()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ВыбранноеЗначение = ТекДанные.Ссылка;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ОповеститьОВыборе(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры