&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Документ = ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Сообщить("Титул не создан");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда
		
		ТипЛогистика = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
		Документ = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ТипЛогистика, Документ);
		
		Если Не ЗначениеЗаполнено(Документ) Тогда
			Сообщить("Титул не создан");
			Возврат;
		КонецЕсли;
		
	Иначе
		
		ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(
			Документ);
		
		Если ТипЛогистика = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1") Тогда
			
			ДокументЭТРН = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				Документ, "ДокументЭТРН");
			Если Не ЗначениеЗаполнено(ДокументЭТРН) Тогда
				Сообщить("Титул не привязан к ЭТРН");
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("Титул, ТипЛогистика, Скопировать", Документ, ТипЛогистика, Истина);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	Если ТипЛогистика = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1") Тогда
		
		ДокументОснование = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Документ, "ДокументОснование");
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			ПараметрыФормы.Вставить("СозданВручную", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяФормыТитула = "Документ."
		+ КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика)
		+ ".ФормаОбъекта";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяФормыТитула, ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаКопированияТитула(Титул, ТипЛогистика)
	
	ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(Титул);
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
	
		Если Не ЗначениеЗаполнено(Титул.ДокументЭТРН) Тогда
			Сообщить("Титул не привязан к ЭТРН");
			Возврат;
		КонецЕсли;		
	
	КонецЕсли;
	
КонецПроцедуры
