
&НаКлиенте
Процедура ПереключитьНовыйПользователь(Команда)
	НетПользователяДД = Не НетПользователяДД;
	УправлениеВидимостьюДоступностью(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// установка роли админа КЛ для админа учетной системы
	УстановитьРольАдминистратора();
	
	ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП = 
		КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийПользовательСБазовымиПравамиМожетРедактироватьСтартовыйПомощник();
	
	РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
	Если Не ЗначениеЗаполнено(РежимАвторизации) Тогда
		РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow;
		УстановитьНастройку("РежимАвторизации", РежимАвторизации);
	КонецЕсли;
	
	API_Логин = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ЛогинАвторизацииДиадокАПИ");
	API_Пароль = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПарольАвторизацииДиадокАПИ");
	
	Если Не РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ApiKey
		И Не РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow
		И ЗначениеЗаполнено(API_Логин)
		И ЗначениеЗаполнено(API_Пароль) Тогда
		
		ПроверитьСоединениеAPI();
	КонецЕсли;
	
	ИспользуетсяТестовыйСервер 			= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	ИспользуютсяЗаказЗаявки 			= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка");
	ИспользуютсяЗаказНаряды 			= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказНаряд");
	ИспользуютсяПутевыеЛисты 			= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист");
	ИспользуютсяПутевыеЛисты_5_02 		= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02");
	ИспользуютсяТРН 					= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН");
	ИспользуетсяПоручениеЭкспедитору	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПоручениеЭкспедитору");
	ИспользуетсяЭкспедиторскаяРасписка	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка");
	ИспользуетсяСкладскаяРасписка		= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяСкладскаяРасписка");
	ИспользуютсяЭкспедиторскиеДокумент	= (ИспользуетсяПоручениеЭкспедитору И ИспользуетсяЭкспедиторскаяРасписка И ИспользуетсяСкладскаяРасписка);
	
	Если Не ИспользуютсяЗаказНаряды Тогда
		Элементы.ИспользуютсяЗаказНаряды.Видимость = Ложь;
	КонецЕсли;
	
	ИмяКонфигурации1С = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИмяКонфигурации1С");
	
	УстановитьТиповуюКонфигурацию();
	
	Если Параметры.НачальнаяСтраница = "ВводЛогинаПароля" Или API_АвторизацияЛогинПарольУспешна <> Истина Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ВводЛогинаПароля;
	ИначеЕсли Параметры.НачальнаяСтраница = "МоиОрганизации" Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации;
		ПеречитатьМоиОрганизацииНаСервере();
	ИначеЕсли Параметры.НачальнаяСтраница = "Функциональность" Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
		ПеречитатьМоиОрганизацииНаСервере();
	ИначеЕсли Параметры.НачальнаяСтраница = "Настройки" Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
		ПеречитатьНастройкиНаСервере();
	ИначеЕсли Параметры.НачальнаяСтраница = "Права" Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПрав;	
	КонецЕсли;
	
	ОбновитьДанныеТестовыхОрганизаций();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда
		ОтображениеРасширенияСДополнительнымиРеквизитами();
		ОбновитьВидимостьДоступностьГруппДоступа();
	Иначе
		Элементы.ГруппаДополнительныеРеквизитыРасширение.Видимость = Ложь;
		Элементы.ГруппаГруппыДоступа.Видимость = Ложь;
	КонецЕсли;
		
	ПолучимНастройкиПрокси();
	
	ПеречитатьОшибки(Истина);
	
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	ОтображениеРасширенияСДополнительнымиРеквизитами();
	
	ОтображениеРасширенияQR();
	
	ОбновитьВидимостьНастроекГруппДоступа();
	
	Если РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow
		И Параметры.НачальнаяСтраница = "ВводЛогинаПароля" Тогда
		
		ЕстьАвторизации = КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьПортальныеАвторизации();
		Если Не ЕстьОрганизации() Или Не ЕстьАвторизации Тогда
			// При первом запуске заполняем в режиме
			ПереносПараметровАвторизацииИПроксиИзМодулейКонтура();
			
			ОткрытьАвторизациюOIDC = Истина;
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(API_Логин) Тогда
		// При первом запуске заполняем в режиме
		ПереносПараметровАвторизацииИПроксиИзМодулейКонтура();
	КонецЕсли;
	
	Если РежимАвторизации <> Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль Тогда
		НайденныйЭлемент = Элементы.РежимАвторизации.СписокВыбора.НайтиПоЗначению(Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль);
		Если НайденныйЭлемент <> Неопределено Тогда
			Элементы.РежимАвторизации.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП Тогда
		Элементы.ВводЛогинаПароля.Доступность = Ложь;
		Элементы.СтраницаНастройки.Доступность = Ложь;
		Элементы.СтраницаНастройкиПрав.Доступность = Ложь;
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ВводЛогинаПароля Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
		КонецЕсли;
	ИначеЕсли Не (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Или РольДоступна("КонтурЛогистика_НастройкаПодсистемы")) Тогда
		Элементы.Страницы.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЗаполнитьНачальныеДанныеДляМетрик();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаПредупреждение.Видимость = Ложь;
	Элементы.ГруппаПредупреждениеQR.Видимость = Ложь;
	
	УстановитьДоступностьКнопкиДалее();
	
	ОбновитьВидимостьТестовыхОрганизаций();
	
	ОбновитьВидимостьДоступностьПрокси(Истина);
	
	// Скроем все панели
	ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь);
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Ложь);
	ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "ДополнительныеРеквизиты");
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Ложь, "ДополнительныеРеквизиты");
	ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "QR_МП_УАТ");
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Ложь, "QR_МП_УАТ");
	
	// Откроем авторизацию по OIDC
	Если ОткрытьАвторизациюOIDC Тогда
		ПодключитьОбработчикОжидания("ОткрытьАвторизациюOIDC", 0.1, Истина);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПриОткрытииЗавершение", 0.1, Истина);
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.ЗаголовокСертификаты.ВысотаЗаголовка = 2;
		Элементы.ЗаголовокМЧД.ВысотаЗаголовка = 2;
		Элементы.ЗаголовокНастройкиПодписания.ВысотаЗаголовка = 2;
	КонецЕсли;
	
	// Метрики
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Источник", "СтартовыйПомощник");
	КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание("КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьЗапускМодуля",
		ПараметрыМетода,, "Отправка метрики запуска модуля", Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение()
	
	// Выполним первоначальное заполнение справочников
	АдресРезультатаВыполнитьОбмен = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
		"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьПервичноеЗаполнениеСправочников",,
		"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьПервичноеЗаполнениеСправочников",
		"Фоновое задание первичного заполнения справочников",
		АдресРезультатаВыполнитьОбмен);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАвторизациюOIDC()
	
	ПараметрыФормы = Новый Структура;
	Если Не ЕстьОрганизации() Тогда
		ПараметрыФормы.Вставить("АвторизацияПриОткрытии");
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций", ПараметрыФормы,
		ЭтаФорма, ЭтаФорма, "АвторизацияОрганизацийЗавершение");
		
	ОткрытьАвторизациюOIDC = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОрганизации()
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьОрганизации();
	
КонецФункции

&НаКлиенте
Процедура АвторизацияОрганизацийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСтартовыйПомошник" 
		И Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации Тогда
	
		ОбновитьСтрокуПоОрганизации(Параметр);
		
	ИначеЕсли ИмяСобытия = "ОбновитьСтартовыйПомошник" 
		И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда	
		
		ПеречитатьНастройкиНаСервере();
		
	ИначеЕсли ИмяСобытия = "ПеречитатьОшибкиСтартовыйПомошник" Тогда
		
		ПеречитатьОшибки();
		
	ИначеЕсли ИмяСобытия = "ПеречитатьМоиОрганизацииСтартовыйПомошник" Тогда
		
		ПеречитатьОшибки();
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок"));
		
	ИначеЕсли ИмяСобытия = "Запись_ГруппыДоступа" Тогда
		
		Если Элементы.ГруппаГруппыДоступа.Видимость Тогда
			ОбновитьВидимостьДоступностьГруппДоступа();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ИзмениласьРольОрганизации" Тогда
		
		ОрганизацияСсылка = Параметр;
		ОбновитьРолиПоОрганизации(ОрганизацияСсылка);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьНастройкиПодписанияВСтартовомПомощнике" Тогда
		
		УправлениеВидимостьюДоступностью(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюДоступностью(Форма)

	Элементы = Форма.Элементы;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ВводЛогинаПароля Тогда 
		
		Если Форма.РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.ЛогинИПарольИApiKey") Тогда 
			
			Элементы.ГруппаЛогинИПарольДД.Видимость = Истина;
			Элементы.ГруппаЧерезПортал.Видимость = Ложь;
			
		ИначеЕсли Форма.РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль") Тогда
			
			Элементы.ГруппаЛогинИПарольДД.Видимость = Истина;
			Элементы.ГруппаЧерезПортал.Видимость = Ложь;
			
		ИначеЕсли Форма.РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.ApiKey") Тогда
			
			Элементы.ГруппаЛогинИПарольДД.Видимость = Ложь;
			Элементы.ГруппаЧерезПортал.Видимость = Ложь;
			
		ИначеЕсли Форма.РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow") Тогда
			
			Элементы.ГруппаЛогинИПарольДД.Видимость = Ложь;
			Элементы.ГруппаЧерезПортал.Видимость = Истина;
			
		КонецЕсли;
		
		Элементы.ГруппаЕстьПользователь.Видимость = Не Форма.НетПользователяДД;
		Элементы.ГруппаНетПользователя.Видимость = Форма.НетПользователяДД;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность Тогда
		
		Элементы.ГруппаИспользуютсяЭкспедиторскиеДокумент.Видимость = Форма.ИспользуютсяЭкспедиторскиеДокумент;
		Элементы.ГруппаЭкспедиторсикеДокументы.Видимость = Не Форма.ИспользуютсяЭкспедиторскиеДокумент;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации Тогда
		
		Если Форма.РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow") Тогда
			Элементы.ОрганизацииДиадокИРолиНаша.Видимость = Ложь;
			Элементы.ОрганизацииДиадокИРолиApiKey.Видимость = Ложь;
		Иначе
			Элементы.ОрганизацииДиадокИРолиНаша.Видимость = Истина;
			Элементы.ОрганизацииДиадокИРолиApiKey.Видимость = Истина;
		КонецЕсли;
		
		Элементы.ГруппаТестовыеОрганизации.Видимость = Не Форма.ИспользуетсяТестовыйСервер;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПодписания Тогда
		
		КоличествоДействующихСертификатов = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихСертификатов();
		Элементы.ТекстДобавленоСертификатов.Заголовок = "Добавлено: " + Строка(КоличествоДействующихСертификатов);
		
		КоличествоДействующихМЧД = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихМЧД();
		Элементы.ТекстЗагруженоМЧД.Заголовок = "Загружено: " + Строка(КоличествоДействующихМЧД);
		
		КоличествоДействующихНастроекПодписания = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихНастроекПодписания();
		Элементы.ТекстДобавленоНастроекПодписания.Заголовок = "Добавлено: " + Строка(КоличествоДействующихНастроекПодписания);
		
		НашиОрганизацииБезНастроекПодписания = КонтурЛогистика_ОбщегоНазначенияСервер.НашиОрганизацииБезНастроекПодписания() ;
		Форма.СписокНашихОрганизацийБезНастроекПодписания.ЗагрузитьЗначения(НашиОрганизацииБезНастроекПодписания);
		Элементы.ТекстОрганизацийБезНастроекПодписания.Видимость = (НашиОрганизацииБезНастроекПодписания.Количество() > 0);
		Элементы.ТекстОрганизацийБезНастроекПодписания.Заголовок = "Организаций без настроек: " + Строка(НашиОрганизацииБезНастроекПодписания.Количество());
		
	КонецЕсли;
	
	РежимOIDCDeviceFlow = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow");
	АвторизацияНаПортале = (Форма.РежимАвторизации = РежимOIDCDeviceFlow);
	Форма.Элементы.ДекорацияРежимАвторизации.Видимость = Не АвторизацияНаПортале;
	Форма.Элементы.ДекорацияЧтоТакоеApiKey.Видимость = Не АвторизацияНаПортале;
	Форма.Элементы.ГруппаДиадокЗаголовок.Видимость = Не АвторизацияНаПортале;
	
КонецПроцедуры

// СтраницаВводЛогинаПароля

&НаКлиенте
Процедура ВводЛогинаПароля_ПроверитьПодключение(Команда)
	
	Если Не ЗначениеЗаполнено(API_Логин) Или Не ЗначениеЗаполнено(API_Пароль) Тогда 
		Сообщить("Укажите Логин и Пароль");
	Иначе
		ПроверитьСоединениеAPI();
	КонецЕсли;
	
	УстановитьДоступностьКнопкиДалее(); 
	
	Если Элементы.ВводЛогинаПароля_ПроверитьПодключение.Видимость = Ложь Тогда 
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Стартовый помощник", "Проверить логин и пароль", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Подключение");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеAPI()

	Попытка
	
		API_СоединениеПроверено = КонтурЛогистика_API_Диадок.Диадок_АПИ_ПроверитьСоединениеDiadocAPI()	
	
	Исключение
		
	    Сообщить(ОписаниеОшибки());
		API_СоединениеПроверено = Ложь;
		
	КонецПопытки;

	Попытка
	
		ПолученныйТокен = КонтурЛогистика_API_Диадок.Диадок_АПИ_Authenticate_ЛогинПароль(API_Логин, API_Пароль);
	    API_АвторизацияЛогинПарольУспешна = ЗначениеЗаполнено(ПолученныйТокен);
		
		Если API_АвторизацияЛогинПарольУспешна Тогда
		
			Элементы.ВводЛогинаПароля_ПроверитьПодключение.Видимость = Ложь;
			ОбновитьПовторноИспользуемыеЗначения();
			
		КонецЕсли;
		
	Исключение
		
	    Сообщить(ОписаниеОшибки());
	    API_АвторизацияЛогинПарольУспешна = Ложь;
		
	КонецПопытки;
	
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаКлиенте
Процедура API_ЛогинПриИзменении(Элемент)
	
	API_АвторизацияЛогинПарольУспешна = Ложь;
	УстановитьДоступностьКнопкиДалее();
	УстановитьНастройку("ЛогинАвторизацииДиадокАПИ", API_Логин);
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаКлиенте
Процедура API_ПарольПриИзменении(Элемент)
	
	API_АвторизацияЛогинПарольУспешна = Ложь;
	УстановитьДоступностьКнопкиДалее();
	УстановитьНастройку("ПарольАвторизацииДиадокАПИ", API_Пароль);
	ПеречитатьОшибки();
	
КонецПроцедуры

// Конец СтраницаВводЛогинаПароля

// СтраницаМоиОрганизации

&НаСервере
Процедура ПеречитатьМоиОрганизацииНаСервере()
	
	Если РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		МассивОрганизацийДД = ПеречитатьМоиОрганизацииНаСервере_OIDC();
	Иначе
		МассивОрганизацийДД = ПеречитатьМоиОрганизацииНаСервере_КлючАПИ();
		
		// Отправить метрику успешной авторизации
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьАвторизацию(МассивОрганизацийДД, "Пароль");
	КонецЕсли;
	
	ОрганизацииДиадокИРоли.Сортировать("Наша Убыв, РольГрузоотправитель Убыв, РольПеревозчик Убыв, РольГрузополучатель Убыв");
	
	// Поиск связных организаций
	НайтиИЗаполнитьСвязныеОрганизацииДляОрганизацииДиадок(МассивОрганизацийДД);
	
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаСервере
Функция ПеречитатьМоиОрганизацииНаСервере_OIDC()
	
	МассивОрганизацийДД = Новый Массив;
	ОрганизацииДиадокИРоли.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК ОрганизацияДиадок,
	|	КонтурЛогистика_ОрганизацииДиадок.Наш КАК Наша,
	|	КонтурЛогистика_ОрганизацииДиадок.Грузоотправитель КАК РольГрузоотправитель,
	|	КонтурЛогистика_ОрганизацииДиадок.Перевозчик КАК РольПеревозчик,
	|	КонтурЛогистика_ОрганизацииДиадок.Грузополучатель КАК РольГрузополучатель,
	|	КонтурЛогистика_ОрганизацииДиадок.Оформитель КАК РольОформитель,
	|	КонтурЛогистика_ОрганизацииДиадок.Медик КАК РольМедик,
	|	КонтурЛогистика_ОрганизацииДиадок.ТехОсмотр КАК РольТехОсмотр,
	|	КонтурЛогистика_ОрганизацииДиадок.Одометр КАК РольОдометр,
	|	КонтурЛогистика_ОрганизацииДиадок.Экспедитор КАК РольЭкспедитор,
	|	КонтурЛогистика_ОрганизацииДиадок.Sociability КАК Sociability,
	|	КонтурЛогистика_ОрганизацииДиадок.ID КАК ID,
	|	КонтурЛогистика_ОрганизацииДиадок.СтатусГотовностиКЭПД КАК СтатусГотовностиКЭПД
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш";
	
	ОрганизацииДиадокИРоли.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого ТекущаяСтрока Из ОрганизацииДиадокИРоли Цикл
		
		ТекущаяСтрока.ПредставлениеРолей = ПредставлениеРолей(ТекущаяСтрока);
		
		// Заполнение ApiKey
		Если РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ApiKey
			Или РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПарольИApiKey Тогда
			
			ТекущаяСтрока.ApiKey = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(
				ТекущаяСтрока.ОрганизацияДиадок, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey);
		КонецЕсли;
		
		
		МассивОрганизацийДД.Добавить(ТекущаяСтрока.ОрганизацияДиадок);
		
	КонецЦикла;
	
	Возврат МассивОрганизацийДД;
	
КонецФункции

&НаСервере
Функция ПеречитатьМоиОрганизацииНаСервере_КлючАПИ()
	
	ЕстьОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьОрганизации();
	
	МассивОрганизацийДД = Новый Массив;
	Диадок_МоиОрганизации = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMyOrganizations();
	
	ОрганизацииДиадокИРоли.Очистить();
	
	Для Каждого ДанныеОднойОрганизации Из Диадок_МоиОрганизации.Organizations Цикл 
		
		ОрганизацияСсылка = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеОднойОрганизации);
		
		НоваяСтрокОрги = ОрганизацииДиадокИРоли.Добавить();
		НоваяСтрокОрги.ОрганизацияДиадок 	= ОрганизацияСсылка;
		НоваяСтрокОрги.Наша 				= ОрганизацияСсылка.Наш;
		НоваяСтрокОрги.РольГрузоотправитель = ОрганизацияСсылка.Грузоотправитель;
		НоваяСтрокОрги.РольПеревозчик 		= ОрганизацияСсылка.Перевозчик;
		НоваяСтрокОрги.РольГрузополучатель 	= ОрганизацияСсылка.Грузополучатель;
		НоваяСтрокОрги.РольОформитель 		= ОрганизацияСсылка.Оформитель;
		НоваяСтрокОрги.РольМедик 			= ОрганизацияСсылка.Медик;
		НоваяСтрокОрги.РольТехОсмотр 		= ОрганизацияСсылка.ТехОсмотр;
		НоваяСтрокОрги.РольОдометр 			= ОрганизацияСсылка.Одометр;
		НоваяСтрокОрги.Sociability			= ОрганизацияСсылка.Sociability;
		НоваяСтрокОрги.ID					= ОрганизацияСсылка.ID;
		НоваяСтрокОрги.ПредставлениеРолей	= ПредставлениеРолей(НоваяСтрокОрги);
		НоваяСтрокОрги.СтатусГотовностиКЭПД	= ОрганизацияСсылка.СтатусГотовностиКЭПД;
		
		// Заполнение ApiKey
		Если Не РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль Тогда
			НоваяСтрокОрги.ApiKey = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(
				ОрганизацияСсылка, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey);
		КонецЕсли;
		
		МассивОрганизацийДД.Добавить(ОрганизацияСсылка);
		
	КонецЦикла;
	
	Возврат МассивОрганизацийДД;
	
КонецФункции

&НаСервере
Функция ПредставлениеРолей(СтрокаОрганизации)
	
	Если СтрокаОрганизации.РольГрузоотправитель
		Или СтрокаОрганизации.РольПеревозчик
		Или СтрокаОрганизации.РольГрузополучатель
		Или СтрокаОрганизации.РольЭкспедитор Тогда
		
		РолиЭТрН = Новый Массив;
		Если СтрокаОрганизации.РольГрузоотправитель Тогда
			РолиЭТрН.Добавить("грузоотправитель");
		КонецЕсли;
		Если СтрокаОрганизации.РольПеревозчик Тогда
			РолиЭТрН.Добавить("перевозчик");
		КонецЕсли;
		Если СтрокаОрганизации.РольГрузополучатель Тогда
			РолиЭТрН.Добавить("грузополучатель");
		КонецЕсли;
		Если СтрокаОрганизации.РольЭкспедитор Тогда
			РолиЭТрН.Добавить("экспедитор");
		КонецЕсли;
		
		ПредставлениеРолейЭТрН = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(РолиЭТрН, ", ");
		ПредставлениеРолейЭТрН = ВРег(Лев(ПредставлениеРолейЭТрН, 1)) + Прав(ПредставлениеРолейЭТрН, СтрДлина(ПредставлениеРолейЭТрН) - 1);
		
	Иначе
		
		ПредставлениеРолейЭТрН = "";
		
	КонецЕсли;
	
	Если СтрокаОрганизации.РольОформитель
		Или СтрокаОрганизации.РольМедик
		Или СтрокаОрганизации.РольТехОсмотр
		Или СтрокаОрганизации.РольОдометр Тогда
		
		РолиЭПЛ = Новый Массив;
		Если СтрокаОрганизации.РольОформитель Тогда
			РолиЭПЛ.Добавить("оформитель");
		КонецЕсли;
		Если СтрокаОрганизации.РольМедик Тогда
			РолиЭПЛ.Добавить("медик");
		КонецЕсли;
		Если СтрокаОрганизации.РольТехОсмотр Тогда
			РолиЭПЛ.Добавить("тех. осмотр");
		КонецЕсли;
		Если СтрокаОрганизации.РольОдометр Тогда
			РолиЭПЛ.Добавить("одометр");
		КонецЕсли;
		
		ПредставлениеРолейЭПЛ = "ЭПЛ: " + КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(РолиЭПЛ, ", ");
		
	Иначе
		
		ПредставлениеРолейЭПЛ = "";
		
	КонецЕсли;
	
	ПредставлениеРолей = ПредставлениеРолейЭТрН
		+ ?(ЗначениеЗаполнено(ПредставлениеРолейЭТрН) И ЗначениеЗаполнено(ПредставлениеРолейЭПЛ), ", ", "")
		+ ПредставлениеРолейЭПЛ;
	
	Если ПредставлениеРолей = "" Тогда
		ПредставлениеРолей = "Заполнить";
	КонецЕсли;
	
	Возврат ПредставлениеРолей;
	
КонецФункции

&НаСервере
Процедура НайтиИЗаполнитьСвязныеОрганизацииДляОрганизацииДиадок(МассивОрганизацийДД) // дублирование с КонтурЛогистика_ОрганизацииДиадок НайтиИЗаполнитьСвязныеОрганизацииДляОрганизацииДиадок

	СвязныеОбъекты.Очистить();
	ТаблицаСоответствий = КонтурЛогистика_ОбщегоНазначенияСервер.СоответствиеОрганизацииУСОрганизациямДД(МассивОрганизацийДД);
	
	Если Не ТаблицаСоответствий = Неопределено Тогда 
		
		СвязныеОбъекты.Загрузить(ТаблицаСоответствий);
		
		Для Каждого СтрокаОрганизаций Из ОрганизацииДиадокИРоли Цикл 
			
			СтрокаОрганизаций.ОрганизацииВБазе.Очистить();
			Справочники.КонтурЛогистика_ОрганизацииДиадок.ОбновитьСвязныеОбъектыПоОрганизации(СтрокаОрганизаций.ОрганизацияДиадок, ТаблицаСоответствий);
			
			СтрокаОрганизаций.ОрганизацииВБазе.ЗагрузитьЗначения(СтрокаОрганизаций.ОрганизацияДиадок.СвязанныеОбъекты.ВыгрузитьКолонку("СвязанныйОбъект"));
			
			Если Не СтрокаОрганизаций.ОрганизацииВБазе.Количество() Тогда 
				СтрокаОрганизаций.ТребуемоеДействие = "Сопоставить";
				СтрокаОрганизаций.СопоставленКартинка = 1;
			КонецЕсли;	
				
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьМоиОрганизации(Команда)
	
	ПеречитатьМоиОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииДиадокИРолиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элемент.ТекущиеДанные;
	ОрганизацияСсылка =  ТекСтрока.ОрганизацияДиадок;
	
	Если Поле.Имя = "ОрганизацииДиадокИРолиОрганизацияДиадок" 
		Или Поле.Имя = "ОрганизацииДиадокИРолиОрганизацииВБазе" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ОрганизацияСсылка);
		
	ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиТребуемоеДействие" И ТекСтрока.ТребуемоеДействие = "" Тогда
		
		Если ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП Тогда
		
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Организация", ОрганизацияСсылка);
			ПараметрыОткрытия.Вставить("СвязанныеОбъекты", ТекСтрока.ОрганизацииВБазе);
			ПараметрыОткрытия.Вставить("ОткрытаИзТЧОрганизацииДиадокИРоли", Истина);
			
			ИмяФормыСправочника = "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаПодбораСвязанныхОбъектов";
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
				"ОбработчикСопоставленияОрганизации",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
							
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ОрганизацияСсылка);
				
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиТребуемоеДействие" И ТекСтрока.ТребуемоеДействие = "Сопоставить" Тогда 
		
		Если ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП Тогда
		
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Организация", ОрганизацияСсылка);
			ПараметрыОткрытия.Вставить("СвязанныеОбъекты", ТекСтрока.ОрганизацииВБазе);
			ПараметрыОткрытия.Вставить("ОткрытаИзТЧОрганизацииДиадокИРоли", Истина);
			
			ИмяФормыСправочника = "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаПодбораСвязанныхОбъектов";
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
				"ОбработчикСопоставленияОрганизации",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
							
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента", 
				Новый Структура("Ключ, ПоказатьИнфоОСопоставлении", ОрганизацияСсылка, Истина), 
				ЭтаФорма);
				
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиApiKey" Тогда
		
		СтандартнаяОбработка = Истина;
		
	ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиПредставлениеРолей" Тогда
		
		РолиОрганизации = Новый Структура;
		Для Каждого ИмяРоли Из ВсеРоли() Цикл
			РолиОрганизации.Вставить(ИмяРоли, ТекСтрока["Роль" + ИмяРоли]);
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", ТекСтрока.ОрганизацияДиадок);
		ПараметрыФормы.Вставить("РолиОрганизации", РолиОрганизации);
		ПараметрыФормы.Вставить("Метрики_Категоря", "Стартовый помощник");
		ПараметрыФормы.Вставить("Метрики_МестоВызова", ЭтаФорма.ИмяФормы);
		ПараметрыФормы.Вставить("Метрики_Действие", "Выбор роли");
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ИдентификаторСтроки", ТекСтрока.ПолучитьИдентификатор());
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаРедактированияРолей", ПараметрыФормы, ЭтаФорма,
			ЭтаФорма, "РедактированияРолейЗавершение", ПараметрыОбработчика, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		Если Поле.Имя = "ОрганизацииДиадокИРолиНаша" Тогда
			ИмяРеквизита = "Наш";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольГрузоотправитель" Тогда 
			ИмяРеквизита = "Грузоотправитель";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольПеревозчик" Тогда 
			ИмяРеквизита = "Перевозчик";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольГрузополучатель" Тогда
			ИмяРеквизита = "Грузополучатель";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольОформитель" Тогда
			ИмяРеквизита = "Оформитель";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольМедик" Тогда
			ИмяРеквизита = "Медик";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольТехОсмотр" Тогда
			ИмяРеквизита = "ТехОсмотр";
		ИначеЕсли Поле.Имя = "ОрганизацииДиадокИРолиРольОдометр" Тогда
			ИмяРеквизита = "Одометр";
		КонецЕсли;
		
		УстановитьРеквизитОрганизацииДиадок(ИмяРеквизита, ОрганизацияСсылка);
		ОповеститьОбИзменении(ОрганизацияСсылка);
		
		ОрганизацииДиадокИРоли.Сортировать("Наша Убыв, РольГрузоотправитель Убыв, РольПеревозчик Убыв, РольГрузополучатель Убыв");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСопоставленияОрганизации(Результат, ДополнительныеПараметры) Экспорт

	ТекущаяСтрока = Элементы.ОрганизацииДиадокИРоли.ТекущиеДанные;
	
	МассивОрганизацийДД = Новый Массив;
	МассивОрганизацийДД.Добавить(ТекущаяСтрока.ОрганизацияДиадок);
	НайтиИЗаполнитьСвязныеОрганизацииДляОрганизацииДиадок(МассивОрганизацийДД)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВсеРоли()
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли();
	
КонецФункции

&НаКлиенте
Процедура РедактированияРолейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОрганизацииДиадокИРоли.ТекущиеДанные;
	
	ЗапишемРолиВОрганизацию(ТекущиеДанные.ОрганизацияДиадок, Результат);
	
	ОбновитьРолиПоОрганизации(ТекущиеДанные.ОрганизацияДиадок);
	
	// Проверяем наличие приглашения и отправляем если требуется
	ПроверкаОтправкаПриглашенийСТестовымиОрганизациями(ТекущиеДанные.ОрганизацияДиадок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапишемРолиВОрганизацию(ОрганизацияДиадок, ДанныеРолей)
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗапишемРолиВОрганизацию(ОрганизацияДиадок, ДанныеРолей);
	
	ЕстьВыбранныеРоли = Ложь;
	Для Каждого ИмяРоли Из ВсеРоли() Цикл
		Если ДанныеРолей[ИмяРоли] Тогда
			ЕстьВыбранныеРоли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Общепродуктовая метрика настройки организации
	// (сейчас считаем что настройка = выбрана роль у нашей организации и есть соответствие)
	Если ОрганизацияДиадок.Наш
		И ОрганизацияДиадок.СвязанныеОбъекты.Количество() > 0
		И ЕстьВыбранныеРоли Тогда
		
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьВыполнениеНастройки(ОрганизацияДиадок, "СтартовыйПомощник");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРолиПоОрганизации(Организация)
	
	ПараметрыОтбора = Новый Структура("ОрганизацияДиадок", Организация);
	НайденныеСтроки = ОрганизацииДиадокИРоли.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = НайденныеСтроки[0];
	
	РолиОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.РолиОрганизации(ТекущаяСтрока.ОрганизацияДиадок);
	
	ТекущаяСтрока.РольГрузоотправитель  = РолиОрганизации.Грузоотправитель;
	ТекущаяСтрока.РольПеревозчик 		= РолиОрганизации.Перевозчик;
	ТекущаяСтрока.РольГрузополучатель 	= РолиОрганизации.Грузополучатель;
	ТекущаяСтрока.РольОформитель 		= РолиОрганизации.Оформитель;
	ТекущаяСтрока.РольМедик 			= РолиОрганизации.Медик;
	ТекущаяСтрока.РольТехОсмотр 		= РолиОрганизации.ТехОсмотр;
	ТекущаяСтрока.РольОдометр 			= РолиОрганизации.Одометр;
	ТекущаяСтрока.РольЭкспедитор		= РолиОрганизации.Экспедитор;
	
	ДанныеРолей = Новый Структура("РольГрузоотправитель, РольПеревозчик, РольГрузополучатель,
		|РольОформитель, РольМедик, РольТехОсмотр, РольОдометр, РольЭкспедитор");
	ЗаполнитьЗначенияСвойств(ДанныеРолей, ТекущаяСтрока);
	
	ТекущаяСтрока.ПредставлениеРолей = ПредставлениеРолей(ДанныеРолей);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитОрганизацииДиадок(Знач ИмяРеквизита, Знач ОрганизацияСсылка)
	
	Если Не ИмяРеквизита = Неопределено Тогда 
		
		ИзменитьЗначениеРеквизитаОрганизацииДиадок(ОрганизацияСсылка, ИмяРеквизита);
		
		ПеречитатьОшибки();
		
		Если ИмяРеквизита = "Наш"
			Или ИмяРеквизита = "Грузоотправитель"
			Или ИмяРеквизита = "Перевозчик"
			Или ИмяРеквизита = "Грузополучатель" Тогда
			
			// Проверяем наличие приглашения и отправляем если требуется
			ПроверкаОтправкаПриглашенийСТестовымиОрганизациями(ОрганизацияСсылка);
		КонецЕсли;
		
	КонецЕсли;
	
	// общепродуктовая метрика настройки организации (сейчас считаем что настройка = выбрана роль у нашей организации и есть соответствие)
	Если ОрганизацияСсылка.Наш 
		И ОрганизацияСсылка.СвязанныеОбъекты.Количество() > 0
		И (ОрганизацияСсылка.Грузоотправитель
		ИЛИ ОрганизацияСсылка.Перевозчик
		ИЛИ ОрганизацияСсылка.Грузополучатель
		ИЛИ ОрганизацияСсылка.Оформитель
		ИЛИ ОрганизацияСсылка.Медик
		ИЛИ ОрганизацияСсылка.ТехОсмотр
		ИЛИ ОрганизацияСсылка.Одометр) Тогда
		
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьВыполнениеНастройки(ОрганизацияСсылка, "СтартовыйПомощник");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеРеквизитаОрганизацииДиадок(ОрганизацииДиадок, ИмяРеквизита)
	
	Для Счет = 1 По 10 Цикл
		
		КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
		
		Попытка
			
			ЗаблокироватьДанныеДляРедактирования(ОрганизацииДиадок);
			
			ОрганизацияОбъект = ОрганизацииДиадок.ПолучитьОбъект();
			ОрганизацияОбъект[ИмяРеквизита] = Не ОрганизацияОбъект[ИмяРеквизита];
			ОрганизацияОбъект.Записать();
			
			РазблокироватьДанныеДляРедактирования(ОрганизацииДиадок);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			КонтурЛогистика_ОбщегоНазначенияСервер.Пауза_(1);
			
			Продолжить;
			
		КонецПопытки;
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокуПоОрганизации(ОрганизацияСсылка)
	
	нСтроки = ОрганизацииДиадокИРоли.НайтиСтроки(Новый Структура("ОрганизацияДиадок", ОрганизацияСсылка));
	
	Если нСтроки.Количество() Тогда 
		
		СтрокаОрганизаций = нСтроки[0];
		
		СтрокаОрганизаций.ОрганизацииВБазе.ЗагрузитьЗначения(ОрганизацияСсылка.СвязанныеОбъекты.ВыгрузитьКолонку("СвязанныйОбъект"));
		
		Если Не СтрокаОрганизаций.ОрганизацииВБазе.Количество() Тогда 
			СтрокаОрганизаций.ТребуемоеДействие = "Сопоставить";
			СтрокаОрганизаций.СопоставленКартинка = 1;
		Иначе	
			СтрокаОрганизаций.ТребуемоеДействие = "";
			СтрокаОрганизаций.СопоставленКартинка = 0;
		КонецЕсли;
		
	КонецЕсли;

	ПеречитатьОшибки();
	
КонецПроцедуры

// Конец СтраницаМоиОрганизации

// СтраницаНастройки

&НаКлиенте
Процедура ПодтвердитьКонфигурацию(Команда)
	
	УстановитьПервичныеНастройкиДляКонфигурации();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПервичныеНастройкиДляКонфигурации()
	
	ПодтвердитьКонфигурациюНаСервере();
	
	ОтображениеРасширенияСДополнительнымиРеквизитами();
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Ложь, "ДополнительныеРеквизиты");
	
	ОтображениеРасширенияQR();
	
	Если ИмяКонфигурации1С = "УАТ_ПРОФ"
		Или ИмяКонфигурации1С = "ERP_УАТ"
		Или ИмяКонфигурации1С = "ТЛЭ" Тогда
		
		Если ПередаватьQRВМПВодительУАТ Тогда
			ПроверитьОбновленияНаКлиенте("QR_МП_УАТ");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьКонфигурациюНаСервере()
	
	ЗаписатьИмяКонфигурацииВОбщиеНастройки();
	СоздатьТиповыеНастройкиНаСервере();
	ПеречитатьНастройкиНаСервере();
	
	УправлениеВидимостьюДоступностьюЭлементовНастроек();
	
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТиповыеНастройкиНаСервере()
	
	Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(, Истина, Истина);
	УстановитьОбязательныеОбщиеНастройки();
	Справочники.КонтурЛогистика_НастройкиКонвертацииРегистровСведений.ЗаполнитьАвтоматическиДляТекущейКонфигурации();
	
	Для Каждого ТипСправочника Из ТипыСправочников() Цикл
		
		ПоддерживаемыеТипы = КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыСправочниковКонфигурации1С(ТипСправочника);
		
		Если ПоддерживаемыеТипы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПредопределенного = "Автоконвертация_" + ТипСправочника;
		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяПредопределенного, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКонфигурацию(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Настройки будут удалены. Продолжить?", 
		РежимДиалогаВопрос.ДаНет,,, 
		ЭтаФорма, 
		"ОбработчикУдаленияНастроек");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикУдаленияНастроек(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Сообщить("Действие отменено пользователем.");
		Возврат;
	КонецЕсли;
	
	УдалитьНастройкиКонвертации();
	
	УдалитьНастройкиДополнительногоРасширения();
	Элементы.ГруппаДополнительныеРеквизитыРасширение.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкиКонвертации()

	УдалитьОбязательныеОбщиеНастройки();
	
	Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.УдалитьВсеНастройки();
	Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.УдалитьВсеНастройки();
	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ИмяКонфигурации1С", "");
	
	ПеречитатьНастройкиНаСервере();
	
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИмяКонфигурацииВОбщиеНастройки()
	
	ИмяПеречисления = ТиповаяКонфигурация.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ТиповаяКонфигурация);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ИмяКонфигурации1С", ИмяЗначенияПеречисления);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНастройкиНаСервере()
	
	ИмяКонфигурации1С = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИмяКонфигурации1С");
	
	ПеречитатьОбщиеНастройки();
	ПеречитатьНастройкиКонвертацииДокументов();
	ПеречитатьНастройкиКонвертацииСправочников();
	
	УправлениеВидимостьюДоступностьюЭлементовНастроек();
	
	// проверка, для орнанизаций проставлена хотя бы одна роль роли, 
	// иначе не создадутся настройки конвертации документов

	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиОрганизацииСРолью() Тогда
		
		Элементы.ГруппаНастройки.Доступность = Ложь;
		ВызватьИсключение "Не настроены роли для организаций на вкладке ""Мои организации.""";
		
	КонецЕсли;
	
	Элементы.ГруппаНастройки.Доступность = Истина;
	Элементы.ГруппаСозданныеНастройки.Видимость = Не ЗначениеЗаполнено(ИмяКонфигурации1С);
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьОбщиеНастройки()
	
	УстановитьКартинкуЭлементуФормы(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НастройкиЗаполнены(), Элементы.СостоянияДокументооборотаКартинка);
	УстановитьКартинкуЭлементуФормы(Справочники.КонтурЛогистика_КлассификаторУпаковок.НастройкиЗаполнены(), Элементы.КлассификаторУпаковокКартинка);
	УстановитьКартинкуЭлементуФормы(Справочники.КонтурЛогистика_СтраныМира.НастройкиЗаполнены(), Элементы.СтраныМираКартинка);
	УстановитьКартинкуЭлементуФормы(Справочники.КонтурЛогистика_Настройки.НастройкиВыполнены(), Элементы.ОбщиеНастройкиКартинка);
	
	// настройки хранения данных
	
	СоответствиеНастроек = Справочники.КонтурЛогистика_Настройки.ПолучитьПроверкуНастроекОсобенностейХраненияДанных();
	
	Для Каждого Настройка Из СоответствиеНастроек Цикл 
				
		Если Настройка.Ключ = "ИмяСправочникаХарактеристика" И Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() Тогда 
			Продолжить;
		КонецЕсли;
		
		УстановитьКартинкуЭлементуФормы(Настройка.Значение, Элементы["Картинка" + Настройка.Ключ]);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНастройкиКонвертацииДокументов()
		
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 1), "Т1");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 2), "Т2");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 3), "Т3");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 4), "Т4");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 5), "Т5");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 6), "Т6");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 7), "Т7");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ТрН_Титул", 8), "Т8");
	
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", 1), "Т1_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", 2), "Т2_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", 3), "Т3_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", 4), "Т4_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", 5), "Т5_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", 6), "Т6_ПЛ");
	
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ЗЗ_Титул", 1), "Т1_ЗЗ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ЗЗ_Титул", 2), "Т2_ЗЗ");
	
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", "1_5_02"), "Т1_5_02_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", "2_5_02"), "Т2_5_02_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", "3_5_02"), "Т3_5_02_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", "4_5_02"), "Т4_5_02_ПЛ");
	УстановитьКартинкуИЗаголовокЭлементамФормы(ЕстьТитул("ПЛ_Титул", "5_5_02"), "Т5_5_02_ПЛ");
			
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНастройкиКонвертацииСправочников()
	
	Для Каждого ТипСправочника Из ТипыСправочников() Цикл
		
		ИмяСправочникаБезПрефикса =  СтрЗаменить(ТипСправочника, "КонтурЛогистика_", "");
		
		ИмяПредопределенного = "Автоконвертация_" + ТипСправочника;
		НастройкаАвтоконвертации = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
			ТипСправочника);
		
		ОформлениеКартинкиКонвертацииСправочника(ИмяСправочникаБезПрефикса,
			НастройкаАвтоконвертации.Значение, Не КонтекстНастройкиКонвертации.ЕстьКонвертация);
		ОформлениеСсылкиКонвертацииСправочника(ИмяСправочникаБезПрефикса, КонтекстНастройкиКонвертации.ЕстьКонвертация);
		ОформлениеТумблераКонвертацииСправочника(ИмяСправочникаБезПрефикса, Не КонтекстНастройкиКонвертации.ЕстьКонвертация);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыСправочников()
	
	ТипыСправочников = Новый Массив;
	ТипыСправочников.Добавить("КонтурЛогистика_ГорючеСмазочныеМатериалы");
	ТипыСправочников.Добавить("КонтурЛогистика_Договоры");
	ТипыСправочников.Добавить("КонтурЛогистика_Лицензии");
	ТипыСправочников.Добавить("КонтурЛогистика_ОрганизацииДиадок");
	ТипыСправочников.Добавить("КонтурЛогистика_ПодразделенияДиадок");
	ТипыСправочников.Добавить("КонтурЛогистика_ПунктыМаршрута");
	ТипыСправочников.Добавить("КонтурЛогистика_Сотрудники");
	ТипыСправочников.Добавить("КонтурЛогистика_ТранспортныеСредства");
	
	Возврат ТипыСправочников;
	
КонецФункции

&НаСервере
Процедура УстановитьКартинкуИЗаголовокЭлементамФормы(ПоказатьГалочку, Постфикс)
	
	УстановитьКартинкуЭлементуФормы(ПоказатьГалочку, Элементы["КартинкаКонвертация" + Постфикс]);
	
	Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда 
		
		Если ПоказатьГалочку Тогда 
			Элементы["ТекстКонвертация" + Постфикс].Заголовок = СтрЗаменить(Элементы["ТекстКонвертация" + Постфикс].Заголовок, "Создать ", "");
		Иначе
			Элементы["ТекстКонвертация" + Постфикс].Заголовок = "Создать " + СтрЗаменить(Элементы["ТекстКонвертация" + Постфикс].Заголовок, "Создать ", "");
		КонецЕсли;	
		
	Иначе
		
		Элементы["ТекстКонвертация" + Постфикс].Заголовок = СтрЗаменить(Элементы["ТекстКонвертация" + Постфикс].Заголовок, "Создать ", "");
		
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Процедура УстановитьКартинкуЭлементуФормы(ПоказатьГалочку, ЭлементФормы)
		
	Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда 
		
		Если ПоказатьГалочку Тогда 
			ЭлементФормы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Галочка;
		Иначе
			ЭлементФормы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Восклицание;
		КонецЕсли;	
		
	Иначе
		
		ЭлементФормы.Картинка = Новый Картинка;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьТиповуюКонфигурацию()

	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Попытка
		ТиповаяКонфигурация = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТиповыеКонфигурации1С." + ТиповаяКонфигурацияСтрока);
	Исключение
		ТиповаяКонфигурация = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТиповыеКонфигурации1С.ПустаяСсылка");
	КонецПопытки;	

КонецПроцедуры

&НаСервере
Процедура ОформлениеКартинкиКонвертацииСправочника(ИмяТипаСправочника, ЗначениеНастройки, КонвертацийНет)
		
	Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда 
		
		Если КонвертацийНет И ЗначениеНастройки = Истина Тогда
			
			Элементы["КартинкаКонвертация" + ИмяТипаСправочника].Картинка = БиблиотекаКартинок.КонтурЛогистика_Восклицание;
			
		Иначе
			
			Элементы["КартинкаКонвертация" + ИмяТипаСправочника].Картинка = БиблиотекаКартинок.КонтурЛогистика_Галочка;	
			
		КонецЕсли;
		
	Иначе
		
		Элементы["КартинкаКонвертация" + ИмяТипаСправочника].Картинка = Новый Картинка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформлениеСсылкиКонвертацииСправочника(ИмяТипаСправочника, ЕстьКонвертация)
	
	Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда 
		
		Если ЕстьКонвертация Тогда
			
			Элементы["СсылкаКонвертация" + ИмяТипаСправочника].Заголовок = "конвертация";
			
		Иначе
			
			Элементы["СсылкаКонвертация" + ИмяТипаСправочника].Заголовок = "Создать";
			
		КонецЕсли;
		
	Иначе
		
		Элементы["СсылкаКонвертация" + ИмяТипаСправочника].Заголовок = "Создать";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформлениеТумблераКонвертацииСправочника(ИмяТипаСправочника, ЕстьКонвертация)
	
	Элементы["Вкл" + ИмяТипаСправочника].Видимость = Не ЕстьКонвертация;
	Элементы["Выкл" + ИмяТипаСправочника].Видимость = ЕстьКонвертация;
	
КонецПроцедуры

&НаКлиенте
Процедура ВклНажатие(Элемент)
	
	ИмяСправочникаБезПрефикса = СтрЗаменить(Элемент.Имя, "Вкл", "");
	
	ВклВыклНастройкуАвтоконвертацииНаСервере(ИмяСправочникаБезПрефикса, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыклНажатие(Элемент)
	
	ИмяСправочникаБезПрефикса = СтрЗаменить(Элемент.Имя, "Выкл", "");
	
	ВклВыклНастройкуАвтоконвертацииНаСервере(ИмяСправочникаБезПрефикса);
	
КонецПроцедуры

&НаСервере
Процедура ВклВыклНастройкуАвтоконвертацииНаСервере(ИмяСправочника, Включить = Истина)
	
	ИмяПредопределенного = "Автоконвертация_КонтурЛогистика_" + ИмяСправочника;
	НастройкаАвтоконвертации = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	
	Если ЗначениеЗаполнено(НастройкаАвтоконвертации) Тогда 
	
		ОбъектНастройки = НастройкаАвтоконвертации.ПолучитьОбъект();
		ОбъектНастройки.Значение = Включить;
		ОбъектНастройки.Записать();
	
	КонецЕсли;
	
	КонвертацийНет = Элементы["СсылкаКонвертация" + ИмяСправочника].Заголовок = "Создать";
	
	ОформлениеКартинкиКонвертацииСправочника(ИмяСправочника, Включить, КонвертацийНет);  
	ОформлениеТумблераКонвертацииСправочника(ИмяСправочника, Включить);
	
	ПеречитатьОшибки();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура УдалитьОбязательныеОбщиеНастройки()

	Для Каждого ИмяНастройки Из МассивИменОбязательныхОбщихНастроек() Цикл 
	
		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяНастройки, "");
	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОбязательныеОбщиеНастройки()

	ТаблицаНастроек = Справочники.КонтурЛогистика_Настройки.ПолучитьГруппу_ОсобенностиХраненияДанных(Истина);

	Для Каждого Настройка Из ТаблицаНастроек Цикл 
		
		// Пропускаем группы
		Если Настройка.Ссылка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;

		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(Настройка.ИмяНастройки, Настройка.Значение);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МассивИменОбязательныхОбщихНастроек()

	Массив = Новый Массив;
	
	Массив.Добавить("ИмяПВХДопСвойства");
	Массив.Добавить("ИмяРегистраДопСвойства");
	Массив.Добавить("ИмяСправочникаЕдиницаИзмерения");
	Массив.Добавить("ИмяСправочникаНоменклатура");
	Массив.Добавить("ИмяСправочникаПользователи");
	Массив.Добавить("ИмяСправочникаВалюты");
	Массив.Добавить("ИмяСправочникаУпаковка");
	Массив.Добавить("ИмяСправочникаХарактеристика");

	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура УправлениеВидимостьюДоступностьюЭлементовНастроек()
	
	// Типовая конфигурация
	
	Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда 
		
		Элементы.ТиповаяКонфигурация.Доступность = Ложь;
		Элементы.ТиповаяКонфигурация.Заголовок = "Конфигурация, записанная в общих настройках";
		
		Элементы.ПодтвердитьКонфигурацию.Видимость 	= Ложь;
		Элементы.ИзменитьКонфигурацию.Видимость 	= Истина;
		
		Элементы.ГруппаСозданныеНастройки.Видимость = Ложь;
		
		Элементы.ГруппаИмяСправочникаХарактеристика.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() 
																	И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики"); 
		
	Иначе	
		
		Элементы.ТиповаяКонфигурация.Доступность = Истина;
		Элементы.ТиповаяКонфигурация.Заголовок = "Ваша типовая конфигурация";
		
		Элементы.ПодтвердитьКонфигурацию.Видимость 	= Истина;
		Элементы.ИзменитьКонфигурацию.Видимость 	= Ложь;
		
		Элементы.ГруппаСозданныеНастройки.Видимость = Истина;
		
	КонецЕсли;	
	
	// Общие настройки
	
	// Нвстройки конвертации документов
	
	ЕстьГО = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиГОВОрганизациях();
	ЕстьГП = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиГПВОрганизациях();
	ЕстьПВ = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиПВВОрганизациях();

	Элементы.ГруппаКонвертацияТ1.Видимость = ЕстьГО;
	Элементы.ГруппаКонвертацияТ2.Видимость = ЕстьПВ;
	Элементы.ГруппаКонвертацияТ3.Видимость = ЕстьГП Или ЕстьГО;
	Элементы.ГруппаКонвертацияТ4.Видимость = ЕстьПВ;
	Элементы.ГруппаКонвертацияТ5.Видимость = ЕстьПВ;
	Элементы.ГруппаКонвертацияТ6.Видимость = ЕстьГО;
	Элементы.ГруппаКонвертацияТ7.Видимость = ЕстьПВ;
	Элементы.ГруппаКонвертацияТ8.Видимость = ЕстьПВ;
	
	Элементы.ГруппаКонвертацияТ1_ЗЗ.Видимость = ИспользуютсяЗаказЗаявки И ЕстьГО;
	Элементы.ГруппаКонвертацияТ2_ЗЗ.Видимость = ИспользуютсяЗаказЗаявки И ЕстьПВ;

	ЕстьОформитель 	= Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашаРольВОрганизациях("Оформитель");
	ЕстьМедик 		= Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашаРольВОрганизациях("Медик");
	ЕстьТехОсмотр 	= Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашаРольВОрганизациях("ТехОсмотр");
	ЕстьОдометр 	= Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашаРольВОрганизациях("Одометр");
	
	Элементы.ГруппаКонвертацияТ1_ПЛ.Видимость = ИспользуютсяПутевыеЛисты И ЕстьОформитель;
	Элементы.ГруппаКонвертацияТ2_ПЛ.Видимость = ИспользуютсяПутевыеЛисты И ЕстьМедик;
	Элементы.ГруппаКонвертацияТ3_ПЛ.Видимость = ИспользуютсяПутевыеЛисты И ЕстьТехОсмотр;
	Элементы.ГруппаКонвертацияТ4_ПЛ.Видимость = ИспользуютсяПутевыеЛисты И ЕстьОдометр;
	Элементы.ГруппаКонвертацияТ5_ПЛ.Видимость = ИспользуютсяПутевыеЛисты И ЕстьОдометр;
	Элементы.ГруппаКонвертацияТ6_ПЛ.Видимость = ИспользуютсяПутевыеЛисты И ЕстьМедик;
		
	Элементы.ГруппаКонвертацияТ1_5_02_ПЛ.Видимость = (ИспользуютсяПутевыеЛисты_5_02 Или ИспользуютсяПутевыеЛисты) И ЕстьОформитель;
	Элементы.ГруппаКонвертацияТ2_5_02_ПЛ.Видимость = (ИспользуютсяПутевыеЛисты_5_02 Или ИспользуютсяПутевыеЛисты) И ЕстьМедик;
	Элементы.ГруппаКонвертацияТ3_5_02_ПЛ.Видимость = (ИспользуютсяПутевыеЛисты_5_02 Или ИспользуютсяПутевыеЛисты) И ЕстьОформитель;
	Элементы.ГруппаКонвертацияТ4_5_02_ПЛ.Видимость = (ИспользуютсяПутевыеЛисты_5_02 Или ИспользуютсяПутевыеЛисты) И ЕстьОформитель;
	Элементы.ГруппаКонвертацияТ5_5_02_ПЛ.Видимость = (ИспользуютсяПутевыеЛисты_5_02 Или ИспользуютсяПутевыеЛисты) И ЕстьМедик;
	
	Если ИспользуютсяПутевыеЛисты И Не ЕстьОформитель И Не ЕстьМедик И Не ЕстьТехОсмотр И Не ЕстьОдометр Тогда
		Сообщить("Не указаны роли путевого листа ни для одной организации");
	КонецЕсли;
	
	Элементы.ГруппаКонвертацияТ1.Видимость = ИспользуютсяТРН И ЕстьГО;
	Элементы.ГруппаКонвертацияТ2.Видимость = ИспользуютсяТРН И ЕстьПВ;
	Элементы.ГруппаКонвертацияТ3.Видимость = ИспользуютсяТРН И ЕстьГП;
	Элементы.ГруппаКонвертацияТ4.Видимость = ИспользуютсяТРН И ЕстьПВ;
	Элементы.ГруппаКонвертацияТ5.Видимость = ИспользуютсяТРН И ЕстьПВ;
	Элементы.ГруппаКонвертацияТ6.Видимость = ИспользуютсяТРН И ЕстьГО;
	Элементы.ГруппаКонвертацияТ7.Видимость = ИспользуютсяТРН И ЕстьПВ;
	Элементы.ГруппаКонвертацияТ8.Видимость = ИспользуютсяТРН И ЕстьПВ;
	
	// Нвстройки конвертации справочников
	
КонецПроцедуры


// Конец СтраницаНастройки

&НаКлиенте
Процедура УстановитьДоступностьКнопкиДалее()
	
	КнопкаДалее = Элементы.Далее;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ВводЛогинаПароля Тогда 
		
		РежимАвторизацииПоАпиКей = (РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.ApiKey"));
		РежимАвторизацииНаПортале = (РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow"));
		
		КнопкаДалее.Доступность = API_АвторизацияЛогинПарольУспешна = Истина Или РежимАвторизацииПоАпиКей Или РежимАвторизацииНаПортале;
		КнопкаДалее.Заголовок 	= "Далее";
		
		Элементы.ВводЛогинаПароля_ПроверитьПодключение.Видимость = НЕ РежимАвторизацииПоАпиКей И НЕ API_АвторизацияЛогинПарольУспешна = Истина;
		Элементы.API_АвторизацияЛогинПарольУспешна.Видимость = Не РежимАвторизацииПоАпиКей;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации
		Или Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность
		Или Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки
		Или Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПрав Тогда
		
		КнопкаДалее.Доступность = Истина;
		КнопкаДалее.Заголовок = "Далее";
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПодписания Тогда
		
		КнопкаДалее.Доступность = Истина;
		КнопкаДалее.Заголовок = "Завершить";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ВводЛогинаПароля Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПрав;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПрав Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПодписания;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПодписания Тогда
		
		Метрика_ПриступитьКРаботе = Истина;
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ВводЛогинаПароля;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПрав Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПодписания Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкиПрав;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент = Неопределено, ТекущаяСтраница)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации Тогда
		
		ПеречитатьМоиОрганизацииНаСервере();
		
		РежимOIDCDeviceFlow = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow");
		АвторизацияНаПортале = (РежимАвторизации = РежимOIDCDeviceFlow);
		Если АвторизацияНаПортале Тогда
			Элементы.ГруппаТребуетсяАвторизация.Видимость = (Не КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьПортальныеАвторизации());
		Иначе
			Элементы.ГруппаТребуетсяАвторизация.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьОрганизацииИРолиВНачальныеДанныеДляМетрик();
		
		ДопИнформация = Новый Структура("КоличествоОрганизаций", Формат(ОрганизацииДиадокИРоли.Количество(), "ЧН=0; ЧГ=0"));
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Стартовый помощник", "Открыть список", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Организации",, ДопИнформация);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		
		ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
		Если Не ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда
			// Попытаемся определить
			ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСервер.ОпределитьКонфигурацию();
			Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда
				УстановитьПервичныеНастройкиДляКонфигурации();
			КонецЕсли;
		КонецЕсли;
		
		ПеречитатьНастройкиНаСервере();
		
		Если ЗначениеЗаполнено(ИдентификаторФЗ_ПроверитьОбновление) Тогда
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Истина);
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьОбновления", 1, Истина);
		Иначе
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь);
		КонецЕсли;
		
		Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Ложь;
		
		Если ОтображатьДополнитильныеРекизитыУчСист Тогда
			ПроверитьОбновленияНаКлиенте("ДополнительныеРеквизиты", Истина);
		КонецЕсли;
		
		Если ИмяКонфигурации1С = "УАТ_ПРОФ"
			Или ИмяКонфигурации1С = "ERP_УАТ"
			Или ИмяКонфигурации1С = "ТЛЭ" Тогда
			
			Если ПередаватьQRВМПВодительУАТ И Не Элементы.ГруппаПредупреждениеQR.Видимость Тогда
				ПроверитьОбновленияНаКлиенте("QR_МП_УАТ");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИспользуютсяПутевыеЛисты Или ИспользуютсяПутевыеЛисты_5_02 Тогда
			
			ОрганизацияМедика = Неопределено;
			КоличествоНашихОрганизацийМедиков = 0;
			КоличествоНашихОрганизацийСВнешнимМедиком = 0;
			
			Для Каждого ТекущаяСтрока Из ОрганизацииДиадокИРоли Цикл
				
				Если Не ТекущаяСтрока.Наша Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТекущаяСтрока.РольОформитель И Не ТекущаяСтрока.РольМедик Тогда
					КоличествоНашихОрганизацийСВнешнимМедиком = КоличествоНашихОрганизацийСВнешнимМедиком + 1;
				КонецЕсли;
				
				Если ТекущаяСтрока.РольМедик Тогда
					КоличествоНашихОрганизацийМедиков = КоличествоНашихОрганизацийМедиков + 1;
					ОрганизацияМедика = ТекущаяСтрока.ОрганизацияДиадок;
				КонецЕсли;
				
			КонецЦикла;
			
			// Зададим вопрос
			Если КоличествоНашихОрганизацийМедиков = 1 Тогда
				МедЛицензияПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
					ОрганизацияМедика, "МедЛицензияПоУмолчанию");
				Если Не ЗначениеЗаполнено(МедЛицензияПоУмолчанию) Тогда
					// Выберем лицензию
					ТекстВопроса = "У вас есть организация с ролью медика.
						|Хотите выбрать медицинскую лицензию по умолчанию?";
					ДополнительныеПараметры = Новый Структура("ОрганизацияМедика", ОрганизацияМедика);
					КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
						ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,,, ЭтаФорма, "ВыборМедЛицензияПоУмолчаниюПродолжение", ДополнительныеПараметры);
				КонецЕсли;
			ИначеЕсли КоличествоНашихОрганизацийСВнешнимМедиком > 0 Тогда
				ОрганизацияМедикПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_ОрганизацияМедикПоУмолчанию");
				Если Не ЗначениеЗаполнено(ОрганизацияМедикПоУмолчанию) Тогда
					// Выберем организацию внешнего медика
					ТекстВопроса = "У вас есть организация без роли медика.
						|Хотите выбрать организацию внешнего медика по умолчанию?";
					КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
						ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,,, ЭтаФорма, "ВыборОрганизацияМедикПоУмолчаниюПродолжение");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьКнопкиДалее();
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	Элементы.Назад.Видимость = (Элементы.Страницы.ТекущаяСтраница <> Элементы.ВводЛогинаПароля);
	
	НачальныеДанныеДляМетрик.Вставить(Элементы.Страницы.ТекущаяСтраница.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборМедЛицензияПоУмолчаниюПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_Лицензии.ФормаВыбора",, ЭтаФорма, ЭтаФорма,
		"ВыборМедЛицензияПоУмолчаниюЗавершение", ДополнительныеПараметры, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборМедЛицензияПоУмолчаниюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("ОрганизацияМедика") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМедЛицензияПоУмолчанию(ДополнительныеПараметры.ОрганизацияМедика, Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьМедЛицензияПоУмолчанию(ОрганизацииДиадок, МедЛицензияПоУмолчанию)
	
	ОрганизацияОбъект = ОрганизацииДиадок.ПолучитьОбъект();
	ОрганизацияОбъект.МедЛицензияПоУмолчанию = МедЛицензияПоУмолчанию;
	ОрганизацияОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрганизацияМедикПоУмолчаниюПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.ФормаВыбора",, ЭтаФорма, ЭтаФорма,
		"ВыборОрганизацияМедикПоУмолчаниюЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрганизацияМедикПоУмолчаниюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНастройку("ПЛ_ОрганизацияМедикПоУмолчанию", Результат);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРольАдминистратора()
	
	Элементы.ГруппаНетНиОдногоПользователя.Видимость = Ложь;
	
	РольАдминаКЛ = Метаданные.Роли.Найти("КонтурЛогистика_ПолныеПраваЛогистика");
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистраторУчетнойСистемы()
		И Не РольДоступна(РольАдминаКЛ) Тогда
		
		ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		Если ТекущийПользовательИБ.Имя = "" Тогда
			Элементы.ГруппаНетНиОдногоПользователя.Видимость = Истина;
		Иначе
			ТекущийПользовательИБ.Роли.Добавить(РольАдминаКЛ);
			ТекущийПользовательИБ.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьТитул(ТипТитула, НомерТитула)
	
	ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов[ТипТитула + НомерТитула];
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ТипДокумента);
	
	Возврат КонтекстНастройкиКонвертации.ЕстьКонвертация;
	
КонецФункции

&НаКлиенте
Процедура ТекстКонвертацияНажатие(Элемент)
	
	НомерТитула = СтрЗаменить(Элемент.Имя, "ТекстКонвертацияТ", "");

	Если Не Найти(Элемент.Имя,"_ПЛ") = 0 Тогда 
		НомерТитула 	= СтрЗаменить(НомерТитула, "_ПЛ", "");
		ТипДокумента 	= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул" + НомерТитула);
	ИначеЕсли Не Найти(Элемент.Имя,"_ЗЗ") = 0 Тогда
		НомерТитула 	= СтрЗаменить(НомерТитула, "_ЗЗ", "");
		ТипДокумента 	= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул" + НомерТитула);
	Иначе
		ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул" + НомерТитула);
	КонецЕсли;	
	
	Настройка = ПолучитьНастройкуКонвертацииДокументов(ТипДокумента);	
	
	Если Настройка = Неопределено Тогда 
		
		ПараметрыФормы = Новый Структура("ТипДокументаЛогистика", ТипДокумента);
		
	Иначе	
		
		ПараметрыФормы = Новый Структура("Ключ", Настройка);	
		
	КонецЕсли;	
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаЭлемента",
		ПараметрыФормы, 
		ЭтаФорма,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройку_(ИмяПредопределенного)

	Возврат Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкуКонвертацииДокументов(ТипДокумента)
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ТипДокумента);
	
	Если КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации Тогда
		Возврат КонтекстНастройкиКонвертации.НастройкаКонвертации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкуКонвертацииСправочников(ТипСправочника)
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
		ТипСправочника);
	
	Если КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации Тогда
		Возврат КонтекстНастройкиКонвертации.НастройкаКонвертации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СсылкаКонвертацияНажатие(Элемент)
	
	ТипСправочника = "КонтурЛогистика_" + СтрЗаменить(Элемент.Имя, "СсылкаКонвертация", "");
	
	Если Элемент.Заголовок = "Создать" Тогда
		
		ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаЭлемента";
		ПараметрыФормы = Новый Структура("ТипСправочникаЛогистика", ТипСправочника);
		
	ИначеЕсли Элемент.Заголовок = "1 конвертация" Тогда 
		
		Настройка = ПолучитьНастройкуКонвертацииСправочников(ТипСправочника);
		
		ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаЭлемента";
		ПараметрыФормы = Новый Структура("Ключ", Настройка);
		
	Иначе 
		
		ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаСписка";
		ПараметрыФормы = Неопределено;
		
	КонецЕсли;	
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяФормыСправочника,
		ПараметрыФормы, 
		ЭтаФорма,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьОшибки(ОткрытьСтраницуСОшибкой = Ложь)
	
	Результат = КонтурЛогистика_ОбщегоНазначенияСервер.НеобходимыеНастройкиДляРаботыПодсистемыЗаполнены();
	
	Если ЗначениеЗаполнено(Результат.ТекстДействия) Тогда
		
		Если ОткрытьСтраницуСОшибкой И (API_АвторизацияЛогинПарольУспешна = Истина 
				Или РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow) Тогда 
			
			Элементы.Страницы.ТекущаяСтраница = Элементы[Результат.ТекСтраницаПомошника];
			
			Если Элементы.Страницы.ТекущаяСтраница = Элементы.МоиОрганизации Тогда
				
				ПеречитатьМоиОрганизацииНаСервере();
				
			ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
				
				ПеречитатьНастройкиНаСервере();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОрганизацииДиадокИРолиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Ложь Или ЗавершениеРаботы = Неопределено Тогда
		Оповестить("ОбновитьРабочийСтол");
		Оповестить("ВыполнитьОбменНаРабочемСтоле");
		ОтправитьМетрики();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстИмяСправочникаНажатие(Элемент)
	
	ИмяПредпопределнного = СтрЗаменить(Элемент.Имя, "Текст", "");
	
	НастройкаСсылка = ПолучитьНастройку_(ИмяПредпопределнного);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Настройки.Форма.ФормаЭлемента",
		Новый Структура("Ключ", НастройкаСсылка),                                                                                                 
		ЭтаФорма,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЧтоТакоеApiKeyНажатие(Элемент)
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПерейтиПоСсылке("https://developer.kontur.ru/doc/logistics.api");
КонецПроцедуры

&НаКлиенте
Процедура РежимАвторизацииПриИзменении(Элемент)
	
	УстановитьНастройку("РежимАвторизации", РежимАвторизации);
	ПеречитатьОшибки();
	УстановитьДоступностьКнопкиДалее();
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	Оповестить("КонтурЛогистика_Аутентификация");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение, СтартовыйПомощникОткрываетПользовательСБазовымиПравами = Неопределено)
	
	Если ЗначениеЗаполнено(СтартовыйПомощникОткрываетПользовательСБазовымиПравами)
		И СтартовыйПомощникОткрываетПользовательСБазовымиПравами = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ЗначениеЗаполнено(СтартовыйПомощникОткрываетПользовательСБазовымиПравами)
		И СтартовыйПомощникОткрываетПользовательСБазовымиПравами = Истина Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьНастройкуОрганизации(ОрганизацияДиадокСсылка, НастройкаОрганизации, УстанавливаемоеЗначение)
	
	Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(ОрганизацияДиадокСсылка, НастройкаОрганизации, УстанавливаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииДиадокИРолиApiKeyПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОрганизацииДиадокИРоли.ТекущиеДанные;
	
	УстановитьНастройкуОрганизации(ТекДанные.ОрганизацияДиадок,
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey"),
		ТекДанные.ApiKey);
		
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииДиадокИРолиApiKeyНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОрганизацииДиадокИРоли.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("КлючАПИ", ТекДанные.ApiKey);
		
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВводаАпиКлюча", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"ПослеВводаApiKey",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаApiKey(НовоеЗначение, ДополнительныеПараметры) Экспорт
	
	ТекДанные = Элементы.ОрганизацииДиадокИРоли.ТекущиеДанные;
	
	Если НовоеЗначение = Неопределено Тогда
		Возврат;	 		
	КонецЕсли;
	
	ТекДанные.ApiKey = НовоеЗначение;
	
	УстановитьНастройкуОрганизации(ТекДанные.ОрганизацияДиадок,
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey"),
		НовоеЗначение);
		
	УстановитьНастройкуОрганизации(ТекДанные.ОрганизацияДиадок,
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики"),
		ЗначениеЗаполнено(НовоеЗначение)); 
		
	ПеречитатьОшибки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяЗаказЗаявкиПриИзменении(Элемент)
		
	УстановитьНастройку("ИспользуетсяЗаказЗаявка", ИспользуютсяЗаказЗаявки, ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	Оповестить("ОбновитьРабочийСтол");
	
	Если ИспользуютсяЗаказЗаявки Тогда
		Организации = КонтурЛогистика_ОбщегоНазначенияСервер.НашиСНастройкойЧтениеЛентыДД(Ложь);
		Если Организации.Количество() > 0 Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
				"Есть организации с выключенной настройкой чтения ленты Диадок. Статусы документов обновляться не будут");
		КонецЕсли;
	КонецЕсли;
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяПутевыеЛистыПриИзменении(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502() Тогда 
		УстановитьНастройку("ИспользуетсяПутевойЛист", Ложь, ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
		УстановитьНастройку("ИспользуетсяПутевойЛист_5_02", ИспользуютсяПутевыеЛисты, ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
		ИспользуютсяПутевыеЛисты_5_02 = ИспользуютсяПутевыеЛисты;
	Иначе
		УстановитьНастройку("ИспользуетсяПутевойЛист", ИспользуютсяПутевыеЛисты, ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);		
	КонецЕсли;	
	
	Оповестить("ОбновитьРабочийСтол");
	
	ОбновитьВидимостьТестовыхОрганизаций();
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяЗаказНарядыПриИзменении(Элемент)
	УстановитьНастройку("ИспользуетсяЗаказНаряд", ИспользуютсяЗаказНаряды, ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	Оповестить("ОбновитьРабочийСтол");
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяЭкспедиторскиеДокументыПриИзменении(Элемент)
	
	ИспользуетсяПоручениеЭкспедитору = ИспользуютсяЭкспедиторскиеДокумент;
	ИспользуетсяЭкспедиторскаяРасписка = ИспользуютсяЭкспедиторскиеДокумент;
	ИспользуетсяСкладскаяРасписка = ИспользуютсяЭкспедиторскиеДокумент;
	
	УстановитьНастройку("ИспользуетсяПоручениеЭкспедитору", ИспользуетсяПоручениеЭкспедитору,
		ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	УстановитьНастройку("ИспользуетсяЭкспедиторскаяРасписка", ИспользуетсяЭкспедиторскаяРасписка,
		ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	УстановитьНастройку("ИспользуетсяСкладскаяРасписка", ИспользуетсяСкладскаяРасписка,
		ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	
	Оповестить("ОбновитьРабочийСтол");
	
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПоручениеЭкспедиторуПриИзменении(Элемент)
	
	УстановитьНастройку("ИспользуетсяПоручениеЭкспедитору", ИспользуетсяПоручениеЭкспедитору,
		ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	
	Оповестить("ОбновитьРабочийСтол");
	
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяЭкспедиторскаяРаспискаПриИзменении(Элемент)
	
	УстановитьНастройку("ИспользуетсяЭкспедиторскаяРасписка", ИспользуетсяЭкспедиторскаяРасписка,
		ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	
	Оповестить("ОбновитьРабочийСтол");
	
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяСкладскаяРаспискаПриИзменении(Элемент)
	
	УстановитьНастройку("ИспользуетсяСкладскаяРасписка", ИспользуетсяСкладскаяРасписка,
		ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	
	Оповестить("ОбновитьРабочийСтол");
	
	УправлениеВидимостьюДоступностью(ЭтаФорма);
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяТРНПриИзменении(Элемент)
	
	УстановитьНастройку("ИспользуетсяТРН", ИспользуютсяТРН, ТекущийПользовательСБазовымиПравамиМожетРедактироватьСП);
	Оповестить("ОбновитьРабочийСтол");
	
	ДокументыИзменены = Истина;
	
КонецПроцедуры

#Область ОбработкаКоманды_ПроверитьОбновления

&НаКлиенте
Процедура ПроверитьОбновленияНаКлиенте(ВидРасширения = "", ПроверитьНовоеОбновление = Ложь)
	
	Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
		
		РезультатЗапуска = КонтурЛогистика_ОбновлениеСервер.ПроверитьОбновления(
			АдресВХранилище_ПроверитьОбновлениеДополнительныеРеквизиты, ВидРасширения, УникальныйИдентификатор);
		
		Если РезультатЗапуска = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатЗапуска.Статус = "Выполнено" Тогда
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "ДополнительныеРеквизиты");
			Если ПроверитьНовоеОбновление Тогда
				ПроверитьНовоеОбновление_ДополнительныеРеквизиты();
			Иначе
				ЗаполнитьДанныеОбОбновленииНаФормеИзХранилища(
					АдресВХранилище_ПроверитьОбновлениеДополнительныеРеквизиты, ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты,
					АдресВХранилище_ЗагрузитьОбновлениеДополнительныеРеквизиты, ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты,
					"ДополнительныеРеквизиты");
			КонецЕсли; 
		Иначе
			ИдентификаторФЗ_ПроверитьОбновлениеДополнительныеРеквизиты = РезультатЗапуска.ИдентификаторЗадания;
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Истина, "ДополнительныеРеквизиты");
			Если ПроверитьНовоеОбновление Тогда
				ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьНовоеОбновление_ДополнительныеРеквизиты", 1, Истина);
			Иначе
				ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьОбновления_ДополнительныеРеквизиты", 1, Истина);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
		
		РезультатЗапуска = КонтурЛогистика_ОбновлениеСервер.ПроверитьОбновления(
			АдресВХранилище_ПроверитьОбновлениеQR, ВидРасширения, УникальныйИдентификатор);
				
		Если РезультатЗапуска = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИдентификаторФЗ_ПроверитьОбновлениеQR = РезультатЗапуска.ИдентификаторЗадания;
		
		Если ЗначениеЗаполнено(ИдентификаторФЗ_ПроверитьОбновлениеQR) Тогда
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Истина, "QR_МП_УАТ");
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьОбновления_QR", 1, Истина);
		Иначе
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "QR_МП_УАТ");
			ЗаполнитьДанныеОбОбновленииНаФормеИзХранилища(
				АдресВХранилище_ПроверитьОбновлениеQR, ИдентификаторФЗ_ПроверитьОбновлениеQR,
				АдресВХранилище_ЗагрузитьОбновлениеQR, ИдентификаторФЗ_ЗагрузитьОбновлениеQR,
				"QR_МП_УАТ");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеОбОбновленииНаФормеИзХранилища(АдресВХранилище_Проверить, ИдентификаторФЗ_Проверить, АдресВХранилище_Загрузить, ИдентификаторФЗ_Загрузить, ВидРасширения = "")
	
	СтруктураОбновленияВерсии = ПолучитьИзВременногоХранилища(АдресВХранилище_Проверить);
	
	Если СтруктураОбновленияВерсии = Неопределено Тогда
		
		ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, ВидРасширения);
		
	Иначе
		
		ИдентификаторФЗ_Проверить = "";
		ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, ВидРасширения);
		
		Если Не СтруктураОбновленияВерсии.Успешно Тогда
			
			Если ЗначениеЗаполнено(СтруктураОбновленияВерсии.Ошибка) Тогда
				
				СообщениеОбОшибке = Новый СообщениеПользователю();
				СообщениеОбОшибке.Текст = СтруктураОбновленияВерсии.Ошибка;
				СообщениеОбОшибке.Сообщить();
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(СтруктураОбновленияВерсии.СсылкаНаЗагрузку) Тогда
				НачатьЗагрузкуОбновления(АдресВХранилище_Загрузить, ИдентификаторФЗ_Загрузить, СтруктураОбновленияВерсии.СсылкаНаЗагрузку, ВидРасширения);
			Иначе
				
				Если Не ЗначениеЗаполнено(ВидРасширения) И ОтображатьДополнитильныеРекизитыУчСист Тогда
					ПроверитьОбновленияНаКлиенте("ДополнительныеРеквизиты", Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму_ЗапущенаПроверкаОбновления(ПроверкаВыполняется, ВидРасширения = "")
	
	Если ВидРасширения = "ДополнительныеРеквизиты" Тогда 
		Элементы.ЛоадерПроверитьОбновлениеДополнительныеРеквизиты.Видимость = ПроверкаВыполняется;
		Элементы.ДекорацияПроверкаОбновленияДополнительныеРеквизиты.Видимость = ПроверкаВыполняется;
		Элементы.НастроитьДополнительныеРеквизиты.Видимость = ОтображатьДополнитильныеРекизитыУчСист;
	ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
		Элементы.ЛоадерПроверитьОбновлениеQR.Видимость = ПроверкаВыполняется;
		Элементы.ДекорацияПроверкаОбновленияQR.Видимость = ПроверкаВыполняется;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуОбновления(Адрес, ИдентификаторФЗ, СсылкаНаЗагрузку, ВидРасширения = "")
	
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Истина, ВидРасширения);
	
	Адрес = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("СсылкаНаЗагрузку", СсылкаНаЗагрузку);
	
	РезультатЗапуска = КонтурЛогистика_ОбновлениеКлиент.НачатьЗагрузкуДанных(
		Адрес, ПараметрыФоновогоЗадания);
	
	Если РезультатЗапуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапуска.Статус = "Выполнено" Тогда
		Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
			УстановитьОбновлениеПослеЗагрузки_ДополнительныеРеквизиты();
		ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
			УстановитьОбновлениеПослеЗагрузки_QR();
		КонецЕсли;
	Иначе
		ИдентификаторФЗ = РезультатЗапуска.ИдентификаторЗадания;
		Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ЗагрузитьОбновление_ДополнительныеРеквизиты", 1, Истина);
		ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ЗагрузитьОбновление_QR", 1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму_ЗапущенаЗагрузкаОбновления(ЗагрузкаВыполняется, ВидРасширения = "")
	
	Если ВидРасширения = "ДополнительныеРеквизиты" Тогда
		Элементы.ЛоадерПроверитьОбновлениеДополнительныеРеквизиты.Видимость = ЗагрузкаВыполняется;
		Элементы.ДекорацияЗагрузкаОбновленияДополнительныеРеквизиты.Видимость = ЗагрузкаВыполняется;
	ИначеЕсли ВидРасширения = "QR_МП_УАТ" Тогда
		Элементы.ЛоадерПроверитьОбновлениеQR.Видимость = ЗагрузкаВыполняется;
		Элементы.ДекорацияЗагрузкаОбновленияQR.Видимость = ЗагрузкаВыполняется;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗавершитьРаботуСистемы(Ложь, Истина);
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкиДополнительногоРасширения()
	
	ГруппаНастроек = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "НастройкиОтображенияПанелиВУчетныхДокументах");
	Если ГруппаНастроек.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект = ГруппаНастроек.ПолучитьОбъект();
	СправочникОбъект.Удалить();
	
КонецПроцедуры

#КонецОбласти

#Область ТестовыеОрганизации

&НаКлиенте
Процедура ОбновитьВидимостьТестовыхОрганизаций()
	
	Элементы.ПоясненияМедикаТестоваяОрганизация.Видимость = ИспользуютсяПутевыеЛисты;
	Элементы.ГруппаМедикТестовыеОрганизации.Видимость = ИспользуютсяПутевыеЛисты;
	
	ИдентификаторыТестовыхОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ИдентификаторыТестовыхОрганизаций();
	
	Для Каждого ТекущаяСтрока Из ИдентификаторыТестовыхОрганизаций Цикл
		ИмяЭлемента = "ТестоваяОрганизация" + ТекущаяСтрока.Ключ;
		ТекущаяОрганизация = ЭтаФорма[ИмяЭлемента];
		ОрганизацияЗаполнена = ЗначениеЗаполнено(ТекущаяОрганизация);
		
		Элементы[ТекущаяСтрока.Ключ + "ВыклТестовыеОрганизации"].Видимость = Не ОрганизацияЗаполнена;
		Элементы[ТекущаяСтрока.Ключ + "ВклТестовыеОрганизации"].Видимость = ОрганизацияЗаполнена;
		Элементы[ИмяЭлемента].Видимость = ОрганизацияЗаполнена;
		
		Если ОрганизацияЗаполнена Тогда
			СвязанныеОбъекты = СвязанныеОбъектыОрганизации(ТекущаяОрганизация);
			Элементы[ТекущаяСтрока.Ключ + "СопоставитьТестовуюОрганизацию"].Видимость = (СвязанныеОбъекты.Количество() = 0);
		Иначе
			Элементы[ТекущаяСтрока.Ключ + "СопоставитьТестовуюОрганизацию"].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыклТестовыеОрганизацииНажатие(Элемент)
	
	РольОрганизации = СтрЗаменить(Элемент.Имя, "ВыклТестовыеОрганизации", "");
	
	СоздатьНайтиТекстовыеОрганизации(РольОрганизации);
	
	ОбновитьВидимостьТестовыхОрганизаций();
	
	ОрганизацияСсылка = ЭтаФорма["ТестоваяОрганизация" + РольОрганизации];
	Если ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		СвязанныеОбъекты = СвязанныеОбъектыОрганизации(ОрганизацияСсылка);
		
		Если СвязанныеОбъекты.Количество() = 0 Тогда
			// Необходимо сопоставить организацию
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Организация", ОрганизацияСсылка);
			
			ИмяФормыСправочника = "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаПодбораСвязанныхОбъектов";
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
				"СопоставлениеТестовойОрганизацииЗавершение", РольОрганизации, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
		// Проверяем наличие приглашения и отправляем если требуется
		ПроверкаОтправкаПриглашенийСТестовымиОрганизациями(, ОрганизацияСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВклТестовыеОрганизацииНажатие(Элемент)
	
	РольОрганизации = СтрЗаменить(Элемент.Имя, "ВклТестовыеОрганизации", "");
	
	ОрганизацияСсылка = ЭтаФорма["ТестоваяОрганизация" + РольОрганизации];
	
	Если Не ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПометитьНаУдалениеОрганизацию(ОрганизацияСсылка);
	
	ЭтаФорма["ТестоваяОрганизация" + РольОрганизации] = Неопределено;
	
	ОбновитьВидимостьТестовыхОрганизаций();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТестовыхОрганизаций()
	
	ИдентификаторыТестовыхОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ИдентификаторыТестовыхОрганизаций();
	
	Для Каждого ТекущаяСтрока Из ИдентификаторыТестовыхОрганизаций Цикл
		ОрганизацияСсылка = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("ИдентификаторУчастникаЭДО", ТекущаяСтрока.Значение);
		
		Если ОрганизацияСсылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЭлемента = "ТестоваяОрганизация" + ТекущаяСтрока.Ключ;
		ЭтаФорма[ИмяЭлемента] = ОрганизацияСсылка;
		Элементы[ИмяЭлемента].Видимость = ЗначениеЗаполнено(ОрганизацияСсылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНайтиТекстовыеОрганизации(РольОрганизации = "")
	
	ИдентификаторыТестовыхОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ИдентификаторыТестовыхОрганизаций();
	
	ТестовыеОрганизации = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ИдентификаторыТестовыхОрганизаций Цикл
		Если РольОрганизации <> "" И ТекущаяСтрока.Ключ <> РольОрганизации Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиСоздатьПоИдентификаторуЭДО(ТекущаяСтрока.Значение);
		
		ТестовыеОрганизации.Добавить(НоваяОрганизация);
		ЭтаФорма["ТестоваяОрганизация" + ТекущаяСтрока.Ключ] = НоваяОрганизация;
		
		// Дополним телефоном и снимаем пометку удаления (если была)
		ОрганизацияОбъект = НоваяОрганизация.ПолучитьОбъект();
		ОрганизацияОбъект.ПометкаУдаления = Ложь;
		ОрганизацияОбъект.ТелефонОсновной = "хххххххххх";
		ОрганизацияОбъект[РольОрганизации] = Истина;
		ОрганизацияОбъект.Записать();
	КонецЦикла;
	
	Если ТестовыеОрганизации.Количество() <> 0 Тогда
		Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(ТестовыеОрганизации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвязанныеОбъектыОрганизации(Организация)
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты(Организация);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеОрганизацию(Организация)
	
	ОрганизацияОбъект = Организация.ПолучитьОбъект();
	ОрганизацияОбъект.ПометкаУдаления = Истина;
	ОрганизацияОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьТестовуюОрганизацию(Команда)
	
	РольОрганизации = СтрЗаменить(ТекущийЭлемент.Имя, "СопоставитьТестовуюОрганизацию", "");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", ЭтаФорма["ТестоваяОрганизация" + РольОрганизации]);
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаПодбораСвязанныхОбъектов";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"СопоставлениеТестовойОрганизацииЗавершение", РольОрганизации, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеТестовойОрганизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	РольОрганизации = ДополнительныеПараметры;
	
	СвязанныеОбъекты = СвязанныеОбъектыОрганизации(ЭтаФорма["ТестоваяОрганизация" + РольОрганизации]);
	Элементы[РольОрганизации + "СопоставитьТестовуюОрганизацию"].Видимость = (СвязанныеОбъекты.Количество() = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаказТестовыхДокументов(Команда)
	
	// Проверяем наличие тестового грузоотправителя, иначе не даем заказать
	Если Не ЗначениеЗаполнено(ТестоваяОрганизацияГрузоотправитель) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо включить тестового грузоотправителя";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Возврат;
	КонецЕсли;
	
	// Ищем, есть ли наш ПВ
	ПодставитьЮрЛицо = НашПеревозчикИлиГрузополучатель();
	
	Адрес = "https://forms.kontur.ru/form/df9b0b5e-ed08-4b9f-ba1b-6cbdf3360309?docs_number=3";
	
	Если ПодставитьЮрЛицо <> Неопределено Тогда 
		Постфикс = ПостфиксЗаказаТРН(ПодставитьЮрЛицо);
	Иначе
		Постфикс = "";
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2_13() Тогда
		
		ЗапуститьПриложение(Адрес + Постфикс);
	Иначе
		ПерейтиПоНавигационнойСсылке(Адрес + Постфикс);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПостфиксЗаказаТРН(ПодставитьЮрЛицо)
	
	Постфикс = "&my_company.name=" + ПодставитьЮрЛицо.НаименованиеОрганизацииПолное + "&my_company.inn=" + ПодставитьЮрЛицо.ИНН + "&my_company.kpp=" + ПодставитьЮрЛицо.КПП;
	Возврат Постфикс;
	
КонецФункции

&НаСервере
Функция НашПеревозчикИлиГрузополучатель()
	
	НайденныйГП = Неопределено;
	МассивНашихОрганизаций = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	// Вернем сразу перевозчика, а если перевозчиков нет, то ГП
	Для Каждого НашаОрганизация Из МассивНашихОрганизаций Цикл 
		
		Если НашаОрганизация.Перевозчик Тогда 
			Возврат НашаОрганизация;
		КонецЕсли;
		
		Если НашаОрганизация.Грузополучатель и НайденныйГП = Неопределено Тогда 
			НайденныйГП = НашаОрганизация;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныйГП;
	
КонецФункции

&НаСервере
Процедура ПроверкаОтправкаПриглашенийСТестовымиОрганизациями(Организация = Неопределено, Контрагент = Неопределено)
	
	Для Каждого ТекущаяНашаОрганизация Из ОрганизацииДиадокИРоли Цикл
		
		РеквизитыОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ТекущаяНашаОрганизация.ОрганизацияДиадок, "Наш, Грузоотправитель, Перевозчик, Грузополучатель, Медик");
		
		// Не наша
		Если Не РеквизитыОрганизации.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		// Нет ни одной роли
		Если Не РеквизитыОрганизации.Грузоотправитель
			И Не РеквизитыОрганизации.Перевозчик
			И Не РеквизитыОрганизации.Грузополучатель
			И Не РеквизитыОрганизации.Медик Тогда
			
			Продолжить;
		КонецЕсли;
		
		// Только по одной организации
		Если ЗначениеЗаполнено(Организация) И ТекущаяНашаОрганизация.ОрганизацияДиадок <> Организация Тогда
			Продолжить;
		КонецЕсли;
		
		// Если мы принимаем от всех организаций, то приглашения отправлять не требуется
		Если СокрЛП(ТекущаяНашаОрганизация.Sociability) = "AllOrganizations" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			
			// Проверяем наличие приглашения и отправляем если требуется
			Если Не ЕстьПриглашение(ТекущаяНашаОрганизация.ОрганизацияДиадок, Контрагент) Тогда
				КонтурЛогистика_API_Диадок.Диадок_АПИ_AcquireCounteragent(ТекущаяНашаОрганизация.ОрганизацияДиадок, Контрагент);
			КонецЕсли;
			
		Иначе
			
			ИдентификаторыТестовыхОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ИдентификаторыТестовыхОрганизаций();
			Для Каждого ТекущийИдентификатор Из ИдентификаторыТестовыхОрганизаций Цикл
				ИмяЭлемента = "ТестоваяОрганизация" + ТекущийИдентификатор.Ключ;
				ТекущийКонтрагент = ЭтаФорма[ИмяЭлемента];
				
				Если Не ЗначениеЗаполнено(ТекущийКонтрагент) Тогда
					Продолжить;
				КонецЕсли;
				
				// Проверяем наличие приглашения и отправляем если требуется
				Если Не ЕстьПриглашение(ТекущаяНашаОрганизация.ОрганизацияДиадок, ТекущийКонтрагент) Тогда
					КонтурЛогистика_API_Диадок.Диадок_АПИ_AcquireCounteragent(ТекущаяНашаОрганизация.ОрганизацияДиадок, ТекущийКонтрагент);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПриглашение(Организация, Контрагент)
	
	ЕстьПриглашение = Ложь;
	
	Counteragent = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetCounteragent(Организация, Контрагент);
	
	Если Counteragent.Свойство("ПартнерскиеОтношенияНеУстановлены") Тогда
		ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.NotInCounteragentList;
	КонецЕсли;
	
	Если Counteragent.Свойство("CurrentStatus") Тогда
		ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов[Counteragent.CurrentStatus];
	Иначе
		ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsMyCounteragent
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.InvitesMe
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsInvitedByMe Тогда
		
		ЕстьПриглашение = Истина;
	КонецЕсли;
	
	Возврат ЕстьПриглашение;
	
КонецФункции

&НаКлиенте
Процедура Заявка(Команда)
	
	ЗапуститьПриложение("https://kontur.ru/logistika#order");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииДиадокИРолиНашаПриИзменении(Элемент)
	
	ИмяРеквизита = "Наш";
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ОрганизацииДиадокИРоли.ТекущиеДанные;
	ОрганизацияСсылка =  ТекСтрока.ОрганизацияДиадок;
	
	УстановитьРеквизитОрганизацииДиадок(ИмяРеквизита, ОрганизацияСсылка);
	
	Если ТекСтрока.Наша Тогда
		
		УстановитьНастройкуОрганизации(ОрганизацияСсылка,
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок"),
			Истина);
			
		ApiKey = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(ОрганизацияСсылка, 
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey"));
		Если ЗначениеЗаполнено(ApiKey) Тогда
			УстановитьНастройкуОрганизации(ОрганизацияСсылка,
				ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики"),
				Истина);
		КонецЕсли;
			
	КонецЕсли;
	
	ОповеститьОбИзменении(ОрганизацияСсылка);
	
	Если ТекСтрока.Наша И Не КонтрагентыОрганизацииСинхронизированы(ОрганизацияСсылка) Тогда
		ПараметрыМетода = Новый Структура;
		ПараметрыМетода.Вставить("ОрганизацияСсылка", ОрганизацияСсылка);
		
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.СинхронизироватьКонтрагентовОрганизации",
			ПараметрыМетода,, "Синхронизировать контрагентов организации");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентыОрганизацииСинхронизированы(ОрганизацияСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияСсылка", ОрганизацияСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОрганизацииДиадокКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.Контрагенты КАК КонтурЛогистика_ОрганизацииДиадокКонтрагенты
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокКонтрагенты.Ссылка = &ОрганизацияСсылка";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура АвторегистрацияССертом(Команда)
	
	ЗапуститьПриложение("https://support.kontur.ru/logistika/51865-avtoregistraciya_organizacij");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЕщеОднуОрганизацию(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗабылЛогинПароль(Команда)
	
	ЗапуститьПриложение("https://auth.kontur.ru/recover");
	
КонецПроцедуры

#КонецОбласти

#Область РасширениеДополнительныеРеквизиты

&НаКлиенте
Процедура ОтображатьДополнитильныеРекизитыУчСистПриИзменении(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтображатьДополнитильныеРекизитыУчСист", ОтображатьДополнитильныеРекизитыУчСист);	
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_УстановкаДополнительногоРасширения", ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ПослеЗакрытияФормыУстановкаДополнительногоРасширения");
	
	ОтображатьДополнитильныеРекизитыУчСист = Не ОтображатьДополнитильныеРекизитыУчСист;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыУстановкаДополнительногоРасширения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "УстановитьРасширение" Тогда
		
		Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Ложь;
		
		РезультатЗапуска = КонтурЛогистика_ОбновлениеСервер.ПроверитьОбновления(
			АдресВХранилище_ПроверитьОбновлениеДополнительныеРеквизиты, "ДополнительныеРеквизиты", УникальныйИдентификатор);
		
		Если РезультатЗапуска.Статус = "Выполнено" Тогда
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "ДополнительныеРеквизиты");
			ЗаполнитьДанныеОбОбновленииНаФормеИзХранилища(
				АдресВХранилище_ПроверитьОбновлениеДополнительныеРеквизиты, ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты,
				АдресВХранилище_ЗагрузитьОбновлениеДополнительныеРеквизиты, ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты,
				"ДополнительныеРеквизиты");
		ИначеЕсли ЗначениеЗаполнено(РезультатЗапуска.ИдентификаторЗадания) Тогда
			ИдентификаторФЗ_ПроверитьОбновлениеДополнительныеРеквизиты = РезультатЗапуска.ИдентификаторЗадания;
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Истина, "ДополнительныеРеквизиты");
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьОбновления_ДополнительныеРеквизиты", 1, Истина);
		Иначе
			ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "ДополнительныеРеквизиты");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ПроверитьОбновления_ДополнительныеРеквизиты() Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МенеджерФоновыхЗаданийДоступен()
		И КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
			ИдентификаторФЗ_ПроверитьОбновлениеДополнительныеРеквизиты, Элементы.ЛоадерПроверитьОбновлениеДополнительныеРеквизиты) Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьОбновления_ДополнительныеРеквизиты", 2, Истина);
		
	Иначе
		
		ЗаполнитьДанныеОбОбновленииНаФормеИзХранилища(
			АдресВХранилище_ПроверитьОбновлениеДополнительныеРеквизиты, ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты,
			АдресВХранилище_ЗагрузитьОбновлениеДополнительныеРеквизиты, ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты,
			"ДополнительныеРеквизиты");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ПроверитьНовоеОбновление_ДополнительныеРеквизиты() Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МенеджерФоновыхЗаданийДоступен()
		И КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
			ИдентификаторФЗ_ПроверитьОбновлениеДополнительныеРеквизиты, Элементы.ЛоадерПроверитьОбновлениеДополнительныеРеквизиты) Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьНовоеОбновление_ДополнительныеРеквизиты", 2, Истина);
		
	Иначе
		
		ПроверитьНовоеОбновление_ДополнительныеРеквизиты();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНовоеОбновление_ДополнительныеРеквизиты()
	
	СтруктураОбновленияВерсии = ПолучитьИзВременногоХранилища(АдресВХранилище_ПроверитьОбновлениеДополнительныеРеквизиты);
	
	Если СтруктураОбновленияВерсии <> Неопределено Тогда
		
		Если СтруктураОбновленияВерсии.Успешно И СтруктураОбновленияВерсии.ЕстьОбновление Тогда
			
			Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Истина;
			Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Заголовок = "Доступна версия " + СтруктураОбновленияВерсии.НомерВерсии;
			
			НомерВерсииРасширениеДополнительныеРеквизиты = СтруктураОбновленияВерсии.НомерВерсии;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьФорму_ЗапущенаПроверкаОбновления(Ложь, "ДополнительныеРеквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ЗагрузитьОбновление_ДополнительныеРеквизиты() Экспорт
	
	Если КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
		ИдентификаторФЗ_ЗагрузитьОбновлениеДополнительныеРеквизиты, Элементы.ЛоадерПроверитьОбновлениеДополнительныеРеквизиты) Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ЗагрузитьОбновление_ДополнительныеРеквизиты", 2, Истина);
	Иначе
		УстановитьОбновлениеПослеЗагрузки_ДополнительныеРеквизиты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеПослеЗагрузки_ДополнительныеРеквизиты()
	
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Ложь, "ДополнительныеРеквизиты");
	
	Успех = КонтурЛогистика_ОбновлениеСервер.УстановитьОбновление(АдресВХранилище_ЗагрузитьОбновлениеДополнительныеРеквизиты, ИмяКонфигурации1С, "ДополнительныеРеквизиты");
	
	Если Успех Тогда
		
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить("Чтобы началось отображение дополнительных реквизитов в учетных справочниках и документах, необходимо ");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("перезапустить",,,, "1"));
		МассивСтрок.Добавить(" программу");
		Элементы.ПредупреждениеОписание.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
		
		Сообщить(
			"Дополнительное расширение установлено.
			|Чтобы продолжить работу с учетом сделанных изменений, необходимо перезапустить программу.");
		
		ОтображатьДополнитильныеРекизитыУчСист = Истина;
		
		Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Не Успех И ЗначениеЗаполнено(НомерВерсииРасширениеДополнительныеРеквизиты) Тогда
		Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Истина;
	Иначе
		Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеРасширенияСДополнительнымиРеквизитами()
	
	ИмяРасширения = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ИмяДополнительногоРасширенияДополнительныеРеквизитыПоИмениКонфигурации(
		ИмяКонфигурации1С);
	
	УстановитьПривилегированныйРежим(Истина);
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВозможноХранениеРасширений() Тогда
		ОтборРасширения = Новый Структура("Имя", ИмяРасширения);
		ОтображатьДополнитильныеРекизитыУчСист = (РасширенияКонфигурации.Получить(ОтборРасширения).Количество() = 1);
	Иначе
		ОтображатьДополнитильныеРекизитыУчСист = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ИспользуютсяТРН
		И ЗначениеЗаполнено(ИмяКонфигурации1С)
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВерсияРежимаСовместимостиКонфигурацииВыше("8.3.13")
		И (ТиповаяКонфигурация = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТиповыеКонфигурации1С.УФ_УТ")
			Или ТиповаяКонфигурация = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТиповыеКонфигурации1С.КА_2")
			Или ТиповаяКонфигурация = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТиповыеКонфигурации1С.ERP")) Тогда
		
		Элементы.ГруппаДополнительныеРеквизитыРасширение.Видимость = Истина;
		Элементы.ДекорацияНовоеОбновлениеДополнительныеРеквизиты.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаДополнительныеРеквизитыРасширение.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНовоеОбновлениеДополнительныеРеквизитыНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоступноНовоеОбновление", Истина);	
	ПараметрыФормы.Вставить("НомерВерсии", НомерВерсииРасширениеДополнительныеРеквизиты);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_УстановкаДополнительногоРасширения", ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ПослеЗакрытияФормыУстановкаДополнительногоРасширения");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДополнительныеРеквизиты(Команда)
	
	ОткрытьФорму("Справочник.КонтурЛогистика_НастройкиДополнительныхРеквизитов.Форма.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область РасширениеQR_МП_УАТ

&НаКлиенте
Процедура ПередаватьQRВМПВодительУАТПриИзменении(Элемент)
	
	УстановитьНастройку("ПередаватьQRВМПВодительУАТ", ПередаватьQRВМПВодительУАТ);
	
	Если ПередаватьQRВМПВодительУАТ И Не Элементы.ГруппаПредупреждениеQR.Видимость Тогда
		ПроверитьОбновленияНаКлиенте("QR_МП_УАТ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеРасширенияQR()
		
	Если НЕ (ИмяКонфигурации1С = "УАТ_ПРОФ"
		Или ИмяКонфигурации1С = "ERP_УАТ"
		Или ИмяКонфигурации1С = "ТЛЭ") Тогда
			
		Элементы.ГруппаQRРасширение.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Элементы.ГруппаQRРасширение.Видимость = Истина;
	
	Если КонтурЛогистика_ОбновлениеСерверПовтИсп.СтараяВерсияУАТ_QR_МП_УАТ(ИмяКонфигурации1С) Тогда
		
		Элементы.ПередаватьQRВМПВодительУАТ.Доступность = Ложь;
		
		Если ИмяКонфигурации1С = "ТЛЭ" Тогда
			ВерсияДляПодсказки = "ТЛЭ 1.1.33.1";
		ИначеЕсли ИмяКонфигурации1С = "ERP_УАТ" Тогда
			ВерсияДляПодсказки = "УАТ для ERP 2.5.18.1";
		Иначе
			ВерсияДляПодсказки = "УАТ ПРОФ 2.2.33.1";
		КонецЕсли;
			
		Элементы.ПередаватьQRВМПВодительУАТ.Подсказка = 
			"Функционал доступен в версиях " + ВерсияДляПодсказки + " и более." + Символы.ПС
			+ Элементы.ПередаватьQRВМПВодительУАТ.Подсказка;
			
	КонецЕсли;
	
	ГруппаНастроек = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "ОбщиеНастройки");
	
	НастройкаПередаватьQRВМПВодительУАТ = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "ПередаватьQRВМПВодительУАТ");
	Если НастройкаПередаватьQRВМПВодительУАТ.Пустая() Тогда
		НовыйЭлемент = Справочники.КонтурЛогистика_Настройки.СоздатьЭлемент();
		НовыйЭлемент.Родитель = ГруппаНастроек;
		НовыйЭлемент.Наименование = "Передавать QR-код в МП ""Водитель УАТ""";
		НовыйЭлемент.ИмяПредопределенногоДляРасширения = "ПередаватьQRВМПВодительУАТ";
		НовыйЭлемент.ТипЗначения = "Булево";
		НовыйЭлемент.Значение = Истина;
		НовыйЭлемент.Описание = "Включает/выключает передачу QR-кода в мобильное приложение ""Водитель УАТ""";
		НовыйЭлемент.Записать();
		
		НастройкаПередаватьQRВМПВодительУАТ = НовыйЭлемент.Ссылка;
	КонецЕсли;
	
	ПередаватьQRВМПВодительУАТ = НастройкаПередаватьQRВМПВодительУАТ.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ЗагрузитьОбновление_QR() Экспорт
	
	Если КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
		ИдентификаторФЗ_ЗагрузитьОбновлениеQR, Элементы.ЛоадерПроверитьОбновлениеQR) Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ЗагрузитьОбновление_QR", 2, Истина);
	Иначе
		УстановитьОбновлениеПослеЗагрузки_QR();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ПроверитьОбновления_QR() Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МенеджерФоновыхЗаданийДоступен()
		И КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
			ИдентификаторФЗ_ПроверитьОбновлениеQR, Элементы.ЛоадерПроверитьОбновлениеQR) Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПроверитьОбновления_QR", 2, Истина);
		
	Иначе
		
		ЗаполнитьДанныеОбОбновленииНаФормеИзХранилища(
			АдресВХранилище_ПроверитьОбновлениеQR, ИдентификаторФЗ_ПроверитьОбновлениеQR,
			АдресВХранилище_ЗагрузитьОбновлениеQR, ИдентификаторФЗ_ЗагрузитьОбновлениеQR,
			"QR_МП_УАТ");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеПослеЗагрузки_QR()
	
	ОбновитьФорму_ЗапущенаЗагрузкаОбновления(Ложь);
	
	Успех = КонтурЛогистика_ОбновлениеСервер.УстановитьОбновление(АдресВХранилище_ЗагрузитьОбновлениеQR, ИмяКонфигурации1С, "QR_МП_УАТ");
	
	Если Успех Тогда
		Элементы.ГруппаПредупреждениеQR.Видимость = Истина;
		Сообщить(
			"Функционал передачи QR-кода в мобильное приложение ""Водитель УАТ"" установлен.
			|Чтобы продолжить работу с учетом сделанных изменений, необходимо перезапустить программу.");
	Иначе
		ПередаватьQRВМПВодительУАТ = Ложь;
		УстановитьНастройку("ПередаватьQRВМПВодительУАТ", ПередаватьQRВМПВодительУАТ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГруппыДоступа

&НаСервере
Процедура ОбновитьВидимостьДоступностьГруппДоступа()
	
	ИмяСправочникаГруппыДоступа = "Справочники.ГруппыДоступа";
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаГруппыДоступа) Тогда
		ДанныеПоГруппамДоступа = ДанныеПоГруппамДоступа();
		
		Элементы.ДекорацияГруппаДоступаАдминистратор.Видимость = ДанныеПоГруппамДоступа.Администратор.ЕстьГруппа;
		Если ДанныеПоГруппамДоступа.Администратор.КоличествоПользователей = Неопределено Тогда
			Элементы.ДекорацияГруппаДоступаАдминистратор.Заголовок = "Администраторы";
		Иначе
			Элементы.ДекорацияГруппаДоступаАдминистратор.Заголовок = "Администраторы ("
				+ Формат(ДанныеПоГруппамДоступа.Администратор.КоличествоПользователей, "ЧН=0; ЧГ=0") + ")";
		КонецЕсли;
		
		Элементы.ДекорацияГруппаДоступаПродвинутыйПользователь.Видимость = ДанныеПоГруппамДоступа.ПродвинутыйПользователь.ЕстьГруппа;
		Если ДанныеПоГруппамДоступа.ПродвинутыйПользователь.КоличествоПользователей = Неопределено Тогда
			Элементы.ДекорацияГруппаДоступаПродвинутыйПользователь.Заголовок = "Продвинутые пользователи";
		Иначе
			Элементы.ДекорацияГруппаДоступаПродвинутыйПользователь.Заголовок = "Продвинутые пользователи ("
				+ Формат(ДанныеПоГруппамДоступа.ПродвинутыйПользователь.КоличествоПользователей, "ЧН=0; ЧГ=0") + ")";
		КонецЕсли;
		
		Элементы.ДекорацияГруппаДоступаПользователь.Видимость = ДанныеПоГруппамДоступа.Пользователь.ЕстьГруппа;
		Если ДанныеПоГруппамДоступа.Пользователь.КоличествоПользователей = Неопределено Тогда
			Элементы.ДекорацияГруппаДоступаПользователь.Заголовок = "Пользователи";
		Иначе
			Элементы.ДекорацияГруппаДоступаПользователь.Заголовок = "Пользователи ("
				+ Формат(ДанныеПоГруппамДоступа.Пользователь.КоличествоПользователей, "ЧН=0; ЧГ=0") + ")";
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаГруппыДоступа.Видимость =
		(Элементы.ДекорацияГруппаДоступаАдминистратор.Видимость
			Или Элементы.ДекорацияГруппаДоступаПродвинутыйПользователь.Видимость
			Или Элементы.ДекорацияГруппаДоступаПользователь.Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГруппаДоступаАдминистраторНажатие(Элемент)
	
	ИмяГруппыДоступа = "Администраторы (Контур.Логистика)";
	ОткрытьГруппуДоступа(ИмяГруппыДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГруппаДоступаПродвинутыйПользовательНажатие(Элемент)
	
	ИмяГруппыДоступа = "Продвинутые пользователи (Контур.Логистика)";
	ОткрытьГруппуДоступа(ИмяГруппыДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГруппаДоступаПользовательНажатие(Элемент)
	
	ИмяГруппыДоступа = "Пользователи (Контур.Логистика)";
	ОткрытьГруппуДоступа(ИмяГруппыДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГруппуДоступа(ИмяГруппыДоступа)
	
	СсылкаНаГруппу = ГруппаДоступаПоИмени(ИмяГруппыДоступа);
	Если ЗначениеЗаполнено(СсылкаНаГруппу) Тогда
		ПоказатьЗначение(, СсылкаНаГруппу);
	Иначе
		Сообщить("Не удалось найти группу доступа: " + ИмяГруппыДоступа);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГруппаДоступаПоИмени(ИмяГруппыДоступа)
	
	Возврат Справочники["ГруппыДоступа"].НайтиПоНаименованию(ИмяГруппыДоступа, Истина);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПоГруппамДоступа()
	
	ДанныеПоГруппамДоступа = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыДоступаПользователи.Пользователь) КАК Пользователь
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
	|ГДЕ
	|	ГруппыДоступа.Наименование = ""Администраторы (Контур.Логистика)""
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступа.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыДоступаПользователи.Пользователь) КАК Пользователь
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
	|ГДЕ
	|	ГруппыДоступа.Наименование = ""Продвинутые пользователи (Контур.Логистика)""
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступа.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыДоступаПользователи.Пользователь) КАК Пользователь
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
	|ГДЕ
	|	ГруппыДоступа.Наименование = ""Пользователи (Контур.Логистика)""
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступа.Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Администратор
	Выборка = Результат[0].Выбрать();
	Выборка.Следующий();
	
	ТекущиеДанные = Новый Структура;
	ТекущиеДанные.Вставить("ЕстьГруппа", ЗначениеЗаполнено(Выборка.Ссылка));
	ТекущиеДанные.Вставить("КоличествоПользователей", Выборка.Пользователь);
	
	ДанныеПоГруппамДоступа.Вставить("Администратор", ТекущиеДанные);
	
	// Продвинутый пользователь
	Выборка = Результат[1].Выбрать();
	Выборка.Следующий();
	
	ТекущиеДанные = Новый Структура;
	ТекущиеДанные.Вставить("ЕстьГруппа", ЗначениеЗаполнено(Выборка.Ссылка));
	ТекущиеДанные.Вставить("КоличествоПользователей", Выборка.Пользователь);
	
	ДанныеПоГруппамДоступа.Вставить("ПродвинутыйПользователь", ТекущиеДанные);
	
	// Пользователь
	Выборка = Результат[2].Выбрать();
	Выборка.Следующий();
	
	ТекущиеДанные = Новый Структура;
	ТекущиеДанные.Вставить("ЕстьГруппа", ЗначениеЗаполнено(Выборка.Ссылка));
	ТекущиеДанные.Вставить("КоличествоПользователей", Выборка.Пользователь);
	
	ДанныеПоГруппамДоступа.Вставить("Пользователь", ТекущиеДанные);
	
	Возврат ДанныеПоГруппамДоступа;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСправочникПользователи(Команда)
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию() = "КЛ" Тогда
		ОткрытьФорму("Справочник.УчетнаяСистема_Пользователи.Форма.ФормаСписка");
	Иначе
		ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСписка");
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Стартовый помощник", "Открыть справочник пользователей", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Права");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиПравПодробнееНажатие(Элемент)
	
	ПерейтиПоСсылке("https://support.kontur.ru/logistika-1s/41559-roli_polzovatelej_podsistemy");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьНастроекГруппДоступа()
	
	ИмяСправочникаГруппыДоступа 		= "Справочники.ГруппыДоступа";
	ИмяСправочникаПрофилиГруппДоступа 	= "Справочники.ПрофилиГруппДоступа";
	
	ВБазеСовременнаяСистемаПравДоступа = 
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаГруппыДоступа)
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаПрофилиГруппДоступа);
	
	Если ВБазеСовременнаяСистемаПравДоступа Тогда
		
		// Современная конфигурация, где есть профили и группы доступа
		Элементы.ГруппаНастройкаПравНетГруппДоступа.Видимость = Ложь;
		
		// Проверим / Создадим группы и профили доступа
		КонтурЛогистика_ОбщегоНазначенияСервер.СоздатьГруппыДоступа();
		
		ОбновитьВидимостьДоступностьГруппДоступа();
		
	Иначе
		
		// Старая конфигурация, где надо администрировать через справочник пользователи
		Элементы.ГруппаГруппыДоступа.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПереносНастроекДиадокEDI

&НаСервере
Процедура ПереносПараметровАвторизацииИПроксиИзМодулейКонтура()
	
	ПараметрыУстановкиМодулейКонтура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПараметрыУстановкиМодулей();
	
	ПеренесеныНастройкиАвторизации = ПеренестиНастройкиАвторизации();
	ПеренесеныНастройкиПрокси = ПеренестиНастройкиПрокси();
	
КонецПроцедуры

&НаСервере
Функция ПеренестиНастройкиАвторизации()
	
	Результат = Ложь;
	
	Если ПараметрыУстановкиМодулейКонтура.Диадок.МодульУстановлен Тогда
		
		СлужебнаяУчетнаяЗаписьЛогин = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(
			ПараметрыУстановкиМодулейКонтура.Диадок, "СлужебнаяУчетнаяЗаписьЛогин");
		Если ЗначениеЗаполнено(СлужебнаяУчетнаяЗаписьЛогин) Тогда
			
			Результат = Истина;
			
			API_Логин = СлужебнаяУчетнаяЗаписьЛогин;
			API_Пароль = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(
				ПараметрыУстановкиМодулейКонтура.Диадок, "СлужебнаяУчетнаяЗаписьПароль");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Результат И ПараметрыУстановкиМодулейКонтура.EDI.МодульУстановлен Тогда
		
		ЛогинСлужебныйДиадок = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("ЛогинСлужебныйДиадок");
		Если ЗначениеЗаполнено(ЛогинСлужебныйДиадок) Тогда
			
			Результат = Истина;
			
			API_Логин = ЛогинСлужебныйДиадок;
			API_Пароль = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("ПарольСлужебныйДиадок");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат Тогда
		// Сохраним настройки
		УстановитьНастройку("ЛогинАвторизацииДиадокАПИ", API_Логин);
		УстановитьНастройку("ПарольАвторизацииДиадокАПИ", API_Пароль);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПеренестиНастройкиПрокси()
	
	Результат = Ложь;
	
	Если ПараметрыУстановкиМодулейКонтура.Диадок.МодульУстановлен Тогда
		
		РежимПрокси = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(
			ПараметрыУстановкиМодулейКонтура.Диадок, "РежимПрокси");
		Если РежимПрокси <> Неопределено Тогда
			
			Результат = Истина;
			
			Попытка
				Прокси_РежимПрокси = Перечисления.КонтурЛогистика_ТипыПрокси[СокрЛП(РежимПрокси)];
			Исключение
				Результат = Ложь;
			КонецПопытки;
			
			Если Результат Тогда
				Прокси_АдресПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(
					ПараметрыУстановкиМодулейКонтура.Диадок, "АдресПроксиСервера");
				Прокси_ПортПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(
					ПараметрыУстановкиМодулейКонтура.Диадок, "ПортПроксиСервера");
				Прокси_ЛогинПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(
					ПараметрыУстановкиМодулейКонтура.Диадок, "ЛогинПроксиСервера");
				Прокси_ПарольПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(	
					ПараметрыУстановкиМодулейКонтура.Диадок, "ПарольПроксиСервера");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Результат И ПараметрыУстановкиМодулейКонтура.EDI.МодульУстановлен Тогда
		
		РежимПрокси = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("ТипПрокси");
		Если РежимПрокси <> Неопределено Тогда
			
			Результат = Истина;
			
			Если РежимПрокси = 0 Тогда
				Прокси_РежимПрокси = Перечисления.КонтурЛогистика_ТипыПрокси.NoProxy;
			ИначеЕсли РежимПрокси = 1
				Или РежимПрокси = 2
				Или РежимПрокси = 3 Тогда
				
				Прокси_РежимПрокси = Перечисления.КонтурЛогистика_ТипыПрокси.UseProxy;
			Иначе
				Результат = Ложь;
			КонецЕсли;
			
			Если Результат Тогда
				Прокси_АдресПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("СерверПрокси");
				Прокси_ПортПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("ПортПрокси");
				Прокси_ЛогинПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("ЛогинПрокси");
				Прокси_ПарольПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("ПарольПрокси");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат Тогда
		Прокси_ПроксиИспользовать = (Прокси_РежимПрокси <> Перечисления.КонтурЛогистика_ТипыПрокси.NoProxy);
		
		// Сохраним настройки
		УстановитьНастройку("РежимПрокси", Прокси_РежимПрокси);
		УстановитьНастройку("ПроксиИспользовать", Прокси_ПроксиИспользовать);
		УстановитьНастройку("АдресПроксиСервера", Прокси_АдресПроксиСервера);
		УстановитьНастройку("ПортПроксиСервера", Прокси_ПортПроксиСервера);
		УстановитьНастройку("ЛогинПроксиСервера", Прокси_ЛогинПроксиСервера);
		УстановитьНастройку("ПарольПроксиСервера", Прокси_ПарольПроксиСервера);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПереносСопоставленийКонтрагентовМодулейКонтура

&НаСервере
Функция ПереносСопоставленийКонтрагентовМодулейКонтура()
	
	Результат = Ложь;
	
	Если ПараметрыУстановкиМодулейКонтура.Диадок.МодульУстановлен Тогда
		
		Результат = ПереносСопоставленийКонтрагентовДиадок(ПараметрыУстановкиМодулейКонтура.Диадок);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПереносСопоставленийКонтрагентовДиадок(НастройкиДиадок)
	
	Результат = Ложь;
	
	ОбъектыКДобавлению = Новый Соответствие;
	
	Если НастройкиДиадок.ИспользоватьТиповуюПодсистему1С  = Истина Тогда
		
		// Получи свойство по имени настройки
		ИмяСвойства = "ДДКонтр_";
		Если НастройкиДиадок.ЭтоУФ Тогда
			СвойствоНастройки = ПланыВидовХарактеристик["ДополнительныеРеквизитыИСведения"].НайтиПоНаименованию(ИмяСвойства, Истина);
		Иначе
			СвойствоНастройки = ПланыВидовХарактеристик["СвойстваОбъектов"].НайтиПоНаименованию(ИмяСвойства, Истина);
		КонецЕсли;
		
		Если СвойствоНастройки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получим значение по свойству
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", СвойствоНастройки);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект,
		|	ЗначенияСвойствОбъектов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство";
		
		Если НастройкиДиадок.ЭтоУФ Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектов", "ДополнительныеСведения");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Объект)
				Или Не ЗначениеЗаполнено(Выборка.Значение) Тогда
				
				Продолжить;
			КонецЕсли;
			
			Идентификатор = КонтурЛогистика_API_Диадок.АдресЯщикаВИдентификатор(Выборка.Значение);
			СвязанныеОбъекты = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.Объект);
			
			ТекущееЗначение = ОбъектыКДобавлению.Получить(Идентификатор);
			Если ТекущееЗначение = Неопределено Тогда
				ОбъектыКДобавлению.Вставить(Идентификатор, СвязанныеОбъекты);
			Иначе
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТекущееЗначение, СвязанныеОбъекты);
				ОбъектыКДобавлению.Вставить(Идентификатор, ТекущееЗначение);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИмяСправочника", "Контрагенты");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Диадок_ЮрФизЛица.ID КАК ID,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник1,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник2 КАК СвязанныйСправочник2,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник3 КАК СвязанныйСправочник3
		|ИЗ
		|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
		|ГДЕ
		|	Диадок_ЮрФизЛица.ИмяСправочника = &ИмяСправочника";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СвязанныеОбъекты = Новый Массив;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник1) Тогда
				СвязанныеОбъекты.Добавить(Выборка.СвязанныйСправочник1);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник2) Тогда
				СвязанныеОбъекты.Добавить(Выборка.СвязанныйСправочник2);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник3) Тогда
				СвязанныеОбъекты.Добавить(Выборка.СвязанныйСправочник3);
			КонецЕсли;
			
			Если СвязанныеОбъекты.Количество() <> 0 Тогда
				Идентификатор = КонтурЛогистика_API_Диадок.АдресЯщикаВИдентификатор(Выборка.ID);
				
				ТекущееЗначение = ОбъектыКДобавлению.Получить(Идентификатор);
				Если ТекущееЗначение = Неопределено Тогда
					ОбъектыКДобавлению.Вставить(Идентификатор, СвязанныеОбъекты);
				Иначе
					КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТекущееЗначение, СвязанныеОбъекты);
					ОбъектыКДобавлению.Вставить(Идентификатор, ТекущееЗначение);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ОбъектКДобавлению Из ОбъектыКДобавлению Цикл
		
		boxID = ОбъектКДобавлению.Ключ;
		Контрагенты = ОбъектКДобавлению.Значение;
		
		ОрганизацияСсылка = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьОрганиациюДДПоId(boxID);
		
		Если Не ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
		
		Для Каждого ТекущийКонтрагент Из Контрагенты Цикл
			ПараметрыОтбора = Новый Структура("Контрагент", ТекущийКонтрагент);
			НайденныеСтроки = ОрганизацияОбъект.Контрагенты.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ОрганизацияОбъект.Записать();
			Результат = Истина;
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прокси

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьПрокси(ПриОткрытии = Ложь)
	
	ИспользоватьНастройкиМодуля = (Прокси_РежимПрокси = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПрокси.UseProxy"));
	
	ВидимостьНастроекПрокси = (ИспользоватьНастройкиМодуля И Прокси_ПроксиИспользовать);
	
	Элементы.Прокси_АдресПроксиСервера.Видимость = ВидимостьНастроекПрокси;
	Элементы.Прокси_ПортПроксиСервера.Видимость = ВидимостьНастроекПрокси;
	Элементы.Прокси_ЛогинПроксиСервера.Видимость = ВидимостьНастроекПрокси;
	Элементы.Прокси_ПарольПроксиСервера.Видимость = ВидимостьНастроекПрокси;
		
КонецПроцедуры

&НаСервере
Процедура ПолучимНастройкиПрокси()
	
	Прокси_РежимПрокси = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимПрокси");
	Прокси_ПроксиИспользовать = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПроксиИспользовать");
	Прокси_ЛогинПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ЛогинПроксиСервера");
	Прокси_ПарольПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПарольПроксиСервера");
	Прокси_ПортПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПортПроксиСервера");
	Прокси_АдресПроксиСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресПроксиСервера");
	
	// Если прокси выключено, то и режим сбросим
	Если Не Прокси_ПроксиИспользовать И Прокси_РежимПрокси <> Перечисления.КонтурЛогистика_ТипыПрокси.NoProxy Тогда
		Прокси_РежимПрокси = Перечисления.КонтурЛогистика_ТипыПрокси.NoProxy;
		УстановитьНастройку("РежимПрокси", Прокси_РежимПрокси);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_РежимПроксиПриИзменении(Элемент)
	
	УстановитьНастройку("РежимПрокси", Прокси_РежимПрокси);
	
	// Включим использование прокси
	Прокси_ПроксиИспользовать = (Прокси_РежимПрокси <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПрокси.NoProxy"));
	УстановитьНастройку("ПроксиИспользовать", Прокси_ПроксиИспользовать);
	
	ОбновитьВидимостьДоступностьПрокси();
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_АдресПроксиСервераПриИзменении(Элемент)
	
	УстановитьНастройку("АдресПроксиСервера", Прокси_АдресПроксиСервера);
	
	ОбновитьВидимостьДоступностьПрокси();
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_ПортПроксиСервераПриИзменении(Элемент)
	
	УстановитьНастройку("ПортПроксиСервера", Прокси_ПортПроксиСервера);
	
	ОбновитьВидимостьДоступностьПрокси();
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_ЛогинПроксиСервераПриИзменении(Элемент)
	
	УстановитьНастройку("ЛогинПроксиСервера", Прокси_ЛогинПроксиСервера);
	
	ОбновитьВидимостьДоступностьПрокси();
	
КонецПроцедуры

&НаКлиенте
Процедура Прокси_ПарольПроксиСервераПриИзменении(Элемент)
	
	УстановитьНастройку("ПарольПроксиСервера", Прокси_ПарольПроксиСервера);
	
	ОбновитьВидимостьДоступностьПрокси();
	
КонецПроцедуры

#КонецОбласти

#Область Авторизация

&НаКлиенте
Процедура АвторизоватьсяНаПортале(Команда)
	
	ПараметрыФормы = Новый Структура;
	Если КоличествоНашихОрганизаций() = 0 Тогда
		ПараметрыФормы.Вставить("АвторизацияПриОткрытии");
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций", ПараметрыФормы,
		ЭтаФорма, ЭтаФорма, "АвторизоватьсяНаПорталеЗавершение",, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизоватьсяНаПорталеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьПортальныеАвторизации() Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФункциональность;
		СтраницыПриСменеСтраницы(, Элементы.Страницы.ТекущаяСтраница);
	КонецЕсли;
	
	Если ТипЗнч("Результат") = Тип("Булево") И Результат = Истина Тогда
		Метрика_ВыполнитьАвторизацию = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоНашихОрганизаций()
	
	ВсеНашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Возврат ВсеНашиОрганизации.Количество();
	
КонецФункции

&НаКлиенте
Процедура Шаг4ИнструкцияНажатие(Элемент)
	
	СсылкаНаИнструкцию = "https://support.kontur.ru/logistika-1s/nastrojki-modulya";
	
	ПерейтиПоСсылке(СсылкаНаИнструкцию);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПодписания

&НаКлиенте
Процедура ДобавитьСертификат(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ВыборСертификата",, ЭтаФорма, ЭтаФорма,
		 "ОбработчикВыборСертификата");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыборСертификата(ДанныеСертификата, ДополнительныеПараметры) Экспорт

	Если ДанныеСертификата <> Неопределено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.Форма.ФормаЭлемента",
			ДанныеСертификата, ЭтаФорма, ЭтаФорма);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТекстДобавленоСертификатовНажатие(Элемент)
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокДействия");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    ОтборСписка.ПравоеЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущаяДатаСервера();
    ОтборСписка.Использование = Истина;
	     	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.Форма.ФормаСписка", ПараметрыВыбора,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗагруженоМЧДНажатие(Элемент)
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    ОтборСписка.ПравоеЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущаяДатаСервера();
    ОтборСписка.Использование = Истина;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОрганизацияДиадок.Наш");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборСписка.ПравоеЗначение = Истина;
    ОтборСписка.Использование = Истина;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наша");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборСписка.ПравоеЗначение = Истина;
    ОтборСписка.Использование = Истина;
	     	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_МЧД.Форма.ФормаСписка", ПараметрыВыбора,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкуПодписания(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи",,
		ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстДобавленоНастроекПодписанияНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаСписка",,
		ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КакПолучитьСертификатНажатие(Элемент)
	ПерейтиПоСсылке("https://ca.kontur.ru/articles/82809-podpisyvat_elektronnye_perevozochnye_dokumenty");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(СсылкаПерехода)
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение(СсылкаПерехода);
	Иначе
		ПерейтиПоНавигационнойСсылке(СсылкаПерехода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОрганизацийБезНастроекПодписанияНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВыбораОрганизацииБезНастройкиПодписания", ЭтаФорма);
	СписокНашихОрганизацийБезНастроекПодписания.ПоказатьВыборЭлемента(ОписаниеОповещения, "Организации без настройки подписания");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораОрганизацииБезНастройкиПодписания(ВыбраннаяОрганизация, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяОрганизация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОрганизацияДиадок", ВыбраннаяОрганизация.Значение);
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи", ПараметрыФормы,
		ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Метрики

&НаСервере
Процедура ОтправитьМетрики()
	
	Если ТипЗнч(НачальныеДанныеДляМетрик) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьПоведенческиеМетрики();	
	ОтправитьСтатистическиеМетрики();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПоведенческиеМетрики()
	
	// отправляем метрики только если пользователь открывал соответствующие закладки
	
	Если НачальныеДанныеДляМетрик.Свойство(Элементы.ВводЛогинаПароля.Имя) Тогда
	
		Если НачальныеДанныеДляМетрик.ТипПрокси <> Прокси_РежимПрокси Тогда 
			ДопИнформация = Новый Структура("ТипПрокси", Строка(Прокси_РежимПрокси));
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Стартовый помощник", "Изменить параметры прокси", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Подключение",, ДопИнформация);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачальныеДанныеДляМетрик.Свойство(Элементы.СтраницаФункциональность.Имя) И ДокументыИзменены Тогда
	
		ДопИнформация = Новый Структура("ЭТрН", Формат(ИспользуютсяТРН, "БЛ=true; БИ=false"));
		ДопИнформация = Новый Структура("ЗЗ", 	Формат(ИспользуютсяЗаказЗаявки, "БЛ=true; БИ=false"));
		ДопИнформация = Новый Структура("ПЛ",	Формат(ИспользуютсяПутевыеЛисты Или ИспользуютсяПутевыеЛисты_5_02, "БЛ=true; БИ=false"));
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Стартовый помощник", "Выбрать документы", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Документы",, ДопИнформация);
		
	КонецЕсли;
	
	Если НачальныеДанныеДляМетрик.Свойство(Элементы.МоиОрганизации.Имя) Тогда
	
		Для каждого Строка Из ОрганизацииДиадокИРоли Цикл
			
			Если Не Строка.ОрганизацияДиадок.Наш Или Не НачальныеДанныеДляМетрик.Свойство("СвязанныеОрганизации") Тогда
				Продолжить;
			КонецЕсли;
			
			Ключ = "_" + СтрЗаменить(Строка.ОрганизацияДиадок.ID, "-", "");
			
			Если Не НачальныеДанныеДляМетрик.СвязанныеОрганизации.Свойство(Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.ОрганизацияДиадок.СвязанныеОбъекты.Количество() > НачальныеДанныеДляМетрик.СвязанныеОрганизации[Ключ].КоличествоСвязанныхОбъектов Тогда
					
				КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
					"Стартовый помощник", "Сопоставить с организацией 1С", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Организации");
		        			
			КонецЕсли;
			
			Если РолиИзменены(НачальныеДанныеДляМетрик.СвязанныеОрганизации[Ключ], Строка.ОрганизацияДиадок) Тогда
				
				ДопИнформация = Новый Структура("ГО", 			Формат(Строка.ОрганизацияДиадок.Грузоотправитель, 	"БЛ=true; БИ=false"));
				ДопИнформация = Новый Структура("ПРВ", 			Формат(Строка.ОрганизацияДиадок.Перевозчик, 		"БЛ=true; БИ=false"));
				ДопИнформация = Новый Структура("ГП", 			Формат(Строка.ОрганизацияДиадок.Грузополучатель, 	"БЛ=true; БИ=false"));
				ДопИнформация = Новый Структура("Оформитель",	Формат(Строка.ОрганизацияДиадок.Оформитель, 		"БЛ=true; БИ=false"));
				ДопИнформация = Новый Структура("Медик", 		Формат(Строка.ОрганизацияДиадок.Медик, 				"БЛ=true; БИ=false"));
				ДопИнформация = Новый Структура("ТехОсмотр", 	Формат(Строка.ОрганизацияДиадок.ТехОсмотр, 			"БЛ=true; БИ=false"));
				ДопИнформация = Новый Структура("Одометр", 		Формат(Строка.ОрганизацияДиадок.Одометр, 			"БЛ=true; БИ=false"));
				КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
					"Стартовый помощник", "Выбрать роли", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Организации",, ДопИнформация);
				
			КонецЕсли;
						
		КонецЦикла;
		
	КонецЕсли;
	
	Если НачальныеДанныеДляМетрик.Свойство(Элементы.СтраницаНастройкиПрав.Имя) Тогда
	
		ИмяСправочникаГруппыДоступа = "Справочники.ГруппыДоступа";
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаГруппыДоступа) Тогда
			
			ДанныеПоГруппамДоступа = ДанныеПоГруппамДоступа();
			
			Если ДанныеПоГруппамДоступа.Администратор.КоличествоПользователей <> Неопределено
				И НачальныеДанныеДляМетрик.Свойство("КоличествоАдминистраторов") Тогда
				КоличествоАдминистраторов = ДанныеПоГруппамДоступа.Администратор.КоличествоПользователей - НачальныеДанныеДляМетрик.КоличествоАдминистраторов;
				Если КоличествоАдминистраторов > 0 Тогда
					КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
						"Стартовый помощник", "Добавить администратора", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Права");	
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеПоГруппамДоступа.ПродвинутыйПользователь.КоличествоПользователей <> Неопределено
				И НачальныеДанныеДляМетрик.Свойство("КоличествоПродвинутыхПользователей") Тогда
				КоличествоПродвинутыхПользователей = ДанныеПоГруппамДоступа.ПродвинутыйПользователь.КоличествоПользователей - НачальныеДанныеДляМетрик.КоличествоПродвинутыхПользователей;
				Если КоличествоПродвинутыхПользователей > 0 Тогда
					КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
						"Стартовый помощник", "Добавить продвинутого пользователя", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Права");	
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеПоГруппамДоступа.Пользователь.КоличествоПользователей <> Неопределено
				И НачальныеДанныеДляМетрик.Свойство("КоличествоПользователей") Тогда
				КоличествоПользователей = ДанныеПоГруппамДоступа.Пользователь.КоличествоПользователей - НачальныеДанныеДляМетрик.КоличествоПользователей;
				Если КоличествоПользователей > 0 Тогда
					КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
						"Стартовый помощник", "Добавить пользователя", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Права");	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачальныеДанныеДляМетрик.Свойство(Элементы.СтраницаНастройки.Имя)
		И НачальныеДанныеДляМетрик.Свойство("ТиповаяКонфигурация") Тогда
	
		Если ТиповаяКонфигурация <> НачальныеДанныеДляМетрик.ТиповаяКонфигурация Тогда
			
			Если ТиповаяКонфигурация = Перечисления.КонтурЛогистика_ТиповыеКонфигурации1С.ПустаяСсылка() Тогда
				Action = "Выбрать конфигурацию";	
			Иначе
				Action = "Изменить конфигурацию";
			КонецЕсли;
			
			ДопИнформация = Новый Структура("ИмяКонфигурации", Строка(ТиповаяКонфигурация));
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Стартовый помощник", Action, "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Настройки конфигурации",, ДопИнформация);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачальныеДанныеДляМетрик.Свойство(Элементы.СтраницаНастройкиПодписания.Имя) Тогда
	
		КоличествоСертификатов = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихСертификатов();
		Если НачальныеДанныеДляМетрик.Свойство("КоличествоСертификатов")
			И КоличествоСертификатов > НачальныеДанныеДляМетрик.КоличествоСертификатов Тогда
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Стартовый помощник", "Добавить сертификат", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Настройки подписания");	
		КонецЕсли;
		
		КоличествоМЧД = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихМЧД();
		Если НачальныеДанныеДляМетрик.Свойство("КоличествоМЧД")
			И КоличествоМЧД > НачальныеДанныеДляМетрик.КоличествоМЧД Тогда
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Стартовый помощник", "Добавить МЧД", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Настройки подписания");	
		КонецЕсли;
		
		КоличествоНастроекПодписания = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихНастроекПодписания();
		Если НачальныеДанныеДляМетрик.Свойство("КоличествоНастроекПодписания")
			И КоличествоНастроекПодписания > НачальныеДанныеДляМетрик.КоличествоНастроекПодписания Тогда
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Стартовый помощник", "Добавить настройки подписания", "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", "Настройки подписания");	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСтатистическиеМетрики()
	
	Переменные = Новый Структура;
	
	Если НачальныеДанныеДляМетрик.Свойство("ДатаНачалаРаботыСП") Тогда 
		Переменные.Вставить("ВремяПрохожденияСП", ТекущаяДата() - НачальныеДанныеДляМетрик.ДатаНачалаРаботыСП);
	КонецЕсли;
	
	Если Метрика_ВыполнитьАвторизацию Тогда
		Переменные.Вставить("ВыполнитьАвторизацию", "true");	
	Иначе
		Переменные.Вставить("ВыполнитьАвторизацию", "false");
	КонецЕсли;
	
	Если ДокументыИзменены И
		(ИспользуютсяТРН Или ИспользуютсяЗаказЗаявки Или ИспользуютсяПутевыеЛисты Или ИспользуютсяПутевыеЛисты_5_02) Тогда
		Переменные.Вставить("ВыбратьДокумент", "true");		
	Иначе
		Переменные.Вставить("ВыбратьДокумент", "false");		
	КонецЕсли;
	
	Для каждого Строка Из ОрганизацииДиадокИРоли Цикл
		
		Если Не Строка.ОрганизацияДиадок.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = "_" + СтрЗаменить(Строка.ОрганизацияДиадок.ID, "-", "");
		
		Если НачальныеДанныеДляМетрик.Свойство("СвязанныеОрганизации")
			И НачальныеДанныеДляМетрик.СвязанныеОрганизации.Свойство(Ключ)
			И РолиИзменены(НачальныеДанныеДляМетрик.СвязанныеОрганизации[Ключ], Строка.ОрганизацияДиадок) Тогда
			Переменные.Вставить("ВыбратьРоли", "true");	
		Иначе
			Переменные.Вставить("ВыбратьРоли", "false");	
		КонецЕсли;
		
	КонецЦикла;	
	
	КоличествоСертификатов = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихСертификатов();
	Если НачальныеДанныеДляМетрик.Свойство("КоличествоСертификатов")
		И КоличествоСертификатов > НачальныеДанныеДляМетрик.КоличествоСертификатов Тогда
		Переменные.Вставить("ДобавитьСертификат", "true");
	Иначе
		Переменные.Вставить("ДобавитьСертификат", "false");
	КонецЕсли;
	
	КоличествоМЧД = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихМЧД();
	Если НачальныеДанныеДляМетрик.Свойство("КоличествоМЧД")
		И КоличествоМЧД > НачальныеДанныеДляМетрик.КоличествоМЧД Тогда
		Переменные.Вставить("ДобавитьМЧД", "true");
	Иначе
		Переменные.Вставить("ДобавитьМЧД", "false");
	КонецЕсли;
	
	КоличествоНастроекПодписания = КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихНастроекПодписания();
	Если НачальныеДанныеДляМетрик.Свойство("КоличествоНастроекПодписания")
		И КоличествоНастроекПодписания > НачальныеДанныеДляМетрик.КоличествоНастроекПодписания Тогда
		Переменные.Вставить("ДобавитьНастройкуПодписания", "true");
	Иначе
		Переменные.Вставить("ДобавитьНастройкуПодписания", "false");
	КонецЕсли;
	
	Если НачальныеДанныеДляМетрик.Свойство("ТиповаяКонфигурация")
		И ТиповаяКонфигурация <> НачальныеДанныеДляМетрик.ТиповаяКонфигурация Тогда 			
		Переменные.Вставить("ВыбратьКонфигурацию", "true");			
	Иначе			
		Переменные.Вставить("ВыбратьКонфигурацию", "false");			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация()) Тогда
		Label = "Повторный запуск";
	Иначе
		Label = "Первый запуск";
	КонецЕсли;
	
	Если Метрика_ПриступитьКРаботе Тогда
		Action = "Приступить к работе"; 		
	Иначе
		Action = "Закрытие стартового помощника";		
	КонецЕсли;
		
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(
		Переменные, "Стартовый помощник", Action, "Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", Label);		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеДанныеДляМетрик()
	
	НачальныеДанныеДляМетрик = Новый Структура;
	НачальныеДанныеДляМетрик.Вставить("ТипПрокси", Прокси_РежимПрокси);
	
	ИмяСправочникаГруппыДоступа = "Справочники.ГруппыДоступа";
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаГруппыДоступа) Тогда
		
		ДанныеПоГруппамДоступа = ДанныеПоГруппамДоступа();
		
		Если ДанныеПоГруппамДоступа.Администратор.КоличествоПользователей = Неопределено Тогда
			КоличествоАдминистраторов = 0;
		Иначе
			КоличествоАдминистраторов = ДанныеПоГруппамДоступа.Администратор.КоличествоПользователей;
		КонецЕсли;		
		НачальныеДанныеДляМетрик.Вставить("КоличествоАдминистраторов", КоличествоАдминистраторов);
		
		Если ДанныеПоГруппамДоступа.ПродвинутыйПользователь.КоличествоПользователей = Неопределено Тогда
			КоличествоПродвинутыхПользователей = 0;
		Иначе
			КоличествоПродвинутыхПользователей = ДанныеПоГруппамДоступа.ПродвинутыйПользователь.КоличествоПользователей;
		КонецЕсли;		
		НачальныеДанныеДляМетрик.Вставить("КоличествоПродвинутыхПользователей", КоличествоПродвинутыхПользователей);
		
		Если ДанныеПоГруппамДоступа.Пользователь.КоличествоПользователей = Неопределено Тогда
			КоличествоПользователей = 0;
		Иначе
			КоличествоПользователей = ДанныеПоГруппамДоступа.Пользователь.КоличествоПользователей;
		КонецЕсли;		
		НачальныеДанныеДляМетрик.Вставить("КоличествоПользователей", КоличествоПользователей);
		
	КонецЕсли;
	
	НачальныеДанныеДляМетрик.Вставить("КоличествоСертификатов", КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихСертификатов());
	НачальныеДанныеДляМетрик.Вставить("КоличествоМЧД", КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихМЧД());
	НачальныеДанныеДляМетрик.Вставить("КоличествоНастроекПодписания", КонтурЛогистика_ОбщегоНазначенияСервер.КоличествоДействующихНастроекПодписания());
	
	НачальныеДанныеДляМетрик.Вставить("ТиповаяКонфигурация", ТиповаяКонфигурация);
	
	НачальныеДанныеДляМетрик.Вставить(Элементы.Страницы.ТекущаяСтраница.Имя);
	
	НачальныеДанныеДляМетрик.Вставить("ДатаНачалаРаботыСП", ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОрганизацииИРолиВНачальныеДанныеДляМетрик()
	
	Если ТипЗнч(НачальныеДанныеДляМетрик) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныеОрганизации = Новый Структура;
		
	Для каждого Строка Из ОрганизацииДиадокИРоли Цикл
		
		Если Не Строка.ОрганизацияДиадок.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеОрганизации = Новый Структура;
		ДанныеОрганизации.Вставить("КоличествоСвязанныхОбъектов", Строка.ОрганизацияДиадок.СвязанныеОбъекты.Количество());
		
		Роли = РолиОрганизации();	
		Для каждого Роль Из Роли Цикл
			ДанныеОрганизации.Вставить(Роль, Строка.ОрганизацияДиадок[Роль]);	
		КонецЦикла;
		
		Ключ = "_" + СтрЗаменить(Строка.ОрганизацияДиадок.ID, "-", "");
		СвязанныеОрганизации.Вставить(Ключ, ДанныеОрганизации);
		
	КонецЦикла;
	
	НачальныеДанныеДляМетрик.Вставить("СвязанныеОрганизации", СвязанныеОрганизации); 
	
КонецПроцедуры

&НаСервере
Функция РолиИзменены(НачальныеРоли, ОрганизацияДиадок)
	
	Роли = РолиОрганизации();
	
	Для каждого Роль Из Роли Цикл
		Если НачальныеРоли[Роль] <>	ОрганизацияДиадок[Роль] Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
	
&НаСервере
Функция РолиОрганизации()
	
	Результат = Новый Массив;
	
	Результат.Добавить("Грузоотправитель");
	Результат.Добавить("Перевозчик");
	Результат.Добавить("Грузополучатель");
	Результат.Добавить("Оформитель");
	Результат.Добавить("Медик");
	Результат.Добавить("ТехОсмотр");
	Результат.Добавить("Одометр");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти