
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивЗаказов") Тогда
		МассивУдаление = Новый Массив;
		Для каждого Т Из Объект.Расходы Цикл
			Если ТипЗнч(Т.АналитикаРасходов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				Если Параметры.МассивЗаказов.Найти(Т.АналитикаРасходов) = Неопределено Тогда
					МассивУдаление.Добавить(Т);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для каждого М Из МассивУдаление Цикл
			Объект.Расходы.Удалить(М);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Т Из Объект.Расходы Цикл
		Если ТипЗнч(Т.АналитикаРасходов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Т.Объем = ОД_ОбщиеФункции.ПолучитьВесОбъемДляДокумента(Т.АналитикаРасходов).Объем;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура РаспределитьСуммуНаСервере()

	ТЗ = Объект.Расходы.Выгрузить();
	ИтогОбъем = ТЗ.Итог("Объем");
	
	Если ИтогОбъем = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИтогСумма = 0;
	Для каждого Т Из Объект.Расходы Цикл
		Т.Цена		= СуммаКРаспределению * (Т.Объем / ИтогОбъем);
		Т.Сумма		= Т.Цена;
		ИтогСумма = ИтогСумма + Т.Сумма;
	КонецЦикла;
	
	Корр = СуммаКРаспределению - ИтогСумма;
	Если Корр <> 0 Тогда
		Объект.Расходы[0].Цена		= Объект.Расходы[0].Цена + Корр;
		Объект.Расходы[0].Сумма		= Объект.Расходы[0].Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОД_РаспределитьСуммуПосле(Команда)

	РаспределитьСуммуНаСервере();
	Для каждого Т Из Объект.Расходы Цикл
		ОбработатьСтрокуТЧ(Т);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьСтрокуТЧ(ТекущиеДанные)
	
	ТекущаяСтрока = Новый Структура;
	ТекущаяСтрока.Вставить("Количество",          ?(ТекущиеДанные.Количество <> 0, ТекущиеДанные.Количество, 1));
	ТекущаяСтрока.Вставить("Цена",                ТекущиеДанные.Цена);
	ТекущаяСтрока.Вставить("Сумма",               ТекущиеДанные.Сумма);
	ТекущаяСтрока.Вставить("СтавкаНДС",           ТекущиеДанные.СтавкаНДС);
	ТекущаяСтрока.Вставить("СуммаНДС",            ТекущиеДанные.СуммаНДС);
	ТекущаяСтрока.Вставить("СуммаСНДС",           ТекущиеДанные.СуммаСНДС);
	ТекущаяСтрока.Вставить("СуммаВзаиморасчетов", ТекущиеДанные.СуммаВзаиморасчетов);
	
	СтруктураПересчетаСуммы = ПоляПересчетаСуммыНДСВСтрокеТЧ(ЭтаФорма);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекущаяСтрока, , "Количество");
	
КонецПроцедуры
