#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Пропускаем обработку, чтобы гарантировать получение формы объекта при передаче параметра "АвтоТест".
	Если ДанныеЗаполнения = "АвтоТест" 
		ИЛИ ДанныеЗаполнения = Неопределено
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Ответственный	= Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Для каждого ДокОснование Из ДанныеЗаполнения Цикл
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Рекламация") Тогда
				Организация		= ДокОснование.Организация;
				Партнер			= ДокОснование.Партнер;
				Основание		= ДокОснование;
				Для каждого Т Из ДокОснование.Товары Цикл
					НоваяСтрока = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
	Иначе
		Организация		= ДанныеЗаполнения.Организация;
		Партнер			= ДанныеЗаполнения.Партнер;
		Основание		= ДанныеЗаполнения;
		
		Для каждого Т Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		КонецЦикла;
	КонецЕсли;
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыРемонт.ВРаботе
		И ЗначениеЗаполнено(ПриемкаВРемонт) Тогда
		
		Движения.СвободныеОстатки.Записывать = Истина;
		Для Каждого Т Из Товары Цикл

			СвободныйОстаток = ПолучитьСвободныйОстаток(Т.Номенклатура, ПриемкаВРемонт);
			
			Если СвободныйОстаток < Т.Количество Тогда
				Сообщить("Номенклатура: " + Т.Номенклатура);
				Сообщить("Требуется: " + Т.Количество);
				Сообщить("Свободный остаток: " + СвободныйОстаток);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = Движения.СвободныеОстатки.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период				= Дата;
			Движение.Номенклатура		= Т.Номенклатура;
			Движение.Склад				= ПриемкаВРемонт;
			Движение.ВРезервеСоСклада	= Т.Количество;
		КонецЦикла;

		Движения.ТоварыКОтгрузке.Записывать = Истина;
		Для Каждого Т Из Товары Цикл
			Движение = Движения.ТоварыКОтгрузке.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период				= Дата;
			Движение.ДокументОтгрузки	= Ссылка;
			Движение.Номенклатура		= Т.Номенклатура;
			Движение.Склад				= ПриемкаВРемонт;
			Движение.ВРезерве			= Т.Количество;
		КонецЦикла;
	Иначе
		ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	//ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();	
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область Дополнительно

Функция ПолучитьСвободныйОстаток(п_Номенклатура, п_Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
		|ГДЕ
		|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
		|	И СвободныеОстаткиОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("Склад", п_Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Остаток;
	КонецЦикла;
	
	Возврат 0;

КонецФункции // ()

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры
	
#КонецОбласти