///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

//РаботаСВнешнимОборудованием
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
Перем глПодключаемоеОборудованиеСобытиеОбработано Экспорт; // для предотвращения повторной обработки события
Перем глДоступныеТипыОборудования Экспорт;
//Конец РаботаСВнешнимОборудованием

//++ НЕ ГОСИС
// ЭлектронноеВзаимодействие
Перем ПараметрыПодсистемыОбменСБанками Экспорт;
// При соответствующих настройках сертификата ЭП в соответствии будут храниться пары Сертификат-Пароль (в данном сеансе)
Перем СоответствиеСертификатаИПароля Экспорт;
// Конец ЭлектронноеВзаимодействие

// ШтрихкодыБольничныхЛистов
Перем глШтрихкодыБольничныхЛистовСобытиеОбработано Экспорт; 
// Конец ШтрихкодыБольничныхЛистов

Перем глКомпонентаОбменаСМобильнымиПриложениями Экспорт;
Перем глФормаНачальнойНастройкиПрограммы Экспорт;
//-- НЕ ГОСИС

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

// ТехнологияСервиса
Перем ОповещениеПриПримененииЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса Экспорт;
// Конец ТехнологияСервиса

// Параметры для фоновых заданий
Перем ПараметрыПроверкиФоновыхЗаданий Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	//++ НЕ ГОСИС
	глФормаНачальнойНастройкиПрограммы = ОткрытиеФормПриНачалеРаботыСистемыВызовСервера.ФормаНачальнойНастройкиПрограммы();
	//-- НЕ ГОСИС
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	//++ Локализация
	//++ НЕ ГОСИС
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователейКлиент.ПередНачаломРаботыСистемы();
	// Конец ИнтернетПоддержкаПользователей
	//-- НЕ ГОСИС
	//-- Локализация
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование

	// Зинаков
	Если QWERTY_Сервер.Получить_РольДоступна("РабочееМестоМенеджерПоПродукту") Тогда // 25.04.2025/1
		QWERTY_Сервер.МинимальныйИнтерфейс();
		ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Менеджер по продукту");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоМенеджерПоПродукту.Форма", П);

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоРуководительСервисногоОтдела") Тогда
		QWERTY_Сервер.МинимальныйИнтерфейс();
		ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Руководитель сервисного отдела");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоРуководительСервисногоОтдела.Форма", П);
	
	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоПомощникРуководителяСервисногоОтдела") Тогда
		QWERTY_Сервер.МинимальныйИнтерфейс();
		ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Помощник руководителя сервисного отдела");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоПомощникРуководителяСервисногоОтдела.Форма", П);

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоМенеджерПоМаркетингу") Тогда
		QWERTY_Сервер.МинимальныйИнтерфейс();
		ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Менеджер по маркетингу");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоМенеджерПоМаркетингу.Форма", П);

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоПомощникБухгалтера") Тогда
		QWERTY_Сервер.МинимальныйИнтерфейс();
		ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Помощник бухгалтера");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоПомощникБухгалтера.Форма", П);

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоМенеджераПоЗакупкам") Тогда
		//QWERTY_Сервер.МинимальныйИнтерфейс();
		//ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место менеджера по закупкам");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоМенеджераПоЗакупкам.Форма", П);

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоМенеджераПоЗакупкамПоставщикиРФ") Тогда
		//QWERTY_Сервер.МинимальныйИнтерфейс();
		//ОбновитьИнтерфейс();
		
		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место менеджера по закупкам поставщики РФ");
		
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
		
		П = Новый Структура;
		
		ОткрытьФорму("ВнешняяОбработка.РабочееМестоМенеджераПоЗакупкамПоставщикиРФ.Форма", П);
		
	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("Операционист") Тогда

		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Операционист");
		
		Если ЗначениеЗаполнено(СпрДОиО) Тогда
		
			QWERTY_Сервер.МинимальныйИнтерфейс();
			ОбновитьИнтерфейс();
		
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
			
			П = Новый Структура;
			
			ОткрытьФорму("ВнешняяОбработка.РабочееМестоОперационист.Форма", П);
		
		КонецЕсли;

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("МенеджерПоПродажамУправлениеРазделом") Тогда

		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Менеджер по продажам");
		
		Если ЗначениеЗаполнено(СпрДОиО) Тогда
		
			QWERTY_Сервер.МинимальныйИнтерфейс();
			ОбновитьИнтерфейс();
		
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
			
			П = Новый Структура;
			
			ОткрытьФорму("ВнешняяОбработка.РабочееМестоМенеджерПоПродажам.Форма", П);
		
		КонецЕсли;
		
	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РуководительОтделаПродажДополнительно") Тогда

		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Руководитель отдела продаж");
		
		Если ЗначениеЗаполнено(СпрДОиО) Тогда
		
			QWERTY_Сервер.МинимальныйИнтерфейс();
			ОбновитьИнтерфейс();
		
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
			
			П = Новый Структура;
			
			ОткрытьФорму("ВнешняяОбработка.РабочееМестоРуководительОтделаПродаж.Форма", П);
		
		КонецЕсли;
		
	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоМенеджераПоМаркетплейсам") Тогда

		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Менеджер по маркетплейсам");
		
		Если ЗначениеЗаполнено(СпрДОиО) Тогда
		
			//QWERTY_Сервер.МинимальныйИнтерфейс();
			//ОбновитьИнтерфейс();
		
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
			
			П = Новый Структура;
			
			ОткрытьФорму("ВнешняяОбработка.РабочееМестоМенеджераПоМаркетплайсам.Форма", П);
			
		КонецЕсли;

	ИначеЕсли QWERTY_Сервер.Получить_РольДоступна("РабочееМестоРуководительСклада") Тогда

		СпрДОиО = QWERTY_Сервер.ПолучитьДОиО("Рабочее место Руководитель склада");
		
		Если ЗначениеЗаполнено(СпрДОиО) Тогда
		
			//QWERTY_Сервер.МинимальныйИнтерфейс();
			//ОбновитьИнтерфейс();
		
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(СпрДОиО);
			
			П = Новый Структура;
			
			ОткрытьФорму("ВнешняяОбработка.РабочееМестоРуководительСклада.Форма", П);
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
	Если глКомпонентаОбменаСМобильнымиПриложениями <> Неопределено Тогда
		
		Попытка
			глКомпонентаОбменаСМобильнымиПриложениями.Отключить(0);
		Исключение
			ИмяСобытия = НСтр("ru='Ошибка при отключении компоненты обмена данными'");
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
			ИмяСобытия,
			"Ошибка",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),,Истина);
		КонецПопытки;
		
		глКомпонентаОбменаСМобильнымиПриложениями = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	//++ НЕ ГОСИС
	Если Лев(Источник, 17) = "MobileApplication" Тогда
		МобильныеПриложенияКлиент.ОбработатьВнешнееСобытиеОтМобильногоПриложения(Источник, Событие, Данные);
		Возврат;
	КонецЕсли;
	//-- НЕ ГОСИС
	
	глПодключаемоеОборудованиеСобытиеОбработано = Ложь;
	глШтрихкодыБольничныхЛистовСобытиеОбработано = Ложь;
	
	//РаботаСВнешнимОборудованием
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	// Передать на обработку данные
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'")
		                                                 + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	//Конец РаботаСВнешнимОборудованием
	
КонецПроцедуры

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Обсуждения
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
	
		МодульОбсужденияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияСлужебныйКлиент");
		МодульОбсужденияСлужебныйКлиент.ПриПолученииФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Обсуждения
		
КонецПроцедуры

#КонецОбласти

#Область Инициализация

//++ НЕ ГОСИС
глНомерКонтейнераСбербанк     = 0;
глУстановленКаналСоСбербанком = Ложь;
//-- НЕ ГОСИС

глПодключаемоеОборудованиеСобытиеОбработано = Ложь;
глШтрихкодыБольничныхЛистовСобытиеОбработано = Ложь;

#КонецОбласти