#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получить описание опасного груза
//
// Параметры:
//  НомерООН			 - Строка	 - номер ООН
//  КлассификационныйКод - Строка	 - классификационный код
//  ГруппаУпаковки		 - Строка, ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки	 - группа упаковки
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурЛогистика_ОписанияОпасныхГрузов - описание груза
//
Функция ПолучитьОписаниеОпасногоГруза(НомерООН, КлассификационныйКод = Неопределено, ГруппаУпаковки = Неопределено) Экспорт
	
	Если ТипЗнч(ГруппаУпаковки) = Тип("ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки") Тогда
		ГруппаУпаковкиЗначение = ГруппаУпаковки;
	Иначе
		// Пробуем сконвертировать
		Попытка
			Если ГруппаУпаковки <> Неопределено Тогда 
				ГруппаУпаковкиЗначение = Перечисления.КонтурЛогистика_ГруппыУпаковки[ГруппаУпаковки];
			Иначе
				ГруппаУпаковкиЗначение = ГруппаУпаковки;
			КонецЕсли;
		Исключение
			ГруппаУпаковкиЗначение = ГруппаУпаковки;
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерООН", НомерООН);
	Запрос.УстановитьПараметр("ОтборПоКлассификационныйКод", ЗначениеЗаполнено(КлассификационныйКод));
	Запрос.УстановитьПараметр("КлассификационныйКод", КлассификационныйКод);
	Запрос.УстановитьПараметр("ОтборПоГруппаУпаковки", ЗначениеЗаполнено(ГруппаУпаковкиЗначение));
	Запрос.УстановитьПараметр("ГруппаУпаковки", ГруппаУпаковкиЗначение);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОписанияОпасныхГрузов КАК КонтурЛогистика_ОписанияОпасныхГрузов
	|ГДЕ
	|	НЕ КонтурЛогистика_ОписанияОпасныхГрузов.ПометкаУдаления
	|	И КонтурЛогистика_ОписанияОпасныхГрузов.НомерООН = &НомерООН
	|	И (НЕ &ОтборПоКлассификационныйКод
	|			ИЛИ &ОтборПоКлассификационныйКод
	|				И КонтурЛогистика_ОписанияОпасныхГрузов.КлассификационныйКод = &КлассификационныйКод)
	|	И (НЕ &ОтборПоГруппаУпаковки
	|			ИЛИ &ОтборПоГруппаУпаковки
	|				И КонтурЛогистика_ОписанияОпасныхГрузов.ГруппаУпаковки = &ГруппаУпаковки)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Берем первую
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

Функция СоздатьНовыйПоXDTO(СвОпаснГруз) Экспорт
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Попытка
		
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.ТипДокумента = "ДОПОГ";	// Документ, регламентирующий перевозку груза
		НовыйЭлемент.НомерООН = КС.XDTO_Вычислить(СвОпаснГруз, "ИдОпаснООН");
		НовыйЭлемент.НадлежащееОтгрузочноеНаименование = КС.XDTO_Вычислить(СвОпаснГруз, "НадОтгНаим");
		НовыйЭлемент.ТехническоеНаименование = КС.XDTO_Вычислить(СвОпаснГруз, "ТехНаим");
		НовыйЭлемент.Описание = КС.XDTO_Вычислить(СвОпаснГруз, "Описание");
		НовыйЭлемент.КлассификационныйКод = КС.XDTO_Вычислить(СвОпаснГруз, "КласКод");
		НовыйЭлемент.ЗнакОпасности = КС.XDTO_Вычислить(СвОпаснГруз, "ЗнОп");
		НовыйЭлемент.КодОграниченияТуннели = КС.XDTO_Вычислить(СвОпаснГруз, "КодОгрЧерТун");
		НовыйЭлемент.Радионуклиды = КС.XDTO_Вычислить(СвОпаснГруз, "НазРадионук");
		НовыйЭлемент.ОписаниеФизХимФормы = КС.XDTO_Вычислить(СвОпаснГруз, "ОписФизХимФорм");
		НовыйЭлемент.МаксАктивностьРадиации = КС.XDTO_Вычислить(СвОпаснГруз, "МаксАкт");
		НовыйЭлемент.КатегорияУпаковки = КС.XDTO_Вычислить(СвОпаснГруз, "КатУпак");
		НовыйЭлемент.ТранспортныйИндекс = КС.XDTO_Вычислить(СвОпаснГруз, "ТрансИндекс");
		НовыйЭлемент.ИндексБезопасности = КС.XDTO_Вычислить(СвОпаснГруз, "ИндексБез");
		НовыйЭлемент.ОпознавательныйЗнакСертификатов = КС.XDTO_Вычислить(СвОпаснГруз, "ОпозЗнак");
		НовыйЭлемент.ПолнаяАктивностьГруза = КС.XDTO_Вычислить(СвОпаснГруз, "ПолнАктГр");
		НовыйЭлемент.КонтрольнаяТемпература = КС.XDTO_Вычислить(СвОпаснГруз, "КонтТемпер");
		НовыйЭлемент.АварийнаяТемпература = КС.XDTO_Вычислить(СвОпаснГруз, "АварТемпер");
		
		// Код класса опасности груза
		КлассОпасн = КС.XDTO_Вычислить(СвОпаснГруз, "КлассОпасн");
		НовыйЭлемент.Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.ЗначениеИзXDTO(КлассОпасн);
		
		// Группа упаковки
		ГрУп = КС.XDTO_Вычислить(СвОпаснГруз, "ГрУп");
		ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.ЗначениеИзXDTO(ГрУп);
		
		НовыйЭлемент.Наименование = НовыйЭлемент.НадлежащееОтгрузочноеНаименование;
		
		НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент.Ссылка;
		
	Исключение
		
		Возврат ПустаяСсылка();
		
	КонецПопытки;
	
КонецФункции

Процедура ЗаполнитьТипДокументаПриОбнолвении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОписанияОпасныхГрузов КАК КонтурЛогистика_ОписанияОпасныхГрузов
	|ГДЕ
	|	НЕ КонтурЛогистика_ОписанияОпасныхГрузов.ПометкаУдаления
	|	И КонтурЛогистика_ОписанияОпасныхГрузов.ТипДокумента = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОписанияОпасныхГрузовОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОписанияОпасныхГрузовОбъект.ТипДокумента = "ДОПОГ";
		ОписанияОпасныхГрузовОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли