 
&После("ОбработкаПроведения")
Процедура ОД_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ТребуетсяЗаборГруза Тогда
		ОД_Логистика.ЗаписьВРегистреСостоянияИРеквизитыДоставки(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура ОД_ОбработкаУдаленияПроведения(Отказ)

	НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
	НЗ.Отбор.Распоряжение.Установить(Ссылка);
	НЗ.Записать();

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рекламация") Тогда
		ЗаполнитьДокументНаОснованииРекламация(ДанныеЗаполнения);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииРекламация(ДанныеЗаполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтотОбъект.Организация 				= ДанныеЗаполнения.Организация;
	ЭтотОбъект.Партнер					= ДанныеЗаполнения.Партнер;
	ЭтотОбъект.Контрагент				= ПолучитьКонтрагента(ДанныеЗаполнения.Партнер);
	ЭтотОбъект.Договор					= ПолучитьДоговор(ЭтотОбъект.Контрагент, ДанныеЗаполнения.Организация);
	ЭтотОбъект.СпособКомпенсации		= Перечисления.СпособыКомпенсацииВозвратовТоваров.ВернутьДенежныеСредства;
	ЭтотОбъект.ПоступлениеОднойДатой	= Истина;
	ЭтотОбъект.ДатаПоступления			= ТекущаяДатаСеанса();
	ЭтотОбъект.ЦенаВключаетНДС			= Истина;
	ЭтотОбъект.НалогообложениеНДС		= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ЭтотОбъект.Комментарий				= "Основание: " + ДанныеЗаполнения;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Реализация) Тогда
		ЭтотОбъект.Соглашение = ДанныеЗаполнения.Реализация.Соглашение;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ДанныеЗаполнения.Товары Цикл
		
		НоваяСтрока = ВозвращаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		НоваяСтрока.КоличествоУпаковок		= ТекСтрока.Количество;
		НоваяСтрока.Сумма					= ТекСтрока.Количество * ТекСтрока.Цена;
		НоваяСтрока.СуммаСНДС				= ТекСтрока.Количество * ТекСтрока.Цена;
		НоваяСтрока.СуммаСНДС				= ТекСтрока.Количество * ТекСтрока.Цена;
		НоваяСтрока.СтавкаНДС				= ТекСтрока.Номенклатура.СтавкаНДС;
		НоваяСтрока.ДокументРеализации		= ДанныеЗаполнения.Реализация;
		
		Ценообразование.ПересчитатьСуммыВСтрокеПоСуммеСНДС(
			НоваяСтрока,
			Истина,
			Ложь,
			Ложь,
			Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция  ПолучитьКонтрагента(п_Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции // ()

Функция  ПолучитьДоговор(п_Контрагент, п_Организация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора";
	
	Запрос.УстановитьПараметр("Контрагент",		п_Контрагент);
	Запрос.УстановитьПараметр("Организация",	п_Организация);
	Запрос.УстановитьПараметр("ТипДоговора",	Перечисления.ТипыДоговоров.СПокупателем);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции // ()
