
&НаСервере
Процедура КомандаЗаполнитьНаСервере()

	СтартовыйНабор2 = Новый Массив;
	СтартовыйНабор2.Добавить("Оборудование принимается как в гарантийный, так и в не гарантийный ремонт.");
	СтартовыйНабор2.Добавить("Стандартный гарантийный  срок на оборудование составляет  1 год со дня продажи. Факт и дата продажи оборудования   подтверждается только копией расходной накладной.");
	СтартовыйНабор2.Добавить("Срок проведения гарантийных работ составляет 45 суток (при наличии необходимых деталей и запасных частей), включая услуги по диагностике.");
	СтартовыйНабор2.Добавить("Технический центр вправе отказать в гарантийном ремонте оборудования при выявлении ненадлежащих  условий хранения и эксплуатации оборудования, а также при выходе оборудования из строя по вине заказчика.");
	СтартовыйНабор2.Добавить("Возможность осуществления гарантийного ремонта определяется только на основании результатов диагностики.");
	СтартовыйНабор2.Добавить("По не гарантийным случаям сроки проведения диагностики могут составлять до 21 рабочего дня, а при наличии «плавающих» и периодических дефектов до 45 рабочих дней.");                                                                        
	
	НаборЗаписей2 = РегистрыСведений.ПечатьАктРекламацииУсловияРемонта.СоздатьНаборЗаписей();
	Сч = 1;
	Для Каждого Стр Из СтартовыйНабор2 Цикл
		НовЗапись = НаборЗаписей2.Добавить();
		НовЗапись.Порядок = Сч;
		НовЗапись.Содержание = Стр;
		Сч = Сч + 1;
	КонецЦикла;
	
	НаборЗаписей2.Записать();	

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	КомандаЗаполнитьНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры
