
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаОчередьЗаданий.Видимость = Не (КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОчередьЗаданий(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_ОчередьЗаданийСценариевАвтоматическойРаботы.Форма.ФормаСписка",,
		ЭтаФорма,,,, РежимОткрытияОкнаФормы.Независимый, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПропуститьСобытия(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Пропустить выделенные?";
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса,,,, ЭтаФорма, "ПропуститьСобытияВопросЗавершение");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПропуститьСобытияВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПропуститьВыделенныеСтроки();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПропуститьВыделенныеСтроки()
	
	Для Каждого ТекущиеДанные Из Элементы.Список.ВыделенныеСтроки Цикл
		
		РегистрыСведений.КонтурЛогистика_ОшибкиСценариевАвтоматическойРаботы.УдалитьЗапись(
			ТекущиеДанные.СценарииАвтоматическойРаботы, ТекущиеДанные.ОбъектОбработки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

