
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Токен", Токен);
	Параметры.Свойство("ОписанияПравОрганизации", ОписанияПравОрганизации);
	Параметры.Свойство("ДокументСсылка", ДокументСсылка);
	
	Если Параметры.Свойство("РолиОрганизации") Тогда
		
		Если Параметры.РолиОрганизации = Неопределено Тогда
			РолиОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.РолиОрганизации(Организация);
		Иначе
			РолиОрганизации = Параметры.РолиОрганизации;
		КонецЕсли;
		
		ВсеРоли = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли();
		Для Каждого ИмяРоли Из ВсеРоли Цикл
			ЭтаФорма[ИмяРоли] = РолиОрганизации[ИмяРоли];
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		НашаОрганизация = Организация.Наш;
	КонецЕсли;
	
	ИспользуетсяЗаказЗаявка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка");
	ИспользуетсяТРН = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН");
	ИспользуетсяПутевойЛист = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист");
	ИспользуетсяПутевойЛист_5_02 = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02");
	ИспользуетсяПоручениеЭкспедитору = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПоручениеЭкспедитору");
	ИспользуетсяЭкспедиторскаяРасписка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка");
	ИспользуетсяСкладскаяРасписка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяСкладскаяРасписка");
	
	ОбновитьБаннерВалидации();
	
	ОтправитьМетрику(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаОсновнаяРоль.Видимость = (
		ИспользуетсяЗаказЗаявка
			Или ИспользуетсяТРН
			Или ИспользуетсяПоручениеЭкспедитору
			Или ИспользуетсяЭкспедиторскаяРасписка
			Или ИспользуетсяСкладскаяРасписка);
	Элементы.ГруппаРольПутевогоЛиста.Видимость = (ИспользуетсяПутевойЛист Или ИспользуетсяПутевойЛист_5_02);
	
	Элементы.ТехОсмотр.Видимость = Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502();
	Элементы.Одометр.Видимость = Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502();
	Элементы.Экспедитор.Видимость = (ИспользуетсяПоручениеЭкспедитору Или ИспользуетсяЭкспедиторскаяРасписка Или ИспользуетсяСкладскаяРасписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность
		И Не ЗакрытиеФормыПодтверждено
		И (ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы) Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохраненияКодаЗавершение", ЭтаФорма);
		ТекстВопроса = "Данные были изменения. Сохранить изменения?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ФормаПроверкиПравДоступа_Закрытие" Тогда
		ОписанияПравОрганизации = Неопределено;
		ОбновитьБаннерВалидации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияКодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗакрытьФормуСРезультатом();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		ЗакрытиеФормыПодтверждено = Истина;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольПриИзменении(Элемент)
	
	ОбновитьБаннерВалидации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗакрытьФормуСРезультатом();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкиПравДоступа(Команда)
	
	Если ОписанияПравОрганизации = Неопределено Тогда
		ОбновитьОписанияПравОрганизации();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ЭтоАдминистратор", ОписанияПравОрганизации.ЭтоАдминистратор);
	ПараметрыФормы.Вставить("РезультатВалидацииПрав", РезультатВалидацииПрав);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаПроверкиПравДоступа", ПараметрыФормы,
		ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьФормуСРезультатом()
	
	ЗакрытиеФормыПодтверждено = Истина;
	
	РолиОрганизации = РолиОрганизации();
	
	Закрыть(РолиОрганизации);
	
КонецПроцедуры

&НаСервере
Функция РолиОрганизации()
	
	РолиОрганизации = Новый Структура;
	
	ВсеРоли = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли();
	
	Для Каждого ИмяРоли Из ВсеРоли Цикл
		РолиОрганизации.Вставить(ИмяРоли, ЭтаФорма[ИмяРоли]);
	КонецЦикла;
	
	Возврат РолиОрганизации;
	
КонецФункции

&НаСервере
Процедура ОбновитьБаннерВалидации()
	
	Если РежимАвторизации <> Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow
		Или Не НашаОрганизация Тогда
		
		Элементы.ГруппаВалидацияПрав.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ОписанияПравОрганизации = Неопределено Тогда
		ОбновитьОписанияПравОрганизации();
	КонецЕсли;
	
	РезультатВалидацииПрав = КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияПравПользователяПоОрганизации(
		РолиОрганизации(), ОписанияПравОрганизации, ДокументСсылка);
	Элементы.ГруппаВалидацияПрав.Видимость = РезультатВалидацииПрав.Отказ;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписанияПравОрганизации()
	
	Организации = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(Организация);
	ОписанияПравОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ОписанияПравОрганизацииВСервисах(Организации, Токен);
	ОписанияПравОрганизации = ОписанияПравОрганизаций.Получить(Организация);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьМетрику(Параметры)
	
	ДанныеРолиОрганизации = РолиОрганизации();
	РолиОрганизации = Новый Массив;
	Для Каждого ТекущаяСтрока Из ДанныеРолиОрганизации Цикл
		Если ТекущаяСтрока.Значение Тогда
			РолиОрганизации.Добавить(ТекущаяСтрока.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("BoxID", Организация.ID);
	ДопИнформация.Вставить("РолиОрганизации", РолиОрганизации);
	
	Если РезультатВалидацииПрав <> Неопределено
		И РезультатВалидацииПрав.Отказ Тогда
		
		ПраваЛогистики = РезультатВалидацииПрав.Логистика.ПЛ;
		КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ДополнитьМассивЛок(ПраваЛогистики, РезультатВалидацииПрав.Логистика.ТРН);
		
		ДопИнформация.Вставить("ПраваЛогистики", ПраваЛогистики);
		ДопИнформация.Вставить("ПраваДиадока", РезультатВалидацииПрав.Диадок);
	КонецЕсли;
	
	Если Параметры.Свойство("Метрики_Категоря") Тогда
		Метрики_Категоря = Параметры.Метрики_Категоря;
	Иначе
		Метрики_Категоря = "Авторизация";
	КонецЕсли;
	
	Если Параметры.Свойство("Метрики_МестоВызова") Тогда
		Метрики_МестоВызова = Параметры.Метрики_МестоВызова;
	Иначе
		Метрики_МестоВызова = "Выбор роли";
	КонецЕсли;
	
	Если Параметры.Свойство("Метрики_Действие") Тогда
		Метрики_Действие = Параметры.Метрики_Действие;
	Иначе
		Метрики_Действие = ЭтаФорма.ИмяФормы;
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		Метрики_Категоря, Метрики_Действие, Метрики_МестоВызова,,, ДопИнформация);
	
КонецПроцедуры

#КонецОбласти