#Область СлужебныйПрограммныйИнтерфейс

// Записываем замеры
//
// Параметры:
//  КоллекцияЗамеров - Массив	 - Фиксируемые замеры. См. КонтурЛогистика_ЗамерыКлиентСервер.НовыйОписаниеЗамера
//
Процедура ЗаписатьЗамерыДлительнойОперации(КоллекцияЗамеров) Экспорт
	
	Если Не ИспользоватьЗамеры() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Замер Из КоллекцияЗамеров Цикл
		ЗаписатьЗамер(Замер);
	КонецЦикла;
	
КонецПроцедуры

// Используется иди нет замеры
// 
// Возвращаемое значение:
//  Булево - признак использования замеров
//
Функция ИспользоватьЗамеры() Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьЗамерыПроизводительности");
	
КонецФункции

// Прогревает кэши ПовтИсп, используемые при оформлении титула, до старта замера времени.
//
// Параметры:
//  ТипЛогистика                  - ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов
//  УчетныйДокумент 			  - Строка, Тип, ДокументСсылка, Неопределено
//  СпецСценарий                  - ПеречислениеСсылка.КонтурЛогистика_СпецСценарииЗадач, Неопределено
//
Процедура ПрогретьПовтИспДляОформленияТитула(ТипЛогистика, УчетныйДокумент = Неопределено, СпецСценарий = Неопределено) Экспорт
	
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика);
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики();
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяХарактеристики();
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдному");
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики");
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	
	КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ТипЛогистика, УчетныйДокумент, СпецСценарий);
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МассивНастроекКонвертацииПоТипуЛогистики(ТипЛогистика);
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьМассивТитуловОформляемыхТекущимПользователем();
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СвязиДокументовПоТитулам();
	
	ПрогретьПовтИспПоТипуТитула(ТипЛогистика);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЗамер(Замер)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("ДатаНачалаКлючевойОперации", Замер.ДатаНачалаКлючевойОперации);
	Переменные.Вставить("ДатаОкончанияКлючевойОперации", Замер.ДатаОкончанияКлючевойОперации);
	Переменные.Вставить("Длительность", Замер.Длительность);
	
	ДополнительныеПеременныеЗамера = Замер.ДополнительныеПеременные;
	
	Если ЗначениеЗаполнено(ДополнительныеПеременныеЗамера) Тогда
		
		Для Каждого ДопПеременная Из Замер.ДополнительныеПеременные Цикл
			Переменные.Вставить(ДопПеременная.Ключ, ДопПеременная.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	НомерСеанса = НомерСеансаИнформационнойБазы();
	
	НаборЗаписей = РегистрыСведений.КонтурЛогистика_ЗамерыВремени.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.КлючеваяОперация.Установить(Замер.КлючеваяОперация);
	НаборЗаписей.Отбор.ДатаНачалаЗамера.Установить(Замер.ДатаНачалаКлючевойОперации);
	НаборЗаписей.Отбор.НомерСеанса.Установить(НомерСеанса);
	
	// В старых базах встречаются подписки на событие записи, чтоб наш регистр игнорировался.
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.КлючеваяОперация = Замер.КлючеваяОперация;
	Запись.ДатаНачалаЗамера = Замер.ДатаНачалаКлючевойОперации;
	Запись.НомерСеанса = НомерСеанса;
	
	Запись.ВремяВыполнения = Замер.Длительность;
	Запись.ВесЗамера = 1;
	Запись.Комментарий = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(Переменные);
	Запись.ЭтоОсновнойЗамер = Замер.ЭтоОсновнойЗамер;
	
	Запись.ДатаЗаписи = УниверсальноеВремя(ТекущаяДатаСеанса);
	Запись.ДатаЗаписиНачалоЧаса = УниверсальноеВремя(НачалоЧаса(ТекущаяДатаСеанса));
	Запись.ДатаЗаписиЛокальная = ТекущаяДатаСеанса;
	Запись.ДатаОкончания = Замер.ДатаОкончанияКлючевойОперации;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПрогретьПовтИспПоТипуТитула(ТипЛогистика)
	
	ТипыЛогистическихДокументов = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов;
	
	Если ТипЛогистика = ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест");
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто");
		
	ИначеЕсли ТипЛогистика = ТипыЛогистическихДокументов.ТрН_Титул3 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3ТоварыУчитыватьУчетныйДокумент");
		
	ИначеЕсли ТипЛогистика = ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МетодОпределенияМассы");
		
	ИначеЕсли ТипЛогистика = ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ДатОтгрСДнейПлюсОтТек");
		КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ДнейНаПогрузку");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти