#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьпредставлениеАдреса();
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_ПодразделенияДиадок_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура СформироватьпредставлениеАдреса()
	
	Если ЗначениеЗаполнено(АдресКодГАР) И ЗначениеЗаполнено(АдресПредставление) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КонтурЛогистика_ВводАдреса.ЭтоСтранаРоссияПодразделенияДиадок(ИнАдресCountry)
		И ЗначениеЗаполнено(ИнАдресAddress) Тогда
		
		Если ЗначениеЗаполнено(ИнАдресCountry) Тогда
			АдресПредставление = СокрЛП(ИнАдресCountry + ", " + ИнАдресAddress);
		Иначе
			АдресПредставление = ИнАдресAddress;
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресКодГАР)
		И ЗначениеЗаполнено(АдресПредставление)
		И Не КонтурЛогистика_ВводАдреса.ПодразделениеДиадокИспользуетАдресКЛАДР(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// TODO объединить с Организациями Диадок
	АдресПредставление = СокрЛП("" + АдресZipCode + " " + АдресRegion);
	
	Если ЗначениеЗаполнено(АдресTerritory) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресTerritory; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресCity) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресCity; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресLocality) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресLocality; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресStreet) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресStreet; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресBuilding) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресBuilding; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресBlock) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресBlock; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресApartment) Тогда 
		АдресПредставление = АдресПредставление + ", " + АдресApartment; 	
	КонецЕсли;

	Если ЗначениеЗаполнено(ИнАдресCountry) Тогда 
		АдресПредставление = АдресПредставление + ", " + ИнАдресCountry; 	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнАдресAddress) Тогда 
		АдресПредставление = АдресПредставление + ", " + ИнАдресAddress; 	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли