
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаКлиенте
Процедура ОД_ПослеЗаписиПосле(ПараметрыЗаписи)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

#Область НаборыКомплекты

Процедура ЗаполнитьНаборыКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ_Товары.Номенклатура КАК Номенклатура,
		|	ТЗ_Товары.НоменклатураНабора КАК НоменклатураНабора,
		|	ТЗ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТЗ_Товары.СуммаСНДС КАК СуммаСНДС
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(ВТ_Товары.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_Товары.СуммаСНДС) КАК Сумма,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВТ_Товары.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок) КАК КоличествоВНаборе,
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Наборы.Набор КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Сумма / (ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе)
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
		|		ПО ВТ_Наборы.ВариантКомплектации = ВТ_ВариантыКомплектации.ВариантКомплектации";
	
	
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_Товары.Колонки.Добавить("НоменклатураНабора", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_Товары.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТЗ_Товары.Колонки.Добавить("СуммаСНДС", Новый ОписаниеТипов("Число"));
	
	ТЗ_Распоряжения = Объект.ТоварыПоРаспоряжениям.Выгрузить();
	ТЗ_Распоряжения.Свернуть("Распоряжение");
	
	Для каждого СтрокаТЗ Из ТЗ_Распоряжения Цикл 
		Для каждого Т Из СтрокаТЗ.Распоряжение.Товары Цикл
			// не берем товары, если они есть в заказе, но нет в ордере
            НайденыСтроки = Объект.ОтгружаемыеТовары.НайтиСтроки(Новый Структура("Номенклатура", Т.Номенклатура));
			Если НайденыСтроки.Количество() > 0 Тогда
				НоваяСтрока = ТЗ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	

	Запрос.УстановитьПараметр("ТЗ_Товары", ТЗ_Товары);
	
	РезультатЗапроса = Запрос.Выполнить();

	Наборы.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Наборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	НаборыКомплектыКоличество = Наборы.Количество();

КонецПроцедуры

#КонецОбласти
