
#Область СобытияФормы
	
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокАдресовДоставки();
	
	Если Объект.Основания.Количество() > 1 Тогда
		Элементы.СтраницыОснование.ТекущаяСтраница = Элементы.СтраницаОснования;
		НадписьЗаголовокОснования = "Всего оснований: " + Объект.Основания.Количество();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	КонецЕсли;

	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы
	
&НаКлиенте
Процедура ОД_ТоварыПриИзмененииПосле(Элемент)

	ЗаполнитьСписокАдресовДоставки();

КонецПроцедуры

&НаКлиенте
Процедура ОД_НадписьЗаголовокОснованияНажатиеПосле(Элемент, СтандартнаяОбработка)

	СписокДокументов = Новый СписокЗначений;
	Для каждого Т Из Объект.Основания Цикл
		СписокДокументов.Добавить(Т.Основание);
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму(
		"ОбщаяФорма.ПросмотрСпискаДокументов",
		Новый Структура("СписокДокументов, Заголовок",
			СписокДокументов,
			НСтр("ru='Документы (%КоличествоДокументов%)'")
		),
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

Функция ВалютаРегламентированногоУчета()

	Возврат Константы.ВалютаРегламентированногоУчета.Получить();

КонецФункции // ()

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", Истина);
	ПараметрыФормы.Вставить("НалогообложениеНДС", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС"));
	ПараметрыФормы.Вставить("ВернутьМногооборотнуюТару", Ложь);
	ПараметрыФормы.Вставить("Соглашение", Неопределено);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Валюта", ВалютаРегламентированногоУчета());
	
	ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	
КонецПроцедуры
	
#КонецОбласти

#Область Доставка

Функция  ПолучитьКонтрагента(п_Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции // ()

Процедура ЗаполнитьСписокАдресовДоставки()

	Элементы.АдресДоставки.СписокВыбора.Очистить();
	Если Объект.Товары.Количество() > 0 Тогда
		Партнер = Объект.Товары[0].АналитикаРасходов;
		Если ТипЗнч(Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
			Контрагент = ПолучитьКонтрагента(Партнер);
			АдресаПолучателяИзКонтактнойИнформации = ОД_Логистика.ФактАдресаКонтрагента(Контрагент);
			Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации Цикл
				Элементы.АдресДоставки.СписокВыбора.Добавить(Стр.АдресДоставки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция АдресаПолучателяИзКонтактнойИнформации(п_Партнер)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС_ДополнительнаяИнформация
		|		ПО КонтактнаяИнформация.Представление = РС_ДополнительнаяИнформация.АдресДоставки
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И НЕ ЕСТЬNULL(РС_ДополнительнаяИнформация.НеАктуален, ЛОЖЬ)");
		
	Запрос.УстановитьПараметр("ПолучательОтправитель", п_Партнер);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции


#КонецОбласти

#Область Вспомогательные

Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого Т Из ТоварыИзХранилища Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Т,,"КодСтроки");
		
		Если ЗначениеЗаполнено(Т.СтатьяРасходовАктивов) Тогда
			НоваяСтрока.СтатьяРасходов = Т.СтатьяРасходовАктивов;
		Иначе
			НоваяСтрока.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
		КонецЕсли;
		
		НоваяСтрока.ТипСтатьи = 1;
		НоваяСтрока.СкладОбязателен = 1;
		НоваяСтрока.ДатаОтгрузкиОбязательна = 1;
		НоваяСтрока.ДатаОтгрузки = Объект.ДатаОтгрузки;
		
		ДокументОснование = "";
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			ДокументОснование = Объект.ДокументОснование;
		ИначеЕсли Объект.Основания.Количество() > 0 Тогда
			ДокументОснование = Объект.Основания[0].Основание;
		КонецЕсли;

		Если ЗначениеЗаполнено(Т.Аналитика) Тогда
			НоваяСтрока.АналитикаРасходов = Т.Аналитика;
		Иначе
			Партнер = "";
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				Партнер = ДокументОснование.Партнер;
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Ремонт")
					И ЗначениеЗаполнено(ДокументОснование.ПартнерОсуществляетРемонт) Тогда
					Партнер = ДокументОснование.ПартнерОсуществляетРемонт;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.АналитикаРасходов = Партнер;
		КонецЕсли;
		
	КонецЦикла;

	ОД_ЗаполнитьОбеспечениеЗаказа();
	
КонецПроцедуры

Процедура ОД_ЗаполнитьОбеспечениеЗаказа()

	ПереченьВариантов = Новый Массив();
	ПереченьВариантов.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить);
	ПереченьВариантов.Добавить(Перечисления.ВариантыОбеспечения.Требуется);

	ИндексыСтрок = Новый Массив;
	Для каждого Т Из Объект.Товары Цикл
		ИндексыСтрок.Добавить(Т.НомерСтроки - 1);
	КонецЦикла; 
	
	МенеджерДокумента = Документы.ЗаказНаВнутреннееПотребление;

	Объект.НеОтгружатьЧастями = Ложь;

	ПараметрыЗаполнения = МенеджерДокумента.ПараметрыВыбораОбеспечения(Объект.Статус);
	ТаблицаОбеспечения = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспеченияДокумента(
		Объект, ПереченьВариантов, ПараметрыЗаполнения, ИндексыСтрок);

	МенеджерДокумента.ЗаполнитьВариантОбеспечения(Объект, ЭтаФорма, "ИндексыСтрок", ТаблицаОбеспечения);
	
КонецПроцедуры

#КонецОбласти