#Область СлужебныйПрограммныйИнтерфейс

Функция Сериализовать(Знач Значение) Экспорт
	
	Если Значение = ПредоставленКлиентом Тогда
		Возврат "1";
	ИначеЕсли Значение = ПредоставленЭкспедитором Тогда
		Возврат "2";
	Иначе
		Возврат "";
	КонецЕсли;
	
 КонецФункции

Функция Десериализовать(Знач Значение) Экспорт
	
	Если Значение = "1" Тогда
		Возврат ПредоставленКлиентом;
	ИначеЕсли Значение = "2" Тогда
		Возврат ПредоставленЭкспедитором;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти