
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументОснования", ДокументОснования);
	
	Если ЗначениеЗаполнено(ДокументОснования) Тогда
		ЗаполнитьДанныеМаршрутов();
		СоздатьПанелиМаршрутов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСостоянияФлажковИИтогов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВыбратьВсеПриИзменении(Элемент)
	
	Для Каждого ТекущаяСтрока Из ДанныеМаршрутов Цикл
		ТекущаяСтрока.Пометка = ВыбратьВсе;
	КонецЦикла;
	
	ОбновитьСостоянияФлажковИИтогов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкаМаршрутПриИзменении(Элемент)
	
	ИдентификаторМаршрута = СтрЗаменить(Элемент.Имя, "ПометкаМаршрут_", "");
	Для Каждого ТекущаяСтрока Из ДанныеМаршрутов Цикл
		
		Если ТекущаяСтрока.ИдентификаторМаршрута <> ИдентификаторМаршрута Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока.Пометка = ЭтаФорма["Пометка_" + ИдентификаторМаршрута];
		
	КонецЦикла;
	
	ОбновитьСостоянияФлажковИИтогов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекарацияМаршрутНажатие(Элемент)
	
	ИдентификаторМаршрута = СтрЗаменить(Элемент.Имя, "ДекарацияМаршрут_", "");
	
	Для Каждого ТекущаяСтрока Из ДанныеМаршрутов Цикл
		Если ТекущаяСтрока.ИдентификаторМаршрута <> ИдентификаторМаршрута Тогда
			Продолжить;
		КонецЕсли;
		
		ПоказатьЗначение(, ТекущаяСтрока.ЗаявкиНаМаршрут);
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьСоздание(Команда)
	
	СозданныеДокументы = СоздатьСкладсикеРасписки();
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка");
	
	Если СозданныеДокументы.Количество() = 1 Тогда
		
		// Откроем документ
		КонтурЛогистика_СтдДиалогиКлиент.ПоказатьЗначениеЛок(, СозданныеДокументы[0]);
		
	Иначе
		
		// Откроем список
		ДокументЛогистикаЛок = Новый СписокЗначений();
		ДокументЛогистикаЛок.ЗагрузитьЗначения(СозданныеДокументы);
		ПараметрыОтбора = Новый Структура("ДокументЛогистика", ДокументЛогистикаЛок);
		
		ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
		ПараметрыФормы.Вставить("ТипЛогистика", ТипЛогистика);
		ПараметрыФормы.Вставить("СпецСценарий", Неопределено);
		
		ОткрытьФорму("ОбщаяФорма.КонтурЛогистика_Задачи", ПараметрыФормы,, Истина);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеМаршрутов()
	
	ДанныеМаршрутов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснования", ДокументОснования);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК ЗаявкиНаМаршрут,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.АдрГруз КАК АдресПогрузки,
	|	"""" КАК ИдентификаторСтрокиЗаявкиНаМаршрут
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 = &ДокументОснования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЭкспедиторскаяРаспискаЗаявкиНаМаршрут.ЗаявкаНаМаршрут,
	|	КонтурЛогистика_ЭкспедиторскаяРаспискаЗаявкиНаМаршрут.ЗаявкаНаМаршрут.АдрГруз,
	|	КонтурЛогистика_ЭкспедиторскаяРаспискаЗаявкиНаМаршрут.ИдентификаторСтроки
	|ИЗ
	|	Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.ЗаявкиНаМаршрут КАК КонтурЛогистика_ЭкспедиторскаяРаспискаЗаявкиНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ЭкспедиторскаяРаспискаЗаявкиНаМаршрут.Ссылка = &ДокументОснования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПредставлениеАдреса = Справочники.КонтурЛогистика_ПунктыМаршрута.ПредставлениеАдреса_(Выборка.АдресПогрузки);
		
		НоваяСтрока = ДанныеМаршрутов.Добавить();
		НоваяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут = Выборка.ИдентификаторСтрокиЗаявкиНаМаршрут;
		НоваяСтрока.ЗаявкиНаМаршрут = Выборка.ЗаявкиНаМаршрут;
		НоваяСтрока.АдресПогрузки = Выборка.АдресПогрузки;
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.ПредставлениеАдреса = ПредставлениеАдреса;
		НоваяСтрока.ИдентификаторАдреса = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		НоваяСтрока.ИдентификаторМаршрута = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПанелиМаршрутов()
	
	ЦветФонаПанели = Новый Цвет(242, 242, 242);
	ОбщийРодитель = Элементы.ГруппаСписокМаршрутов;
	
	// Создадим реквизиты формы для отслеживания пометок
	СтруктураРеквизитов = Новый Структура;
	Для Каждого ТекущаяСтрока Из ДанныеМаршрутов Цикл
		ИмяРеквизита = "Пометка_" + ТекущаяСтрока.ИдентификаторМаршрута;
		СтруктураРеквизитов.Вставить(ИмяРеквизита, Новый ОписаниеТипов("Булево"));
	КонецЦикла;
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизиты(ЭтаФорма, СтруктураРеквизитов);
	
	// Получим группировки по адресам
	ИдентификаторыАдресов = ДанныеМаршрутов.Выгрузить();
	ИдентификаторыАдресов.Свернуть("ИдентификаторАдреса");
	
	Для Каждого ТекущаяСтрокаАдрес Из ИдентификаторыАдресов Цикл
		
		ТекущийИдентификаторАдреса = ТекущаяСтрокаАдрес.ИдентификаторАдреса;
		
		// Данные группы
		ПараметрыОтбора = Новый Структура("ИдентификаторАдреса", ТекущийИдентификаторАдреса);
		НайденныеМаршруты = ДанныеМаршрутов.НайтиСтроки(ПараметрыОтбора);
		
		// Группа адреса
		СвойстваГруппы = Новый Структура;
		СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
		СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
		СвойстваГруппы.Вставить("ЦветФона", ЦветФонаПанели);
		ГруппаАдреса = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычная(
			ЭтаФорма, "ГруппаАдрес_" + ТекущийИдентификаторАдреса, ОбщийРодитель,,,,, СвойстваГруппы);
		
		// Декарация Предсталение адреса
		СвойстваДекорации = Новый Структура;
		СвойстваДекорации.Вставить("Заголовок", НайденныеМаршруты[0].ПредставлениеАдреса);
		СвойстваДекорации.Вставить("АвтоМаксимальнаяШирина", Ложь);
		СвойстваДекорации.Вставить("РастягиватьПоГоризонтали", Истина);
		СвойстваДекорации.Вставить("Шрифт", Новый Шрифт(,, Истина));
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			ЭтаФорма, "ДекарацияАдрес_" + ТекущийИдентификаторАдреса, ГруппаАдреса, СвойстваДекорации);
		
		// Создадим элементы группы
		Для Каждого ТекущийМаршрут Из НайденныеМаршруты Цикл
			
			ТекущийИдентификаторМаршрута = ТекущийМаршрут.ИдентификаторМаршрута;
			
			// Группа маршрута
			СвойстваГруппы = Новый Структура;
			СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
			СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
			СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
			ГруппаМаршрута = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычная(
				ЭтаФорма, "ГруппаМаршрут_" + ТекущийИдентификаторМаршрута, ГруппаАдреса,,,,, СвойстваГруппы);
			
			// Флажок маршрута
			СвойстваФлажка = Новый Структура;
			СвойстваФлажка.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
			
			СобытияФлжка = Новый Структура;
			СобытияФлжка.Вставить("ПриИзменении", "ПометкаМаршрутПриИзменении");
			
			ПутьКДанным = "Пометка_" + ТекущийИдентификаторМаршрута;
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПолеФлажок(
				ЭтаФорма, "ПометкаМаршрут_" + ТекущийИдентификаторМаршрута, ГруппаМаршрута,,, ПутьКДанным,
				СвойстваФлажка, СобытияФлжка);
			
			// Декарация маршрута
			СвойстваДекарации = Новый Структура;
			СвойстваДекарации.Вставить("Заголовок", ТекущийМаршрут.ЗаявкиНаМаршрут);
			СвойстваДекарации.Вставить("ГиперСсылка", Истина);
			
			СобытияДекарации = Новый Структура;
			СобытияДекарации.Вставить("Нажатие", "ДекарацияМаршрутНажатие");
			
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
				ЭтаФорма, "ДекарацияМаршрут_" + ТекущийИдентификаторМаршрута, ГруппаМаршрута, СвойстваДекарации, СобытияДекарации);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостоянияФлажковИИтогов()
	
	ВыбратьВсе = Истина;
	ВыбраноМаршрутов = 0;
	ВсеАдреса = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ДанныеМаршрутов Цикл
		
		ИмяРеквизита = "Пометка_" + ТекущаяСтрока.ИдентификаторМаршрута;
		ЭтаФорма[ИмяРеквизита] = ТекущаяСтрока.Пометка;
		
		Если ТекущаяСтрока.Пометка Тогда
			ВыбраноМаршрутов = ВыбраноМаршрутов + 1;
			ВсеАдреса.Добавить(ТекущаяСтрока.ИдентификаторАдреса);
		Иначе
			ВыбратьВсе = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ВсеАдреса = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(ВсеАдреса);
	БудетСозданоРасписок = ВсеАдреса.Количество();
	
	ЕстьВыбранныеМаршруты = (ВыбраноМаршрутов <> 0);
	
	Элементы.ФормаПродолжить.Доступность = ЕстьВыбранныеМаршруты;
	Элементы.ГруппаПанельИтоговИтоги.Видимость = ЕстьВыбранныеМаршруты;
	Элементы.ПанельИтоговМаршрутыНеВыбраны.Видимость = Не ЕстьВыбранныеМаршруты;
	
КонецПроцедуры

&НаСервере
Функция СоздатьСкладсикеРасписки()
	
	СозданныеДокументы = Новый Массив;
	
	// Соберем все адреса
	ВсеАдреса = Новый Массив;
	Для Каждого ТекущаяСтрока Из ДанныеМаршрутов Цикл
		Если ТекущаяСтрока.Пометка Тогда
			ВсеАдреса.Добавить(ТекущаяСтрока.ИдентификаторАдреса);
		КонецЕсли;
	КонецЦикла;
	ВсеАдреса = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(ВсеАдреса);
	
	// Создадим для каждого адреса свою расписку
	Для Каждого ТекущийИдентификаторАдреса Из ВсеАдреса Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Пометка", Истина);
		ПараметрыОтбора.Вставить("ИдентификаторАдреса", ТекущийИдентификаторАдреса);
		
		НайденныеМаршруты = ДанныеМаршрутов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеМаршруты.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Создание документов
		Если ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.КонтурЛогистика_ЭкспедиторскаяРасписка") Тогда
			
			// ЭР
			Для Каждого ТекущаяСтрока Из НайденныеМаршруты Цикл
				
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("ЭкспедиторскаяРасписка", ДокументОснования);
				ДанныеЗаполнения.Вставить("ЗаявкаНаМаршрут", ТекущаяСтрока.ЗаявкиНаМаршрут);
				ДанныеЗаполнения.Вставить("ИдентификаторСтрокиЗаявкиНаМаршрут", ТекущаяСтрока.ИдентификаторСтрокиЗаявкиНаМаршрут);
				
				НовыйДокумент = Документы.КонтурЛогистика_СкладскаяРасписка.СоздатьДокумент();
				НовыйДокумент.Заполнить(ДанныеЗаполнения);
				
				Если Не ЗначениеЗаполнено(НовыйДокумент.Дата) Тогда
					НовыйДокумент.Дата = ТекущаяДатаСеанса();
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НовыйДокумент.Номер) Тогда
					НовыйДокумент.УстановитьНовыйНомер();
				КонецЕсли;
				
				НовыйДокумент.Записать();
				
			КонецЦикла;
			
		Иначе
			
			// ПЭ
			ДанныеЗаполнения = Новый Массив;
			Для Каждого ТекущаяСтрока Из НайденныеМаршруты Цикл
				ДанныеЗаполнения.Добавить(ТекущаяСтрока.ЗаявкиНаМаршрут);
			КонецЦикла;
			
			НовыйДокумент = Документы.КонтурЛогистика_СкладскаяРасписка.СоздатьДокумент();
			НовыйДокумент.Заполнить(ДанныеЗаполнения);
			
			Если Не ЗначениеЗаполнено(НовыйДокумент.Дата) Тогда
				НовыйДокумент.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НовыйДокумент.Номер) Тогда
				НовыйДокумент.УстановитьНовыйНомер();
			КонецЕсли;
			
			НовыйДокумент.Записать();
			
		КонецЕсли;
		
		СозданныеДокументы.Добавить(НовыйДокумент.Ссылка);
		
	КонецЦикла;
	
	Возврат СозданныеДокументы;
	
КонецФункции

#КонецОбласти