
&НаКлиенте
Процедура СписокЭкспедиторскихРасписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокЭкспедиторскихРасписокЗаявкаНаМаршрут" Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные.ЗаявкаНаМаршрут);
	Иначе 
		ПоказатьЗначение( , Элемент.ТекущиеДанные.ЭкспедиторскаяРасписка);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЭкспедиторскихРасписок.Параметры.УстановитьЗначениеПараметра("ПЭ_Титул1", Параметры.Титул1);
	
КонецПроцедуры
