#Область ПрограммныйИнтерфейс

Функция ТекущийМоментВремениМСК() Экспорт
	
	Возврат МестноеВремя(ТекущаяУниверсальнаяДата(), "Europe/Moscow");
	
КонецФункции

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования = Неопределено) Экспорт
	
	Если Форма.Параметры.Свойство("ТекущийЭлемент") Тогда
		
		НайденноеПоле = Форма.Элементы.Найти(Форма.Параметры.ТекущийЭлемент);
		Если Не НайденноеПоле = Неопределено Тогда
			Форма.ТекущийЭлемент = НайденноеПоле;
		КонецЕсли;
		
		Если Форма.Параметры.ТекущийЭлемент = "Собственник" Тогда
			Форма.Элементы.АдресСтраницы.ТекущаяСтраница = Форма.Элементы.ДанныеСобственника;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(Форма.ИмяФормы, "Документ.КонтурЛогистика") > 0 Тогда
		УправлениеПользователемПодписантом(Форма);
		УправлениеСвязямиДокументов(Форма);
		УправлениеСтатусомПодписиИКолбасойТитулов(Форма);
		УправлениеВидимостьюКомандФормДокументов(Форма);
		УправлениеЭлементамиИнформированияОТопливе(Форма);
	КонецЕсли;
	
	СтруктураРеквизитаФормы = Новый Структура("СписокНастроекКонвертации", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитаФормы, Форма);
	
	Если Форма.Элементы.Найти("СвязанныеОбъектыСоздатьНаОсновании") <> Неопределено Тогда
		
		Форма.Элементы.СвязанныеОбъектыСоздатьНаОсновании.Доступность = Ложь;
		
		Если СтруктураРеквизитаФормы.СписокНастроекКонвертации <> Неопределено Тогда
			
			СписокЗначенийНКС = СтруктураРеквизитаФормы.СписокНастроекКонвертации;
			
			Для Каждого ЭлСписка Из СписокЗначенийНКС Цикл
				
				Если ЭлСписка.Значение.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Входящее Тогда
					Форма.Элементы.СвязанныеОбъектыСоздатьНаОсновании.Доступность = Истина;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеРазрешениемРедактированияРеквизитов(Форма, ЭлементыДляРазрешенияРедактирования);
	
	// Группы доступа
	УправлениеДоступностьюФормПоГруппамДоступа(Форма);
	
	// Подменю "Помощь"
	ДобавитьПодменюПомощьВТитул(Форма);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ФормаСписка(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	// Группы доступа
	УправлениеДоступностьюФормПоГруппамДоступа(Форма);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ФормаВыбора(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	// Группы доступа
	УправлениеДоступностьюФормПоГруппамДоступа(Форма);
	
КонецПроцедуры

Процедура УправлениеСтатусомПодписиИМЧД(Знач Форма)
	
	Перем ДополнительныеРеквизитыФормы;
	
	Если Не Форма.Параметры.Свойство("Ключ") Тогда
		Возврат;
	КонецЕсли;
	
	Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЭР(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулСР(Форма.Параметры.Ключ) Тогда
		
		// Создать реквизиты формы
		ДополнительныеРеквизитыФормы = КонтурЛогистика_РаботаСЭлементамиФормыСервер.ДополнительныеРеквизитыФормыДляПанелиСтатусовПодписи(Форма);
		Если ДополнительныеРеквизитыФормы.Количество() > 0 Тогда
			Форма.ИзменитьРеквизиты(ДополнительныеРеквизитыФормы);
		КонецЕсли;
		
		// Вывести реквизиты на форму
		КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиСтатусыПодписиСертификатаМЧД(Форма.Параметры.Ключ, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеКомандамиДокументаУчетнойСистемы(Знач Форма)
	
	Перем ДополнительныеРеквизитыФормы;
	
	Если Форма.Параметры.Свойство("Ключ") Тогда
		
		Если (КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Параметры.Ключ)) 
			Или (КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Параметры.Ключ))
			Или (КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Параметры.Ключ))
		Тогда
			
			ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(Форма.Параметры.Ключ);
			КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
				ТипЛогистика);
			
			КонвертацияВозможна = (КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации
				Или КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация);
			
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ОтображениеКомандыПропуститьОбработкуВходящегоДокумента(
				Форма, КонтекстНастройкиКонвертации.ОбратныйМаппинг);
			
			Если ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
				Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
				Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1") 
				Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1") Тогда
				
				Если Форма.ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
					ИЛИ Форма.ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
					ИЛИ Форма.ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
					
					КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиКомандыДокументаОснования(
						Форма.Параметры.Ключ, Форма, КонвертацияВозможна);
				КонецЕсли;
				
			Иначе
				
				КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиКомандыДокументаОснования(
					Форма.Параметры.Ключ, Форма, КонвертацияВозможна);
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УпралениеПанельюОбработкиДокументаОбратнымМаппингом(Знач Форма, ТипТитула)
	
	Перем ДополнительныеРеквизитыФормы;
	
	Если Форма.Параметры.Свойство("Ключ") Тогда
		
		Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Параметры.Ключ) 
			ИЛИ КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Параметры.Ключ)
			ИЛИ КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Параметры.Ключ)
			Тогда
			
			ДополнительныеРеквизитыФормы = КонтурЛогистика_РаботаСЭлементамиФормыСервер.ДополнительныеРеквизитыФормыДляОбработкиДокументаОбратнымМаппингом(Форма);
			Если ДополнительныеРеквизитыФормы.Количество() > 0 Тогда
				Форма.ИзменитьРеквизиты(ДополнительныеРеквизитыФормы);
			КонецЕсли;
		   						
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПанельОбработкиДокументаОбратнымМаппингом(Форма.Параметры.Ключ, Форма, ТипТитула);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура УправлениеРазрешениемРедактированияРеквизитов(Форма, ЭлементыДляРазрешенияРедактирования)
			
	Если ЗначениеЗаполнено(ЭлементыДляРазрешенияРедактирования) Тогда
		
		Для каждого Стр Из ЭлементыДляРазрешенияРедактирования Цикл
	
			Если Форма.Элементы.Найти(Стр) <> Неопределено Тогда
				Форма.Элементы[Стр].ТолькоПросмотр = Истина;				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыДляРазрешенияРедактирования)
		И ТипЗнч(ЭлементыДляРазрешенияРедактирования) = Тип("Массив")
		И ЭлементыДляРазрешенияРедактирования.Количество() > 0
		И КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Тогда
		
		КонтурЛогистика_РаботаСЭлементамиФормыСервер.ДобавитьРеквизитЭлементыДляРазрешенияРедактирования(Форма);
		
		Для каждого Стр Из ЭлементыДляРазрешенияРедактирования Цикл
	
			Если Форма.Элементы.Найти(Стр) <> Неопределено Тогда
				Форма.ДФИ_ЭлементыДляРазрешенияРедактирования.Добавить(Стр);
			КонецЕсли;
			
		КонецЦикла;
		
		КонтурЛогистика_РаботаСЭлементамиФормыСервер.ДобавитьЭлементыФормыДляРазрешенияРедактирования(Форма);
								
	КонецЕсли;
	
КонецПроцедуры

Процедура ПреобразоватьПериод(Период) Экспорт
	
	Если ЗначениеЗаполнено(Период) Тогда

		Год = 3600 * 24 * 365;
		Если Период.ДатаОкончания = Дата(1, 1, 1) Или Период.ДатаОкончания > ТекущаяДатаСеанса() + Год Тогда

			Если НачалоДня(Период.ДатаНачала) = НачалоДня(ТекущаяДатаСеанса()) Тогда
				Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Последние7Дней);
			Иначе
				Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				Период.ДатаОкончания = Период.ДатаНачала + 3600 * 24 * 7;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры	

// Останавливает выполнение кода на заданное время. 
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза_(Секунд) Экспорт
	
	ВремяОжидания = Окр(Секунд);
	
    Если ВремяОжидания <> 0 Тогда
        
        НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
		НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
		НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");

		Попытка
			Соединение = Новый HTTPСоединение("127.0.0.0", , , , НастройкиПрокси, ВремяОжидания);
			Соединение.Получить(Новый HTTPЗапрос);
		Исключение
			ВремяОжидания = 0;
		КонецПопытки;
        
    КонецЕсли;
	
КонецПроцедуры	

// Расчитывает хеш-суммы по строке данных.
// Источник: https://www.strchr.com/hash_functions
//
// Параметры:
//  ИсходныеДанные	 - Строка, ДвоичныеДанные	 - исходные данные.
//  РазмерКлюча		 - Число	 - размер получаемого ключа, как Максимальная величина + 1 (18446744073709551615; 64 бита).
// 
// Возвращаемое значение:
//  Число - хеш-сумма строки данных.
//
Функция ХешСумма(ИсходныеДанные, РазмерКлюча = 18446744073709551616) Экспорт
	
	// Приведем к строке
	Если ТипЗнч(ИсходныеДанные) = Тип("ДвоичныеДанные") Тогда
		СтрокаДанных = Base64Строка(ИсходныеДанные);
	Иначе
		СтрокаДанных = ИсходныеДанные;
	КонецЕсли;
	
	// Используем данные функции Kernighan and Ritchie's.
	ХешСумма = 0;	// Начальное значение
	Множитель = 31;	// Множитель (влияет накачество хеш и производительность)
	
	ДлинаСтроки = СтрДлина(СтрокаДанных);
	
	Для Счет = 1 По ДлинаСтроки цикл
		ХешСумма = Множитель * ХешСумма + КодСимвола(Сред(СтрокаДанных, Счет, 1));
	КонецЦикла;
	
	Возврат ХешСумма % РазмерКлюча;
	
КонецФункции

// Соединяет строки в XML
//
Функция СоединитьСтрокиВXML(Строки, Разделитель = "") Экспорт
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	
	ЭтоМассивСтрок = Истина;
	ЭтоПерваяСтрока = Истина;
	
	Для Каждого Элемент Из Строки Цикл
		
		Строка = Элемент;
		Если ЭтоПерваяСтрока Тогда
			Запись.ЗаписатьБезОбработки(Строка);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			Запись.ЗаписатьБезОбработки(Разделитель);
			Запись.ЗаписатьБезОбработки(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Запись.Закрыть();
	
КонецФункции

// Двоичные данные из строки - аналог ПолучитьДвоичныеДанныеИзСтроки.
//
// Параметры:
//  Строка			 - Строка	 - строка текста.
//  КодировкаТекста_ - Строка	 - кодировка.
//  ЗаписатьBOM		 - Булево	 - признак BOM.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - двоичные данные.
//
Функция ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(Строка, КодировкаТекста_ = "utf-8", ЗаписатьBOM = Ложь) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Если ЗаписатьBOM Тогда
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_);
	Иначе	
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.ANSI);
	КонецЕсли;
	
	ЗаписьТекста.Закрыть();
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_,, Истина, Символы.ПС);
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Соединить двоичные данные - аналог СоединитьДвоичныеДанные.
//
Функция СоединитьДвоичныеДанные_КонтурЛогистика(МассивДвоичныхДанных) Экспорт
	
	// Аналог СоединитьДвоичныеДанные для 8.2
	МассивИменДвоичныхДанных = Новый Массив;
	
	Для Каждого Элемент Из МассивДвоичныхДанных Цикл
		
		// BSLLS:MissingTemporaryFileDeletion-off
		// Диагностика не находит удаления
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		// BSLLS:MissingTemporaryFileDeletion-on
		МассивИменДвоичныхДанных.Добавить(ИмяВременногоФайла);
		
		Элемент.Записать(ИмяВременногоФайла);
		
	КонецЦикла;
	
	ИмяВременногоФайлаРезультат = ПолучитьИмяВременногоФайла();
	
	ОбъединитьФайлы(МассивИменДвоичныхДанных, ИмяВременногоФайлаРезультат);	
	
	ДвоичныеДанныеСоединенные = Новый ДвоичныеДанные(ИмяВременногоФайлаРезультат);
	
	// Удаление файлов
	УдалитьФайлы(ИмяВременногоФайлаРезультат);
	Для Каждого ИмяВременногоФайла Из МассивИменДвоичныхДанных Цикл
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЦикла;
	
	Возврат ДвоичныеДанныеСоединенные;
	
КонецФункции

// Список значений настройки
//
// Параметры:
//  ИмяНастройки - Строка	 - Имя настройки
// 
// Возвращаемое значение:
//  Массив - значения из саписка значений
//
Функция СписокЗначенийНастройки(ИмяНастройки) Экспорт
	
	ПробоватьСоздаватьПриОтсутствии = Ложь;
	
	Настройка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройку_(ИмяНастройки, ПробоватьСоздаватьПриОтсутствии);
	
	Возврат Справочники.КонтурЛогистика_Настройки.СписокЗначенийНастройки(Настройка);
	
КонецФункции

// Определяет можно ли использовать криптографию на сервере
//
// Возвращаемое значение:
//  Булево - Истина, если использовать криптографию на сервере можно
//
Функция МожноИспользоватьКриптографиюНаСервере() Экспорт
	
	Результат = (КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая"
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РазрешитьПодписьНаСервере"));
	
	Возврат Результат;
	
КонецФункции

// Возвращает разрешения в разрезе титулов и справочников
//
Функция ДоступыПользователя(Пользователь) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ГруппыДоступа.ДоступыПользователя(Пользователь);
	
КонецФункции

// Процедура устанавливает ограничения доступа на уровне записей
//
// Параметры:
//  ИменаПараметровСеанса - Массив
//                        - Неопределено - имена параметров сеанса для инициализации.
//                                         Массив устанавливаемых идентификаторов параметров сеанса,
//                                         которые нужно инициализировать, если обработчик вызывается
//                                         перед использованием неинициализированных параметров сеанса.
//                                         Неопределено, если обработчик события вызывается системой при начале сеанса.
//
Процедура УстановитьОграниченияДоступаНаУровнеЗаписей(ИменаПараметровСеанса) Экспорт
	
	Если ИменаПараметровСеанса = Неопределено
		Или (ИменаПараметровСеанса.Найти("КонтурЛогистика_ОграничениеДоступаНаУровнеЗаписейВключено") = Неопределено
			И ИменаПараметровСеанса.Найти("КонтурЛогистика_ДоступныеОрганизации") = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	// Роль с полными правами
	Если РольДоступна("КонтурЛогистика_ПолныеПраваЛогистика") Тогда
		
		ОграничениеДоступаНаУровнеЗаписейВключено = Ложь;
		ДоступныеОрганизации = Новый Массив;
		
	Иначе
		
		ИспользоватьОграниченияДоступаПоОрганизацииНаУровнеЗаписей = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
			"ИспользоватьОграниченияДоступаПоОрганизацииНаУровнеЗаписей");
		
		Если ИспользоватьОграниченияДоступаПоОрганизацииНаУровнеЗаписей Тогда
			// Берем из БСП
			ДоступныеОрганизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДоступныеОрганизацииБСП(ПараметрыСеанса.ТекущийПользователь);
		Иначе
			// Беерм из групп доступа
			ДоступныеОрганизации = Справочники.КонтурЛогистика_ГруппыДоступа.ДоступныеОрганизации(ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;
		
		Если ДоступныеОрганизации.ПолныйДоступ Тогда
			ОграничениеДоступаНаУровнеЗаписейВключено = Ложь;
			ДоступныеОрганизации = Новый Массив;
		Иначе
			ОграничениеДоступаНаУровнеЗаписейВключено = Истина;
			ДоступныеОрганизации = ДоступныеОрганизации.Организации;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСеанса.КонтурЛогистика_ОграничениеДоступаНаУровнеЗаписейВключено = ОграничениеДоступаНаУровнеЗаписейВключено;
	ПараметрыСеанса.КонтурЛогистика_ДоступныеОрганизации = Новый ФиксированныйМассив(ДоступныеОрганизации);
	
КонецПроцедуры

// Разрешения работы с документами пользователя из настроек сотрудника
//
// Параметры:
//  Пользователь - ОпределяемыйТип.КонтурЛогистика_Пользователи1С	 - текущий пользователь 1С.
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - ограничения по организации.
// 
// Возвращаемое значение:
//  Структура - МожетПодписывать и МожетПередаватьНаПодпись
//
Функция РазрешенияРаботыСДокументамиПользователя(Пользователь, Организация) Экспорт
	
	РазрешенияРаботы = Новый Структура;
	РазрешенияРаботы.Вставить("МожетПодписывать", Истина);	// Если не найдем, то разрешаем
	РазрешенияРаботы.Вставить("МожетПередаватьНаПодпись", Ложь);
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат РазрешенияРаботы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("УИДПользователя", Строка(Пользователь.УникальныйИдентификатор()));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_СотрудникиСвязанныеОбъекты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СотрудникиПоУИД
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники.СвязанныеОбъекты КАК КонтурЛогистика_СотрудникиСвязанныеОбъекты
	|ГДЕ
	|	КонтурЛогистика_СотрудникиСвязанныеОбъекты.УИД = &УИДПользователя
	|	ИЛИ КонтурЛогистика_СотрудникиСвязанныеОбъекты.СвязанныйОбъект = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_СотрудникиСвязанныеОбъекты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СотрудникиПоФизЛицу
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники.СвязанныеОбъекты КАК КонтурЛогистика_СотрудникиСвязанныеОбъекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИмяСправочникаПользователи КАК Справочник_Пользователи
	|		ПО КонтурЛогистика_СотрудникиСвязанныеОбъекты.СвязанныйОбъект = Справочник_Пользователи.ФизическоеЛицо
	|ГДЕ
	|	Справочник_Пользователи.Ссылка = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиПоУИД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	СотрудникиПоУИД КАК СотрудникиПоУИД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СотрудникиПоФизЛицу.Ссылка
	|ИЗ
	|	СотрудникиПоФизЛицу КАК СотрудникиПоФизЛицу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.МожетПодписывать КАК МожетПодписывать,
	|	КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.МожетПередаватьНаПодпись КАК МожетПередаватьНаПодпись
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники.РазрешенияРаботыСДокументами КАК КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сотрудники КАК Сотрудники
	|		ПО КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.Ссылка = Сотрудники.Ссылка
	|ГДЕ
	|	КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.Организация = &Организация";
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Если ИмяКонфигурации = "КЛ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяСправочникаПользователи", "УчетнаяСистема_Пользователи");
	ИначеЕсли ИмяКонфигурации = "УПП" Или ИмяКонфигурации = "УТ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяСправочникаПользователи", "Пользователи");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФизическоеЛицо", "ФизЛицо");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяСправочникаПользователи", "Пользователи");
	КонецЕсли;
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(РазрешенияРаботы, Выборка);
		КонецЕсли;
		
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
	Возврат РазрешенияРаботы;
	
КонецФункции

// Заменяет подстроку поиска на подсроку замены во всех выражениях вычисления
//
// Параметры:
//  ПодстрокаПоиска	 - Строка	 - подстрока поиска
//  ПодстрокаЗамены	 - Строка	 - подстрока замены
//
Процедура ЗаменитьПодстрокуВВыраженияхВычисления(ПодстрокаПоиска, ПодстрокаЗамены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодстрокаПоиска", "%" + ПодстрокаПоиска + "%");
	Запрос.Текст = ТекстЗапросаПоискаПодстрокиВВыраженииВычисления();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекущийСправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекущийСправочникОбъект.ОбменДанными.Загрузка = Истина;
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииДокументов") Тогда
			
			// НКД
			ТекущийСправочникОбъект.ДопСвязанныйДокументВыражениеВычисления = СтрЗаменить(
				ТекущийСправочникОбъект.ДопСвязанныйДокументВыражениеВычисления, ПодстрокаПоиска, ПодстрокаЗамены);
			
			ИменаРеквизитовТаблицы = Новый Массив;
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисления");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисления2");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисленияСтрокаНеогр");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПравилаКонвертацииГлавногоДокумента, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПравилаКонвертацииТитулаРеквизиты, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПравилаКонвертацииТитулаТабЧастьТовары, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПравилаКонвертацииТитулаТабЧастьПроизвольная, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.Переменные, ИменаРеквизитовТаблицы);
			
			ИменаРеквизитовТаблицы = Новый Массив;
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисления");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисленияТипЗначения");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисленияСтрокаНеогр");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ЗаполнениеДокУчСист, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ЗаполнениеДокУчСистТЧТовары, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ЗаполнениеДокУчСистТЧПроизвольная, ИменаРеквизитовТаблицы);
			
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисления2");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПеременныеДокУчСист, ИменаРеквизитовТаблицы);
			
			ИменаРеквизитовТаблицы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВыражениеВычисления");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ТаблицаСоответствий, ИменаРеквизитовТаблицы);
			
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников") Тогда
			
			// НКС
			ИменаРеквизитовТаблицы = Новый Массив;
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисления");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисления2");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисленияСтрокаНеогр");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПравилаКонвертации, ИменаРеквизитовТаблицы);
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ПравилаОбратнойКонвертации, ИменаРеквизитовТаблицы);
			
			ИменаРеквизитовТаблицы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВыражениеВычисления");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ТаблицаСоответствий, ИменаРеквизитовТаблицы);
			
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисленияТипЗначения");
			ИменаРеквизитовТаблицы.Добавить("ВыражениеВычисленияСтрокаНеогр");
			
			ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены,
				ТекущийСправочникОбъект.ЗаполнениеСпрУчСист, ИменаРеквизитовТаблицы);
			
		Иначе
			
			// Связи документов
			ТекущийСправочникОбъект.ПоискаПодчиненногоВыражениеВычисления = СтрЗаменить(
				ТекущийСправочникОбъект.ПоискаПодчиненногоВыражениеВычисления, ПодстрокаПоиска, ПодстрокаЗамены);
			
			ТекущийСправочникОбъект.ОтборВыражениеВычисления = СтрЗаменить(
				ТекущийСправочникОбъект.ОтборВыражениеВычисления, ПодстрокаПоиска, ПодстрокаЗамены);
			
			ТекущийСправочникОбъект.РасчетОснованияЗаполнения_ВыражениеВычисления = СтрЗаменить(
				ТекущийСправочникОбъект.РасчетОснованияЗаполнения_ВыражениеВычисления, ПодстрокаПоиска, ПодстрокаЗамены);
			
		КонецЕсли;
		
		ТекущийСправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Сокращенное представление типа документа
//
// Параметры:
//  ТипДокумента	 - ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов	 - тип логистического документа.
// 
// Возвращаемое значение:
//  Структура - сокращенное представление типа документа:
//    * ПредставлениеДокумента - Строка - краткое наименование типа титула;
//    * НомерТитула            - Строка - номер титула.
//
Функция СокращенноеПредставлениеТипаДокумента(ТипДокумента) Экспорт
	
	ПредставлениеДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СокращенноеПредставлениеДокумента(ТипДокумента);
	НомерТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипДокумента);
	
	Результат = Новый Структура;
	Результат.Вставить("ПредставлениеДокумента", ПредставлениеДокумента);
	Результат.Вставить("НомерТитула", НомерТитула);
	
	Возврат Результат;
	
КонецФункции

// Привести к указанному часовому поясучасовому поясу
//
// Параметры:
//  ДатаИзменения		 - Дата	 - датя для изменения
//  ИсходныйЧасовойПояс	 - Строка	 - исходный часовой пояс
//  НовыйЧасовойПояс	 - Строка	 - новый часовой пояс
// 
// Возвращаемое значение:
//  Дата - измененная дата
//
Функция ПривестиКЧасовомуПоясу(Знач ДатаИзменения, ИсходныйЧасовойПояс, НовыйЧасовойПояс = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаИзменения) Тогда
		Возврат ДатаИзменения;
	КонецЕсли;
	
	ЭтоТолькоВремя = Не ЗначениеЗаполнено(НачалоДня(ДатаИзменения)); 
	
	Если ЭтоТолькоВремя Тогда
		// проблема - метод УниверсальноеВремя() не умеет работать с чистым временем без норм даты
		ДатаИзменения = ДатаИзменения + (НачалоДня(ТекущаяДатаСеанса()) - '00010101');
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсходныйЧасовойПояс) Тогда
		УниверсальноеВремя = УниверсальноеВремя(ДатаИзменения, ИсходныйЧасовойПояс);
	Иначе
		УниверсальноеВремя = УниверсальноеВремя(ДатаИзменения, Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйЧасовойПояс) Тогда
		Результат = МестноеВремя(УниверсальноеВремя, НовыйЧасовойПояс);
	Иначе
		Результат = МестноеВремя(УниверсальноеВремя, Неопределено);
	КонецЕсли;
	
	Если ЭтоТолькоВремя Тогда 
		Результат = Результат - (НачалоДня(Результат) - '00010101'); // допускаем перевод в предыдущий день
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ссылка веб списка сотрудников логистики
//
// Параметры:
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - организация
// 
// Возвращаемое значение:
//  Строка - ссылка на список сотрудников
//
Функция СсылкаВебСпискаСотрудниковЛогистики(Организация) Экспорт
	
	СсылкаНастройкиВеб = "";
	
	ИспользоватьТестовыйСерверДиадок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	Если ИспользоватьТестовыйСерверДиадок Тогда
		АдресСервера = "https://logist-staging.kontur.ru";
	Иначе
		АдресСервера = "https://logist.kontur.ru";
	КонецЕсли;
	
	boxID = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Организация, "ID");
	
	СсылкаНастройкиВеб = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("%1/%2/administrator?mode=employees", АдресСервера, boxID);
	
	Возврат СсылкаНастройкиВеб;
	
КонецФункции

// Ссылка веб списка сотрудников диадока
//
// Параметры:
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - организация
// 
// Возвращаемое значение:
//  Строка - ссылка на список сотрудников
//
Функция СсылкаВебСпискаСотрудниковДиадока(Организация) Экспорт
	
	СсылкаНастройкиВеб = "";
	
	ИспользоватьТестовыйСерверДиадок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	Если ИспользоватьТестовыйСерверДиадок Тогда
		АдресСервера = "https://diadoc-staging.kontur.ru";
	Иначе
		АдресСервера = "https://diadoc.kontur.ru";
	КонецЕсли;
	
	boxID = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Организация, "ID");
	
	СсылкаНастройкиВеб = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("%1/%2/employees", АдресСервера, boxID);
	
	Возврат СсылкаНастройкиВеб;
	
КонецФункции

// Определим использования регламентного задания
//
// Параметры:
//  ИмяРегламентногоЗадания	 - Строка	 - Имя регламентного задания
// 
// Возвращаемое значение:
//  Булево - Признак использования регламентного задания
//
Функция РегламентноеЗаданиеИспользуется(ИмяРегламентногоЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = Неопределено;
	
	РегЗадания = КонтурЛогистика_Привилегированный.ПолучитьРегламентныеЗадания();
	Для каждого РегЗадание Из РегЗадания Цикл
		Если РегЗадание.Ключ = ИмяРегламентногоЗадания Тогда
			РегламентноеЗадание = РегЗадание;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РегламентноеЗадание = Неопределено Тогда
		
		Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
			ВызватьИсключение "Для работы регламентных заданий требуется механизм Дополнительных отчетов и обработок (из БСП)!";
		КонецЕсли;
		
		ДопОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту(
			"ИмяОбъекта", КонтурЛогистика_РежимРасширенияСервер.ИмяОбработкиРегламентныхЗаданийДляРасширенияКонтурЛогистика());
		
		Если Не ЗначениеЗаполнено(ДопОбработка) Тогда
			Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") <> Истина Тогда
				ВызватьИсключение "Необходимо включить механизм дополнительных отчетов и обработок!";
			Иначе
				ВызватьИсключение
					"Не подключена дополнительная обработка для регламентных заданий!
					|Можно подключить в обработке ""Фоновые и регламентные задания""";
			КонецЕсли;
		КонецЕсли;
		
		ДопОбработкаОб = ДопОбработка.ПолучитьОбъект();
		
		Для каждого Команда Из ДопОбработкаОб.Команды Цикл
			
			Если Команда.Идентификатор = ИмяРегламентногоЗадания
				И Команда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода Тогда
				
				Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Команда.РегламентноеЗаданиеGUID);
				Если Задание <> Неопределено Тогда
					РегламентноеЗадание = Задание;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РегламентноеЗадание = Неопределено Тогда
		ВызватьИсключение "Не найдено предопределенное регламентное задание """ + ИмяРегламентногоЗадания + """!";
	КонецЕсли;
	
	Возврат РегламентноеЗадание.Использование;
	
КонецФункции

#КонецОбласти

Функция ЗаполнитьРеквизитыПоПользователю(Организация) Экспорт 
	
	Попытка
		ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(Организация);
		Подписант = ДанныеПодписанта.Пользователь1С;
	
		Если Не ЗначениеЗаполнено(Подписант) Тогда
			Пользователь1с = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
			Подписант = Пользователь1с;
		КонецЕсли;
	Исключение
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());
		Подписант = Неопределено;
	КонецПопытки;
	
	Возврат Подписант;
	
КонецФункции

Функция ПолучитьТаблицуСтилейXSL() Экспорт
	Возврат ПолучитьОбщийМакет("КонтурЛогистика_ТаблицаСтилейXSL").ПолучитьТекст();
КонецФункции

Функция СтруктураСчетчиковРабочегоСтола() Экспорт
	
	ИспользуемыеТитулы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьМассивТитуловОформляемыхТекущимПользователем();
	
	ИспользуемыеСвязиДокументовПоТитулам = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СвязиДокументовПоТитулам();
	
	Счетчики = Новый Структура();
	
	// Используемые титулы
	Для Каждого ИспользуемыйТитул Из ИспользуемыеТитулы Цикл
		
		ЗначенияСчетчиков = Новый Структура("Задач, Ошибок, Настроено, ОшибкаЗапроса, СвязиДокументов");
		
		Если ИспользуемыйТитул = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7 Тогда
			Счетчики.Вставить("ТрН_Титул7", ЗначенияСчетчиков);
		ИначеЕсли ИспользуемыйТитул = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
			Счетчики.Вставить("ТрН_Титул13", ЗначенияСчетчиков);
		ИначеЕсли ИспользуемыйТитул = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 Тогда
			Счетчики.Вставить("ТрН_Титул14", ЗначенияСчетчиков);
		КонецЕсли;
		
		ЗначенияСчетчиков = Новый Структура("Задач, Ошибок, Настроено, ОшибкаЗапроса, СвязиДокументов");
		Счетчики.Вставить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ИспользуемыйТитул), ЗначенияСчетчиков);
		
	КонецЦикла;
	
	// Ввод на основании (связи документов)
	Для Каждого ИспользуемаяСвязь Из ИспользуемыеСвязиДокументовПоТитулам Цикл
		
		ИмяТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ИспользуемаяСвязь.Ключ);
		
		Если Не Счетчики.Свойство(ИмяТитула) Тогда
			ЗначенияСчетчиков = Новый Структура("Задач, Ошибок, Настроено, ОшибкаЗапроса, СвязиДокументов");
			Счетчики.Вставить(ИмяТитула, ЗначенияСчетчиков);
		КонецЕсли;
		
		Счетчики[ИмяТитула].СвязиДокументов = ИспользуемаяСвязь.Значение;
		
	КонецЦикла;
	
	Возврат Счетчики;
	
КонецФункции

Процедура УстановитьОграниченияТипа(ИмяТипаЛогистика, ЭлементФормы) Экспорт

	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	локОписаниеТипов = Справочники.КонтурЛогистика_Настройки.ПолучитьОписаниеТипаСущности(ИмяТипаЛогистика);
	
	Если ЗначениеЗаполнено(локОписаниеТипов) Тогда 
		ЭлементФормы.ОграничениеТипа = локОписаниеТипов;
	Иначе
		Если Не ИмяТипаЛогистика = "Характеристика" Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() Тогда
			Сообщить("Не указан тип " + ИмяТипаЛогистика + " в справочнике КонтурЛогистика_Настройки");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОграничениеТипаЕдиницИзмерения(ЭлементФормы) Экспорт

	ОписаниеЕдиницыИзмерения = Справочники.КонтурЛогистика_Настройки.ПолучитьОписаниеТиповЕдиницИзмерения();
	Если ЗначениеЗаполнено(ОписаниеЕдиницыИзмерения) Тогда 
		ЭлементФормы.ОграничениеТипа = ОписаниеЕдиницыИзмерения;
	Иначе
		 Сообщить("Не указан тип единиц измерения в регистре НастройкиКонвертации");
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВидимостьХарактеристик(ЭлементФормы) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	ТипХарактеристики = Справочники.КонтурЛогистика_Настройки.ПолучитьОписаниеТипаСущности("Характеристика");
	
	ЭлементФормы.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() 
								И (КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяХарактеристики() И ТипХарактеристики <> Неопределено);
	
КонецПроцедуры

Процедура ЗаполнитьСписокЕдиницИзмерения(Номенклатура, СписокВыбора = Неопределено) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Номенклатура",				Номенклатура);
	Если ИмяКонфигурации = "УТ" 
		ИЛИ ИмяКонфигурации = "УФ_УНФ"
		ИЛИ ИмяКонфигурации = "УПП" 
		ИЛИ ИмяКонфигурации = "КА" 
		ИЛИ ИмяКонфигурации = "КЛ" 
		ИЛИ ИмяКонфигурации = "УС_3" Тогда 
		ПараметрыВыбора.Вставить("Отбор", Новый Структура("Владелец", Номенклатура));
	Иначе
		ПараметрыВыбора.Вставить("Отбор",						Новый Структура);
	КонецЕсли;
	ПараметрыВыбора.Вставить("СтрокаПоиска",				""); 
	ПараметрыВыбора.Вставить("ДобавлятьПустуюУпаковку",		Истина); 
	ПараметрыВыбора.Вставить("ВыборГруппИЭлементов",		ИспользованиеГруппИЭлементов.Элементы); 
	
	ТипЕдиницИзмерения = Справочники.КонтурЛогистика_Настройки.ПолучитьИмяСправочникаСущности("ЕдиницаИзмерения");
	
	СписокВыбора = Новый СписокЗначений;
	
	Если ИмяКонфигурации = "УФ_УНФ" Тогда
		
		ПараметрыВыбора.Вставить("Отбор", Новый Структура("Владелец", Номенклатура));
		ТипЕдиницИзмерения = Справочники.КонтурЛогистика_Настройки.ПолучитьИмяСправочникаСущности("Упаковка");
		ДанныеВыбораЕдИзм = Справочники[ТипЕдиницИзмерения].ПолучитьДанныеВыбора(ПараметрыВыбора);
		
		Для Каждого ЭлементСписка Из ДанныеВыбораЕдИзм Цикл
			СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
			
	Иначе
		
		МассивТипов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ТипЕдиницИзмерения, ",");
		
		Для Каждого Тип из МассивТипов Цикл
			
			СписокВыбораПромежуточный = Справочники[Тип].ПолучитьДанныеВыбора(ПараметрыВыбора);
			
			Для Каждого ЭлементСписка Из СписокВыбораПромежуточный Цикл
				Если ТипЗнч(ЭлементСписка.Значение)= Тип("Структура") Тогда
					СписокВыбора.Добавить(ЭлементСписка.Значение.Значение, ЭлементСписка.Представление);
				Иначе
					СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьБазовуюЕдиницуИзмерения(Номенклатура) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
		
		Если ИмяКонфигурации = "УТ" 
			Или ИмяКонфигурации = "УПП" Тогда 
			Возврат Номенклатура.ЕдиницаХраненияОстатков;
		ИначеЕсли ИмяКонфигурации = "БП" Тогда 
			Возврат Номенклатура.БазоваяЕдиницаИзмерения;
		Иначе
			Возврат Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокВыбораСправочника(ИмяСправочника, ПараметрыВыбора) Экспорт
	
	СписокВыбора = Справочники[ИмяСправочника].ПолучитьДанныеВыбора(ПараметрыВыбора);
	Возврат СписокВыбора;
	
КонецФункции

Функция ТекПользовательАдминистратор() Экспорт
	
	Результат = Ложь;
	
	Результат = (РольДоступна("КонтурЛогистика_ПолныеПраваЛогистика")
		Или (КонтурЛогистика_Привилегированный.РольСуществует("ПолныеПрава")
			И РольДоступна("ПолныеПрава"))
		Или (КонтурЛогистика_Привилегированный.РольСуществует("АдминистраторСистемы")
			И РольДоступна("АдминистраторСистемы"))
		Или (КонтурЛогистика_Привилегированный.РольСуществует("УчетнаяСистема_Администрирование")
			И РольДоступна("УчетнаяСистема_Администрирование")));
	
	Возврат Результат;
	
КонецФункции

Функция ТекПользовательАдминистраторУчетнойСистемы() Экспорт
	
	Результат = Ложь;
	
	Результат = (КонтурЛогистика_Привилегированный.РольСуществует("ПолныеПрава") И РольДоступна("ПолныеПрава"))
	ИЛИ (КонтурЛогистика_Привилегированный.РольСуществует("АдминистраторСистемы") И РольДоступна("АдминистраторСистемы"))
	ИЛИ (КонтурЛогистика_Привилегированный.РольСуществует("УчетнаяСистема_Администрирование") И РольДоступна("УчетнаяСистема_Администрирование"));
	Возврат Результат;
	
КонецФункции

Функция ЭтоМассивДокументовУчетнойСистемы(МассивУчетныхДокументовИлиДокументовЛогистика) Экспорт
	
	Если МассивУчетныхДокументовИлиДокументовЛогистика.Количество() = 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	//предполагаем что все документы массива одного варианта т.е. либо все жоки учетной системы или все Логистики
	
	МассивЛогистическихТиповУчетныхДокументов = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьВсеТипыНастроенныхУчетныхДокументовТипами();
	МассивТиповДокументовКонтурЛогистика = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьВсеТипыДокументовКонтурЛогистикаТипами();
	
	ПервыйДокументСписка = МассивУчетныхДокументовИлиДокументовЛогистика[0];
	
	Если МассивЛогистическихТиповУчетныхДокументов.Найти(ТипЗнч(ПервыйДокументСписка)) <> Неопределено Тогда
		
		Возврат Истина;
		
	ИначеЕсли МассивТиповДокументовКонтурЛогистика.Найти(ТипЗнч(ПервыйДокументСписка)) <> Неопределено Тогда
		
		Возврат Ложь;
		
	Иначе
		
		ВызватьИсключение "Для документов этого типа в настройках конвертации не указаны правила конвертации (Справочник Настройки конвертации (Контур.Логистика))";
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьВсеТипыНастроенныхУчетныхДокументовСтроками() Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьВсеТипыНастроенныхУчетныхДокументовСтроками();	
	
КонецФункции

Функция ПолучитьВсеТипыНастроенныхУчетныхДокументовТипами() Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьВсеТипыНастроенныхУчетныхДокументовТипами();	
	
КонецФункции

Функция ПредставлениеУчетногоДокументаСтрокой(ПредставлениеУчетногоДокумента) Экспорт
	
	Если ПредставлениеУчетногоДокумента = Неопределено Тогда
		
		ПредставлениеДокументаСтрокой = Неопределено;
		
	ИначеЕсли ТипЗнч(ПредставлениеУчетногоДокумента) = Тип("Строка") Тогда
		
		ПредставлениеДокументаСтрокой = ПредставлениеУчетногоДокумента;
		
	ИначеЕсли ТипЗнч(ПредставлениеУчетногоДокумента) = Тип("Тип") Тогда
		
		ПредставлениеДокументаСтрокой = КонтурЛогистика_ОбщегоНазначенияСервер.ТипДокументаСтрокойПотипуДокумента(
			ПредставлениеУчетногоДокумента);
		
	Иначе
		
		ПредставлениеДокументаСтрокой = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(
			ПредставлениеУчетногоДокумента);
		
	КонецЕсли;
	
	Возврат ПредставлениеДокументаСтрокой;
	
КонецФункции

Функция ТипДокументаСтрокойПоТипуДокумента(ТипЗначенияСсылкиДокумента) Экспорт
	
	Если ЗначениеЗаполнено(ТипЗначенияСсылкиДокумента) Тогда 
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияСсылкиДокумента);
		Возврат ОбъектМетаданных.Имя;
		
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

// Возвращает менеджер объекта по полному имени объекта метаданных.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ОбработкаМенеджер, РегистрСведенийМенеджер - менеджер объекта.
// 
// Пример:
//  МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник.Организации");
//  ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
//
Функция МенеджерОбъектаПоПолномуИмени_КонтурЛогистика(ПолноеИмя) Экспорт
	
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ   = ЧастиИмени[1];
	Иначе 
		Менеджер = Неопределено;
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Менеджер = Документы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		
		Если      ЧастиИмени.Количество() = 2 Тогда
			Менеджер = РегистрыРасчета;
			
		ИначеЕсли ЧастиИмени.Количество() = 4 Тогда
			КлассПодчиненногоОМ = ЧастиИмени[2];
			ИмяПодчиненногоОМ = ЧастиИмени[3];
			
			Если ВРег(КлассПодчиненногоОМ) = "ПЕРЕРАСЧЕТ" Тогда 
				Менеджер = РегистрыРасчета[ИмяОМ].Перерасчеты;
				ИмяОм = ИмяПодчиненногоОМ;
				
			Иначе 
				Менеджер = Неопределено;
			КонецЕсли;
			
		Иначе
			Менеджер = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Менеджер = Константы;
		
	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Менеджер = Последовательности;
		
	Иначе
		Менеджер = Неопределено;
	КонецЕсли;
	
	Если Менеджер = Неопределено Тогда
		ПроверитьОбъектМетаданныхСуществует(ПолноеИмя);
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			НСтр("ru = 'Объект метаданных ""%1"" не имеет менеджера объекта.'"), ПолноеИмя);
	КонецЕсли;
	
	Попытка
		Возврат Менеджер[ИмяОМ];
	Исключение
		ПроверитьОбъектМетаданныхСуществует(ПолноеИмя);
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьОбъектМетаданныхСуществует(ПолноеИмя)
	
	Если Метаданные.НайтиПоПолномуИмени(ПолноеИмя) = Неопределено Тогда 
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			НСтр("ru = 'Неизвестный тип объекта метаданных ""%1"".'"), ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

// Создает объект ОписаниеТипов, содержащий тип Строка.
//
// Параметры:
//  ДлинаСтроки - Число - длина строки.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Строка.
//
Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт
	
	Возврат Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(ДлинаСтроки));
	
КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Число.
//
// Параметры:
//  Разрядность - Число - общее количество разрядов числа (количество разрядов
//                        целой части плюс количество разрядов дробной части).
//  РазрядностьДробнойЧасти - Число - число разрядов дробной части.
//  ЗнакЧисла - ДопустимыйЗнак - допустимый знак числа.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Число.
//
Функция ОписаниеТипаЧисло(Разрядность, РазрядностьДробнойЧасти = 0, Знач ЗнакЧисла = Неопределено) Экспорт
	
	Если ЗнакЧисла = Неопределено Тогда 
		ЗнакЧисла = ДопустимыйЗнак.Любой;
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти, ЗнакЧисла));
	
КонецФункции

// Создает объект ОписаниеТипов, содержащий тип Дата.
//
// Параметры:
//  ЧастиДаты - ЧастиДаты - набор вариантов использования значений типа Дата.
//
// Возвращаемое значение:
//  ОписаниеТипов - описание типа Дата.
//
Функция ОписаниеТипаДата(ЧастиДаты) Экспорт
	
	Возврат Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты));
	
КонецФункции

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщегоНазначения.ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщегоНазначения.ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
		УстановитьБезопасныйРежим(Истина);
		Модуль = Вычислить(Имя);
		// АПК:488-вкл
	ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
		Возврат МенеджерОбъектаПоПолномуИмени_КонтурЛогистика(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Возвращает Истина, если функциональная подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
// У функциональной подсистемы снят флажок "Включать в командный интерфейс".
// См. также ОбщегоНазначенияПереопределяемый.ПриОпределенииОтключенныхПодсистем
// и ОбщегоНазначенияКлиент.ПодсистемаСуществует для вызова из клиентского кода.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если подсистема существует.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = ИменаПодсистем();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции

// Возвращает соответствие имен "функциональных" подсистем и значения Истина.
// У "функциональной" подсистемы снят флажок "Включать в командный интерфейс".
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//   * Ключ - Строка
//   * Значение - Булево
//
Функция ИменаПодсистем() Экспорт
	
	ОтключенныеПодсистемы = Новый Соответствие;
	
	Имена = Новый Соответствие;
	ВставитьИменаПодчиненныхПодсистем(Имена, Метаданные, ОтключенныеПодсистемы);
	
	Возврат Новый ФиксированноеСоответствие(Имена);
	
КонецФункции

Процедура ВставитьИменаПодчиненныхПодсистем(Имена, РодительскаяПодсистема, ОтключенныеПодсистемы, ИмяРодительскойПодсистемы = "")
	
	Для Каждого ТекущаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл
		
		Если ТекущаяПодсистема.ВключатьВКомандныйИнтерфейс Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТекущейПодсистемы = ИмяРодительскойПодсистемы + ТекущаяПодсистема.Имя;
		Если ОтключенныеПодсистемы.Получить(ИмяТекущейПодсистемы) = Истина Тогда
			Продолжить;
		Иначе
			Имена.Вставить(ИмяТекущейПодсистемы, Истина);
		КонецЕсли;
		
		Если ТекущаяПодсистема.Подсистемы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВставитьИменаПодчиненныхПодсистем(Имена, ТекущаяПодсистема, ОтключенныеПодсистемы, ИмяТекущейПодсистемы + ".");
	КонецЦикла;
	
КонецПроцедуры

// Выполняет произвольный алгоритм на встроенном языке 1С:Предприятия, предварительно устанавливая
// безопасный режим выполнения кода и безопасный режим разделения данных для всех разделителей,
// присутствующих в составе конфигурации.
//
// Параметры:
//  Алгоритм  - Строка - алгоритм на встроенном языке "1С:Предприятия".
//  Параметры - Произвольный -  контекст, который требуется для выполнения алгоритма.
//    В тексте алгоритма обращение к контексту должно происходить по имени "Параметры".
//    Например, выражение "Параметры.Значение1 = Параметры.Значение2" обращается к значениям
//    "Значение1" и "Значение2", переданным в Параметры, как свойства.
//
// Пример:
//
//  Параметры = Новый Структура;
//  Параметры.Вставить("Значение1", 1);
//  Параметры.Вставить("Значение2", 10);
//  ОбщегоНазначения.ВыполнитьВБезопасномРежиме("Параметры.Значение1 = Параметры.Значение2", Параметры);
//
Процедура ВыполнитьВБезопасномРежиме(Знач Алгоритм, Знач Параметры = Неопределено) Экспорт
	
	УстановитьБезопасныйРежим(Истина);
	
	Если ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		
		Попытка
			МодульРаботаВМоделиСервиса = ОбщийМодуль("РаботаВМоделиСервиса");
			МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
		Исключение
			// у клиента устаревший интерфейс модуля РаботаВМоделиСервиса
			МассивРазделителей = Новый Массив;
		КонецПопытки;
		
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		
	КонецЦикла;
	
	РезультатВычисления = Неопределено;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Сценарий = Неопределено;
	Параметры.Свойство("Сценарий", Сценарий);
	
	Выборка = Неопределено;
	Параметры.Свойство("Выборка", Выборка);
	
	Объект = Неопределено;
	Параметры.Свойство("Объект", Объект);
	
	ДокументОбъект = Неопределено;
	Параметры.Свойство("ДокументОбъект", ДокументОбъект);
	
	ДокументОбъектИлиСсылка = Неопределено;
	Параметры.Свойство("ДокументОбъектИлиСсылка", ДокументОбъектИлиСсылка);
	
	Основание = Неопределено;
	Параметры.Свойство("Основание", Основание);
	
	ДокументОснование = Неопределено;
	Параметры.Свойство("ДокументОснование", ДокументОснование);
	
	ДокументОсновной = Неопределено;
	Параметры.Свойство("ДокументОсновной", ДокументОсновной);
	
	НастройкаКонвертации = Неопределено;
	Параметры.Свойство("НастройкаКонвертации", НастройкаКонвертации);
	
	НастрокаКонвертацииДокумента = Неопределено;
	Параметры.Свойство("НастрокаКонвертацииДокумента", НастрокаКонвертацииДокумента);
	
	ДочерняяНастройкаКонвертации = Неопределено;
	Параметры.Свойство("ДочерняяНастройкаКонвертации", ДочерняяНастройкаКонвертации);
	
	ПравилоКонвертации = Неопределено;
	Параметры.Свойство("ПравилоКонвертации", ПравилоКонвертации);
	
	Переменные = Неопределено;
	Параметры.Свойство("Переменные", Переменные);
	
	СтрокаТоваровДокументаОснования = Неопределено;
	Параметры.Свойство("СтрокаТоваровДокументаОснования", СтрокаТоваровДокументаОснования);
	
	СтрокаТоваров = Неопределено;
	Параметры.Свойство("СтрокаТоваров", СтрокаТоваров);
	
	РазделительВДокументе = Неопределено;
	Параметры.Свойство("РазделительВДокументе", РазделительВДокументе);
	
	ДанныеДляПроверки = Неопределено;
	Параметры.Свойство("ДанныеДляПроверки", ДанныеДляПроверки);
	
	ДатаГлавного = Неопределено;
	Параметры.Свойство("ДатаГлавного", ДатаГлавного);
	
	ОрганизацияГлавного = Неопределено;
	Параметры.Свойство("ОрганизацияГлавного", ОрганизацияГлавного);
	
	СтрокаВалидации = Неопределено;
	Параметры.Свойство("СтрокаВалидации", СтрокаВалидации);
	
	СтруктураПараметровЗапроса = Неопределено;
	Параметры.Свойство("СтруктураПараметровЗапроса", СтруктураПараметровЗапроса);
	
	ТипЛогистика = Неопределено;
	Параметры.Свойство("ТипЛогистика", ТипЛогистика);
	
	ТекущийПараметр = Неопределено;
	Параметры.Свойство("ТекущийПараметр", ТекущийПараметр);
	
	ДанныеНастройкиСвязи = Неопределено;
	Параметры.Свойство("ДанныеНастройкиСвязи", ДанныеНастройкиСвязи);
	
	СценарийСсылка = Неопределено;
	Параметры.Свойство("СценарийСсылка", СценарийСсылка);
	
	Параметр = Неопределено;
	Параметры.Свойство("Параметр", Параметр);
	
	Правило = Неопределено;
	Параметры.Свойство("Правило", Правило);
	
	ДанныеЗаписи = Неопределено;
	Параметры.Свойство("ДанныеЗаписи", ДанныеЗаписи);
	
	УчетныйДокумент = Неопределено;
	Параметры.Свойство("УчетныйДокумент", УчетныйДокумент);
	
	ДокументОснованиеТаблицыТовары = Неопределено;
	Параметры.Свойство("ДокументОснованиеТаблицыТовары", ДокументОснованиеТаблицыТовары);
	
	Выполнить Алгоритм;
	
	Параметры.РезультатВычисления = РезультатВычисления;
	
КонецПроцедуры

// Вычисляет переданное выражение, предварительно устанавливая безопасный режим выполнения кода
// и безопасный режим разделения данных для всех разделителей, присутствующих в составе конфигурации.
//
// Параметры:
//  Выражение - Строка - выражение на встроенном языке 1С:Предприятия.
//  Параметры - Произвольный - контекст, который требуется для вычисления выражения.
//    В тексте выражения обращение к контексту должно происходить по имени "Параметры".
//    Например, выражение "Параметры.Значение1 = Параметры.Значение2" обращается к значениям
//    "Значение1" и "Значение2" переданные в Параметры, как свойства.
//
// Возвращаемое значение:
//   Произвольный - результат вычисления выражения.
//
// Пример:
//
//  // Пример 1
//  Параметры = Новый Структура;
//  Параметры.Вставить("Значение1", 1);
//  Параметры.Вставить("Значение2", 10);
//  Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме("Параметры.Значение1 = Параметры.Значение2", Параметры);
//
//  // Пример 2
//  Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме("СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
//
Функция ВычислитьВБезопасномРежиме(Знач Выражение, Знач Параметры = Неопределено) Экспорт
	
	УстановитьБезопасныйРежим(Истина);
	
	Если ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		
		Попытка
			МодульРаботаВМоделиСервиса = ОбщийМодуль("РаботаВМоделиСервиса");
			МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
		Исключение
			// у клиента устаревший интерфейс модуля РаботаВМоделиСервиса
			МассивРазделителей = Новый Массив;
		КонецПопытки;
		
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		
	КонецЦикла;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Сценарий = Неопределено;
	Параметры.Свойство("Сценарий", Сценарий);
	
	Выборка = Неопределено;
	Параметры.Свойство("Выборка", Выборка);
	
	Объект = Неопределено;
	Параметры.Свойство("Объект", Объект);
	
	ДокументОбъект = Неопределено;
	Параметры.Свойство("ДокументОбъект", ДокументОбъект);
	
	ДокументОбъектИлиСсылка = Неопределено;
	Параметры.Свойство("ДокументОбъектИлиСсылка", ДокументОбъектИлиСсылка);
	
	Основание = Неопределено;
	Параметры.Свойство("Основание", Основание);
	
	ДокументОснование = Неопределено;
	Параметры.Свойство("ДокументОснование", ДокументОснование);
	
	ДокументОсновной = Неопределено;
	Параметры.Свойство("ДокументОсновной", ДокументОсновной);
	
	НастройкаКонвертации = Неопределено;
	Параметры.Свойство("НастройкаКонвертации", НастройкаКонвертации);
	
	НастрокаКонвертацииДокумента = Неопределено;
	Параметры.Свойство("НастрокаКонвертацииДокумента", НастрокаКонвертацииДокумента);
	
	ДочерняяНастройкаКонвертации = Неопределено;
	Параметры.Свойство("ДочерняяНастройкаКонвертации", ДочерняяНастройкаКонвертации);
	
	ПравилоКонвертации = Неопределено;
	Параметры.Свойство("ПравилоКонвертации", ПравилоКонвертации);
	
	Переменные = Неопределено;
	Параметры.Свойство("Переменные", Переменные);
	
	СтрокаТоваровДокументаОснования = Неопределено;
	Параметры.Свойство("СтрокаТоваровДокументаОснования", СтрокаТоваровДокументаОснования);
	
	СтрокаТоваров = Неопределено;
	Параметры.Свойство("СтрокаТоваров", СтрокаТоваров);
	
	РазделительВДокументе = Неопределено;
	Параметры.Свойство("РазделительВДокументе", РазделительВДокументе);
	
	ДанныеДляПроверки = Неопределено;
	Параметры.Свойство("ДанныеДляПроверки", ДанныеДляПроверки);
	
	ДатаГлавного = Неопределено;
	Параметры.Свойство("ДатаГлавного", ДатаГлавного);
	
	ОрганизацияГлавного = Неопределено;
	Параметры.Свойство("ОрганизацияГлавного", ОрганизацияГлавного);
	
	СтрокаВалидации = Неопределено;
	Параметры.Свойство("СтрокаВалидации", СтрокаВалидации);
	
	СтруктураПараметровЗапроса = Неопределено;
	Параметры.Свойство("СтруктураПараметровЗапроса", СтруктураПараметровЗапроса);
	
	ТипЛогистика = Неопределено;
	Параметры.Свойство("ТипЛогистика", ТипЛогистика);
	
	ТекущийПараметр = Неопределено;
	Параметры.Свойство("ТекущийПараметр", ТекущийПараметр);
	
	ДанныеНастройкиСвязи = Неопределено;
	Параметры.Свойство("ДанныеНастройкиСвязи", ДанныеНастройкиСвязи);
	
	СценарийСсылка = Неопределено;
	Параметры.Свойство("СценарийСсылка", СценарийСсылка);
	
	Параметр = Неопределено;
	Параметры.Свойство("Параметр", Параметр);
	
	Правило = Неопределено;
	Параметры.Свойство("Правило", Правило);
	
	ДанныеЗаписи = Неопределено;
	Параметры.Свойство("ДанныеЗаписи", ДанныеЗаписи);
	
	УчетныйДокумент = Неопределено;
	Параметры.Свойство("УчетныйДокумент", УчетныйДокумент);
	
	ДокументОснованиеТаблицыТовары = Неопределено;
	Параметры.Свойство("ДокументОснованиеТаблицыТовары", ДокументОснованиеТаблицыТовары);
	
	Возврат Вычислить(Выражение);
	
КонецФункции

Функция ВычислитьЗначениеВБезопасномРежиме(Знач ВыражениеВычисления, Знач Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Если Найти(ВыражениеВычисления, "РезультатВычисления") Тогда
		
		Параметры.Вставить("РезультатВычисления");
		
		ВыполнитьВБезопасномРежиме(ВыражениеВычисления, Параметры);
		
		ВычисленноеЗначение = Параметры.РезультатВычисления;
		
	Иначе
		
		ВычисленноеЗначение = ВычислитьВБезопасномРежиме(ВыражениеВычисления, Параметры);
		
	КонецЕсли;
	
	Возврат ВычисленноеЗначение;
	
КонецФункции

// Преобразует строку таблицы значений в структуру.
// Свойства структуры и их значения совпадают с колонками переданной строки.
//
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// Возвращаемое значение:
//  Структура - преобразованная строка таблицы значений.
//
Функция СтрокаТаблицыЗначенийВСтруктуру_(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Возвращает имя вида объектов метаданных по типу объекта.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоСсылке.
//
// Параметры:
//  ТипОбъекта - Тип - тип прикладного объекта, определенный в конфигурации.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоТипу_(ТипОбъекта) Экспорт
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "Справочник";
	
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "Документ";
	
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "БизнесПроцесс";
	
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланВидовХарактеристик";
	
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланСчетов";
	
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланВидовРасчета";
	
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "Задача";
	
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланОбмена";
	
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "Перечисление";
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Проверить, что описание типа состоит из единственного типа значения и 
// совпадает с нужным типом.
//
// Параметры:
//   ОписаниеТипа - ОписаниеТипов - проверяемая коллекция типов;
//   ТипЗначения  - Тип - проверяемый тип.
//
// Возвращаемое значение:
//   Булево - Истина, если совпадает.
//
// Пример:
//  Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа_(ТипЗначенияСвойства, Тип("Булево") Тогда
//    // Выводим поле в виде флажка.
//  КонецЕсли;
//
Функция ОписаниеТипаСостоитИзТипа_(ОписаниеТипа, ТипЗначения) Экспорт
	
	Если ОписаниеТипа.Типы().Количество() = 1
	   И ОписаниеТипа.Типы().Получить(0) = ТипЗначения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа "Неопределено" возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоТипСсылка(ПроверяемыйТип) Экспорт
	
	// ! невозможно использовать классическое (как в типовых) определение т.к. не работает в расширениях
	
	Возврат Не ПроверяемыйТип = Тип("Неопределено") 
				И Не ПроверяемыйТип = Тип("Строка") 
				И Не ПроверяемыйТип = Тип("Число")
				И Не ПроверяемыйТип = Тип("Дата")
				И Не ПроверяемыйТип = Тип("Булево")
				И Не ПроверяемыйТип = Тип("Null")
				И Не ПроверяемыйТип = Тип("Структура")
				И Не ПроверяемыйТип = Тип("ФиксированнаяСтруктура")
				И Не ПроверяемыйТип = Тип("Соответствие")
				И Не ПроверяемыйТип = Тип("ФиксированноеСоответствие")
				И Не ПроверяемыйТип = Тип("СтрокаТаблицыЗначений")
				И Не ПроверяемыйТип = Тип("РезультатЗапроса")
				И Не ПроверяемыйТип = Тип("ВыборкаИзРезультатаЗапроса")
				И Не ПроверяемыйТип = Тип("ТаблицаЗначений")
				И Не ПроверяемыйТип = Тип("Массив")
				И Не ПроверяемыйТип = Тип("УникальныйИдентификатор")
				И Не Найти(НРег(Строка(ПроверяемыйТип)), "табли")
				И Не ПроверяемыйТип = Тип("ХранилищеЗначения")
				И Не ПроверяемыйТип = Тип("Тип")
				И Не ПроверяемыйТип = Тип("ОписаниеТипов")
				И Не ПроверяемыйТип = Тип("МоментВремени")
				И Не ПроверяемыйТип = Тип("ВидСчета");
				
КонецФункции

Функция ОписаниеТипаВсеСсылки() Экспорт
	
	Возврат Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
		Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
			Справочники.ТипВсеСсылки(),
			Документы.ТипВсеСсылки().Типы()),
			ПланыОбмена.ТипВсеСсылки().Типы()),
			Перечисления.ТипВсеСсылки().Типы()),
			ПланыВидовХарактеристик.ТипВсеСсылки().Типы()),
			ПланыСчетов.ТипВсеСсылки().Типы()),
			ПланыВидовРасчета.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().Типы()),
			Задачи.ТипВсеСсылки().Типы());
	
КонецФункции

&НаСервере
Функция МассивТиповЗначенийЭлементов(Справочники = Неопределено, 
	Перечисления = Неопределено, ПримитивныеТипы = Неопределено, ИмяСправочника = "КонтурЛогистика_Настройки") Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Типы = Метаданные.Справочники[ИмяСправочника].Реквизиты.Значение.Тип.Типы();
	
	Для Каждого СтрокаМассива Из Типы Цикл
		
		Если ЭтоПримитивныйТип(СтрокаМассива) Тогда 
			Если ПримитивныеТипы <> Неопределено Тогда			
				СписокВыбора.Добавить(СтрокаМассива, СтрокаМассива);
			КонецЕсли;
		Иначе
			
			СтрокаТипа = СтрокаТипа(СтрокаМассива);
			Добавить = (Справочники <> Неопределено И ЭтоСправочник_(СтрокаТипа))
						ИЛИ (Перечисления <> Неопределено И ЭтоПеречисление_(СтрокаТипа));
			
			Если Добавить Тогда
				СписокВыбора.Добавить(СтрокаТипа, СтрокаМассива);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокВыбора.СортироватьПоЗначению();
	
	Возврат СписокВыбора;
	
КонецФункции

Функция ЭтоПримитивныйТип(ПроверяемыйТип)
	
	ПримитивныеТипы = Новый Массив;
	ПримитивныеТипы.Добавить(Тип("Булево"));
	ПримитивныеТипы.Добавить(Тип("Строка"));
	ПримитивныеТипы.Добавить(Тип("Дата"));
	ПримитивныеТипы.Добавить(Тип("Число"));
	
	ЭтоПримитивныйТип = ПримитивныеТипы.Найти(ПроверяемыйТип) <> Неопределено;
	
	Возврат ЭтоПримитивныйТип;
	
КонецФункции

Функция ЭтоОбъектМетаданныхПоИмени(ПолноеИмя, ИмяОбъекта)
	
	ЭтоОбъектМетаданныхПоИмени = Ложь;
	ИмяРасширенное = ИмяОбъекта + "Ссылка";
	
	ЧастиИмени = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(
		ПолноеИмя,
		".");
			
	Если ЧастиИмени.Количество() = 0 Тогда
		Возврат ЭтоОбъектМетаданныхПоИмени;
	КонецЕсли;
	
	Если ЧастиИмени[0] = ИмяОбъекта 
		ИЛИ ЧастиИмени[0] = ИмяРасширенное Тогда
		
		ЭтоОбъектМетаданныхПоИмени = Истина;
		
	КонецЕсли;
	
	Возврат ЭтоОбъектМетаданныхПоИмени;
	
КонецФункции

Функция ЭтоСправочник_(ПолноеИмя)
	
	Возврат ЭтоОбъектМетаданныхПоИмени(ПолноеИмя, "Справочник");
	
КонецФункции

Функция ЭтоПеречисление_(ПолноеИмя)
	
	Возврат ЭтоОбъектМетаданныхПоИмени(ПолноеИмя, "Перечисление");
	
КонецФункции

Функция СтрокаТипа(ТипДанных)
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДанных);
	СтрокаТипа = ОбъектМетаданных.ПолноеИмя();
	
	Если ЭтоПеречисление_(СтрокаТипа) Тогда
		СтрокаТипа = СтрЗаменить(СтрокаТипа, "Перечисление", "ПеречислениеСсылка");
	КонецЕсли;
	
	Если ЭтоСправочник_(СтрокаТипа) Тогда
		СтрокаТипа = СтрЗаменить(СтрокаТипа, "Справочник", "СправочникСсылка");
	КонецЕсли;
	
	Возврат СтрокаТипа;
	
КонецФункции

Функция ПреобразоватьЗначениеКТипу(ЗначениеСтрока, ТипЗначения) Экспорт
	
	ЗначениеПреобразованное = ЗначениеСтрока;
	                               
	Если ТипЗначения = "Число" Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗначениеСтрока) Тогда 
			ЗначениеПреобразованное = 0;
		Иначе
			ЗначениеПреобразованное = Число(ЗначениеСтрока);
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = "Строка" Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗначениеСтрока) Тогда 
			ЗначениеПреобразованное = "";
		Иначе
			ЗначениеПреобразованное = СокрЛП(ЗначениеСтрока);
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = "Булево" Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗначениеСтрока) Тогда 
			ЗначениеПреобразованное = Ложь;
		Иначе
			ЗначениеПреобразованное = Булево(ЗначениеСтрока);
		КонецЕсли;
		
	ИначеЕсли Лев(ТипЗначения, 16) = "СправочникСсылка" 
		ИЛИ Лев(ТипЗначения, 18) = "ПеречислениеСсылка" Тогда
		
		ОписаниеТипов = Новый ОписаниеТипов(ТипЗначения);
		
		Если ЗначениеЗаполнено(ЗначениеСтрока) Тогда 
			ЗначениеПреобразованное = ОписаниеТипов.ПривестиЗначение(ПредопределенноеЗначение(ЗначениеСтрока));
		Иначе
			ЗначениеПреобразованное = ОписаниеТипов.ПривестиЗначение("");
		КонецЕсли;
		
	Иначе
		
		ЗначениеПреобразованное = ЗначениеСтрока;
		
	КонецЕсли;
	
	Возврат ЗначениеПреобразованное;
	
КонецФункции

// Позволяет определить, есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//  ИскатьВСтандартныхРеквизитах - Булево - будет продолжен поиск среди стандартных реквизитов, 
//											если реквизит не найдер среди реквизитов
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитОбъекта_(ИмяРеквизита, МетаданныеОбъекта, ИскатьВСтандартныхРеквизитах = Ложь) Экспорт

	РеквизитНайден = Ложь;
	
	Реквизиты = МетаданныеОбъекта.Реквизиты; // КоллекцияОбъектовМетаданных
	
	Если Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда  
		
		Если ИскатьВСтандартныхРеквизитах Тогда
			
			Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл 
				
				Если Реквизит.Имя = ИмяРеквизита Тогда 
					
					РеквизитНайден = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;	
						
		КонецЕсли;	
		
	Иначе
		
		РеквизитНайден = Истина;
		
	КонецЕсли;	
	
	Возврат РеквизитНайден;

КонецФункции

//Проверяет есть ли в строке символы отличные от "0123456789"
// Возвращаемое значение:
//	Булево
Функция СтрокаСодержитТолькоЦифры(СтрокаПроверки) Экспорт 
	
	Для й = 1 По СтрДлина(СтрокаПроверки) Цикл
		
		ПроверяемыйСимвол = Сред(СтрокаПроверки, й, 1);
		
		Если ПроверяемыйСимвол < "0" ИЛИ ПроверяемыйСимвол > "9" Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция КонтрольнаяСуммаИННФЛСовпадает(ИНН) Экспорт 
	КС1_Диадок = УмножитьВектора(ИНН, "7:2:4:10:3:5:9:4:6:8:");
	КС2_Диадок = УмножитьВектора(ИНН, "3:7:2:4:10:3:5:9:4:6:8:");
	Возврат  (((КС1_Диадок % 11) % 10) = число(сред(ИНН, 11, 1))) и (((КС2_Диадок % 11) % 10) = число(сред(ИНН, 12, 1)))
КонецФункции

Функция УмножитьВектора(ИНН, Множители)
	Результат = 0;
	н=0;
	пока найти(Множители, ":")>0 цикл 
		н = н+1;
		Множитель = число(лев(Множители, найти(Множители, ":")-1));
		Множители = прав(Множители, СтрДлина(Множители)- найти(Множители, ":"));
		
		Результат = Результат + Множитель * число(сред(ИНН, н, 1));
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолноеИмяОбъектаПоСсылке(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции	

Функция НеобходимыеНастройкиДляРаботыПодсистемыЗаполнены() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("ТекСтраницаПомошника", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТекстДействия", "");
	
	// Проверка, что корректно заполнены типы реквизита "Значение" справочника "КонтурЛогистика_Настройки"
	МассивУстановленныхТипов = Метаданные.Справочники.КонтурЛогистика_Настройки.Реквизиты.Значение.Тип.Типы();
	
	ТаблицаНастроек = Справочники.КонтурЛогистика_Настройки.ТаблицаНастроекПоУмолчанию();
	МассивТиповПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СвернутьМассив_(ТаблицаНастроек.ВыгрузитьКолонку("ТипЗначения"));
	
	МассивНеУстановленныхТипов = Новый Массив;
	
	Для Каждого ТипСтрока Из МассивТиповПоУмолчанию Цикл
		
		Если ЗначениеЗаполнено(ТипСтрока)
			И МассивУстановленныхТипов.Найти(Тип(ТипСтрока)) = Неопределено Тогда
			
			МассивНеУстановленныхТипов.Добавить(ТипСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивНеУстановленныхТипов.Количество() Тогда
		
		ТипыСтрокой = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(МассивНеУстановленныхТипов, ", ");
		
		Результат.ТекСтраницаПомошника = "ВводЛогинаПароля";
		Результат.ТекстОшибки = "Для реквизита ""Значение"" справочника ""КонтурЛогистика_Настройки"" не указаны типы: "
			+ ТипыСтрокой;
		Результат.ТекстДействия = "Откройте конфигуратор и для реквизита ""Значение"" справочника ""КонтурЛогистика_Настройки"" настройте типы: "
			+ ТипыСтрокой;
		
	КонецЕсли;
	
	// Проверка заполненности логина и пароля
	РежимАвторизации = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("РежимАвторизации");
	
	Если РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль
		Или РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПарольИApiKey Тогда
		
		API_Логин = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", "ЛогинАвторизацииДиадокАПИ");
		API_Пароль = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", "ПарольАвторизацииДиадокАПИ");
		
		Если Не ЗначениеЗаполнено(API_Логин.Значение) Или Не ЗначениеЗаполнено(API_Пароль.Значение) Тогда 
			
			Результат.ТекСтраницаПомошника = "ВводЛогинаПароля";
			Результат.ТекстОшибки = "Не указаны логин или пароль от сервиса Диадок";
			Результат.ТекстДействия = "Укажите логин или пароль от сервиса Диадок";
			
			Возврат Результат;
			
		Иначе
			
			Попытка
				
				ПолученныйТокен = КонтурЛогистика_API_Диадок.Диадок_АПИ_Authenticate_ЛогинПароль(API_Логин.Значение, API_Пароль.Значение);
				
				Если Не ЗначениеЗаполнено(ПолученныйТокен) Тогда
					
					Результат.ТекСтраницаПомошника = "ВводЛогинаПароля";
					Результат.ТекстОшибки = "Логин или пароль от сервиса Диадок указаны не верно";
					Результат.ТекстДействия = "Укажите правильные логин и пароль от сервиса Диадок";
					
					Возврат Результат;
					
				КонецЕсли;
				
			Исключение
				
				Результат.ТекСтраницаПомошника = "ВводЛогинаПароля";
				Результат.ТекстОшибки = ОписаниеОшибки();
				Результат.ТекстДействия = "Укажите правильные логин и пароль от сервиса Диадок";
				
			КонецПопытки;
			
		КонецЕсли;
		
	ИначеЕсли РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		
		// Проверим аутентификацию по OIDC
		ЕстьАвторизации = ЕстьПортальныеАвторизации();
		
		Если Не ЕстьАвторизации Тогда
			
			Результат.ТекСтраницаПомошника = "ВводЛогинаПароля";
			Результат.ТекстОшибки = "Необходимо выполнить авторизацию в сервис Контур.Диадок";
			Результат.ТекстДействия = "Авторизоваться в сервисе Контур.Диадок";
			
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка настройки организаций и настроек конвертации
	ЛюбаяНашаОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация();
	Если ЛюбаяНашаОрганизация = Неопределено Тогда
		
		Результат.ТекСтраницаПомошника = "МоиОрганизации";
		Результат.ТекстОшибки = "Не выбрана ни одна орнанизация для работы с ЭТрН";
		Результат.ТекстДействия = "Установите флаг ""Наша"" в стартовом помошнике или флаг ""Наш"" в карточке организации";
		
		Возврат Результат;
		
	КонецЕсли;
	
	// Проверка заполнения Apikey
	Если РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ApiKey
		И РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПарольИApiKey Тогда
		
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Если Не ЗначениеЗаполнено(ПараметрыСервиса.ApiKey) Тогда
			
			Результат.ТекСтраницаПомошника = "МоиОрганизации";
			Результат.ТекстОшибки = "Для режима авторизации """ + РежимАвторизации
				+ """ хотя бы для одной нашей организации должен быть указан Api key";
			Результат.ТекстДействия = "Заполните Api key для любой организации с флагом ""Наша"" в "
				+ "стартовом помошнике или настройку ""Logistics api key"" в карточке организации";
			
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиОрганизацииСРолью() Тогда
		
		Результат.ТекСтраницаПомошника = "МоиОрганизации";
		Результат.ТекстОшибки = "Не указаны роли для наших организаций";
		Результат.ТекстДействия = "Укажите роли для наших организаций";
		
		Возврат Результат;
		
	КонецЕсли;
	
	// Проверка типов хранения данных типовой конфигурации
	ИмяКонфигурации 		= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	СоответствиеНастроек 	= Справочники.КонтурЛогистика_Настройки.ПолучитьПроверкуНастроекОсобенностейХраненияДанных();
	
	МассивПредопределенных = Новый Массив;
	
	Для Каждого Настройка Из СоответствиеНастроек Цикл 
		
		КонфигурацияПоддерживаетХарактеристики = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики();
		
		Если Настройка.Ключ = "ИмяСправочникаХарактеристика" Тогда 
			Если Не КонфигурацияПоддерживаетХарактеристики Или (КонфигурацияПоддерживаетХарактеристики 
				И Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяХарактеристики()) Тогда 	
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		Если Не Настройка.Значение Тогда 
			
			НастройкаСсылка = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(Настройка.Ключ);
			
			Результат.ТекСтраницаПомошника 	= "СтраницаНастройки";
			Результат.ТекстОшибки 			= "В общих настройках не правильно указано " + НастройкаСсылка.Наименование;
			Результат.ТекстДействия 		= "В общих настройках Укажите правильное " + НастройкаСсылка.Наименование;
			
			Возврат Результат;
						
		КонецЕсли;	
				
	КонецЦикла;	
	
	// Для созданных настроек конвертации документов проверить, что типизированы документы-основания
	
	МассивТиповДокументов = Новый Массив;
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН") Тогда
		МассивТиповДокументов.Добавить("ТрН_Титул");
	КонецЕсли;
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист") Тогда
		МассивТиповДокументов.Добавить("ПЛ_Титул");
	КонецЕсли;
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02") Тогда
		МассивТиповДокументов.Добавить("ПЛ_Титул_5_02");
	КонецЕсли;
	Если  КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка") Тогда
		МассивТиповДокументов.Добавить("ЗЗ_Титул");
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивТиповДокументов Цикл 
		
		Если ЭлементМассива = "ТрН_Титул" Тогда 
			КолТитулов = 8;
			Наименование = "ЭТрН";
		ИначеЕсли ЭлементМассива = "ПЛ_Титул" Тогда 
			КолТитулов = 6;
			Наименование = "Путевой лист";
		ИначеЕсли ЭлементМассива = "ПЛ_Титул_5_02" Тогда 
			КолТитулов = 5;
			Наименование = "Путевой лист 5.02";
		Иначе
			КолТитулов = 2;
			Наименование = "Заказ (заявка)";
		КонецЕсли;	
		
		Для Сч = 1 По КолТитулов Цикл
			
			НаименованиеТитула = Наименование + " Титул " + Сч;
			
			ТипыДокументаОснованияМассив = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ТипыДокументаОснованияТитула(ЭлементМассива, Сч);
			
			// проверка, что в док. основании Титула проставлены типы
			
			Если ТипыДокументаОснованияМассив.Количество() = 1 
				И ТипыДокументаОснованияМассив.Найти(Тип("ДокументСсылка.КонтурЛогистика_Вспомогательный")) = 0 Тогда 
				
				Результат.ТекСтраницаПомошника 	= "СтраницаНастройки";
				Результат.ТекстОшибки 			= "Для " + НаименованиеТитула + " не настроены типы документа основания.";
				Результат.ТекстДействия 		= "Откройте конфигуратор и настройте типы документа-основания для  " + НаименованиеТитула;
				
				Возврат Результат;
				
			КонецЕсли;
			
			// проверка, что в док. основании Титула не продолбался вспомогательный тип	
			
			Если ТипыДокументаОснованияМассив.Количество() >= 1	
				И ТипыДокументаОснованияМассив.Найти(Тип("ДокументСсылка.КонтурЛогистика_Вспомогательный")) = Неопределено Тогда 
				
				Результат.ТекСтраницаПомошника 	= "СтраницаНастройки";
				Результат.ТекстОшибки 			= "Для " + НаименованиеТитула + " в настройках типов документа основания не хватает типа ""КонтурЛогистика_Вспомогательный"".";
				Результат.ТекстДействия 		= "Откройте конфигуратор и установите еще один тип ""КонтурЛогистика_Вспомогательный"" для реквизита ""ДокументОснование"" для  " + НаименованиеТитула;
				
				Возврат Результат;
				
			КонецЕсли;
			
			// проверка, что в настройках конвертации тип документа 1С содержится в типах документа основания для соответствующего титула 
			Если ЭлементМассива = "ПЛ_Титул_5_02" Тогда
				ИмяТипаЛогистики = "ПЛ_Титул" + Сч + "_5_02";	
			Иначе
				ИмяТипаЛогистики = ЭлементМассива + Сч;
			КонецЕсли;
			
			ТипЛогистика 					= Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов[ИмяТипаЛогистики];
			ТипыДокументов1СМассив 			= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТипыЗначенияДокумента1С(ТипЛогистика);
			
			Для Каждого ТипДокументаСтрока Из ТипыДокументов1СМассив Цикл
				
				Если ТипДокументаСтрока = "" Тогда 
					Продолжить;
				КонецЕсли;	
				
				ТипДокумента = Тип("ДокументСсылка." + ТипДокументаСтрока);
				
				Если ТипыДокументаОснованияМассив.Найти(ТипДокумента) = Неопределено Тогда 
					
					Результат.ТекСтраницаПомошника 	= "СтраницаНастройки";
					Результат.ТекстОшибки 			= "В настройках конвертации документов для " + НаименованиеТитула + " указан тип документа 1С """ + ТипДокументаСтрока + """, который не указан в типах реквизита ""ДокументОснование"" для этого Титула.";
					Результат.ТекстДействия 		= "Откройте конфигуратор и установите еще один тип """ + ТипДокументаСтрока + """ для реквизита ""ДокументОснование"" для " + НаименованиеТитула + " ИЛИ измените тип документа 1С в настройках конвертации.";
					
					Возврат Результат;
					
				КонецЕсли; 	
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;

	// проверка справочника настройки конвертации справочников
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("КонтурЛогистика_Договоры", "Договоры (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_ОрганизацииДиадок", "Организации Диадок (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_ПодразделенияДиадок", "Подразделения Диадок (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_ПунктыМаршрута", "Пункты маршрута (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_Сотрудники", "Сотрудники и физические лица (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_ТранспортныеСредства", "Транспортные средства (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_Лицензии", "Лицензии (Контур.Логистика)");
	Соответствие.Вставить("КонтурЛогистика_ГорючеСмазочныеМатериалы", "Горюче-смазочные материалы (Контур.Логистика)");
	
	Для Каждого КлючИЗначение Из Соответствие Цикл 
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
			КлючИЗначение.Ключ);
		
		Если Не КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда 
			
			ЗначениеАвтоконвертации = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_" + КлючИЗначение.Ключ);
			Если ЗначениеАвтоконвертации = Истина Тогда 
				
				Результат.ТекСтраницаПомошника 	= "СтраницаНастройки";
				Результат.ТекстОшибки 			= "Для справочника """ + КлючИЗначение.Значение + """ включена автоконвертация. Но настройка конвертации не найдена.";
				Результат.ТекстДействия 		= "Выключите автоконвертацию для справочника """ + КлючИЗначение.Значение + """ или создайде настройку конвертации для этого справочника.";
				
				Возврат Результат;
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	// Проверка настроек подписания
	Если ПроверятьНаличиеНастроекПодписания() Тогда
		
		КоличествоДействующихНастроекПодписания = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.КоличествоДействующихНастроекПодписания();
		Если КоличествоДействующихНастроекПодписания = 0 Тогда
			
			Результат.ТекСтраницаПомошника = "СтраницаНастройкиПодписания";
			Результат.ТекстОшибки = "Нет ни одной настройки подписания";
			Результат.ТекстДействия = "Добавьте настройку подписания";
			
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// todo доблять по мере необходимости
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеОрганизацииУСОрганизациямДД(МассивОрганизациДДИлиСсылка) Экспорт 
	
	Таблица = Неопределено;
	
	// проверка наличия справочников "Организации" и "Контрагенты" в конфигурации
	// в случае с КЛ "УчетнаяСистема_Организации" и "УчетнаяСистема_Контрагенты"
	
	ЕстьСправочникОрганизации = Ложь;
	ЕстьСправочникКонтрагенты = Ложь;
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	ЭтоКонфигурацияКЛ = ИмяКонфигурации = "КЛ";

	Если ЭтоКонфигурацияКЛ Тогда 
		
		НазваниеСправочникаОрганизации = "УчетнаяСистема_Организации";
		НазваниеСправочникаКонтрагенты = "УчетнаяСистема_Контрагенты";
		
	Иначе
		
		НазваниеСправочникаОрганизации = "Организации";
		НазваниеСправочникаКонтрагенты = "Контрагенты";
		
	КонецЕсли;	
	
	МД_Организации = Метаданные.Справочники.Найти(НазваниеСправочникаОрганизации);
	
	Если МД_Организации = Неопределено Тогда 
		НазваниеСправочникаОрганизации = "Фирмы";
		МД_Организации = Метаданные.Справочники.Найти(НазваниеСправочникаОрганизации);
		Если МД_Организации = Неопределено Тогда
			// да что ты **** такое?
			ЕстьСправочникОрганизации = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не МД_Организации = Неопределено Тогда 
		
		Если Не МД_Организации.Реквизиты.Найти("ИНН") = Неопределено 
			И Не МД_Организации.Реквизиты.Найти("КПП") = Неопределено Тогда 

			ЕстьСправочникОрганизации = Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	МД_Контрагенты = Метаданные.Справочники.Найти(НазваниеСправочникаКонтрагенты);
	Если Не МД_Контрагенты = Неопределено Тогда 
		
		Если Не МД_Контрагенты.Реквизиты.Найти("ИНН") = Неопределено 
			И Не МД_Контрагенты.Реквизиты.Найти("КПП") = Неопределено Тогда 

			ЕстьСправочникКонтрагенты = Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	// поиск организаций
	
	ТекстЗапроса = "";
	
	Если ЕстьСправочникОрганизации И ЕстьСправочникКонтрагенты Тогда  
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК ОрганизацияДД,
		|	УчетнаяСистема_Организации.Ссылка КАК ОрганизацияУС
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетнаяСистема_Организации КАК УчетнаяСистема_Организации
		|		ПО КонтурЛогистика_ОрганизацииДиадок.ИНН = УчетнаяСистема_Организации.ИНН
		|			И КонтурЛогистика_ОрганизацииДиадок.КПП = УчетнаяСистема_Организации.КПП
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&МассивОрганизациДД)
		|	И НЕ УчетнаяСистема_Организации.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка,
		|	УчетнаяСистема_Контрагенты.Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетнаяСистема_Контрагенты КАК УчетнаяСистема_Контрагенты
		|		ПО КонтурЛогистика_ОрганизацииДиадок.ИНН = УчетнаяСистема_Контрагенты.ИНН
		|			И КонтурЛогистика_ОрганизацииДиадок.КПП = УчетнаяСистема_Контрагенты.КПП
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&МассивОрганизациДД)
		|	И НЕ УчетнаяСистема_Контрагенты.ПометкаУдаления";	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.УчетнаяСистема_Организации", "Справочник." + НазваниеСправочникаОрганизации);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.УчетнаяСистема_Контрагенты", "Справочник." + НазваниеСправочникаКонтрагенты);
		
	ИначеЕсли ЕстьСправочникОрганизации Тогда 
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК ОрганизацияДД,
		|	УчетнаяСистема_Организации.Ссылка КАК ОрганизацияУС
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетнаяСистема_Организации КАК УчетнаяСистема_Организации
		|		ПО КонтурЛогистика_ОрганизацииДиадок.ИНН = УчетнаяСистема_Организации.ИНН
		|			И КонтурЛогистика_ОрганизацииДиадок.КПП = УчетнаяСистема_Организации.КПП
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&МассивОрганизациДД)
		|	И НЕ УчетнаяСистема_Организации.ПометкаУдаления";	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.УчетнаяСистема_Организации", "Справочник." + НазваниеСправочникаОрганизации);
		
	ИначеЕсли ЕстьСправочникКонтрагенты Тогда 
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК ОрганизацияДД,
		|	УчетнаяСистема_Контрагенты.Ссылка КАК ОрганизацияУС
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетнаяСистема_Контрагенты КАК УчетнаяСистема_Контрагенты
		|		ПО КонтурЛогистика_ОрганизацииДиадок.ИНН = УчетнаяСистема_Контрагенты.ИНН
		|			И КонтурЛогистика_ОрганизацииДиадок.КПП = УчетнаяСистема_Контрагенты.КПП
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&МассивОрганизациДД)
		|	И НЕ УчетнаяСистема_Контрагенты.ПометкаУдаления";	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.УчетнаяСистема_Контрагенты", "Справочник." + НазваниеСправочникаКонтрагенты);
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("МассивОрганизациДД", МассивОрганизациДДИлиСсылка);
		Таблица = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;	
	
	Возврат Таблица;
	
КонецФункции

Функция ОпределитьКонфигурацию() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяКонфигурации1С = Неопределено;
	
	НастройкаИмяКонфы = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", "ИмяКонфигурации1С");
	Если ЗначениеЗаполнено(НастройкаИмяКонфы) И ЗначениеЗаполнено(НастройкаИмяКонфы.Значение) Тогда // настройка может быть еще не инициализирована.
		// но при попытке её инициализировать механизм вновь обратиться к ОпределитьКонфигурацию() и мы зациклимся. Поэтому сначала проверяем инициализацию.
		ИмяКонфигурации1С = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИмяКонфигурации1С");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда 
		Возврат ИмяКонфигурации1С;
	КонецЕсли;
	
	ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.Контур_ОпределитьКонфигурацию();
	
	Если ИмяКонфигурации1С = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ИмяКонфигурации1С) Тогда
			Сообщить ("Не удалось определить конфигурацию. Задайте настройку ""Имя конфигурации 1С"" в справочнике ""Настройки (Контур.Логистика)""!");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяКонфигурации1С;

КонецФункции

Функция ШаблоныВМассивеФайлов(МассивФайлов) Экспорт 
	
	Возврат Справочники.КонтурЛогистика_ФайлыОбмена.ШаблоныВМассивеФайлов(МассивФайлов);
	
КонецФункции	

Функция ПрототипыВМассивеФайлов(МассивФайлов) Экспорт 
	
	Возврат Справочники.КонтурЛогистика_ФайлыОбмена.ПрототипыВМассивеФайлов(МассивФайлов);
	
КонецФункции	

Функция УниверсальныеСообщенияВМассивеФайлов(МассивФайлов) Экспорт 
	
	Возврат Справочники.КонтурЛогистика_ФайлыОбмена.УниверсальныеСообщенияВМассивеФайлов(МассивФайлов);
	
КонецФункции

Процедура УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение) Экспорт
	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение);
	                                    
КонецПроцедуры	

Функция ЗначениеРеквизитаСсылки(Ссылка, ИмяРеквизита) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
				   |	Объект."
				   + ИмяРеквизита
				   + "
					 |ИЗ
					 |	"
				   + ПолноеИмяОбъектаПоСсылке(Ссылка)
				   + " КАК Объект
					 |ГДЕ
					 |	Объект.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Значение = Неопределено;

	Если Выборка.Следующий() Тогда

		Значение = Выборка[ИмяРеквизита];

	КонецЕсли;

	Возврат Значение;

КонецФункции

Функция ЗначенияРеквизитовСсылок(Ссылки, РеквизитыСтрокой) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Значения = Новый Структура;	
	МассивРеквизитовДляЗапроса = Новый Массив;
	
	МассивРеквизитов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(
						РеквизитыСтрокой, ",");
		
	Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл
		МассивРеквизитовДляЗапроса.Добавить("Объект." + ИмяРеквизита);
	КонецЦикла;
	
	РеквизитыДляЗапроса = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(
							МассивРеквизитовДляЗапроса, ", ");
		
	ШаблонЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|  Объект.Ссылка КАК Ссылка,
	|  %1
	|ИЗ
	|	"
	+ ПолноеИмяОбъектаПоСсылке(Ссылки[0])
	+ " КАК Объект
	|ГДЕ
	|	Объект.Ссылка В (&Ссылки)";	
		
	Запрос = Новый Запрос();
	Запрос.Текст = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
					ШаблонЗапроса, РеквизитыДляЗапроса);

	Запрос.УстановитьПараметр("Ссылки", Ссылки);

	Значения = Запрос.Выполнить().Выгрузить();

	Возврат Значения;	
	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура
//            - ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//                       Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//                       учитываться не будет.
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то все реквизиты вернутся со 
//                                значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//              Если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//              Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта_КонтурЛогистика(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	// Если передано имя предопределенного.
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		
		ПолноеИмяПредопределенногоЭлемента = Ссылка;
		
		// Вычисление ссылки по имени предопределенного.
		// - дополнительно выполняет проверку метаданных предопределенного, выполняется предварительно.
		Попытка
			Ссылка = ПредопределенноеЗначение(ПолноеИмяПредопределенногоЭлемента);
		Исключение
			ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
				"Неверный первый параметр %1 в функции %2: %3", "Ссылка", "КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта", 
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		// Разбор полного имени предопределенного.
		ЧастиПолногоИмени = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ПолноеИмяПредопределенногоЭлемента, ".");
		ПолноеИмяОбъектаМетаданных = ЧастиПолногоИмени[0] + "." + ЧастиПолногоИмени[1];
		
		// Если предопределенный не создан в ИБ, то требуется выполнить проверку доступа к объекту.
		// В других сценариях проверка доступа выполняется в момент исполнения запроса.
		Если Ссылка = Неопределено Тогда 
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
			Если Не ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда 
				ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
					"Недостаточно прав для работы с таблицей ""%1""", ПолноеИмяОбъектаМетаданных);
			КонецЕсли;
		КонецЕсли;
		
	Иначе // Если передана ссылка.
		
		Попытка
			ПолноеИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя(); 
		Исключение
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
								"Неверный первый параметр %1 в функции %2: Значение должно быть ссылкой или именем предопределенного элемента.", 
								"Ссылка", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначенияРеквизитовОбъекта");
		КонецПопытки;
		
	КонецЕсли;
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		Реквизиты = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(Реквизиты, ",", Ложь);
		Для Индекс = 0 По Реквизиты.ВГраница() Цикл
			Реквизиты[Индекс] = СокрЛП(Реквизиты[Индекс]);
		КонецЦикла;
	КонецЕсли;
		
	// Приведение реквизитов к единому формату.
	СтруктураПолей = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		Для Каждого КлючИЗначение Из Реквизиты Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ, СокрЛП(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		Для Каждого Реквизит Из Реквизиты Цикл
			Реквизит = СокрЛП(Реквизит);
			Попытка
				ПсевдонимПоля = СтрЗаменить(Реквизит, ".", "");
				СтруктураПолей.Вставить(ПсевдонимПоля, Реквизит);
			Исключение 
				// Если псевдоним не является ключом.
				ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
					"Неверный второй параметр %1 в функции %2",
					"Реквизиты", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначенияРеквизитовОбъекта");
			КонецПопытки;
		КонецЦикла;
	Иначе
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			"Неверный тип второго параметра %1 в функции %2: %3.", 
			"Реквизиты", "ОбщегоНазначения.ЗначенияРеквизитовОбъекта", Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	// Подготовка результата (после выполнения запроса переопределится).
	Результат = Новый Структура;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
				
		ТекстЗапросаПолей = 
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		// Предварительное добавление поля по псевдониму в возвращаемый результат.
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	// Если предопределенного нет в ИБ.
	// - приведение результата к отсутствию объекта в ИБ или передаче пустой ссылки.
	Если Ссылка = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Если Тип("Структура") = ТипЗнч(Реквизиты)
		Или Тип("ФиксированнаяСтруктура") = ТипЗнч(Реквизиты) Тогда
		Реквизиты = Новый Массив;
		Для Каждого КлючИЗначение Из СтруктураПолей Цикл
			ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
						КлючИЗначение.Значение,
						КлючИЗначение.Ключ);
			Реквизиты.Добавить(ИмяПоля);
		КонецЦикла;
	КонецЕсли;
	
	РеквизитыЧерезТочку = Новый Массив;
	Для Индекс = -Реквизиты.ВГраница() По 0 Цикл
		ИмяПоля = Реквизиты[-Индекс];
		Если Найти(ИмяПоля, ".") Тогда
			РеквизитыЧерезТочку.Добавить(ИмяПоля);
			Реквизиты.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Реквизиты) Тогда
		ЗначенияРеквизитовОбъекта = ЗначенияРеквизитовОбъектов_КонтурЛогистика(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка), Реквизиты, ВыбратьРазрешенные)[Ссылка];
		Если ЗначенияРеквизитовОбъекта <> Неопределено Тогда
			Для Каждого КлючИЗначение Из СтруктураПолей Цикл
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
							КлючИЗначение.Значение,
							КлючИЗначение.Ключ);
				Если Найти(ИмяПоля, ".") = 0 И ЗначенияРеквизитовОбъекта.Свойство(ИмяПоля) Тогда
					Результат[КлючИЗначение.Ключ] = ЗначенияРеквизитовОбъекта[ИмяПоля];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыЧерезТочку) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Реквизиты = РеквизитыЧерезТочку;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|&ТекстЗапросаПолей
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка";
	
	Если Не ВыбратьРазрешенные Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", ""); // @Query-part-1
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	// Выполнение запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		
		// Если реквизиты были переданы строкой, то они уже конвертированы в массив.
		// Если реквизиты - массив, оставляем без изменений.
		// Если реквизиты - структура - конвертируем в массив.
		// В остальных случаях уже было бы выброшено исключение.
		Если Тип("Структура") = ТипЗнч(Реквизиты)
			Или Тип("ФиксированнаяСтруктура") = ТипЗнч(Реквизиты) Тогда
			Реквизиты = Новый Массив;
			Для каждого КлючИЗначение Из СтруктураПолей Цикл
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
							КлючИЗначение.Значение,
							КлючИЗначение.Ключ);
				Реквизиты.Добавить(ИмяПоля);
			КонецЦикла;
		КонецЕсли;
				
		// Не удалось распознать ошибку, проброс первичной ошибки.
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Заполнение реквизитов.
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//                                Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//                                такого реквизита учитываться не будет.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//                                если есть ограничение на уровне записей, то возвращается Неопределено;
//                                если нет прав для работы с таблицей, то возникнет исключение;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//                 Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//                 то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъекта_КонтурЛогистика(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда 
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			"Неверный второй параметр %1 в функции %2: 
			|Имя реквизита должно быть заполнено.", "ИмяРеквизита", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика");
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъекта_КонтурЛогистика(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции 

// Возвращает значения реквизитов, прочитанные из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//         - ФиксированныйМассив из ЛюбаяСсылка - ссылки на объекты.
//           Если массив пуст, то результатом будет пустое соответствие.
//  Реквизиты - Строка - имена реквизитов перечисленные через запятую, в формате требований к свойствам
//                       структуры. Например, "Код, Наименование, Родитель".
//            - Массив из Строка
//            - ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
// 
Функция ЗначенияРеквизитовОбъектов_КонтурЛогистика(Ссылки, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Реквизиты = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Реквизиты, ",");
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизиты) Тогда 
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			"Неверный второй параметр %1 в функции %2: 
			|Поле объекта должно быть указано.", "Реквизиты", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначенияРеквизитовОбъектов");
	КонецЕсли;
	
	Если Найти(Реквизиты, ".") <> 0 Тогда 
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			"Неверный второй параметр %1 в функции %2: 
			|Обращение через точку не поддерживается.", "Реквизиты", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначенияРеквизитовОбъектов");
	КонецЕсли;
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если Ссылки.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
		
	РеквизитыТекстЗапроса = Реквизиты;
		
	СсылкиПоТипам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		Тип = ТипЗнч(Ссылка);
		Если СсылкиПоТипам[Тип] = Неопределено Тогда
			СсылкиПоТипам[Тип] = Новый Массив;
		КонецЕсли;
		ЭлементПоТипу = СсылкиПоТипам[Тип]; // Массив
		ЭлементПоТипу.Добавить(Ссылка);
	КонецЦикла;
	
	ТекстыЗапросов = Новый Массив;
	ПараметрыЗапроса = Новый Структура;
	
	ИменаОбъектовМетаданных = Новый Массив;
	
	Для Каждого СсылкиПоТипу Из СсылкиПоТипам Цикл
		Тип = СсылкиПоТипу.Ключ;
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМетаданных = Неопределено Тогда
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
				"Неверный первый параметр %1 в функции %2: 
				|Значения массива должны быть ссылками.", "Ссылки", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначенияРеквизитовОбъектов");
		КонецЕсли;
		
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИменаОбъектовМетаданных.Добавить(ПолноеИмяОбъектаМетаданных);
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Ссылка,
			|	&Реквизиты
			|ИЗ
			|	&ПолноеИмяОбъектаМетаданных КАК ПсевдонимЗаданнойТаблицы
			|ГДЕ
			|	ПсевдонимЗаданнойТаблицы.Ссылка В (&Ссылки)";
		Если Не ВыбратьРазрешенные Или ТекстыЗапросов.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", ""); // @Query-part-1
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизиты", РеквизитыТекстЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		ИмяПараметра = "Ссылки" + СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ссылки", "&" + ИмяПараметра); // @Query-part-1
		ПараметрыЗапроса.Вставить(ИмяПараметра, СсылкиПоТипу.Значение);
				
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстЗапроса = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
				
		// Не удалось распознать ошибку, проброс первичной ошибки.
		ВызватьИсключение;
		
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(Реквизиты);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
		
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
// для быстрого чтения отдельных реквизитов объекта из базы данных.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  МассивСсылок       - Массив из ЛюбаяСсылка
//                     - ФиксированныйМассив из ЛюбаяСсылка
//  ИмяРеквизита       - Строка - например, "Код".
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объектам выполняется с учетом прав пользователя;
//                                если какой-либо объект будет исключен из выборки по правам, то этот объект
//                                будет исключен и из результата;
//                                если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//      * Ключ     - ЛюбаяСсылка  - ссылка на объект,
//      * Значение - Произвольный - значение прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъектов_КонтурЛогистика(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда 
		ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			"Неверный второй параметр %1 в функции %2: 
			|Имя реквизита должно быть заполнено.", "ИмяРеквизита", "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъектов");
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов_КонтурЛогистика(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные);
	Для каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция ВремяВТекущемПоясеИзМСК(ДатаВремяМСК) Экспорт

	текСмещение = СмещениеСтандартногоВремени(ЧасовойПоясСеанса(), УниверсальноеВремя(ТекущаяДата(), Неопределено));
	СмещениеМСК = 10800;
	
	Возврат ДатаВремяМСК + текСмещение - СмещениеМСК;
	
КонецФункции

Функция СертификатыДляПроверки(Пользователь1С, ТекПользовательЯвляетсяАдминистратором) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.СертификатыДляПроверки(Пользователь1С, ТекПользовательЯвляетсяАдминистратором);
	
КонецФункции

Функция ИндексВодительПочта(Водитель) Экспорт
	
	ИндексВодительПочта = 0;
	
	Если ЗначениеЗаполнено(Водитель) Тогда
		Если ЗначениеЗаполнено(Водитель.АдресЭлектроннойПочты) Тогда
			ИндексВодительПочта = 1;
		Иначе
			ИндексВодительПочта = 2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИндексВодительПочта;
	
КонецФункции

// Идентификаторы автотестовых организаций
// 
// Возвращаемое значение:
//  Структура - идентификаторы
//
Функция ИдентификаторыТестовыхОрганизаций() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Грузоотправитель", "2BM-9690066876-969001000-202309190851298882848");
	Результат.Вставить("Перевозчик", "2BM-9678116150-967801000-202309200222228667049");
	Результат.Вставить("Грузополучатель", "2BM-9686429372-968601000-202309200228553080020");
	Результат.Вставить("Медик", "2BM-5017601351-548643505-202405230743029663551");
	
	Возврат Результат;
	
КонецФункции

#Область Топливо

Процедура УправлениеЭлементамиИнформированияОТопливе(Форма)
	
	ОбновитьПоказанияОстатокаТопливаНаФорме(Форма);
	
	ОбновитьКомандуЗаправки(Форма);
	
КонецПроцедуры

Процедура ОбновитьПоказанияОстатокаТопливаНаФорме(Форма)
	
	ГруппаТоплива = Форма.Элементы.Найти("ГруппаПоказанияТоплива");
	Если ГруппаТоплива = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(Форма.ИмяФормы, "Документ.КонтурЛогистика_ПЛ_Титул4") > 0 Тогда
		ТипПоказаний = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.НаВыезде;
	ИначеЕсли Найти(Форма.ИмяФормы, "Документ.КонтурЛогистика_ПЛ_Титул5") > 0 Тогда
		ТипПоказаний = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.НаЗаезде;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Титул1", Форма.Объект.Титул1);
	Запрос.УстановитьПараметр("ТипДанных", РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ);
	Запрос.УстановитьПараметр("ТипПоказаний", ТипПоказаний);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.Количество КАК Количество,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1 КАК Реквизит1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|		ПО КонтурЛогистика_ПЛ_Титул1.kl_id = КонтурЛогистика_ПроизвольныеДанные.Разрез1
	|			И (КонтурЛогистика_ПЛ_Титул1.Ссылка = &Титул1)
	|			И (КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных)
	|			И (КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &ТипПоказаний)
	|			И (КонтурЛогистика_ПроизвольныеДанные.СинхронизацияССервисом = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыСинхронизации.НеНачата)
	|				ИЛИ КонтурЛогистика_ПроизвольныеДанные.СинхронизацияССервисом = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыСинхронизации.УспешноЗавершена))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Форма.ОстатокТоплива = Выборка.Количество;
		Форма.ГорючеСмазочныеМатериалы = Выборка.Реквизит1;
		
		ГруппаТоплива.Видимость = Истина;
	Иначе
		ГруппаТоплива.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьКомандуЗаправки(Форма)
	
	КомандаЗаправки = Форма.Элементы.Найти("ОбщаяКомандаКонтурЛогистика_Заправки");
	Если КомандаЗаправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1")
		Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда
		Титул1 = Форма.Объект.Ссылка;
	Иначе
		Титул1 = Форма.Объект.Титул1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Титул1", Титул1);
	Запрос.УстановитьПараметр("ТипДанных", РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ);
	Запрос.УстановитьПараметр("ТипПоказаний", Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.Заправка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.Количество КАК Количество,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1 КАК Реквизит1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|		ПО КонтурЛогистика_ПЛ_Титул1.kl_id = КонтурЛогистика_ПроизвольныеДанные.Разрез1
	|			И (КонтурЛогистика_ПЛ_Титул1.Ссылка = &Титул1)
	|			И (КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных)
	|			И (КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &ТипПоказаний)";
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтурЛогистика_ПЛ_Титул1", "КонтурЛогистика_ПЛ_Титул1_5_02");
	КонецЕсли;
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		КомандаЗаправки.Видимость = Ложь;
	Иначе
		Выборка = Результат.Выбрать();
		КомандаЗаправки.Заголовок = "Заправок (" + Строка(Выборка.Количество()) + ")";
		КомандаЗаправки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДружбаКонтрагентов

Функция УстановленыОтношения(Орг1, Орг2) Экспорт
	
	УстановленыОтношения = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПроверитьОтношения(Орг1, Орг2);
	Если Не УстановленыОтношения Тогда
		УстановленыОтношения = КонтурЛогистика_ОбщегоНазначенияСервер.ПроверитьОтношения(Орг1, Орг2);		
	КонецЕсли;	
	
	Возврат УстановленыОтношения;
	
КонецФункции

Функция ПроверитьОтношения(Орг1, Орг2) Экспорт
	
	СтатусОтношений = ПолучитьСтатусОтношений(Орг1, Орг2);
	
	Если СтатусОтношений = Неопределено Тогда
		
		Попытка
			
			Если Орг1.Наш Тогда
				Counteragent = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetCounteragent(Орг1, Орг2);
			Иначе
				Counteragent = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetCounteragent(Орг2, Орг1);
			КонецЕсли;
			СтатусОтношений = КонтурЛогистика_ОбщегоНазначенияСервер.СтатусОтношенияСКонтрагентом(Counteragent);
		
			Если Не Counteragent.Свойство("ПартнерскиеОтношенияНеУстановлены") Тогда
				КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьСтатусы(Орг1, Орг2, СтатусОтношений, СтатусОтношений);	
			КонецЕсли;
			
		Исключение
		 	СтатусОтношений = Неопределено;
		КонецПопытки
		
	КонецЕсли;
	
	Если СтатусОтношений = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.IsRejectedByMe
		Или СтатусОтношений = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.RejectsMe Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСтатусОтношений(Орг1, Орг2)
	
 	Найд1 = Орг1.Контрагенты.Найти(Орг2, "Контрагент");
	Если Найд1 <> Неопределено Тогда
		Статус1 = Найд1.Статус;
	Иначе
		Статус1 = Неопределено;
	КонецЕсли;
	
	Найд2 = Орг2.Контрагенты.Найти(Орг1, "Контрагент");
	Если Найд2 <> Неопределено Тогда
		Статус2 = Найд2.Статус;
	Иначе
		Статус2 = Неопределено;
	КонецЕсли;
	
	Если Статус1 = Статус2 Тогда
		Возврат Статус1;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтатусОтношенияСКонтрагентом(Counteragent) Экспорт
	
	ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.ПустаяСсылка();
	
	Если Counteragent.Свойство("ПартнерскиеОтношенияНеУстановлены") Тогда		
		ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов.NotInCounteragentList;				
	ИначеЕсли Counteragent.Свойство("CurrentStatus") Тогда		
		ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыКонтрагентов[Counteragent.CurrentStatus];				
	КонецЕсли;
	
	Возврат ТекущийСтатус;
	
КонецФункции

Процедура ЗаписатьСтатусы(Организация, Контрагент, СтатусОрганизации, СтатусКонтрагента) Экспорт
	
	ОрганизацияОбъект = Организация.ПолучитьОбъект();
	
	СтрокаКонтрагент = ОрганизацияОбъект.Контрагенты.Найти(Контрагент, "Контрагент");
	Если СтрокаКонтрагент = Неопределено Тогда
		
		Если ОрганизацияОбъект.Контрагенты.Количество() < 99999 Тогда
			СтрокаКонтрагент = ОрганизацияОбъект.Контрагенты.Добавить();
			СтрокаКонтрагент.Контрагент = Контрагент;
			СтрокаКонтрагент.Статус = СтатусОрганизации;
			ОрганизацияОбъект.Записать();
		Иначе
			КонтурЛогистика_Метрика.ОбработатьОшибку(
				"ЗаписатьСтатусы",
				"Табличная часть объекта будет содержать более 99999 строк. КонтурЛогистика_ОрганизацииДиадок.Контрагенты",
				Организация,
				"Переполнение табличной части Контрагенты у организации Диадок при попытки добавления контрагента в проверке отношений");
		КонецЕсли;
		
	Иначе
		Если СтрокаКонтрагент.Статус <> СтатусОрганизации Тогда						
			СтрокаКонтрагент.Статус = СтатусОрганизации;
			ОрганизацияОбъект.Записать();			
		КонецЕсли;
	КонецЕсли;
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	СтрокаКонтрагент = КонтрагентОбъект.Контрагенты.Найти(Организация, "Контрагент");
	Если СтрокаКонтрагент = Неопределено Тогда
		
		Если КонтрагентОбъект.Контрагенты.Количество() < 99999 Тогда
			СтрокаКонтрагент = КонтрагентОбъект.Контрагенты.Добавить();
			СтрокаКонтрагент.Контрагент = Организация;
			СтрокаКонтрагент.Статус = СтатусКонтрагента;
			КонтрагентОбъект.Записать();
		Иначе
			КонтурЛогистика_Метрика.ОбработатьОшибку(
				"ЗаписатьСтатусы",
				"Табличная часть объекта будет содержать более 99999 строк. КонтурЛогистика_ОрганизацииДиадок.Контрагенты",
				Контрагент,
				"Переполнение табличной части Контрагенты у организации Диадок при попытки добавления контрагента в проверке отношений");	
		КонецЕсли;
		
	Иначе
		Если СтрокаКонтрагент.Статус <> СтатусКонтрагента Тогда					
			СтрокаКонтрагент.Статус = СтатусКонтрагента;
			КонтрагентОбъект.Записать();			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьНаименованиеФормыВыбораПоТипу(Тип) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	ИмяФормы = "";
	
	Если ОбъектМетаданных <> Неопределено Тогда
		ИмяФормы = "Документ." + ОбъектМетаданных.Имя + ".ФормаВыбора";
	КонецЕсли;
	
	Возврат ИмяФормы;	
	
КонецФункции

Функция НайтиДокументОснованиеИЗаписатьВТитул(ДокументТитул) Экспорт 
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляТекущегоТитула(ДокументТитул);
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
		
		ДокументТитулОбъект = ДокументТитул.ПолучитьОбъект();
		ДокументТитулОбъект.ДокументОснование = НайденныйДокУчСист;
		ДокументТитулОбъект.Записать();
		
	КонецЕсли;
	
	Возврат НайденныйДокУчСист;
		
КонецФункции

#Область БезопасноеХранилище

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с хранилищем паролей.

// Записывает конфиденциальные данные в безопасное хранилище.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Безопасное хранилище недоступно для чтения пользователям (кроме администраторов),
// а доступно только коду, который делает обращения только к своей части данных и
// в том контексте, который предполагает чтение или запись конфиденциальных данных.
//
// Параметры:
//  Владелец - ПланОбменаСсылка
//           - СправочникСсылка
//           - Строка - ссылка на объект информационной базы,
//             представляющий объект-владелец сохраняемого пароля или строка до 128 символов.
//             Для объектов других типов в качестве владельца рекомендуется использовать ссылку на
//             элемент метаданных этого типа в справочнике ИдентификаторыОбъектовМетаданных
//             или ключ в виде строки с учетом имен подсистем.
//             Например, для БСП:
//               Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.АдресныеОбъекты");
//             если нужно 1 хранилище на подсистему БСП:
//               Владелец = "СтандартныеПодсистемы.УправлениеДоступом";
//             если нужно более 1 хранилища на подсистему БСП:
//               Владелец = "СтандартныеПодсистемы.УправлениеДоступом.<Уточнение>";
//
//  Данные  - Произвольный - данные помещаемые в безопасное хранилище. Неопределенно - удаляет все данные.
//             Для удаления данных по ключу следует использовать процедуру УдалитьДанныеИзБезопасногоХранилища.
//  Ключ    - Строка       - ключ сохраняемых настроек, по умолчанию "Пароль".
//                           Ключ должен соответствовать правилам имен идентификаторов:
//                           1. Первым символом ключа должна быть буква или символ подчеркивания (_).
//                           2. Каждый из последующих символов может быть буквой, цифрой или символом подчеркивания (_).
//
// Пример:
//  Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//      Если ТекущийПользовательМожетИзменятьПароль Тогда
//          УстановитьПривилегированныйРежим(Истина);
//          ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Логин, "Логин");
//          ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Пароль);
//          УстановитьПривилегированныйРежим(Ложь);
//      КонецЕсли;
//  КонецПроцедуры
//
Процедура ЗаписатьДанныеВБезопасноеХранилище(Владелец, Данные, Ключ = "Пароль") Экспорт
	
	Проверить(ЗначениеЗаполнено(Владелец),
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2.
			           |параметр должен содержать ссылку; передано значение: %3 (тип %4).'"),
			"Владелец", "ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище", Владелец, ТипЗнч(Владелец)));
			
	Проверить(ТипЗнч(Ключ) = Тип("Строка"),
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2.
			           |параметр должен содержать строку; передано значение: %3 (тип %4).'"),
			"Ключ", "ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище", Ключ, ТипЗнч(Ключ)));
	
	БезопасноеХранилищеДанных = РегистрыСведений.КонтурЛогистика_БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();
		
	БезопасноеХранилищеДанных.Владелец = Владелец;
	БезопасноеХранилищеДанных.Прочитать();
	Если Данные <> Неопределено Тогда
		Если БезопасноеХранилищеДанных.Выбран() Тогда
			ДанныеДляСохранения = БезопасноеХранилищеДанных.Данные.Получить();
			Если ТипЗнч(ДанныеДляСохранения) <> Тип("Структура") Тогда
				ДанныеДляСохранения = Новый Структура();
			КонецЕсли;
			ДанныеДляСохранения.Вставить(Ключ, Данные);
			ДанныеДляХранилищеЗначения = Новый ХранилищеЗначения(ДанныеДляСохранения, Новый СжатиеДанных(6));
			БезопасноеХранилищеДанных.Данные = ДанныеДляХранилищеЗначения;
			БезопасноеХранилищеДанных.Записать();
		Иначе
			ДанныеДляСохранения = Новый Структура(Ключ, Данные);
			ДанныеДляХранилищеЗначения = Новый ХранилищеЗначения(ДанныеДляСохранения, Новый СжатиеДанных(6));
			БезопасноеХранилищеДанных.Данные = ДанныеДляХранилищеЗначения;
			БезопасноеХранилищеДанных.Владелец = Владелец;
			БезопасноеХранилищеДанных.Записать();
		КонецЕсли;
	Иначе
		БезопасноеХранилищеДанных.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает данные из безопасного хранилища.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Безопасное хранилище недоступно для чтения пользователям (кроме администраторов),
// а доступно только коду, который делает обращения только к своей части данных и
// в том контексте, который предполагает чтение или запись конфиденциальных данных.
//
// Параметры:
//  Владелец    - ПланОбменаСсылка
//              - СправочникСсылка
//              - Строка - ссылка на объект информационной базы,
//                  представляющий объект-владелец сохраняемого пароля или строка до 128 символов.
//  Ключи       - Строка - содержит список имен сохраненных данных, указанных через запятую.
//  ОбщиеДанные - Булево - Истина, если требуется в модели сервиса получить данные из общих данных в разделенном режиме.
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределено - данные из безопасного хранилища. Если указан один ключ,
//                            то возвращается его значение, иначе структура.
//                            Если данные отсутствуют - Неопределенно.
//
// Пример:
//	Процедура ПриЧтенииНаСервере(ТекущийОбъект)
//		
//		Если ТекущийПользовательМожетИзменятьПароль Тогда
//			УстановитьПривилегированныйРежим(Истина);
//			Логин  = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ТекущийОбъект.Ссылка, "Логин");
//			Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ТекущийОбъект.Ссылка);
//			УстановитьПривилегированныйРежим(Ложь);
//		Иначе
//			Элементы.ГруппаЛогинИПароль.Видимость = Ложь;
//		КонецЕсли;
//		
//	КонецПроцедуры
//
Функция ПрочитатьДанныеИзБезопасногоХранилища(Владелец, Ключи = "Пароль", ОбщиеДанные = Неопределено) Экспорт
	
	Проверить(ЗначениеЗаполнено(Владелец),
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2.
			           |параметр должен содержать ссылку; передано значение: %3 (тип %4).'"),
			"Владелец", "ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища", Владелец, ТипЗнч(Владелец)));
	
	ИмяБезопасногоХранилищаДанных = "КонтурЛогистика_БезопасноеХранилищеДанных";
	
	Результат = ДанныеИзБезопасногоХранилища(Владелец, ИмяБезопасногоХранилищаДанных, Ключи);
	
	Возврат Результат;

КонецФункции

// Удаляет конфиденциальные данные в безопасное хранилище.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Безопасное хранилище недоступно для чтения пользователям (кроме администраторов),
// а доступно только коду, который делает обращения только к своей части данных и
// в том контексте, который предполагает чтение или запись конфиденциальных данных.
//
// Параметры:
//  Владелец - ПланОбменаСсылка
//           - СправочникСсылка
//           - Строка - ссылка на объект информационной базы,
//               представляющий объект-владелец сохраняемого пароля или строка до 128 символов.
//  Ключи    - Строка - содержит список имен удаляемых данных, указанных через запятую. 
//               Неопределено - удаляет все данные.
//
// Пример:
//	Процедура ПередУдалением(Отказ)
//		
//		// Проверка значения свойства ОбменДанными.Загрузка отсутствует, так как удалять данные
//		// из безопасного хранилища нужно даже при удалении объекта при обмене данными.
//		
//		УстановитьПривилегированныйРежим(Истина);
//		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Ссылка);
//		УстановитьПривилегированныйРежим(Ложь);
//		
//	КонецПроцедуры
//
Процедура УдалитьДанныеИзБезопасногоХранилища(Владелец, Ключи = Неопределено) Экспорт
	
	Проверить(ЗначениеЗаполнено(Владелец),
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2.
			           |параметр должен содержать ссылку; передано значение: %3 (тип %4).'"),
			"Владелец", "ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища", Владелец, ТипЗнч(Владелец)));
	
	БезопасноеХранилищеДанных = РегистрыСведений.КонтурЛогистика_БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();
	
	БезопасноеХранилищеДанных.Владелец = Владелец;
	БезопасноеХранилищеДанных.Прочитать();
	Если ТипЗнч(БезопасноеХранилищеДанных.Данные) = Тип("ХранилищеЗначения") Тогда
		ДанныеДляСохранения = БезопасноеХранилищеДанных.Данные.Получить();
		Если Ключи <> Неопределено И ТипЗнч(ДанныеДляСохранения) = Тип("Структура") Тогда
			СписокКлючей = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(Ключи, ",", Ложь);
			Если БезопасноеХранилищеДанных.Выбран() И СписокКлючей.Количество() > 0 Тогда
				Для каждого КлючДляУдаления Из СписокКлючей Цикл
					Если ДанныеДляСохранения.Свойство(КлючДляУдаления) Тогда
						ДанныеДляСохранения.Удалить(КлючДляУдаления);
					КонецЕсли;
				КонецЦикла;
				ДанныеДляХранилищеЗначения = Новый ХранилищеЗначения(ДанныеДляСохранения, Новый СжатиеДанных(6));
				БезопасноеХранилищеДанных.Данные = ДанныеДляХранилищеЗначения;
				БезопасноеХранилищеДанных.Записать();
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	БезопасноеХранилищеДанных.Удалить();
	
КонецПроцедуры

// Получить пароль из безапасного хранилища
//
// Параметры: См. КонтурЛогистика_ОбщегоНазначенияСервер.ПрочитатьДанныеИзБезопасногоХранилища
//
// Возвращаемое значение:
//  Строка - Пароль
//
Функция ПолучитьПароль(СсылкаНаОбъект, Ключ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Пароли = ПрочитатьДанныеИзБезопасногоХранилища(СсылкаНаОбъект, Ключ);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Пароли = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Пароли[Ключ];
	КонецЕсли;
	
КонецФункции

// Записать пароль в ббезапасное хранилище
//
// Параметры: См. КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьДанныеВБезопасноеХранилище
//
Процедура ЗаписатьПароль(Владелец, Данные, Ключ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписатьДанныеВБезопасноеХранилище(Владелец, Данные, Ключ);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

Функция ТекстЗапросаПоискаПодстрокиВВыраженииВычисления()
	
	Возврат
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииГлавногоДокумента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СправочникиЛогистики
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииГлавногоДокумента КАК КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииГлавногоДокумента
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииГлавногоДокумента.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииГлавногоДокумента.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииГлавногоДокумента.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаРеквизиты.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииТитулаРеквизиты КАК КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаРеквизиты
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаРеквизиты.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаРеквизиты.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаРеквизиты.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьТовары.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииТитулаТабЧастьТовары КАК КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьТовары
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьТовары.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьТовары.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьТовары.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьПроизвольная.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПравилаКонвертацииТитулаТабЧастьПроизвольная КАК КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьПроизвольная
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьПроизвольная.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьПроизвольная.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПравилаКонвертацииТитулаТабЧастьПроизвольная.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПеременные.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Переменные КАК КонтурЛогистика_НастройкиКонвертацииДокументовПеременные
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовПеременные.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПеременные.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПеременные.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСист.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ЗаполнениеДокУчСист КАК КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСист
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСист.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСист.ВыражениеВычисленияТипЗначения ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСист.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧТовары.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ЗаполнениеДокУчСистТЧТовары КАК КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧТовары
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧТовары.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧТовары.ВыражениеВычисленияТипЗначения ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧТовары.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧПроизвольная.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ЗаполнениеДокУчСистТЧПроизвольная КАК КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧПроизвольная
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧПроизвольная.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧПроизвольная.ВыражениеВычисленияТипЗначения ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовЗаполнениеДокУчСистТЧПроизвольная.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПеременныеДокУчСист.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПеременныеДокУчСист КАК КонтурЛогистика_НастройкиКонвертацииДокументовПеременныеДокУчСист
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументовПеременныеДокУчСист.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПеременныеДокУчСист.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПеременныеДокУчСист.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументовПеременныеДокУчСист.ВыражениеВычисленияТипЗначения ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовТаблицаСоответствий.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ТаблицаСоответствий КАК КонтурЛогистика_НастройкиКонвертацииДокументовТаблицаСоответствий
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовТаблицаСоответствий.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ДопСвязанныйДокументВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.ПравилаКонвертации КАК КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковТаблицаСоответствий.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.ТаблицаСоответствий КАК КонтурЛогистика_НастройкиКонвертацииСправочниковТаблицаСоответствий
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковТаблицаСоответствий.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаОбратнойКонвертации.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.ПравилаОбратнойКонвертации КАК КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаОбратнойКонвертации
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаОбратнойКонвертации.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаОбратнойКонвертации.ВыражениеВычисления2 ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаОбратнойКонвертации.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковЗаполнениеСпрУчСист.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнениеСпрУчСист КАК КонтурЛогистика_НастройкиКонвертацииСправочниковЗаполнениеСпрУчСист
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииСправочниковЗаполнениеСпрУчСист.ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочниковЗаполнениеСпрУчСист.ВыражениеВычисленияТипЗначения ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочниковЗаполнениеСпрУчСист.ВыражениеВычисленияСтрокаНеогр ПОДОБНО &ПодстрокаПоиска)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	(КонтурЛогистика_НастройкиСвязейДокументов.ПоискаПодчиненногоВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиСвязейДокументов.ОтборВыражениеВычисления ПОДОБНО &ПодстрокаПоиска
	|			ИЛИ КонтурЛогистика_НастройкиСвязейДокументов.РасчетОснованияЗаполнения_ВыражениеВычисления ПОДОБНО &ПодстрокаПоиска)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникиЛогистики.Ссылка КАК Ссылка
	|ИЗ
	|	СправочникиЛогистики КАК СправочникиЛогистики
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникиЛогистики.Ссылка";
	
КонецФункции

Процедура ЗаменитьПодстрокуВРеквизитахТабличнойЧасти(ПодстрокаПоиска, ПодстрокаЗамены, ТабличнаяЧасть, ИменаРеквизитовТаблицы)
	
	Для Каждого ТекущаяСтрока Из ТабличнаяЧасть Цикл
		
		Для Каждого ТенкущееИмяРеквизита Из ИменаРеквизитовТаблицы Цикл
			
			ТекущаяСтрока[ТенкущееИмяРеквизита] = СтрЗаменить(ТекущаяСтрока[ТенкущееИмяРеквизита], ПодстрокаПоиска, ПодстрокаЗамены);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеДоступностьюФормПоГруппамДоступа(Форма)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ДоступыПользователя = ДоступыПользователя(ТекущийПользователь);
	
	ПолныйДоступ = ДоступыПользователя.ПолныйДоступ;
	
	Если ПолныйДоступ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоФормаСписка = (Найти(Форма.ИмяФормы, "ФормаСписка") <> 0);
	ЭтоФормаВыбора = (Найти(Форма.ИмяФормы, "ФормаВыбора") <> 0);
	
	// Справочники
	Если Лев(Форма.ИмяФормы, 11) = "Справочник." Тогда
		
		ИмяСправочника = СтрЗаменить(Форма.ИмяФормы, "Справочник.", "");
		Если ЭтоФормаСписка Тогда
			ИмяСправочника = СтрЗаменить(ИмяСправочника, ".ФормаСписка", "");
		ИначеЕсли ЭтоФормаВыбора Тогда
			ИмяСправочника = СтрЗаменить(ИмяСправочника, ".ФормаВыбора", "");
		Иначе
			ИмяСправочника = СтрЗаменить(ИмяСправочника, ".ФормаЭлемента", "");
		КонецЕсли;
		ИмяСправочника = СтрЗаменить(ИмяСправочника, ".Форма", "");
		
		ДоступКСправочникам = ДоступыПользователя.ДоступКСправочникам;
		
		ТолькоПросмотрЭлементов = ДоступКСправочникам.ТолькоПросмотр.Получить(ИмяСправочника);
		СозданиеРедактированиеЭлементов = ДоступКСправочникам.СозданиеРедактирование.Получить(ИмяСправочника);
		
	// Документы
	ИначеЕсли Лев(Форма.ИмяФормы, 9) = "Документ." Тогда
		
		ИмяТипаДокумента = СтрЗаменить(Форма.ИмяФормы, "Документ.", "");
		Если ЭтоФормаСписка Тогда
			ИмяТипаДокумента = СтрЗаменить(ИмяТипаДокумента, ".ФормаСписка", "");
		ИначеЕсли ЭтоФормаВыбора Тогда
			ИмяТипаДокумента = СтрЗаменить(ИмяТипаДокумента, ".ФормаВыбора", "");
		Иначе
			ИмяТипаДокумента = СтрЗаменить(ИмяТипаДокумента, ".ФормаДокумента", "");
		КонецЕсли;
		ИмяТипаДокумента = СтрЗаменить(ИмяТипаДокумента, ".Форма", "");
		ИмяТипаДокумента = СтрЗаменить(ИмяТипаДокумента, "КонтурЛогистика_", "");
		
		ДоступКТитулам = ДоступыПользователя.ДоступКТитулам;
		
		// Главные документы не входят в перечисление типов; СсылкаПоИмени для них не вызываем.
		Если ИмяТипаДокумента = "ЭлектроннаяТранспортнаяНакладная" Тогда
			
			СозданиеРедактированиеЭлементов =
				(ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1)
					Или ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2)
					Или ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3)
					Или ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4));
			
			Если СозданиеРедактированиеЭлементов Тогда
				ТолькоПросмотрЭлементов = Ложь;
			Иначе
				ТолькоПросмотрЭлементов =
					(ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1)
						Или ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2)
						Или ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3)
						Или ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4));
			КонецЕсли;
			
		ИначеЕсли ИмяТипаДокумента = "ЭлектронныйЗаказНаряд" Тогда
			
			СозданиеРедактированиеЭлементов =
				(ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1)
					Или ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул2)
					Или ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул3)
					Или ДоступКТитулам.СозданиеРедактирование.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул4));
			
			Если СозданиеРедактированиеЭлементов Тогда
				ТолькоПросмотрЭлементов = Ложь;
			Иначе
				ТолькоПросмотрЭлементов =
					(ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1)
						Или ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул2)
						Или ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул3)
						Или ДоступКТитулам.ТолькоПросмотр.Получить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул4));
			КонецЕсли;
			
		ИначеЕсли ИмяТипаДокумента = "ЭлектроннаяСопроводительнаяВедомость" Тогда
			// TODO - Не понятно как расчитать
			
		Иначе
			
			ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СсылкаПоИмени(ИмяТипаДокумента);
			
			Если ЗначениеЗаполнено(ТипДокумента) Тогда
				
				ТолькоПросмотрЭлементов = ДоступКТитулам.ТолькоПросмотр.Получить(ТипДокумента);
				СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(ТипДокумента);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если ТолькоПросмотрЭлементов = Неопределено Или СозданиеРедактированиеЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТолькоПросмотрЭлементов И Не СозданиеРедактированиеЭлементов Тогда
		ВызватьИсключение "У вас нет доступа. Обратитесь к администратору.";
	КонецЕсли;
	
	Форма.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	
	Если Форма.ТолькоПросмотр Тогда
		СкрытьЭлементФормы(Форма, "ФормаГруппаЗаполнитьИз");
		СкрытьЭлементФормы(Форма, "ДобавитьИзДиадока");
		
		СкрытьЭлементФормы(Форма, "ВнестиИсправлениеТитула");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи");
		
		// ПодменюУправление
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПропуститьДокумент");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ИзменитьСтатусДокумента");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ИзменитьСтатусДокумента1");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ИзменитьСостояниеДокумента");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыЛогистика");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_УдалитьДокументыДиадок");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ВнестиИсправлениеТитула");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ВвестиСледующийТитул");
	КонецЕсли;
	
КонецПроцедуры

Процедура СкрытьЭлементФормы(Форма, ИмяЭлемента)
	
	НайденныйЭлемент = Форма.Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Видимость = Ложь;
	НайденныйЭлемент.Доступность = Ложь;
	
КонецПроцедуры

Процедура УправлениеСтатусомПодписиИКолбасойТитулов(Форма) Экспорт
	
	ТекТитулСсылка = Форма.Объект.Ссылка;
	Если ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда
		ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
	ИначеЕсли ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектронныйЗаказНаряд") Тогда
		ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1");
	ИначеЕсли ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость") Тогда
		ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1");
	Иначе
		ТипТитула = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ТекТитулСсылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипТитула) Тогда 
		Возврат;
	КонецЕсли;
	
	НомерТекТипа = Число(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипТитула));
	
	Если Не ЗначениеЗаполнено(ТекТитулСсылка) И НомерТекТипа = "1" Тогда
		Возврат; // В незаписанном Т1 можно не выполнять запросы - ничего еще нет, а дефолтная колбаса в титуле верная
	КонецЕсли;
	
	// Вывести статусы подписи сертификата и МЧД
	УправлениеСтатусомПодписиИМЧД(Форма);
	
	// Вывести команды для документа учетной системы
	УправлениеКомандамиДокументаУчетнойСистемы(Форма);
	
	// Вывести команды настройки НКД и перезаполнения титула
	УправлениеКомандамиПерезаполненияТитула(Форма);
	
	// Вывести панель обратного маппинга
	УпралениеПанельюОбработкиДокументаОбратнымМаппингом(Форма, ТипТитула);
	
	// Реализовано для ПЛ, ТРН и ЗЗ
	Если Не Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипТитула)
		И Не Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипТитула)
		И Не Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЭР(ТипТитула)
		И Не Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоСР(ТипТитула)
		И Не Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипТитула) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекТитулСсылка) Тогда
		ГлавныйДокумент = ОпределитьГлавныйДокументПриПустойСсылкеТекущего(ТекТитулСсылка, Форма);
	Иначе
		ГлавныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоТитулу(ТекТитулСсылка);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Путевой Лист
	
	Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(ТекТитулСсылка) Тогда
		
		Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ_5_02(ТипТитула) Тогда
			УправлениеКолбасойТитуловПЛ_5_02(ГлавныйДокумент, ТекТитулСсылка, ТипТитула, Форма);
		Иначе
			УправлениеКолбасойТитуловПЛ(ГлавныйДокумент, ТекТитулСсылка, ТипТитула, Форма);
		КонецЕсли;
		
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// ТрН
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипТитула) Тогда
		
		// В эту таблицу попадут только успешно доставленные/полученные документы
		ТаблицаСостояний = ПолучитьТаблицуТитуловПеревозкиТРН(ГлавныйДокумент);
		
		ТаблицаСостоянийСвернутая = ТаблицаСостояний.Скопировать();
		ТаблицаСостоянийСвернутая.Свернуть("НомерТитула");
		
		УправлениеКолбасойТитуловТРН(НомерТекТипа, ТаблицаСостояний, ТаблицаСостоянийСвернутая, ТекТитулСсылка, Форма);
		
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Заказ-Заявка
	
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипТитула) Тогда
		
		УправлениеКолбасойТитуловЗЗ(ГлавныйДокумент, ТекТитулСсылка, ТипТитула, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьГлавныйДокументПриПустойСсылкеТекущего(Знач ТекТитулСсылка, Знач Форма)
	
	ГлавныйДокумент = Неопределено;
	
	Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(ТекТитулСсылка) Тогда 
		ГлавныйДокумент = Форма.Объект.ДокументЭТРН;
		
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(ТекТитулСсылка) 
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(ТекТитулСсылка) 
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулДФ(ТекТитулСсылка) Тогда
		Если ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1")
			Или ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02")
			Или ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1")  
			Или ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ДФ_Титул1") Тогда 
			ГлавныйДокумент = ТекТитулСсылка;
			
		Иначе
			ГлавныйДокумент = Форма.Объект.Титул1;
		КонецЕсли;
		
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗН(ТекТитулСсылка) Тогда
		ГлавныйДокумент = Форма.Объект.ДокументЗН;
		
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулСВ(ТекТитулСсылка) Тогда
		ГлавныйДокумент = Форма.Объект.ДокументСВ;
		
	Иначе
		ГлавныйДокумент = Неопределено;
	КонецЕсли;

	Возврат ГлавныйДокумент;
	
КонецФункции

Процедура УправлениеКолбасойТитуловПЛ(Знач ГлавныйДокумент, Знач ТекТитулСсылка, Знач ТипТитула, Знач Форма)
	
	Перем ДваВодителя, НомерТитула, ОбязательныйМО, стрНомерТитула, СтрокаДокументаТ1, СтрокаДокументаЭтапа, СтрокиДокументовЭтогоЭтапа, ТаблицаСостояний, ТаблицаСостоянийСвернутая, Титул2ТекущийВодитель, Титул6ТекущийВодитель, ЭлементГруппаПункт, ЭлементДобавитьЕщеТитул, ЭлементПункт, ЭлементСоединитель;
	
	ОбязательныйМО = Ложь;
	ДваВодителя = Ложь;
	Титул2ТекущийВодитель = Неопределено;  // требуется если сейчас открыта Т2
	Титул6ТекущийВодитель = Неопределено;  // требуется если сейчас открыта Т6
	Форма.Элементы["ИконкаОтправитьQR"].Доступность = Ложь; // далее дадим доступ если сейчас в рейсе
	Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Ложь; // далее дадим доступ если сейчас в рейсе
		
	Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
		
		ДваВодителя = ЗначениеЗаполнено(Форма.Объект.Водитель2);
		ОбязательныйМО = Форма.Объект.ОбязМедосмотрПосле;
		Если ОбязательныйМО Тогда 
			Форма.Элементы.Найти("Пункт6").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
			Форма.Элементы.Найти("Пункт6доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
		Иначе
			Форма.Элементы.Найти("Пункт6").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущийНеобязательный;
			Форма.Элементы.Найти("Пункт6доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущийНеобязательный;
		КонецЕсли;
		
	ИначеЕсли ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2 Тогда
		
		Титул2ТекущийВодитель = Форма.Объект.Водитель;
		
	ИначеЕсли ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6 Тогда
		
		Титул6ТекущийВодитель = Форма.Объект.Водитель;	
		
	КонецЕсли;
	
	// в эту таблицу попадут только успешно доставленные/полученные документы
	ТаблицаСостояний = ПолучитьТаблицуТитуловПеревозкиПЛ(ГлавныйДокумент);
	
	// Отказ в подписи Т2 внешним медиком
	Если ГлавныйДокумент.ЕстьОтказВПодписи И Не ГлавныйДокумент.ОрганизацияМедик.Наш Тогда
		
		// Добавим мнимый титул 2 с отказом, так как при отказе не оформляется титул.
		НоваяСтрока = ТаблицаСостояний.Добавить();
		НоваяСтрока.Титул = Документы.КонтурЛогистика_ПЛ_Титул2.ПустаяСсылка();
		НоваяСтрока.НомерТитула = 2;
		НоваяСтрока.ЕстьОтказВПодписи = Истина;
		
		Если ЗначениеЗаполнено(ГлавныйДокумент.Водитель2) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерТитула", 2);
			ПараметрыОтбора.Вставить("Водитель", ГлавныйДокумент.Водитель);
			
			НайденныеСтроки = ТаблицаСостояний.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока.Водитель = ГлавныйДокумент.Водитель;
			Иначе
				НоваяСтрока.Водитель = ГлавныйДокумент.Водитель2;
			КонецЕсли;
		Иначе
			НоваяСтрока.Водитель = ГлавныйДокумент.Водитель;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаСостоянийСвернутая = ТаблицаСостояний.Скопировать();
	ТаблицаСостоянийСвернутая.Свернуть("НомерТитула");
	
	СтрокаДокументаТ1 = Неопределено;
	
	Для Каждого стрНомерТитула Из ТаблицаСостоянийСвернутая Цикл
		
		НомерТитула = стрНомерТитула.НомерТитула;
		
		СтрокиДокументовЭтогоЭтапа = ТаблицаСостояний.НайтиСтроки(Новый Структура("НомерТитула", НомерТитула));
		
		ЭлементГруппаПункт = Форма.Элементы.Найти("ГруппаПункт" + НомерТитула);
		ЭлементСоединитель = Форма.Элементы.Найти("Соединитель" + (НомерТитула-1)); // соединитель от предыдущего пункта
		ЭлементДобавитьЕщеТитул = Форма.Элементы.Найти("Пункт" + НомерТитула + "Добавить");
		
		// обойдем документы этого этапа
		Для Каждого СтрокаДокументаЭтапа Из СтрокиДокументовЭтогоЭтапа Цикл 
			
			// запомним на будущее строку титула 1
			Если НомерТитула = 1 Тогда
				
				СтрокаДокументаТ1 = СтрокаДокументаЭтапа;
				ПозиционироватьТекущийТ2илиТ6(СтрокаДокументаТ1, Титул2ТекущийВодитель, Титул6ТекущийВодитель, Форма);
				
			КонецЕсли;
			
			// в медосмотре надо выводить медосмотр конкретного водителя 1 или 2
			Если НомерТитула = 2 
				ИЛИ НомерТитула = 6 Тогда
				
				Если СтрокаДокументаТ1 <> Неопределено И СтрокаДокументаТ1.Водитель = СтрокаДокументаЭтапа.Водитель Тогда 
					ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула);
				ИначеЕсли СтрокаДокументаТ1 <> Неопределено И СтрокаДокументаТ1.Водитель2 = СтрокаДокументаЭтапа.Водитель Тогда
					ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула + "доп");
				Иначе
					Продолжить;  // Для доп. водителей нет отображения
				КонецЕсли;
				
			Иначе
				ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула);
			КонецЕсли;
			
			// включить картинку и соединитель этапа
			Если ЭлементПункт <> Неопределено Тогда
				УправлениеКолбасойТитуловУстановитьКартинкуПунктуПоСостояниюСтроки(СтрокаДокументаЭтапа, ТекТитулСсылка, ЭлементПункт);
			КонецЕсли;
			
			Если ЭлементСоединитель <> Неопределено Тогда 
				ЭлементСоединитель.Картинка = БиблиотекаКартинок.КонтурЛогистика_СоединительИстинаДвойной;
			КонецЕсли;
			
			// установить особенности цепочки
			Если СтрокаДокументаЭтапа.НомерТитула = 1 Тогда
				
				Если СтрокаДокументаЭтапа.ОбязМедосмотрПосле = Истина Тогда
					
					ОбязательныйМО = Истина;
					
					Если ТипТитула <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6 Тогда
						Форма.Элементы.Найти("Пункт6").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
						Форма.Элементы.Найти("Пункт6доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДокументаЭтапа.ДваВодителя = Истина Тогда
					ДваВодителя = Истина;
				Иначе
					ДваВодителя = Ложь;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 4 Тогда
				
				Форма.Элементы["ИконкаОтправитьQR"].Доступность = Истина;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Истина;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 5 Тогда
				
				Форма.Элементы["ИконкаОтправитьQR"].Доступность = Ложь;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Форма.Элементы.Найти("Пункт2доп").Видимость = ДваВодителя;
	Форма.Элементы.Найти("Пункт6доп").Видимость = ДваВодителя;

КонецПроцедуры

Процедура УправлениеКолбасойТитуловПЛ_5_02(Знач ГлавныйДокумент, Знач ТекТитулСсылка, Знач ТипТитула, Знач Форма)
	
	Перем ДваВодителя, НомерТитула, ОбязательныйМО, стрНомерТитула, СтрокаДокументаТ1, СтрокаДокументаЭтапа, СтрокиДокументовЭтогоЭтапа, ТаблицаСостояний, ТаблицаСостоянийСвернутая, Титул2ТекущийВодитель, Титул6ТекущийВодитель, ЭлементГруппаПункт, ЭлементДобавитьЕщеТитул, ЭлементПункт, ЭлементСоединитель;
	
	ОбязательныйМО = Ложь;
	ДваВодителя = Ложь;
	Титул2ТекущийВодитель = Неопределено;  // требуется если сейчас открыта Т2
	Титул5ТекущийВодитель = Неопределено;  // требуется если сейчас открыта Т5
	Форма.Элементы["ИконкаОтправитьQR"].Доступность = Ложь; // далее дадим доступ если сейчас в рейсе
	Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Видимость = Ложь;
		
	Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		
		ДваВодителя = ЗначениеЗаполнено(Форма.Объект.Водитель2);
		ОбязательныйМО = Форма.Объект.ОбязМедосмотрПосле;
		Если ОбязательныйМО Тогда 
			Форма.Элементы.Найти("Пункт5").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
			Форма.Элементы.Найти("Пункт5доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
		Иначе
			Форма.Элементы.Найти("Пункт5").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущийНеобязательный;
			Форма.Элементы.Найти("Пункт5доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущийНеобязательный;
		КонецЕсли;
		
	ИначеЕсли ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02 Тогда
		
		Титул2ТекущийВодитель = Форма.Объект.Водитель;
		
	ИначеЕсли ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
		
		Титул5ТекущийВодитель = Форма.Объект.Водитель;
		
	КонецЕсли;
	
	// в эту таблицу попадут только успешно доставленные/полученные документы
	ТаблицаСостояний = ПолучитьТаблицуТитуловПеревозкиПЛ(ГлавныйДокумент);
	
	// Отказ в подписи Т2 внешним медиком
	Если ГлавныйДокумент.ЕстьОтказВПодписи И Не ГлавныйДокумент.ОрганизацияМедик.Наш Тогда
		
		// Добавим мнимый титул 2 с отказом, так как при отказе не оформляется титул.
		НоваяСтрока = ТаблицаСостояний.Добавить();
		НоваяСтрока.Титул = Документы.КонтурЛогистика_ПЛ_Титул2.ПустаяСсылка();
		НоваяСтрока.НомерТитула = 2;
		НоваяСтрока.ЕстьОтказВПодписи = Истина;
		
		Если ЗначениеЗаполнено(ГлавныйДокумент.Водитель2) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерТитула", 2);
			ПараметрыОтбора.Вставить("Водитель", ГлавныйДокумент.Водитель);
			
			НайденныеСтроки = ТаблицаСостояний.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока.Водитель = ГлавныйДокумент.Водитель;
			Иначе
				НоваяСтрока.Водитель = ГлавныйДокумент.Водитель2;
			КонецЕсли;
		Иначе
			НоваяСтрока.Водитель = ГлавныйДокумент.Водитель;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаСостоянийСвернутая = ТаблицаСостояний.Скопировать();
	ТаблицаСостоянийСвернутая.Свернуть("НомерТитула");
	
	СтрокаДокументаТ1 = Неопределено;
	
	Для Каждого стрНомерТитула Из ТаблицаСостоянийСвернутая Цикл
		
		НомерТитула = стрНомерТитула.НомерТитула;
		
		СтрокиДокументовЭтогоЭтапа = ТаблицаСостояний.НайтиСтроки(Новый Структура("НомерТитула", НомерТитула));
		
		ЭлементГруппаПункт = Форма.Элементы.Найти("ГруппаПункт" + НомерТитула);
		ЭлементСоединитель = Форма.Элементы.Найти("Соединитель" + (НомерТитула-1)); // соединитель от предыдущего пункта
		ЭлементДобавитьЕщеТитул = Форма.Элементы.Найти("Пункт" + НомерТитула + "Добавить");
		
		// обойдем документы этого этапа
		Для Каждого СтрокаДокументаЭтапа Из СтрокиДокументовЭтогоЭтапа Цикл 
			
			// запомним на будущее строку титула 1
			Если НомерТитула = 1 Тогда
				
				СтрокаДокументаТ1 = СтрокаДокументаЭтапа;
				ПозиционироватьТекущийТ2илиТ5_5_02(СтрокаДокументаТ1, Титул2ТекущийВодитель, Титул5ТекущийВодитель, Форма);
				
			КонецЕсли;
			
			// в медосмотре надо выводить медосмотр конкретного водителя 1 или 2
			Если НомерТитула = 2 Или НомерТитула = 5 Тогда
				
				Если СтрокаДокументаТ1 <> Неопределено И СтрокаДокументаТ1.Водитель = СтрокаДокументаЭтапа.Водитель Тогда 
					ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула);
				ИначеЕсли СтрокаДокументаТ1 <> Неопределено И СтрокаДокументаТ1.Водитель2 = СтрокаДокументаЭтапа.Водитель Тогда
					ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула + "доп");
				Иначе
					Продолжить;  // Для доп. водителей нет отображения
				КонецЕсли;
				
			Иначе
				ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула);
			КонецЕсли;
			
			// включить картинку и соединитель этапа
			Если ЭлементПункт <> Неопределено Тогда
				УправлениеКолбасойТитуловУстановитьКартинкуПунктуПоСостояниюСтроки(СтрокаДокументаЭтапа, ТекТитулСсылка, ЭлементПункт);
			КонецЕсли;
			
			Если ЭлементСоединитель <> Неопределено Тогда 
				ЭлементСоединитель.Картинка = БиблиотекаКартинок.КонтурЛогистика_СоединительИстинаДвойной;
			КонецЕсли;
			
			// установить особенности цепочки
			Если СтрокаДокументаЭтапа.НомерТитула = 1 Тогда
				
				Если СтрокаДокументаЭтапа.ОбязМедосмотрПосле = Истина Тогда
					
					ОбязательныйМО = Истина;
					
					Если ТипТитула <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
						Форма.Элементы.Найти("Пункт5").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
						Форма.Элементы.Найти("Пункт5доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДокументаЭтапа.ДваВодителя = Истина Тогда
					ДваВодителя = Истина;
				Иначе
					ДваВодителя = Ложь;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 3 Тогда
				
				Форма.Элементы["ИконкаОтправитьQR"].Доступность = Истина;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Видимость = Истина;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 4 Тогда
				
				Форма.Элементы["ИконкаОтправитьQR"].Доступность = Ложь;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Форма.Элементы.Найти("Пункт2доп").Видимость = ДваВодителя;
	Форма.Элементы.Найти("Пункт5доп").Видимость = ДваВодителя;

КонецПроцедуры

Процедура УправлениеКолбасойТитуловТРН(Знач НомерТекТипа, Знач ТаблицаСостояний, Знач ТаблицаСостоянийСвернутая, Знач ТекТитулСсылка, Знач Форма)
	
	Перем ЕстьВозвратнаяЦепочка, ИмяЭлементаПункт, НомерТитула, стрНомерТитула, СтрокаДокументаЭтапа, СтрокиДокументовЭтогоЭтапа, ЭлементГруппаПункт, ЭлементДобавитьЕщеТитул, ЭлементПункт, ЭлементСоединитель;
	
	ЕстьВозвратнаяЦепочка = ТаблицаСостоянийСвернутая.Найти(4, "НомерТитула") <> Неопределено 
							И (ТаблицаСостояний.НайтиСтроки(Новый Структура("НомерТитула, ОтказВПриемке", 4, Истина)).Количество() > 0
								ИЛИ ТаблицаСостояний.НайтиСтроки(Новый Структура("НомерТитула, ПринятьЧастично", 4, Истина)).Количество() > 0);
	
	ЭлементПункт7Добавить = Форма.Элементы.Найти("Пункт7Добавить");
	ЭлементПункт8Добавить = Форма.Элементы.Найти("Пункт8Добавить");
	
	Если ЭлементПункт7Добавить <> Неопределено Тогда
		ЭлементПункт7Добавить.Доступность = Ложь;
		ЭлементПункт7Добавить.Видимость = Ложь;
	КонецЕсли;
	
	Если ЭлементПункт8Добавить <> Неопределено Тогда
		ЭлементПункт8Добавить.Доступность = Ложь;
		ЭлементПункт8Добавить.Видимость = Ложь;
	КонецЕсли;
	
	Форма.Элементы["ГруппаВозврат"].Видимость = Ложь;
	Форма.Элементы.Отделитель.Видимость = Истина;
	
	// Для Т3,4,7 понять мы сейчас прямой или возвратный
	Если НомерТекТипа = 3 Тогда 
		
		Если Форма.Объект.ЭтоПриемВозврата Тогда 
			Форма.Элементы.Найти("ПунктПриемкаВозврата").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
		Иначе
			Форма.Элементы.Найти("Пункт3").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
		КонецЕсли;
		
	ИначеЕсли НомерТекТипа = 4 Тогда 
		
		Если Форма.Объект.ЭтоПриемВозврата Тогда 
			Форма.Элементы.Найти("ПунктРазгрузкаВозврата").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
		Иначе
			Форма.Элементы.Найти("Пункт4").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
		КонецЕсли;
		
	ИначеЕсли НомерТекТипа = 7 Тогда 
		
		Если Форма.Объект.ЭтоВозвратнаяЦепочка Тогда 
			Форма.Элементы.Найти("ПунктПереадресовкаВозврата").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
		Иначе
			Форма.Элементы.Найти("Пункт7").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
		КонецЕсли;
		
	КонецЕсли;
	
	// для простых (без возврата) цепочек, где есть Т3 и там не было введено переадресаций и эстафет уберем эти пункты в колбасе 
	Если ТаблицаСостоянийСвернутая.Найти(7, "НомерТитула") = Неопределено 
		И ТаблицаСостоянийСвернутая.Найти(3, "НомерТитула") <> Неопределено
		И Не ЕстьВозвратнаяЦепочка Тогда
		Форма.Элементы["ГруппаПункт7"].Видимость = Ложь;
	КонецЕсли;
	
	Если ТаблицаСостоянийСвернутая.Найти(8, "НомерТитула") = Неопределено 
		И ТаблицаСостоянийСвернутая.Найти(3, "НомерТитула") <> Неопределено
		И Не ЕстьВозвратнаяЦепочка Тогда
		Форма.Элементы["ГруппаПункт8"].Видимость = Ложь;
	КонецЕсли;
	
	НомИспрТ1 = 0;
	НомИспрТ3 = 0;
	
	Для Каждого стрНомерТитула Из ТаблицаСостоянийСвернутая Цикл
		
		НомерТитула = стрНомерТитула.НомерТитула;
		
		Если НомерТитула = 17 Тогда 
			ИмяЭлементаПункт = "ПереадресовкаВозврата";
		ИначеЕсли НомерТитула = 23 Тогда
			ИмяЭлементаПункт = "ПриемкаВозврата";
		ИначеЕсли НомерТитула = 24 Тогда
			ИмяЭлементаПункт = "РазгрузкаВозврата";
		Иначе
			ИмяЭлементаПункт = НомерТитула;
		КонецЕсли;
		
		СтрокиДокументовЭтогоЭтапа = ТаблицаСостояний.НайтиСтроки(Новый Структура("НомерТитула", НомерТитула));
		
		Если НомерТитула = 6 И СтрокиДокументовЭтогоЭтапа.Количество() > 1 Тогда
			// Для титула 6 после отказа может прийти положительный титул
			// Оставляем только последний
			СтрокаПоследнегоТитула = Неопределено;
			Для Каждого СтрокаДокументаЭтапа Из СтрокиДокументовЭтогоЭтапа Цикл
				Если СтрокаПоследнегоТитула = Неопределено Тогда
					СтрокаПоследнегоТитула = СтрокаДокументаЭтапа;
					Продолжить;
				КонецЕсли;
				
				Если СтрокаДокументаЭтапа.Титул.Дата > СтрокаПоследнегоТитула.Титул.Дата Тогда
					СтрокаПоследнегоТитула = СтрокаДокументаЭтапа;
				КонецЕсли;
			КонецЦикла;
			СтрокиДокументовЭтогоЭтапа = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаПоследнегоТитула);
		КонецЕсли;
		
		ЭлементГруппаПункт = Форма.Элементы.Найти("ГруппаПункт" + ИмяЭлементаПункт);
		ЭлементСоединитель = Форма.Элементы.Найти("Соединитель" + (НомерТитула-1)); // соединитель от предыдущего пункта
		ЭлементДобавитьЕщеТитул = Форма.Элементы.Найти("Пункт" + НомерТитула + "Добавить");
		
		// обойдем документы этого этапа
		Для Каждого СтрокаДокументаЭтапа Из СтрокиДокументовЭтогоЭтапа Цикл 
			
			ЭлементПункт = Форма.Элементы.Найти("Пункт" + ИмяЭлементаПункт);
			
			// включить картинку и соединитель этапа
			Если ЭлементПункт <> Неопределено Тогда
				УправлениеКолбасойТитуловУстановитьКартинкуПунктуПоСостояниюСтроки(СтрокаДокументаЭтапа, ТекТитулСсылка, ЭлементПункт);
				
				// Выделим вводимый титул исправления
				Если СтрокаДокументаЭтапа.НомерТитула = НомерТекТипа
					И Не ЗначениеЗаполнено(ТекТитулСсылка) Тогда
					
					Если (НомерТитула = 3 Или НомерТитула = 4)
						И Форма.Объект.ЭтоПриемВозврата Тогда
						// Не перекрашиваем т.к. сейчас вводится на обратной цепочке
					Иначе
						ЭлементПункт.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЭлементСоединитель <> Неопределено Тогда 
				ЭлементСоединитель.Картинка = БиблиотекаКартинок.КонтурЛогистика_СоединительИстинаДвойной;
			КонецЕсли;
			
			// Вывод номера исправления
			ЭлементНадписиПункти = Форма.Элементы.Найти("НадписьИспрПункт" + ИмяЭлементаПункт);
			Если ЭлементНадписиПункти <> Неопределено И СтрокаДокументаЭтапа.НомИспр <> 0 Тогда
				ЭлементНадписиПункти.Видимость = Истина;
				ЭлементНадписиПункти.Заголовок = ЭлементНадписиПункти.Заголовок + Строка(СтрокаДокументаЭтапа.НомИспр);
				ЭлементНадписиПункти.Подсказка = "Исправление " + Строка(СтрокаДокументаЭтапа.НомИспр);
			КонецЕсли;
			
			// установить особенности цепочки
			Если СтрокаДокументаЭтапа.НомерТитула = 1 Тогда
				
				НомИспрТ1 = СтрокаДокументаЭтапа.НомИспр;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 2 Тогда
				
				Если СтрокаДокументаЭтапа.Статус <> Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
					И СтрокаДокументаЭтапа.ЕстьОтказВПодписи <> Истина Тогда 
					Форма.Элементы["ИконкаОтправитьQR"].Доступность = Истина;
					Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Истина;
					
					Если ЭлементПункт7Добавить <> Неопределено Тогда
						ЭлементПункт7Добавить.Доступность = Истина;
					КонецЕсли;
					Если ЭлементПункт8Добавить <> Неопределено Тогда
						ЭлементПункт8Добавить.Доступность = Истина;
					КонецЕсли;
				КонецЕсли;
				
				// Выделим соединитель и номер исправления красным если номера исправлений не совпадают
				Если НомИспрТ1 <> СтрокаДокументаЭтапа.НомИспр Тогда
					ЭлементСоединитель.Картинка = БиблиотекаКартинок.КонтурЛогистика_СоединительИстинаДвойнойКрасный;
					ЭлементНадписьИспрПунктТ1 = Форма.Элементы.Найти("НадписьИспрПункт1");
					Если ЭлементНадписьИспрПунктТ1 <> Неопределено Тогда
						ЭлементНадписьИспрПунктТ1.ЦветТекста = WebЦвета.Красный;
					КонецЕсли;
					ЭлементНадписьИспрПунктТ2 = Форма.Элементы.Найти("НадписьИспрПункт2");
					Если ЭлементНадписьИспрПунктТ2 <> Неопределено Тогда
						ЭлементНадписьИспрПунктТ2.ЦветТекста = WebЦвета.Красный;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 3 Тогда
				
				Форма.Элементы["ИконкаОтправитьQR"].Доступность = Ложь;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Ложь;
				
				Если ЭлементПункт7Добавить <> Неопределено Тогда
					ЭлементПункт7Добавить.Доступность = Ложь;
				КонецЕсли;
				Если ЭлементПункт8Добавить <> Неопределено Тогда
					ЭлементПункт8Добавить.Доступность = Ложь;
				КонецЕсли;
				
				Если СтрокаДокументаЭтапа.ПринятьЧастично Или СтрокаДокументаЭтапа.ОтказВПриемке Тогда 
					Форма.Элементы["ГруппаВозврат"].Видимость = Истина;
					Форма.Элементы.Отделитель.Видимость = Ложь;
				КонецЕсли;
				
				НомИспрТ3 = СтрокаДокументаЭтапа.НомИспр;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 4 Тогда
				
				// Выделим соединитель и номер исправления красным если номера исправлений не совпадают
				Если НомИспрТ3 <> СтрокаДокументаЭтапа.НомИспр Тогда
					ЭлементСоединитель.Картинка = БиблиотекаКартинок.КонтурЛогистика_СоединительИстинаДвойнойКрасный;
					ЭлементНадписьИспрПунктТ3 = Форма.Элементы.Найти("НадписьИспрПункт3");
					Если ЭлементНадписьИспрПунктТ3 <> Неопределено Тогда
						ЭлементНадписьИспрПунктТ3.ЦветТекста = WebЦвета.Красный;
					КонецЕсли;
					ЭлементНадписьИспрПунктТ4 = Форма.Элементы.Найти("НадписьИспрПункт4");
					Если ЭлементНадписьИспрПунктТ4 <> Неопределено Тогда
						ЭлементНадписьИспрПунктТ4.ЦветТекста = WebЦвета.Красный;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 5 И Не НомерТекТипа = 6 Тогда
				
				Форма.Элементы.Найти("Пункт6").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктБудущий;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 7 Тогда
				
				Если ЭлементПункт7Добавить <> Неопределено Тогда
					ЭлементПункт7Добавить.Видимость = Истина;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 8 Тогда
				
				Если ЭлементПункт8Добавить <> Неопределено Тогда
					ЭлементПункт8Добавить.Видимость = Истина;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 17 Тогда
				
				Форма.Элементы["ИконкаОтправитьQRВозврат"].Доступность = Истина;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Истина;
				Если ЭлементПункт7Добавить <> Неопределено Тогда
					ЭлементПункт7Добавить.Доступность = Ложь;
				КонецЕсли;
				Если ЭлементПункт8Добавить <> Неопределено Тогда
					ЭлементПункт8Добавить.Доступность = Ложь;
				КонецЕсли;
				
			ИначеЕсли СтрокаДокументаЭтапа.НомерТитула = 23 Тогда
				
				Форма.Элементы["ИконкаОтправитьQRВозврат"].Доступность = Ложь;
				Форма.Элементы["ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод"].Доступность = Ложь;
				Если ЭлементПункт7Добавить <> Неопределено Тогда
					ЭлементПункт7Добавить.Доступность = Ложь;
				КонецЕсли;
				Если ЭлементПункт8Добавить <> Неопределено Тогда
					ЭлементПункт8Добавить.Доступность = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеКолбасойТитуловЗЗ(Знач ГлавныйДокумент, Знач ТекТитулСсылка, Знач ТипТитула, Знач Форма)
	
	Перем НомерТитула, стрНомерТитула, СтрокаДокументаТ1, СтрокаДокументаЭтапа, СтрокиДокументовЭтогоЭтапа, ТаблицаСостояний, ТаблицаСостоянийСвернутая, ЭлементГруппаПункт, ЭлементДобавитьЕщеТитул, ЭлементПункт, ЭлементСоединитель;
	
	// в эту таблицу попадут только успешно доставленные/полученные документы
	ТаблицаСостояний = ПолучитьТаблицуТитуловПеревозкиЗЗ(ГлавныйДокумент);
	
	ТаблицаСостоянийСвернутая = ТаблицаСостояний.Скопировать();
	ТаблицаСостоянийСвернутая.Свернуть("НомерТитула");
	
	СтрокаДокументаТ1 = Неопределено;
	
	Для Каждого стрНомерТитула Из ТаблицаСостоянийСвернутая Цикл
		
		НомерТитула = стрНомерТитула.НомерТитула;
		
		СтрокиДокументовЭтогоЭтапа = ТаблицаСостояний.НайтиСтроки(Новый Структура("НомерТитула", НомерТитула));
		
		ЭлементГруппаПункт = Форма.Элементы.Найти("ГруппаПункт" + НомерТитула);
		ЭлементСоединитель = Форма.Элементы.Найти("Соединитель" + (НомерТитула-1)); // соединитель от предыдущего пункта
		ЭлементДобавитьЕщеТитул = Форма.Элементы.Найти("Пункт" + НомерТитула + "Добавить");
		
		// обойдем документы этого этапа
		Для Каждого СтрокаДокументаЭтапа Из СтрокиДокументовЭтогоЭтапа Цикл 
						
			ЭлементПункт = Форма.Элементы.Найти("Пункт" + НомерТитула);
			
			// включить картинку и соединитель этапа
			Если ЭлементПункт <> Неопределено Тогда
				УправлениеКолбасойТитуловУстановитьКартинкуПунктуПоСостояниюСтроки(СтрокаДокументаЭтапа, ТекТитулСсылка, ЭлементПункт);
			КонецЕсли;
			
			Если ЭлементСоединитель <> Неопределено Тогда 
				ЭлементСоединитель.Картинка = БиблиотекаКартинок.КонтурЛогистика_СоединительИстинаДвойной;
			КонецЕсли;
						
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеКолбасойТитуловУстановитьКартинкуПунктуПоСостояниюСтроки(Знач СтрокаДокументаЭтапа, Знач ТекТитулСсылка, Знач ЭлементПункт)
	
	Если СтрокаДокументаЭтапа.Титул = ТекТитулСсылка Тогда
		
		Если СтрокаДокументаЭтапа.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
			Или СтрокаДокументаЭтапа.ЕстьОтказВПодписи = Истина Тогда 
			ЭлементПункт.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийОшибка;
		Иначе
			ЭлементПункт.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийВыполнен;
		КонецЕсли;
		
	Иначе
		
		Если СтрокаДокументаЭтапа.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
			ЭлементПункт.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктОшибка;
		ИначеЕсли СтрокаДокументаЭтапа.ЕстьОтказВПодписи = Истина Тогда 
			ЭлементПункт.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктОтказ;
		Иначе
			ЭлементПункт.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктВыполнен;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПозиционироватьТекущийТ2илиТ6(Знач СтрокаДокументаТ1, Знач Титул2ТекущийВодитель, Знач Титул6ТекущийВодитель, Знач Форма)
	
	Если СтрокаДокументаТ1 <> Неопределено Тогда 
		Если Титул2ТекущийВодитель <> Неопределено Тогда 
			Если СтрокаДокументаТ1.Водитель = Титул2ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт2").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			ИначеЕсли СтрокаДокументаТ1.Водитель2 = Титул2ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт2доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			КонецЕсли;
		ИначеЕсли Титул6ТекущийВодитель <> Неопределено Тогда
			Если СтрокаДокументаТ1.Водитель = Титул6ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт6").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			ИначеЕсли СтрокаДокументаТ1.Водитель2 = Титул6ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт6доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПозиционироватьТекущийТ2илиТ5_5_02(Знач СтрокаДокументаТ1, Знач Титул2ТекущийВодитель, Знач Титул5ТекущийВодитель, Знач Форма)
	
	Если СтрокаДокументаТ1 <> Неопределено Тогда 
		Если Титул2ТекущийВодитель <> Неопределено Тогда 
			Если СтрокаДокументаТ1.Водитель = Титул2ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт2").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			ИначеЕсли СтрокаДокументаТ1.Водитель2 = Титул2ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт2доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			КонецЕсли;
		ИначеЕсли Титул5ТекущийВодитель <> Неопределено Тогда
			Если СтрокаДокументаТ1.Водитель = Титул5ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт5").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			ИначеЕсли СтрокаДокументаТ1.Водитель2 = Титул5ТекущийВодитель Тогда
				Форма.Элементы.Найти("Пункт5доп").Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктТекущийНевыполнен;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуТитуловПеревозкиПЛ(ГлавныйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ГлавныйДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1") Тогда
		Запрос.Текст = ТекстЗапросаПолученияТаблицыТитуловПеревозкиПЛ(ГлавныйДокумент);
	Иначе
		Запрос.Текст = ТекстЗапросаПолученияТаблицыТитуловПеревозкиПЛ_5_02(ГлавныйДокумент);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Титул1", ГлавныйДокумент);
	СтатусыУспешнойДоставки = СтатусыБылаПопыткаТранспорта();
	Запрос.УстановитьПараметр("СтатусыУспешнойДоставки", СтатусыУспешнойДоставки);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ТекстЗапросаПолученияТаблицыТитуловПеревозкиПЛ(ГлавныйДокумент)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтурЛогистика_ПЛ_Титул1.Ссылка КАК Ссылка,
	               |	1 КАК НомерТитула,
	               |	КонтурЛогистика_ПЛ_Титул1.ОбязМедосмотрПосле КАК ОбязМедосмотрПосле,
	               |	NULL КАК ЕстьОтказВПодписи,
	               |	КонтурЛогистика_ПЛ_Титул1.ЭтоСменаВодителя КАК ЭтоСменаВодителя,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель2 <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка) КАК ДваВодителя,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель КАК Водитель,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель2 КАК Водитель2
	               |ПОМЕСТИТЬ ВТ_ДокументыТитулы
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул1.Ссылка = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул1.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул2.Ссылка,
	               |	2,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул2.ЕстьОтказВПодписи,
	               |	NULL,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул2.Водитель,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул2 КАК КонтурЛогистика_ПЛ_Титул2
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул2.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул2.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул3.Ссылка,
	               |	3,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул3.ЕстьОтказВПодписи,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул3 КАК КонтурЛогистика_ПЛ_Титул3
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул3.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул3.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул4.Ссылка,
	               |	4,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул4.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул4.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул5.Ссылка,
	               |	5,
	               |	NULL,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул5.ЭтоСменаВодителя,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул5 КАК КонтурЛогистика_ПЛ_Титул5
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул5.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул5.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул6.Ссылка,
	               |	6,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул6.ЕстьОтказВПодписи,
	               |	NULL,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул6.Водитель,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул6 КАК КонтурЛогистика_ПЛ_Титул6
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул6.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул6.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДокументыТитулы.Ссылка КАК Титул,
	               |	ВТ_ДокументыТитулы.НомерТитула КАК НомерТитула,
	               |	МАКСИМУМ(ЕСТЬNULL(КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка))) КАК Статус,
	               |	ВТ_ДокументыТитулы.ОбязМедосмотрПосле КАК ОбязМедосмотрПосле,
	               |	ВТ_ДокументыТитулы.ЕстьОтказВПодписи КАК ЕстьОтказВПодписи,
	               |	ВТ_ДокументыТитулы.Водитель КАК Водитель,
	               |	ВТ_ДокументыТитулы.ЭтоСменаВодителя КАК ЭтоСменаВодителя,
	               |	ВТ_ДокументыТитулы.ДваВодителя КАК ДваВодителя,
	               |	ВТ_ДокументыТитулы.Водитель2 КАК Водитель2
	               |ИЗ
	               |	ВТ_ДокументыТитулы КАК ВТ_ДокументыТитулы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(
	               |				,
	               |				Документ В
	               |					(ВЫБРАТЬ
	               |						ВТ_ДокументыТитулы.Ссылка КАК Ссылка
	               |					ИЗ
	               |						ВТ_ДокументыТитулы КАК ВТ_ДокументыТитулы)) КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	               |		ПО ВТ_ДокументыТитулы.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ
	               |ГДЕ
	               |	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус В(&СтатусыУспешнойДоставки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДокументыТитулы.Ссылка,
	               |	ВТ_ДокументыТитулы.ЕстьОтказВПодписи,
	               |	ВТ_ДокументыТитулы.Водитель2,
	               |	ВТ_ДокументыТитулы.ДваВодителя,
	               |	ВТ_ДокументыТитулы.ОбязМедосмотрПосле,
	               |	ВТ_ДокументыТитулы.ЭтоСменаВодителя,
	               |	ВТ_ДокументыТитулы.Водитель,
	               |	ВТ_ДокументыТитулы.НомерТитула
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Титул";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПолученияТаблицыТитуловПеревозкиПЛ_5_02(ГлавныйДокумент)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтурЛогистика_ПЛ_Титул1.Ссылка КАК Ссылка,
	               |	1 КАК НомерТитула,
	               |	КонтурЛогистика_ПЛ_Титул1.ОбязМедосмотрПосле КАК ОбязМедосмотрПосле,
	               |	NULL КАК ЕстьОтказВПодписи,
	               |	ЛОЖЬ КАК ЭтоСменаВодителя,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель2 <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка) КАК ДваВодителя,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель КАК Водитель,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель2 КАК Водитель2
	               |ПОМЕСТИТЬ ВТ_ДокументыТитулы
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул1_5_02 КАК КонтурЛогистика_ПЛ_Титул1
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул1.Ссылка = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул1.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул2.Ссылка,
	               |	2,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул2.ЕстьОтказВПодписи,
	               |	NULL,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул2.Водитель,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул2_5_02 КАК КонтурЛогистика_ПЛ_Титул2
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул2.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул2.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул3.Ссылка,
	               |	3,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул3.ЕстьОтказВПодписи,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул3_5_02 КАК КонтурЛогистика_ПЛ_Титул3
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул3.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул3.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул4.Ссылка,
	               |	4,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул4_5_02 КАК КонтурЛогистика_ПЛ_Титул4
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул4.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул4.ПометкаУдаления
	               |
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул5.Ссылка,
	               |	5,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул5.ЕстьОтказВПодписи,
	               |	NULL,
	               |	NULL,
	               |	КонтурЛогистика_ПЛ_Титул5.Водитель,
	               |	NULL
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул5_5_02 КАК КонтурЛогистика_ПЛ_Титул5
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул5.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул5.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДокументыТитулы.Ссылка КАК Титул,
	               |	ВТ_ДокументыТитулы.НомерТитула КАК НомерТитула,
	               |	МАКСИМУМ(ЕСТЬNULL(КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка))) КАК Статус,
	               |	ВТ_ДокументыТитулы.ОбязМедосмотрПосле КАК ОбязМедосмотрПосле,
	               |	ВТ_ДокументыТитулы.ЕстьОтказВПодписи КАК ЕстьОтказВПодписи,
	               |	ВТ_ДокументыТитулы.Водитель КАК Водитель,
	               |	ВТ_ДокументыТитулы.ЭтоСменаВодителя КАК ЭтоСменаВодителя,
	               |	ВТ_ДокументыТитулы.ДваВодителя КАК ДваВодителя,
	               |	ВТ_ДокументыТитулы.Водитель2 КАК Водитель2
	               |ИЗ
	               |	ВТ_ДокументыТитулы КАК ВТ_ДокументыТитулы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(
	               |				,
	               |				Документ В
	               |					(ВЫБРАТЬ
	               |						ВТ_ДокументыТитулы.Ссылка КАК Ссылка
	               |					ИЗ
	               |						ВТ_ДокументыТитулы КАК ВТ_ДокументыТитулы)) КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	               |		ПО ВТ_ДокументыТитулы.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ
	               |ГДЕ
	               |	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус В(&СтатусыУспешнойДоставки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДокументыТитулы.Ссылка,
	               |	ВТ_ДокументыТитулы.ЕстьОтказВПодписи,
	               |	ВТ_ДокументыТитулы.Водитель2,
	               |	ВТ_ДокументыТитулы.ДваВодителя,
	               |	ВТ_ДокументыТитулы.ОбязМедосмотрПосле,
	               |	ВТ_ДокументыТитулы.ЭтоСменаВодителя,
	               |	ВТ_ДокументыТитулы.Водитель,
	               |	ВТ_ДокументыТитулы.НомерТитула
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Титул";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуТитуловПеревозкиТРН(ДокументЭТРН) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтатусыУспешнойДоставки = СтатусыБылаПопыткаТранспорта();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокументЭТРН);
	Запрос.УстановитьПараметр("СтатусыУспешнойДоставки", СтатусыУспешнойДоставки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.Ссылка КАК Ссылка,
	|	1 КАК НомерТитула,
	|	NULL КАК ЕстьОтказВПодписи,
	|	NULL КАК ПринятьЧастично,
	|	NULL КАК ОтказВПриемке,
	|	КонтурЛогистика_ТрН_Титул1.НомИспр КАК НомИспр
	|ПОМЕСТИТЬ ВТ_Титулы
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул1.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул1.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2.Ссылка,
	|	2,
	|	КонтурЛогистика_ТрН_Титул2.ЕстьОтказВПодписи,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул2.НомИспрГО
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул2.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул2.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3.Ссылка,
	|	3,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул3.ПринятьЧастично,
	|	КонтурЛогистика_ТрН_Титул3.ОтказВПриемке,
	|	КонтурЛогистика_ТрН_Титул3.НомИспр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул3.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул3.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул3.ЭтоПриемВозврата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4.Ссылка,
	|	4,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул4.ПринятьЧастично,
	|	КонтурЛогистика_ТрН_Титул4.ОтказВПриемке,
	|	КонтурЛогистика_ТрН_Титул4.НомИспрГП
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4 КАК КонтурЛогистика_ТрН_Титул4
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул4.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул4.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул4.ЭтоПриемВозврата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул5.Ссылка,
	|	5,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул5 КАК КонтурЛогистика_ТрН_Титул5
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул5.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул5.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул6.Ссылка,
	|	6,
	|	КонтурЛогистика_ТрН_Титул6.ЕстьОтказВПодписи,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул6 КАК КонтурЛогистика_ТрН_Титул6
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул6.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул6.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка,
	|	7,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул7.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул7.ЭтоВозвратнаяЦепочка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8.Ссылка,
	|	8,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8 КАК КонтурЛогистика_ТрН_Титул8
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул8.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул8.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка,
	|	17,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул7.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = &ДокументЭТРН
	|	И КонтурЛогистика_ТрН_Титул7.ЭтоВозвратнаяЦепочка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3.Ссылка,
	|	23,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул3.ПринятьЧастично,
	|	КонтурЛогистика_ТрН_Титул3.ОтказВПриемке,
	|	КонтурЛогистика_ТрН_Титул3.НомИспр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул3.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул3.ДокументЭТРН = &ДокументЭТРН
	|	И КонтурЛогистика_ТрН_Титул3.ЭтоПриемВозврата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4.Ссылка,
	|	24,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул4.ПринятьЧастично,
	|	КонтурЛогистика_ТрН_Титул4.ОтказВПриемке,
	|	КонтурЛогистика_ТрН_Титул4.НомИспрГП
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4 КАК КонтурЛогистика_ТрН_Титул4
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул4.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул4.ДокументЭТРН = &ДокументЭТРН
	|	И КонтурЛогистика_ТрН_Титул4.ЭтоПриемВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Титулы.Ссылка КАК Титул,
	|	ВТ_Титулы.НомерТитула КАК НомерТитула,
	|	ВТ_Титулы.ЕстьОтказВПодписи КАК ЕстьОтказВПодписи,
	|	ВТ_Титулы.ПринятьЧастично КАК ПринятьЧастично,
	|	ВТ_Титулы.ОтказВПриемке КАК ОтказВПриемке,
	|	ВТ_Титулы.НомИспр КАК НомИспр,
	|	МАКСИМУМ(КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус) КАК Статус
	|ИЗ
	|	ВТ_Титулы КАК ВТ_Титулы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						ВТ_Титулы.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТ_Титулы КАК ВТ_Титулы)) КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	|		ПО ВТ_Титулы.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ
	|ГДЕ
	|	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус В(&СтатусыУспешнойДоставки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Титулы.ЕстьОтказВПодписи,
	|	ВТ_Титулы.Ссылка,
	|	ВТ_Титулы.ОтказВПриемке,
	|	ВТ_Титулы.НомИспр,
	|	ВТ_Титулы.ПринятьЧастично,
	|	ВТ_Титулы.НомерТитула
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТитула,
	|	ОтказВПриемке,
	|	ЕстьОтказВПодписи";
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуТитуловПеревозкиЗЗ(ГлавныйДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтурЛогистика_ЗЗ_Титул1.Ссылка КАК Ссылка,
	               |	1 КАК НомерТитула,
	               |	ЛОЖЬ КАК ЕстьОтказВПодписи
	               |ПОМЕСТИТЬ ВТ_ДокументыТитулы
	               |ИЗ
	               |	Документ.КонтурЛогистика_ЗЗ_Титул1 КАК КонтурЛогистика_ЗЗ_Титул1
	               |ГДЕ
	               |	КонтурЛогистика_ЗЗ_Титул1.Ссылка = &Титул1
	               |	И НЕ КонтурЛогистика_ЗЗ_Титул1.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтурЛогистика_ЗЗ_Титул2.Ссылка,
	               |	2,
	               |	КонтурЛогистика_ЗЗ_Титул2.ЕстьОтказВПодписи
	               |ИЗ
	               |	Документ.КонтурЛогистика_ЗЗ_Титул2 КАК КонтурЛогистика_ЗЗ_Титул2
	               |ГДЕ
	               |	КонтурЛогистика_ЗЗ_Титул2.Титул1 = &Титул1
	               |	И НЕ КонтурЛогистика_ЗЗ_Титул2.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДокументыТитулы.Ссылка КАК Титул,
	               |	ВТ_ДокументыТитулы.НомерТитула КАК НомерТитула,
	               |	МАКСИМУМ(ЕСТЬNULL(КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка))) КАК Статус,
	               |	ВТ_ДокументыТитулы.ЕстьОтказВПодписи КАК ЕстьОтказВПодписи
	               |ИЗ
	               |	ВТ_ДокументыТитулы КАК ВТ_ДокументыТитулы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(
	               |				,
	               |				Документ В
	               |					(ВЫБРАТЬ
	               |						ВТ_ДокументыТитулы.Ссылка КАК Ссылка
	               |					ИЗ
	               |						ВТ_ДокументыТитулы КАК ВТ_ДокументыТитулы)) КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	               |		ПО ВТ_ДокументыТитулы.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ
	               |ГДЕ
	               |	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус В(&СтатусыУспешнойДоставки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДокументыТитулы.Ссылка,
	               |	ВТ_ДокументыТитулы.НомерТитула,
	               |	ВТ_ДокументыТитулы.ЕстьОтказВПодписи
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Титул";
	
	Запрос.УстановитьПараметр("Титул1", ГлавныйДокумент);
	СтатусыУспешнойДоставки = СтатусыБылаПопыткаТранспорта();
	Запрос.УстановитьПараметр("СтатусыУспешнойДоставки", СтатусыУспешнойДоставки);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция СтатусыБылаПопыткаТранспорта()
	
	СтатусыБылаПопыткаТранспорта = Новый Массив;
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.Получен);
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением);
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки);
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан);
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаОтказВПодписи);
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена);
	СтатусыБылаПопыткаТранспорта.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка);
	
	Возврат СтатусыБылаПопыткаТранспорта;
	
КонецФункции 

Процедура УправлениеПользователемПодписантом(Форма)
	
	Попытка
		
		Если Форма.ТекущийСтатус <> Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик Тогда
			Возврат;
		КонецЕсли;
		
		ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		
		// Проверим идентичность пользователя титула и текущего
		Если Форма.Объект.ПользовательПодписант = ПользовательПодписант Тогда
			Возврат;
		КонецЕсли;
		
		ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(Форма.Объект.Ссылка);
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			ТипЛогистика, Форма.Объект.ДокументОснование);
		
		Если Не КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
			Возврат;
		КонецЕсли;
		
		// Проверим настройку в НКД
		ПодписантТекущийПользователь = КонтекстНастройкиКонвертации.ПодписантТекущийПользователь;
		
		Если Не ПодписантТекущийПользователь Тогда
			Возврат;
		КонецЕсли;
		
		// Установим текущего пользователя в подписанта титула
		Форма.Объект.ПользовательПодписант = ПользовательПодписант;
		Форма.Модифицированность = Истина;
		
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура УправлениеСвязямиДокументов(Форма)
	
	Если Не Форма.Параметры.Свойство("Ключ") Тогда
		Возврат;
	КонецЕсли;
	
	Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЭР(Форма.Параметры.Ключ)
		Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулСР(Форма.Параметры.Ключ) Тогда
		
		СвязанныйДокумент = РегистрыСведений.КонтурЛогистика_СвязиДокументов.СвязанныйДокумент(Форма.Параметры.Ключ);
		
		Если Не ЗначениеЗаполнено(СвязанныйДокумент.ДокументПодчиненный) Тогда
			Возврат;
		КонецЕсли;
		
		Если СвязанныйДокумент.ДокументПодчиненный = Форма.Параметры.Ключ Тогда
			ОтображаемыйДокумент = СвязанныйДокумент.ДокументОсновной;
			ОтображаемДокументОснование = Истина;
		Иначе
			ОтображаемыйДокумент = СвязанныйДокумент.ДокументПодчиненный;
			ОтображаемДокументОснование = Ложь;
		КонецЕсли;
		
		// Создать реквизиты формы
		Типы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ОтображаемыйДокумент));
		ОписаниеТипа = Новый ОписаниеТипов(Типы);
		ПредставлениеСвязанногоДокумента = Новый РеквизитФормы("ПредставлениеСвязанногоДокумента", ОписаниеТипа);
		
		ДополнительныеРеквизиты = Новый Массив;
		ДополнительныеРеквизиты.Добавить(ПредставлениеСвязанногоДокумента);
		
		Форма.ИзменитьРеквизиты(ДополнительныеРеквизиты);
		
		Форма.ПредставлениеСвязанногоДокумента = ОтображаемыйДокумент;
		
		// Вывести реквизиты на форму
		КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиСвязанныеОбъекты(
			Форма.Параметры.Ключ, ОтображаемДокументОснование, Форма, ОтображаемыйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеВидимостьюКомандФормДокументов(Форма)
	
	ЭтоТрНЧерновики = Ложь;
	ЭтоЗЗилиПЭЧерновики = Ложь;
	ЭтоЭПЛЧерновики = Ложь;
	
	Попытка
		ТипСсылки = ТипЗнч(Форма.Объект.Ссылка);
		ЭтоТрНЧерновики = ТипСсылки = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
			Или ТипСсылки = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3");
		ЭтоЗЗилиПЭЧерновики = ТипСсылки = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1")
			Или ТипСсылки = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1");
		ЭтоЭПЛЧерновики = ТипСсылки = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02");
	Исключение
		ЭтоТрНЧерновики = КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Форма.ИмяФормы, "Документ.КонтурЛогистика_ТрН_Титул1") > 0
			Или КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Форма.ИмяФормы, "Документ.КонтурЛогистика_ТрН_Титул3") > 0;
		ЭтоЗЗилиПЭЧерновики = КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Форма.ИмяФормы, "Документ.КонтурЛогистика_ЗЗ_Титул1") > 0
			Или КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Форма.ИмяФормы, "Документ.КонтурЛогистика_ПЭ_Титул1") > 0;
		ЭтоЭПЛЧерновики = КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Форма.ИмяФормы, "Документ.КонтурЛогистика_ПЛ_Титул1_5_02") > 0;
	КонецПопытки;
	
	Если Не ЭтоТрНЧерновики И Не ЭтоЗЗилиПЭЧерновики И Не ЭтоЭПЛЧерновики Тогда
		
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке");
		
	КонецЕсли;
	
	Если Не ЭтоТрНЧерновики Тогда
		
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание");
		СкрытьЭлементФормы(Форма, "ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителю");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПредыдущийТипДокумента(ТипЛогистика) Экспорт

	Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПредыдущийТипДокумента(ТипЛогистика);

КонецФункции

Функция УбратьЦифры(ВхСтрока)
	
   ВыхСтрока="";
   Для п = 1 По СтрДлина(ВхСтрока) Цикл
      Симв = Сред(ВхСтрока, п, 1);
	  Если Симв >= "0" И Симв <= "9" Тогда
		  //пропускаем
	  Иначе
         ВыхСтрока = ВыхСтрока+Симв;
      КонецЕсли;
  КонецЦикла;
  
   Возврат ВыхСтрока;
   
КонецФункции

Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
				НСтр("ru = '%1 в %2'"), ТекстИсключения, КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеИзБезопасногоХранилища(Владелец, ИмяБезопасногоХранилищаДанных, Ключ)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	БезопасноеХранилищеДанных.Данные КАК Данные
		|ИЗ
		|	#ИмяБезопасногоХранилищаДанных КАК БезопасноеХранилищеДанных
		|ГДЕ
		|	БезопасноеХранилищеДанных.Владелец = &Владелец";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяБезопасногоХранилищаДанных", "РегистрСведений." + ИмяБезопасногоХранилищаДанных);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура(Ключ);
	Если РезультатЗапроса.Следующий() Тогда
		Если ЗначениеЗаполнено(РезультатЗапроса.Данные) Тогда
			СохраненныеДанные = РезультатЗапроса.Данные.Получить();
			Если ЗначениеЗаполнено(СохраненныеДанные) Тогда
				ЗаполнитьЗначенияСвойств(Результат, СохраненныеДанные);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СертификатПоОтпечатку(Отпечаток, СертификатНаСервере) Экспорт
	
	Возврат Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПолучитьСертификатПоОтпечатку(Отпечаток, СертификатНаСервере);
	
КонецФункции

Функция ПолучитьСтатусДО(ТекТитулСсылка) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ТекТитулСсылка);
	
КонецФункции

Функция ВсеНашиОрганизации() Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
КонецФункции

Процедура УбратьПризнакНашУОрганизаций(МассивОрганизаций) Экспорт
	
	Для каждого Орг Из МассивОрганизаций Цикл
		
		ОргОб = Орг.ПолучитьОбъект();
		ОргОб.Наш = Ложь;
		ОргОб.Записать();
		
	КонецЦикла;
			
КонецПроцедуры

Функция ИмяФормыВыбораПоТипуДокумента(ТипДокументаОснования) Экспорт
	
	МетаТипа = Метаданные.НайтиПоТипу(ТипДокументаОснования);
	
	Если МетаТипа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МетаТипа.ПолноеИмя() + ".ФормаВыбора";
	
КонецФункции

Функция ТипыДокументаОснования(ИмяДокументаЛогистика) Экспорт
	
	Титул1 = Метаданные.Документы.Найти(ИмяДокументаЛогистика);
	
	Если Титул1 = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	РеквизитДокументОснование = Титул1.Реквизиты.Найти("ДокументОснование");
	
	Если РеквизитДокументОснование = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РеквизитДокументОснование.Тип.Типы();
	
КонецФункции

Функция ПолучитьИмяСсылкиПоТипуЛогистики(ТипЛогистика) Экспорт
	
	Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);
	
КонецФункции

Функция СтроковоеПредставлениеОписаниеТипов_(ОписаниеТипа) Экспорт
	
	стрТип = "";
	Для каждого Тип Из ОписаниеТипа.Типы() Цикл
		Если Тип = Тип("Булево") Или Тип = Тип("Строка") Или Тип = Тип("Дата") Или Тип = Тип("Число") Тогда
			стрТип = стрТип + Строка(Тип) + ";";
		Иначе
			
			стрТип = стрТип + СтроковоеПредставлениеТипа_(Тип) + ";";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Лев(стрТип, СтрДлина(стрТип) - 1);
	
КонецФункции

Функция СтроковоеПредставлениеТипа_(Тип) Экспорт
	
	Представление = "";
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(Тип) Тогда
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
		ИмяОбъекта = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ПолноеИмя, ".")[1];
		
		Если ОбъектМетаданных <> Неопределено Тогда
			
			Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
				Представление = "СправочникСсылка";		
			ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
				Представление = "ДокументСсылка";		
			ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
				Представление = "БизнесПроцессСсылка";		
			ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
				Представление = "ПланВидовХарактеристикСсылка";		
			ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
				Представление = "ПланСчетовСсылка";	
			ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
				Представление = "ПланВидовРасчетаСсылка";		
			ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
				Представление = "ЗадачаСсылка";		
			ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
				Представление = "ПланОбменаСсылка";		
			ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
				Представление = "ПеречислениеСсылка";		
			КонецЕсли;
			
		КонецЕсли;
			
		Результат = ?(Представление = "", Представление, Представление + "." + ИмяОбъекта);
		
	ИначеЕсли Тип = Тип("Неопределено") Тогда
		Результат = "Неопределено";		
	ИначеЕсли Тип = Тип("Строка") Тогда
		Результат = "Строка";
	ИначеЕсли Тип = Тип("Число") Тогда
		Результат = "Число";
	ИначеЕсли Тип = Тип("Булево") Тогда
		Результат = "Булево";
	ИначеЕсли Тип = Тип("Дата") Тогда
		Результат = "Дата";	
	Иначе		
		Результат = Строка(Тип);		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуПоУИД(УИД, Тип) Экспорт
	
	Если Найти(Тип, "Справочник") Тогда
		Возврат Справочники[СтрЗаменить(Тип, "Справочник.", "")].ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	ИначеЕсли Найти(Тип, "Документ") Тогда
		Возврат Документы[СтрЗаменить(Тип, "Документ.", "")].ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СписокТиповДляСвязанногоОбъекта(СправочникСсылка) Экспорт
	
	СписокТипов = Новый СписокЗначений;
	
	ОбъектМетаданных = СправочникСсылка.Метаданные();
	Для каждого ТекущийТип Из ОбъектМетаданных.ТабличныеЧасти.СвязанныеОбъекты.Реквизиты.СвязанныйОбъект.Тип.Типы() Цикл
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТекущийТип) Тогда
			СписокТипов.Добавить(Метаданные.НайтиПоТипу(ТекущийТип).Имя, Метаданные.НайтиПоТипу(ТекущийТип).Синоним);
		Иначе
			НовыйЭлемент = СписокТипов.Добавить(Строка(ТекущийТип));
			Если СписокТипов.Индекс(НовыйЭлемент) > 0 Тогда
				СписокТипов.Сдвинуть(НовыйЭлемент, -СписокТипов.Индекс(НовыйЭлемент));
			конецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВсеТипыСправочниковУС = КонтурЛогистика_КонвертацияСерверПовтИсп.ПоддерживаемыеТипыСправочниковКонфигурации1С(ОбъектМетаданных.Имя);
	Для Каждого ИмяОбъекта Из ВсеТипыСправочниковУС Цикл
		ОбъектМетаданныхТекущейНКД = Метаданные.Справочники.Найти(ИмяОбъекта);
		Если ОбъектМетаданныхТекущейНКД = Неопределено Тогда
			ОбъектМетаданныхТекущейНКД = Метаданные.Документы.Найти(ИмяОбъекта);
			Если ОбъектМетаданныхТекущейНКД = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТипОбъекта = Тип("ДокументСсылка." + ИмяОбъекта);
		Иначе
			ТипОбъекта = Тип("СправочникСсылка." + ИмяОбъекта);
		КонецЕсли;
		
		Если Не ОбъектМетаданных.ТабличныеЧасти.СвязанныеОбъекты.Реквизиты.СвязанныйОбъект.Тип.СодержитТип(ТипОбъекта) Тогда
			СписокТипов.Добавить(ИмяОбъекта, Строка(ТипОбъекта), Истина);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(СправочникСсылка) = Тип("СправочникСсылка.КонтурЛогистика_Сотрудники") Тогда
		ТипыПользователей1С = Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПодписания.Измерения.Пользователь1С.Тип.Типы();
		Для Каждого ТекущийТипПользователя Из ТипыПользователей1С Цикл
			Если СписокТипов.НайтиПоЗначению(ТекущийТипПользователя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Добавим тип
			СписокТипов.Добавить(
				Метаданные.НайтиПоТипу(ТекущийТипПользователя).Имя,
				Метаданные.НайтиПоТипу(ТекущийТипПользователя).Синоним,
				Истина);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокТипов;
	
КонецФункции

Функция НашиСНастройкойЧтениеЛентыДД(ЧитатьЛентуДиадок) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.НашиСНастройкойЧтениеЛентыДД(ЧитатьЛентуДиадок);
	
КонецФункции

Функция ЭтоHTTPЗапросОтправкиТитула(ПараметрыЗапроса) Экспорт
	
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура") И ПараметрыЗапроса.Свойство("АдресМетода") Тогда
		
		АдресМетода = ПараметрыЗапроса.АдресМетода;
		массивАдресМетода = КонтурЛогистика_СтдСтрКлиентСервер.РазложитьСтрокуВМассивПодстрокЛок(АдресМетода, "/");
		
		Если (массивАдресМетода.Найти("documents") <> Неопределено И массивАдресМетода.Найти("waybill") <> Неопределено)
			Или (массивАдресМетода.Найти("documents") <> Неопределено И массивАдресМетода.Найти("epl") <> Неопределено)
			Или (массивАдресМетода.Найти("PostMessage") <> Неопределено)
			Или (массивАдресМетода.Найти("PostMessagePatch") <> Неопределено) Тогда				
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОбщуюНастройку(ИмяНастройки) Экспорт
	
	Возврат Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяНастройки);
	
КонецФункции

Процедура НачатьТранзакцию_() Экспорт
	
	Если СокрЛП(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.РежимУправленияБлокировкойДанных()) = "АвтоматическийИУправляемый" Тогда
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);	
	Иначе
		НачатьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Функция АвтоматическийРежимБлокировкиДанный() Экспорт
	
	Возврат СокрЛП(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.РежимУправленияБлокировкойДанных()) = "Автоматический";
	
КонецФункции	

Процедура СинхронизироватьОрганизациюИзСервисаЛогистика(Организация) Экспорт
	ОрганизацияОбъект = Организация.ПолучитьОбъект();
	ОрганизацияОбъект.СинхронизироватьИзСервисаЛогистика();
КонецПроцедуры

Процедура ДобавитьРодителяВПуть(Родители, ЭлементСсылка)
	
	Если ЗначениеЗаполнено(ЭлементСсылка.Родитель) Тогда
		Родители.Вставить(0, ЭлементСсылка.Родитель.Наименование);
		ДобавитьРодителяВПуть(Родители, ЭлементСсылка.Родитель)
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПутьОтРодителяКЭлементу(ЭлементСсылка) Экспорт
	
	Родители = Новый Массив;
	ДобавитьРодителяВПуть(Родители, ЭлементСсылка);
	Путь = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Родители, " -> ");	
	
	Возврат Путь;
	
КонецФункции

Процедура УправлениеКомандамиПерезаполненияТитула(Форма)
	
	Если Не Форма.Параметры.Свойство("Ключ") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Параметры.Ключ)
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Параметры.Ключ)
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Параметры.Ключ) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул5")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул6")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1") Тогда
		
		Возврат;
	КонецЕсли;
	
	// Добавим команду открытия настроек
	ЭлементОткрытьНастройкуКонвертации = Форма.Элементы.Найти("ОткрытьНастройкуКонвертации");
	Если ЭлементОткрытьНастройкуКонвертации = Неопределено Тогда
		
		Если ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2") Тогда
			ЭлементГруппаНомерДата = Форма.Элементы.Найти("ГруппаНомерДата");
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ_5_02(Форма.Параметры.Ключ)
			И Форма.Элементы.Найти("ГруппаДокументОснование") <> Неопределено
			И Форма.Элементы.ГруппаДокументОснование.Видимость Тогда
			ЭлементГруппаНомерДата = Форма.Элементы.Найти("ГруппаДокументОснование");	
		Иначе
			ЭлементГруппаНомерДата = Форма.Элементы.Найти("ГруппаНомерДата");
		КонецЕсли;
		
		Если ЭлементГруппаНомерДата = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Подсказка", "Открыть настройку конвертации");
		СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Картинка);
		СвойстваЭлемента.Вставить("Ширина", 2);
		СвойстваЭлемента.Вставить("Высота", 1);
		СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		СвойстваЭлемента.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_Настройки);
		СвойстваЭлемента.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Верх);
		
		СобытияЭлемента = Новый Структура;
		СобытияЭлемента.Вставить("Нажатие", "КомандаДокументОснование");
		
		ЭлементОткрытьНастройкуКонвертации = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ОткрытьНастройкуКонвертации", ЭлементГруппаНомерДата, СвойстваЭлемента, СобытияЭлемента);
		
	Иначе
		
		ЭлементОткрытьНастройкуКонвертации.Видимость = Истина;
		
	КонецЕсли;
	
	Если Форма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим команду перезаполнения
	ЭлементПерезаполнитьПоДокОснованию = Форма.Элементы.Найти("ПерезаполнитьПоДокОснованию");
	Если ЭлементПерезаполнитьПоДокОснованию <> Неопределено Тогда
		ЭлементПерезаполнитьПоДокОснованию.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	ЭлементПерезаполнитьТитул = Форма.Элементы.Найти("ПерезаполнитьТитул");
	Если ЭлементПерезаполнитьТитул = Неопределено Тогда
		
		Если ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2") Тогда
			ЭлементГруппаНомерДата = Форма.Элементы.Найти("ГруппаНомерДата");
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ_5_02(Форма.Параметры.Ключ)
			И Форма.Элементы.Найти("ГруппаДокументОснование") <> Неопределено
			И Форма.Элементы.ГруппаДокументОснование.Видимость Тогда
			ЭлементГруппаНомерДата = Форма.Элементы.Найти("ГруппаДокументОснование");
			Форма.Элементы.Переместить(ЭлементОткрытьНастройкуКонвертации, ЭлементГруппаНомерДата);
		Иначе
			ЭлементГруппаНомерДата = Форма.Элементы.Найти("ГруппаНомерДата");
		КонецЕсли;
		
		Если ЭлементГруппаНомерДата = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Заголовок", "Перезаполнить");
		СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Надпись);
		СвойстваЭлемента.Вставить("Гиперссылка", Истина);
		СвойстваЭлемента.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		СвойстваЭлемента.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Верх);
		
		СобытияЭлемента = Новый Структура;
		СобытияЭлемента.Вставить("Нажатие", "КомандаДокументОснование");
		
		ЭлементПерезаполнитьТитул = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ПерезаполнитьТитул", ЭлементГруппаНомерДата, СвойстваЭлемента, СобытияЭлемента, ЭлементОткрытьНастройкуКонвертации);
		
		// Добавим иконку
		СвойстваЭлемента = Новый Структура;
		СвойстваЭлемента.Вставить("Вид", ВидДекорацииФормы.Картинка);
		СвойстваЭлемента.Вставить("Ширина", 2);
		СвойстваЭлемента.Вставить("Высота", 1);
		СвойстваЭлемента.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_Повторить);
		СвойстваЭлемента.Вставить("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеЭлемента.Центр);
		
		// Иконку решили убрать т.к. это просто картинка и она по факту только мешается
		//КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		//	Форма, "ПерезаполнитьТитулКартнка", ЭлементГруппаНомерДата, СвойстваЭлемента,, ЭлементПерезаполнитьТитул);
		
	Иначе
		
		ЭлементПерезаполнитьТитул.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаголовокДопПоляГосСистИзИнфПол(Знач ИнфПол) Экспорт
	
	ГосСистемы = Новый Массив;
	ГосСистемы.Добавить("ЕГАИС");
	ГосСистемы.Добавить("ВетИС");
	ГосСистемы.Добавить("ГИС МТ");
	
	тзИдентификаторыГосСист = Новый ТаблицаЗначений;
	тзИдентификаторыГосСист.Колонки.Добавить("ГосСист");
	тзИдентификаторыГосСист.Колонки.Добавить("Номер");
	тзИдентификаторыГосСист.Колонки.Добавить("Колво");
	
	КраткоеОписание = "";
		
	Для каждого ГосСист Из ГосСистемы Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("Идентиф",ГосСист);
		
		Строки = ИнфПол.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 0 Тогда
			
		ИначеЕсли Строки.Количество() = 1 Тогда			
			НоваяСтрока = тзИдентификаторыГосСист.Добавить();
			НоваяСтрока.ГосСист = ГосСист;
			НоваяСтрока.Номер = Строки[0].Значение;
			НоваяСтрока.Колво = 1;			
		Иначе
			НоваяСтрока = тзИдентификаторыГосСист.Добавить();
			НоваяСтрока.ГосСист = ГосСист;
			НоваяСтрока.Колво = Строка(Строки.Количество());
		КонецЕсли;
		
	КонецЦикла;
	
	Если тзИдентификаторыГосСист.Количество() = 1 И тзИдентификаторыГосСист[0].Колво = 1 Тогда
		КраткоеОписание = тзИдентификаторыГосСист[0].ГосСист + " " + тзИдентификаторыГосСист[0].Номер;	
	Иначе
				
		Для каждого Стр Из тзИдентификаторыГосСист Цикл
			ОписаниеГосСистемы =  Стр.ГосСист + " " + Стр.Колво + " шт.";
			КраткоеОписание = ?(ЗначениеЗаполнено(КраткоеОписание), КраткоеОписание + "; " + ОписаниеГосСистемы, КраткоеОписание + ОписаниеГосСистемы);			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КраткоеОписание; 
					
КонецФункции

Функция ОрганизацияДляЗапросаУИДов(ДокументОбъектСсылка) Экспорт
	
	ДанныеФайла = Неопределено;
	Организация = Неопределено;
	
	Попытка
		ДанныеФайла = Справочники.КонтурЛогистика_ФайлыОбмена.ПолучитьОсновныеДанныеФайла(ДокументОбъектСсылка);
	Исключение
		ТекстОшибки = "Ошибка при отпределение организации для запроса УИДов. Ошибка: " + ОписаниеОшибки();
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ДокументОбъектСсылка, ТекстОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ДанныеФайла) И ДанныеФайла.Свойство("Отправитель") Тогда
		Организация = ДанныеФайла.Отправитель;
	КонецЕсли;
	
	Если (ТипЗнч(ДокументОбъектСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1") 
		Или ТипЗнч(ДокументОбъектСсылка) = Тип("ДокументОбъект.КонтурЛогистика_ТрН_Титул1"))
		И ЗначениеЗаполнено(ДокументОбъектСсылка.Составитель) Тогда
		Организация = ДокументОбъектСсылка.Составитель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Организация = ПараметрыСервиса.ОрганизацияДиадок;
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

Функция ПолучитьДатуНачалаДействияЭПЛ502() Экспорт
	
	РезультатПоУмолчанию = Дата("20260901000000");
	
	Попытка
		
		Результат = КонтурЛогистика_ФункциональныеОпции.ДатаНачалаДействияЭПЛ502();
		Если Результат = Неопределено Или Результат = Дата(1, 1, 1) Тогда
			Результат = РезультатПоУмолчанию;
		КонецЕсли;
		
	Исключение
		Результат = РезультатПоУмолчанию;
	КонецПопытки;
	
	Если Результат < ТекущаяДатаСеанса() 
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист") = Истина Тогда
		
		ВключитьИспользованияЭПЛ502();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДействуютЭкспедиторскиеДокументы() Экспорт
	
	Результат = Истина;
	
	Попытка
		
		ДатаНачалаДействия = КонтурЛогистика_ФункциональныеОпции.ДатаНачалаДействияЭкспедиторскихДокументов();
		Если ДатаНачалаДействия = Неопределено Или ДатаНачалаДействия = Дата(1, 1, 1) Тогда
			Возврат Результат;
		КонецЕсли;
		
	Исключение
		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат = (ДатаНачалаДействия < ТекущаяДатаСеанса());
	
	Возврат Результат;
	
КонецФункции

Процедура ВключитьИспользованияЭПЛ502() Экспорт
	
	Попытка
		
		Результат = КонтурЛогистика_ФункциональныеОпции.ВключитьНастройкуИспользованияЭПЛ502();
		Если Результат = Неопределено Или Не Результат Тогда
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
	
		Если ЗначениеЗаполнено(Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", "ИспользуетсяПутевойЛист_5_02")) Тогда
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ИспользуетсяПутевойЛист_5_02", Истина);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		
	КонецПопытки;
		
КонецПроцедуры

Функция КоличествоДействующихСертификатов() Экспорт
		
	Возврат Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.КоличествоДействующихСертификатов();
	
КонецФункции

Функция КоличествоДействующихМЧД() Экспорт
		
	Возврат Справочники.КонтурЛогистика_МЧД.КоличествоДействующихМЧД();
	
КонецФункции

Функция КоличествоДействующихНастроекПодписания() Экспорт
		
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.КоличествоДействующихНастроекПодписания();
	
КонецФункции

// Возвращает Истина, если нужно проверять наличие настроек подписания.
// Ложь — если пользователь отключил проверку («Больше не показывать» на рабочем столе).
//
Функция ПроверятьНаличиеНастроекПодписания() Экспорт
	
	Значение = ХранилищеОбщихНастроек.Загрузить(
		"КонтурЛогистика_СтартовыйПомощник",
		"НеПроверятьНаличиеНастроекПодписания");
	
	Возврат Значение <> Истина;
	
КонецФункции

// Сохраняет признак: не проверять наличие настроек подписания и не показывать
// стартовый помощник / предупреждение на рабочем столе по этой причине.
//
Процедура УстановитьНеПроверятьНаличиеНастроекПодписания(Значение = Истина) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(
		"КонтурЛогистика_СтартовыйПомощник",
		"НеПроверятьНаличиеНастроекПодписания",
		Значение);
	
КонецПроцедуры

Функция НашиОрганизацииБезНастроекПодписания() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок КАК ОрганизацияДиадок
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(&ТекущаяДата, ОрганизацияДиадок.Наш) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок
		|";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	МассивОрганизацийСНастройками = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОрганизацияДиадок");
	МассивВсехНашихОрганизаций = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();

	МассивОрганизацийБезНастроек = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивВсехНашихОрганизаций, МассивОрганизацийСНастройками);
	
	Возврат МассивОрганизацийБезНастроек;
	
КонецФункции

Функция ТекущийПользовательСБазовымиПравамиМожетРедактироватьСтартовыйПомощник() Экспорт
	
	Если РольДоступна("КонтурЛогистика_НастройкаПодсистемы") Или РольДоступна("КонтурЛогистика_ПолныеПраваЛогистика") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТиповаяКонфигурацияСтрока = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	Попытка
		ТиповаяКонфигурация = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТиповыеКонфигурации1С." + ТиповаяКонфигурацияСтрока);
	Исключение
		ТиповаяКонфигурация = Неопределено;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация())
		И ЗначениеЗаполнено(ТиповаяКонфигурация)
		И РольДоступна("КонтурЛогистика_БазовыеПраваЛогистика") Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьОрганизациюИзДанныхДиадока(Знач ДанныеОднойОрганизации, Знач ОрганизацияКЗаполнению = Неопределено, 
	СинхронизироватьКонтрагентовОрганизации = Ложь) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗаполнитьОрганизациюИзДанныхДиадока(
		ДанныеОднойОрганизации, ОрганизацияКЗаполнению, СинхронизироватьКонтрагентовОрганизации);
	
КонецФункции

Функция ВключеныУведомленияОГотовностиКЭПД() Экспорт
	
	Попытка
		
		Результат = КонтурЛогистика_ФункциональныеОпции.ВключитьУведомленийОГотовностиКЭПД();
		Если Результат = Неопределено Или Результат = "Disabled" Тогда
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ВключеныУведомленияТолькоНаУказанныйEmailОГотовностиКЭПД() Экспорт
	
	Попытка
		
		Результат = КонтурЛогистика_ФункциональныеОпции.ВключитьУведомленийОГотовностиКЭПД();
		Если Результат <> Неопределено И Результат = "EnabledOnlyChosenEmail" Тогда
			Возврат Истина;	
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбновитьСтатусГотовностиЭПДУчастниковПеревозки(ДокументОбъект) Экспорт
	
	Организации = Новый Массив;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КонтурЛогистика_ТрН_Титул1") Тогда
				
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументЭТРН.Грузоотправитель)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ДокументЭТРН.Грузоотправитель.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ДокументЭТРН.Грузоотправитель);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументЭТРН.Перевозчик)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ДокументЭТРН.Перевозчик.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ДокументЭТРН.Перевозчик);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументЭТРН.Грузополучатель)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ДокументЭТРН.Грузополучатель.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ДокументЭТРН.Грузополучатель);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументЭТРН.ПогрузкуОсуществляет)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ДокументЭТРН.ПогрузкуОсуществляет.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ДокументЭТРН.ПогрузкуОсуществляет);	
		КонецЕсли;
				
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КонтурЛогистика_ПЛ_Титул1") Тогда
		
		Если ЗначениеЗаполнено(ДокументОбъект.ОрганизацияМедик)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ОрганизацияМедик.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ОрганизацияМедик);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ОрганизацияТехСостояние)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ОрганизацияТехСостояние.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ОрганизацияТехСостояние);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ОрганизацияОдометр)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ОрганизацияОдометр.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ОрганизацияОдометр);	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда
		
		Если ЗначениеЗаполнено(ДокументОбъект.ОрганизацияМедик)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.ОрганизацияМедик.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.ОрганизацияМедик);	
		КонецЕсли;
				
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КонтурЛогистика_ЗЗ_Титул1") Тогда
		
		Если ЗначениеЗаполнено(ДокументОбъект.Грузоотправитель)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.Грузоотправитель.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.Грузоотправитель);	
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.Перевозчик)
			И Перечисления.КонтурЛогистика_СтатусыГотовностиКЭПД.ГотовностьНеОпределена(ДокументОбъект.Перевозчик.СтатусГотовностиКЭПД) Тогда
			Организации.Добавить(ДокументОбъект.Перевозчик);	
		КонецЕсли;
		
	КонецЕсли;
	
	АктуализироватьПоДате = Истина;
	Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(Организации, АктуализироватьПоДате);
	
КонецПроцедуры

// Возвращает признак, что у элемента справочника Логистики заполнен связанный объект учетной системы.
//
// Параметры:
//  Ссылка - СправочникСсылка - элемент справочника Логистики
//
// Возвращаемое значение:
//  Булево
//
Функция ЭлементСправочникаИмеетСвязанныйОбъект(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеСправочника = Ссылка.Метаданные();
	Если МетаданныеСправочника.ТабличныеЧасти.Найти("СвязанныеОбъекты") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
	|ИЗ
	|	Справочник." + МетаданныеСправочника.Имя + ".СвязанныеОбъекты КАК СвязанныеОбъекты
	|ГДЕ
	|	СвязанныеОбъекты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.СвязанныйОбъект) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Пометить на удаление

Функция СформироватьТекстВопроса(ПараметрКоманды) Экспорт
	
	Возврат ?(ПараметрКоманды.ПометкаУдаления, 
			"Снять с " + """" + СокрЛП(ПараметрКоманды.Ссылка) + """" + " пометку на удаление?",
			"Пометить " + """" + СокрЛП(ПараметрКоманды.Ссылка) + """" + " на удаление?");
	
КонецФункции

Процедура ПометитьНаУдаление(ПараметрКоманды) Экспорт
	
	Если Метаданные.Справочники.Содержит(ПараметрКоманды.Метаданные()) Тогда
		ПараметрКоманды.ПолучитьОбъект().УстановитьПометкуУдаления(Не ПараметрКоманды.ПометкаУдаления, Ложь);
	ИначеЕсли Метаданные.Документы.Содержит(ПараметрКоманды.Метаданные()) Тогда
		ПараметрКоманды.ПолучитьОбъект().УстановитьПометкуУдаления(Не ПараметрКоманды.ПометкаУдаления);
	КонецЕсли;	
		
КонецПроцедуры

// Фамилия и Инициалы

Функция ФамилияИнициалы(Знач ФамилияИмяОтчество) Экспорт
	
	Если ТипЗнч(ФамилияИмяОтчество) = Тип("Строка") Тогда
		ФамилияИмяОтчество = ЧастиИмени(ФамилияИмяОтчество);
	КонецЕсли;
	
	Фамилия = ФамилияИмяОтчество.Фамилия;
	Имя = ФамилияИмяОтчество.Имя;
	Отчество = ФамилияИмяОтчество.Отчество;
	
	Если ПустаяСтрока(Имя) Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Если ПустаяСтрока(Отчество) Тогда
		Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("%1 %2.", Фамилия, Лев(Имя, 1));
	КонецЕсли;
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("%1 %2. %3.", Фамилия, Лев(Имя, 1), Лев(Отчество, 1));
	
КонецФункции

Функция ЧастиИмени(ФамилияИмяОтчество)
	
	Результат = Новый Структура("Фамилия,Имя,Отчество");
	
	ЧастиИмени = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ФамилияИмяОтчество, " ", Ложь);
	
	Если ЧастиИмени.Количество() >= 1 Тогда
		Результат.Фамилия = ЧастиИмени[0];
	КонецЕсли;
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		Результат.Имя = ЧастиИмени[1];
	КонецЕсли;
	
	Если ЧастиИмени.Количество() >= 3 Тогда
		Результат.Отчество = ЧастиИмени[2];
	КонецЕсли;
	
	Если ЧастиИмени.Количество() > 3 Тогда
		ДополнительныеЧастиОтчества = Новый Массив;
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'оглы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'улы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'уулу'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'кызы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'гызы'"));
		ДополнительныеЧастиОтчества.Добавить(НСтр("ru = 'угли'"));
		
		Если ДополнительныеЧастиОтчества.Найти(НРег(ЧастиИмени[3])) <> Неопределено Тогда
			Результат.Отчество = Результат.Отчество + " " + ЧастиИмени[3];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// Обновление модуля

Функция ОбновитьМодульДоПоследнейВерсии(СсылкаНаЗагрузку) Экспорт
	
	// Проверим права
	Если Не ЭтоПолноправныйПользователь() Тогда
		ТекстОшибки = "Недостаточно прав!
			|Для установки обновления Контур.Логистика обратитесь к администратору.";
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗагрузку) Тогда
		Сообщить("Не удалось получить ссылку на загрузку обновления.");
		Возврат Ложь;
	КонецЕсли;
	
	// Загружаем с сервиса
	Попытка
		ДвоичныеДанныеОтвет = КонтурЛогистика_ОбновлениеСервер.ЗагрузитьДанные(СсылкаНаЗагрузку);
	Исключение
		КонтурЛогистика_Метрика.ОбработатьОшибку("ОбновитьМодульДоПоследнейВерсии", ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ДвоичныеДанныеОтвет = Неопределено Тогда
		Сообщить("Не удалось загрузить обновление.");
		Возврат Ложь;
	КонецЕсли;
	
	// Установим расширение
	Попытка
		// Получис старую версию
		ОтборРасширения = Новый Структура;
		ОтборРасширения.Вставить("Имя", "РасширениеКонтурЛогистика");
		
		НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
		Если НайденныеРасширения.Количество() = 0 Тогда
			Сообщить("Не удалось найти текущее расширение.");
			Возврат Ложь;
		КонецЕсли;
		ТекущееРасширение = НайденныеРасширения[0];
		
		// Разархивируем полученный пакет
		ЧтениеДанныхАрхив = Новый ЧтениеДанных(ДвоичныеДанныеОтвет);
		ПапкаДляРаспаковки = КаталогВременныхФайлов() + "KonturLogist";
		
		ЧтениеZIP = Новый ЧтениеZIPФайла(ЧтениеДанныхАрхив.ИсходныйПоток());
		ЧтениеZIP.ИзвлечьВсе(ПапкаДляРаспаковки);
		ЧтениеZIP.Закрыть();
		
		// Ищем в файлах расширение
		ФайлыЭД = НайтиФайлы(ПапкаДляРаспаковки, "*.cfe");
		Если ФайлыЭД.Количество() > 0 Тогда
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ФайлыЭД[0].ПолноеИмя);
		Иначе
			ДвоичныеДанныеФайла = Неопределено;
			
			Сообщить("Ошибка при распаковке ответа сервиса обновлений Контур");
			Возврат Ложь;
		КонецЕсли;
		
		// Подчищаем следы
		Попытка
			Выполнить("ФайловаяСистема.УдалитьВременныйКаталог(ПапкаДляРаспаковки)");
		Исключение
			// Ничего не делаем, если не удалось удалить временные файлы.
		КонецПопытки;
		
		Если ДвоичныеДанныеФайла = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Проверим возможность применения
		ИтогиПроверки = ТекущееРасширение.ПроверитьВозможностьПрименения(ДвоичныеДанныеФайла);
		Если ИтогиПроверки.Количество() <> 0 Тогда
			Сообщить("Проблемы применения расширения:");
			Для Каждого ТекущийИтог Из ИтогиПроверки Цикл
				Сообщить("- " + ТекущийИтог.Описание);
			КонецЦикла;
			
			Возврат Ложь;
		КонецЕсли;
		
		// Запишем расширение
		ТекущееРасширение.БезопасныйРежим = Ложь;
		ТекущееРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ТекущееРасширение.Записать(ДвоичныеДанныеФайла);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Не удалось обновить расширение по причине:
			|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщить(ТекстОшибки);
		КонтурЛогистика_Метрика.ОбработатьОшибку("ОбновитьМодульДоПоследнейВерсии", ИнформацияОбОшибке);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоПолноправныйПользователь()
	
	Попытка
		ЭтоПолноправныйПользователь = Вычислить("Пользователи.ЭтоПолноправныйПользователь()");
	Исключение
		ЭтоПолноправныйПользователь = Ложь;
	КонецПопытки;
	
	Возврат ЭтоПолноправныйПользователь;
	
КонецФункции

Функция ОткрыватьТитулЧерезКолбасу(ГлавныйДокумент, ТипТитула, ТитулСсылка) Экспорт
	
	Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
		Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4 Тогда
			
		СостоянияДО = СостоянияДОВыполнитьОбмен();
		ТекСостояниеТитула = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ТитулСсылка.ДокументЭТРН);
	
		ТипНужногоПредыдущегоТитула = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредыдущийПоЦепочкеТипЛогистика(ТипТитула);
		НайденныйПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ТипНужногоПредыдущегоТитула, ГлавныйДокумент);
				
		Если ЗначениеЗаполнено(ТекСостояниеТитула) 
			И СостоянияДО.Найти(ТекСостояниеТитула) <> Неопределено
			И ЗначениеЗаполнено(НайденныйПредыдущийТитул) Тогда
		
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СостоянияДОВыполнитьОбмен()
	
	СостонияДО = Новый Массив;
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("new"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("wait-mintrans-api"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pd-carrier-signed"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-carrier-signed"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-carrier-signed"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pd-consingee-singed"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-consingee-singed"));
	СостонияДО.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-consignor-signed"));
	
	Возврат СостонияДО;
	
КонецФункции

// Функция используется в автотестах для установки ключа АПИ организации по ИНН
Процедура УстановитьКлючАпиОрганизацииПоИНН(ИНН, КлючАпи) Экспорт
		
	ОрганизацияДиадокСсылка = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("ИНН", ИНН);
	
	Если ЗначениеЗаполнено(ОрганизацияДиадокСсылка) Тогда
		Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(ОрганизацияДиадокСсылка, 
			Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey, 
			КлючАпи);
	Иначе		
		Сообщить("Организация не найдена");	
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторИнформационнойБазы() Экспорт
	
	ИдентификаторИнформационнойБазы = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПараметрыБлокировки_ИдентификаторБазы");
	
	Если ПустаяСтрока(ИдентификаторИнформационнойБазы) Тогда
		ИдентификаторИнформационнойБазы = Строка(Новый УникальныйИдентификатор());
		
		УстановитьПривилегированныйРежим(Истина);
		
		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ПараметрыБлокировки_ИдентификаторБазы", ИдентификаторИнформационнойБазы);
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ИдентификаторИнформационнойБазы;
	
КонецФункции

// Версия стандартной подсистемы выше указанной
//
// Параметры:
//  ВерсияСравнения	 - Строка	 - версия сравнения в формате "*.*.*.*"
// 
// Возвращаемое значение:
//  Булево - истина, если версия стандартной подсистемы выше, чем указанная ВерсияСравнения
//
Функция ВерсияСтандартнойПодсистемыВыше(ВерсияСравнения) Экспорт
	
	МодульОбновлениеИнформационнойБазыСлужебный = ОбщийМодуль("ОбновлениеИнформационнойБазыСлужебный");
	Если МодульОбновлениеИнформационнойБазыСлужебный = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ВерсияИБ = МодульОбновлениеИнформационнойБазыСлужебный.ВерсияИБ("СтандартныеПодсистемы");
	Исключение
		// Не удалось получить версию, возможно нет БСП или не корректно интегрирована
		Возврат Ложь;
	КонецПопытки;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	Если МодульОбщегоНазначенияКлиентСервер = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (МодульОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияИБ, ВерсияСравнения) > 0);
	
КонецФункции

Функция МетаданынеОбъектаПоИмени(ПолноеИмя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	
КонецФункции

Функция ТекущаяДатаСервера() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

Функция ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка = Неопределено) Экспорт
	
	Если КонтурЛогистика_КоннекторHTTPСлужебныйПовтИсп.ВерсияСовместимостиБольшеРавноЛок("8.3.10") Тогда
		Возврат	КонтурЛогистика_КоннекторHTTPСлужебный8310.ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка);
	Иначе
		Возврат	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный.ПолучитьСтрокуИзДвоичныхДанныхЛок(ВходящиеДвоичныеДанные, Кодировка);
	КонецЕсли;
	
КонецФункции

Функция РеквизитыФормы(Форма) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Реквизиты = Форма.ПолучитьРеквизиты();
	Для каждого Реквизит Из Реквизиты Цикл
		Результат.Добавить(Строка(Форма[Реквизит.Имя]), Реквизит.Имя);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСертификатПоДокументу(ДокументСсылка) Экспорт
	
	Сертификат = Неопределено;
	
	КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументСсылка);
	Если ЗначениеЗаполнено(КрайнийФайл) 
		И Не КрайнийФайл.ПодписьВерна 
		И КрайнийФайл.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.ОшибкаОтправки
		И ЗначениеЗаполнено(КрайнийФайл.Отпечаток) Тогда 
		Сертификат = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.НайтиПоРеквизиту("ОтпечатокСертификата", КрайнийФайл.Отпечаток);
	Иначе	
		ПодписантСтруктура 	= КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодписантСтруктура(ДокументСсылка);
		Сертификат = ПодписантСтруктура.Сертификат;
	КонецЕсли;
	
	Возврат Сертификат;
	
КонецФункции

#Область ИнформацияДляТехПоддержки

// Контракт описания обработчика оповещения
//
// Параметры:
//  Обработчик - Строка - имя обработчика;
//  Модуль - ФормаКлиентскогоПриложения - форма, в которой расположен модуль обработчика;
//  ДопПараметры - Структура - доп параметры для
// 
// Возвращаемое значение:
//  Структура - содержит входящие параметры
//
Функция ОписаниеОбработчикаОповещения(Обработчик, Модуль, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Модуль", Модуль);
	Результат.Вставить("Обработчик", Обработчик);
	Результат.Вставить("ДопПараметры", ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляПисьмаВТехПоддержку() Экспорт
	
	Результат = Новый Структура("СтрокаКоманды, ТекстПредупреждения, ТекстШаблонаПисьма, ТекстЗаголовкаШаблонаПисьма");
	
	ПочтовыйАдрес	 = КодироватьСтроку(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтактыТехническойПоддержкиПочта(), СпособКодированияСтроки.КодировкаURL);
	ТемаПисьма		 = КодироватьСтроку("Модуль для 1С ""Контур.Логистика""", СпособКодированияСтроки.КодировкаURL);
	ТекстПисьма		 = КодироватьСтроку(ТекстПисьмаДляТехПоддержки(), СпособКодированияСтроки.КодировкаURL);
	
	ТекстПисьма = СтрЗаменить(ТекстПисьма, Символы.ПС, "%0D%0A");
	
	Результат.СтрокаКоманды = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("mailto:%1?subject=%2&body=%3", ПочтовыйАдрес, ТемаПисьма, ТекстПисьма);
	
	Результат.ТекстЗаголовкаШаблонаПисьма = НСтр("ru = 'Шаблон письма в техническую поддержку'");
	
	Результат.ТекстШаблонаПисьма = ШаблонПисьмаВТехПоддержку();
	
	Результат.ТекстПредупреждения = НСтр(
	"ru = 'К сожалению, не удалось запустить почтовую программу
	|Пожалуйста, отправьте письмо привычным для Вас способом
	|Шаблон письма откроется после нажатия кнопки ""ОК""'");
	
	Возврат Результат;
	
КонецФункции

Функция ШаблонПисьмаВТехПоддержку()
	
	ПочтовыйАдрес = "help.logistika@kontur.ru";
	ТемаПисьма = "Модуль для 1С ""Контур.Логистика""";
	ТекстПисьма = ТекстПисьмаДляТехПоддержки();
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(НСтр(
		"ru = '
		|Email: %1
		|Тема: %2
		|Шаблон письма:
		|
		|%3'")
		, ПочтовыйАдрес, ТемаПисьма, ТекстПисьма);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстПисьмаДляТехПоддержки()
	
	ДопСведения = ДопСведенияДляОтправкиПисьмаВТехПоддержку();
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(НСтр(
	"ru = 'Добрый день!
	|
	|
	|
	|%1'"), ДопСведения);
	
	Возврат Результат;
	
КонецФункции

Функция ДопСведенияДляОтправкиПисьмаВТехПоддержку()
	
	Организации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Если ЗначениеЗаполнено(Организации) Тогда
		
		МассивСтрок = Новый Массив;
		
		Для Каждого Организация Из Организации Цикл
			
			Наименование = Организация.Наименование;
			ИНН			 = Организация.ИНН;
			
			Если ЗначениеЗаполнено(Организация.КПП) Тогда
				КПП = Организация.КПП;
			Иначе
				КПП = "-";
			КонецЕсли;
			
			МассивСтрок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("- %1 (%2/%3)", Наименование, ИНН, КПП));
			
		КонецЦикла;
		
		СтрокаОрганизаций = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(МассивСтрок, Символы.ПС);
		
	Иначе
		
		СтрокаОрганизаций = НСтр("ru = 'В модуле нет настроенных организаций'");
		
	КонецЕсли;
	
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
	НСтр("ru = 'Организации:
	|%1
	|
	|Версия модуля: %2
	|Версия платформы: %3
	|Версия режима совместимости: %4
	|Конфигурация: ""%5""'")
	, СтрокаОрганизаций
	, КонтурЛогистика_ОбновлениеВерсииМодуля.ТекущаяВерсияПодсистемыКонтурЛогистика()
	, ИнформацияОСистеме.ВерсияПриложения
	, Строка(Метаданные.РежимСовместимости)
	, КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.Контур_ОпределитьКонфигурацию());
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляЗвонкаВТехПоддержку() Экспорт
	
	Результат = Новый Структура("СтрокаКоманды, ТекстПредупреждения");
	
	НомерТелефона = "88005005978";
	НомерТелефонаБезДефисов = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефонаБезДефисовБезКодаСтраны = Прав(НомерТелефонаБезДефисов, 10);
	
	Результат.СтрокаКоманды = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("callto:+7%1", 
		НомерТелефонаБезДефисовБезКодаСтраны);
	Результат.ТекстПредупреждения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(НСтр(
	"ru = 'К сожалению, не удалось запустить программу голосовых вызовов
	|Пожалуйста, воспользуйтесь стационарным или мобильным телефоном: %1 (бесплатно)'"), НомерТелефона);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ГруппыДоступаТиповыеКонфигруации

Функция СоздатьГруппыДоступа() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ГруппаПрофиляГруппДоступа = Неопределено;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Создаем группы доступа
		ИмяГруппы = "Контур.Логистика";
		ГруппаПрофиляГруппДоступа = Справочники["ПрофилиГруппДоступа"].НайтиПоНаименованию(ИмяГруппы, Истина);
		Если Не ЗначениеЗаполнено(ГруппаПрофиляГруппДоступа) Тогда
			ГруппаПрофиляГруппДоступаОбъект = Справочники["ПрофилиГруппДоступа"].СоздатьГруппу();
			ГруппаПрофиляГруппДоступаОбъект.Наименование = ИмяГруппы;
			ГруппаПрофиляГруппДоступаОбъект.Записать();
			ГруппаПрофиляГруппДоступа = ГруппаПрофиляГруппДоступаОбъект.Ссылка;
		КонецЕсли;
		
		ГруппаГруппыДоступа = Справочники["ГруппыДоступа"].НайтиПоНаименованию(ИмяГруппы, Истина);
		Если Не ЗначениеЗаполнено(ГруппаГруппыДоступа) Тогда
			ГруппаГруппыДоступаОбъект = Справочники["ГруппыДоступа"].СоздатьГруппу();
			ГруппаГруппыДоступаОбъект.Наименование = ИмяГруппы;
			ГруппаГруппыДоступаОбъект.Записать();
			ГруппаГруппыДоступа = ГруппаГруппыДоступаОбъект.Ссылка;
		КонецЕсли;
		
		СоздатьПрофильАдминистратора(ГруппаПрофиляГруппДоступа, ГруппаГруппыДоступа);
		СоздатьПрофильПродвинутогоПользователя(ГруппаПрофиляГруппДоступа, ГруппаГруппыДоступа);
		СоздатьПрофильПользователя(ГруппаПрофиляГруппДоступа, ГруппаГруппыДоступа);
		
		ГруппаПрофиляГруппДоступа = ГруппаПрофиляГруппДоступа.Ссылка;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = "При создании групп доступов возникла ошибка:
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить(ТекстОшибки);
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ГруппаПрофиляГруппДоступа;
	
КонецФункции

Процедура СоздатьПрофильАдминистратора(ГруппаПрофиляГруппДоступа, ГруппаГруппыДоступа)
	
	ИмяГруппыДоступа = "Администраторы (Контур.Логистика)";
	ИмяПрофиля = "Администратор (Контур.Логистика)";
	
	// Профиль
	ТекущийПрофиль = Справочники["ПрофилиГруппДоступа"].НайтиПоНаименованию(ИмяПрофиля, Истина);
	Если Не ЗначениеЗаполнено(ТекущийПрофиль) Тогда
		
		НовыйПрофиль = Справочники["ПрофилиГруппДоступа"].СоздатьЭлемент();
		НовыйПрофиль.Родитель = ГруппаПрофиляГруппДоступа;
		НовыйПрофиль.Наименование = ИмяПрофиля;
		
		// Для старых конфигураций типа УТ 11.0 может не быть "Назначение"
		Попытка
			НовоеНазначение = НовыйПрофиль.Назначение.Добавить();
			НовоеНазначение.ТипПользователей = Вычислить("Справочники.Пользователи.ПустаяСсылка()");
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ПолныеПраваЛогистика");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ОтчетТехподдержка");
		
		НовыйПрофиль.Записать();
		
		ТекущийПрофиль = НовыйПрофиль.Ссылка;
		
	КонецЕсли;
	
	// Группа доступа
	ТекущаяГруппа = Справочники["ГруппыДоступа"].НайтиПоНаименованию(ИмяГруппыДоступа, Истина);
	Если Не ЗначениеЗаполнено(ТекущаяГруппа) Тогда
		ГруппаДоступа = Справочники["ГруппыДоступа"].СоздатьЭлемент();
		ГруппаДоступа.Родитель = ГруппаГруппыДоступа;
		ГруппаДоступа.Наименование = ИмяГруппыДоступа;
		ГруппаДоступа.Профиль = ТекущийПрофиль;
		ГруппаДоступа.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПрофильПродвинутогоПользователя(ГруппаПрофиляГруппДоступа, ГруппаГруппыДоступа)
	
	ИмяГруппыДоступа = "Продвинутые пользователи (Контур.Логистика)";
	ИмяПрофиля = "Продвинутый пользователь (Контур.Логистика)";
	
	// Профиль
	ТекущийПрофиль = Справочники["ПрофилиГруппДоступа"].НайтиПоНаименованию(ИмяПрофиля, Истина);
	Если Не ЗначениеЗаполнено(ТекущийПрофиль) Тогда
		
		НовыйПрофиль = Справочники["ПрофилиГруппДоступа"].СоздатьЭлемент();
		НовыйПрофиль.Родитель = ГруппаПрофиляГруппДоступа;
		НовыйПрофиль.Наименование = ИмяПрофиля;
		
		// Для старых конфигураций типа УТ 11.0 может не быть "Назначение"
		Попытка
			НовоеНазначение = НовыйПрофиль.Назначение.Добавить();
			НовоеНазначение.ТипПользователей = Вычислить("Справочники.Пользователи.ПустаяСсылка()");
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_БазовыеПраваЛогистика");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ИзменениеСтатусовДокументов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ИсправлениеТитулов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_НастройкаПодписания");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_НастройкаПодсистемы");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ОтказДокументов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_УдалениеДокументов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_УправлениеОрганизациями");
		
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхСопроводительныхВедомостей");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхТранспортныхНакладных");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхЭкспедиторскихДокументов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхДоговоровФрахтования");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхЗаказЗаявок");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхЗаказНарядов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхПутевыхЛистов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ОтчетТехподдержка");
		
		НовыйПрофиль.Записать();
		
		ТекущийПрофиль = НовыйПрофиль.Ссылка;
		
	КонецЕсли;
	
	// Группа доступа
	ТекущаяГруппа = Справочники["ГруппыДоступа"].НайтиПоНаименованию(ИмяГруппыДоступа, Истина);
	Если Не ЗначениеЗаполнено(ТекущаяГруппа) Тогда
		ГруппаДоступа = Справочники["ГруппыДоступа"].СоздатьЭлемент();
		ГруппаДоступа.Родитель = ГруппаГруппыДоступа;
		ГруппаДоступа.Наименование = ИмяГруппыДоступа;
		ГруппаДоступа.Профиль = ТекущийПрофиль;
		ГруппаДоступа.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПрофильПользователя(ГруппаПрофиляГруппДоступа, ГруппаГруппыДоступа)
	
	ИмяГруппыДоступа = "Пользователи (Контур.Логистика)";
	ИмяПрофиля = "Пользователь (Контур.Логистика)";
	
	// Профиль
	ТекущийПрофиль = Справочники["ПрофилиГруппДоступа"].НайтиПоНаименованию(ИмяПрофиля, Истина);
	Если Не ЗначениеЗаполнено(ТекущийПрофиль) Тогда
		
		НовыйПрофиль = Справочники["ПрофилиГруппДоступа"].СоздатьЭлемент();
		НовыйПрофиль.Родитель = ГруппаПрофиляГруппДоступа;
		НовыйПрофиль.Наименование = ИмяПрофиля;
		
		// Для старых конфигураций типа УТ 11.0 может не быть "Назначение"
		Попытка
			НовоеНазначение = НовыйПрофиль.Назначение.Добавить();
			НовоеНазначение.ТипПользователей = Вычислить("Справочники.Пользователи.ПустаяСсылка()");
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_БазовыеПраваЛогистика");
		
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхСопроводительныхВедомостей");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхТранспортныхНакладных");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхЭкспедиторскихДокументов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхДоговоровФрахтования");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхЗаказЗаявок");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхЗаказНарядов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ДобавлениеИзменениеЭлектронныхПутевыхЛистов");
		ДобавитьРольВПрофиль(НовыйПрофиль, "Роль.КонтурЛогистика_ОтчетТехподдержка");
		
		НовыйПрофиль.Записать();
		
		ТекущийПрофиль = НовыйПрофиль.Ссылка;
		
	КонецЕсли;
	
	// Группа доступа
	ТекущаяГруппа = Справочники["ГруппыДоступа"].НайтиПоНаименованию(ИмяГруппыДоступа, Истина);
	Если Не ЗначениеЗаполнено(ТекущаяГруппа) Тогда
		ГруппаДоступа = Справочники["ГруппыДоступа"].СоздатьЭлемент();
		ГруппаДоступа.Родитель = ГруппаГруппыДоступа;
		ГруппаДоступа.Наименование = ИмяГруппыДоступа;
		ГруппаДоступа.Профиль = ТекущийПрофиль;
		ГруппаДоступа.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Добавляет роль во все типовые профили Контур.Логистика, если их ещё нет.
// Используется при обновлении модуля для уже созданных профилей.
//
Процедура ДополнитьПрофилиКонтурЛогистикаРолью(ПолноеИмяРоли) Экспорт
	
	ИмяСправочникаПрофилиГруппДоступа = "Справочники.ПрофилиГруппДоступа";
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(
		ИмяСправочникаПрофилиГруппДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ИменаПрофилей = Новый Массив;
		ИменаПрофилей.Добавить("Администратор (Контур.Логистика)");
		ИменаПрофилей.Добавить("Продвинутый пользователь (Контур.Логистика)");
		ИменаПрофилей.Добавить("Пользователь (Контур.Логистика)");
		
		ИдентификаторОбъектаРоли = ИдентификаторОбъектаРоли(ПолноеИмяРоли);
		Если ИдентификаторОбъектаРоли = Неопределено Тогда
			
			Попытка
				Справочники["ИдентификаторыОбъектовМетаданных"].ОбновитьДанныеСправочника(Истина);
			Исключение
				НичегоНеДелаем = Истина;
			КонецПопытки;
			
			ИдентификаторОбъектаРоли = ИдентификаторОбъектаРоли(ПолноеИмяРоли);
			Если ИдентификаторОбъектаРоли = Неопределено Тогда
				ВызватьИсключение
					"Не удалось найти идентификатор объекта роли.
					|Требуется обновить вспомогательные данные. Для выполнения обновления можно:
					| - воспользоваться внешней обработкой ""Инструменты разработчика: Обновление вспомогательных данных""
					| - либо запустить программу с параметром командной строки 1С: Предприятия 8 ""/С ЗапуститьОбновлениеИнформационнойБазы""
					| - либо увеличить номер версии конфигурации, чтобы при очередном запуске выполнились процедуры обновления данных информационной базы.";
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого ИмяПрофиля Из ИменаПрофилей Цикл
			
			ТекущийПрофиль = Справочники["ПрофилиГруппДоступа"].НайтиПоНаименованию(ИмяПрофиля, Истина);
			Если Не ЗначениеЗаполнено(ТекущийПрофиль) Тогда
				Продолжить;
			КонецЕсли;
			
			ПрофильОбъект = ТекущийПрофиль.ПолучитьОбъект();
			Если ПрофильОбъект.Роли.Найти(ИдентификаторОбъектаРоли, "Роль") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьРольВПрофиль(ПрофильОбъект, ПолноеИмяРоли);
			ПрофильОбъект.Записать();
			
		КонецЦикла;
		
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДобавитьРольВПрофиль(Профиль, ПолноеИмяРоли)
	
	ИдентификаторОбъектаРоли = ИдентификаторОбъектаРоли(ПолноеИмяРоли);
	
	Если ИдентификаторОбъектаРоли = Неопределено Тогда
		
		Попытка
			// Попробуем обновить данные справочника и повторить запрос
			Справочники["ИдентификаторыОбъектовМетаданных"].ОбновитьДанныеСправочника(Истина);
		Исключение
			// Ничего не делаем
		КонецПопытки;
		
		ИдентификаторОбъектаРоли = ИдентификаторОбъектаРоли(ПолноеИмяРоли);
		Если ИдентификаторОбъектаРоли = Неопределено Тогда
			ВызватьИсключение
				"Не удалось найти идентификатор объекта роли.
				|Требуется обновить вспомогательные данные. Для выполнения обновления можно:
				| - воспользоваться внешней обработкой ""Инструменты разработчика: Обновление вспомогательных данных""
				| - либо запустить программу с параметром командной строки 1С: Предприятия 8 ""/С ЗапуститьОбновлениеИнформационнойБазы""
				| - либо увеличить номер версии конфигурации, чтобы при очередном запуске выполнились процедуры обновления данных информационной базы.";
		КонецЕсли;
	КонецЕсли;
	
	НоваяРоль = Профиль.Роли.Добавить();
	НоваяРоль.Роль = ИдентификаторОбъектаРоли;
	
КонецПроцедуры

Функция ИдентификаторОбъектаРоли(ПолноеИмя)
	
	ИмяСправочникаИдентификаторыОбъектовМетаданных = "Справочники.ИдентификаторыОбъектовМетаданных";
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаИдентификаторыОбъектовМетаданных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	НЕ ИдентификаторыОбъектовМетаданных.ПометкаУдаления
	|	И ИдентификаторыОбъектовМетаданных.ПолноеИмя = &ПолноеИмя";
	
	ИмяСправочникаИдентификаторыОбъектовРасширений = "Справочники.ИдентификаторыОбъектовРасширений";
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаИдентификаторыОбъектовРасширений) Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИдентификаторыОбъектовРасширений.Ссылка
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовРасширений КАК ИдентификаторыОбъектовРасширений
		|ГДЕ
		|	НЕ ИдентификаторыОбъектовРасширений.ПометкаУдаления
		|	И ИдентификаторыОбъектовРасширений.ПолноеИмя = &ПолноеИмя";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПараметрыУстановкиМодулейКонтура

Функция ЗначениеОбщейНастройкиДД(НастройкиДиадок, ИмяНастройки) Экспорт
	
	Если НастройкиДиадок.ИспользоватьТиповуюПодсистему1С = Истина Тогда
		
		ИмяСвойства = "DDPro_" + ИмяНастройки;
		
		// Получи свойство по имени настройки
		Если НастройкиДиадок.ЭтоУФ Тогда
			СвойствоНастройки = ПланыВидовХарактеристик["ДополнительныеРеквизитыИСведения"].НайтиПоНаименованию(ИмяСвойства, Истина);
		Иначе
			СвойствоНастройки = ПланыВидовХарактеристик["СвойстваОбъектов"].НайтиПоНаименованию(ИмяСвойства, Истина);
		КонецЕсли;
		
		Если СвойствоНастройки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получим значение по свойству
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", СвойствоНастройки);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство";
		
		Если НастройкиДиадок.ЭтоУФ Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектов", "ДополнительныеСведения");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Значение;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИмяСправочника", "ОбщиеНастройки");
		Запрос.УстановитьПараметр("ИмяРеквизита", ИмяНастройки);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	Справочник.Диадок_ДополнительныеСправочники.ДополнительныеРеквизиты КАК Диадок_ДополнительныеСправочникиДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ДополнительныеСправочники КАК Диадок_ДополнительныеСправочники
		|		ПО Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.Ссылка = Диадок_ДополнительныеСправочники.Ссылка
		|ГДЕ
		|	Диадок_ДополнительныеСправочники.ИмяСправочника = &ИмяСправочника
		|	И Диадок_ДополнительныеСправочникиДополнительныеРеквизиты.ИмяРеквизита = &ИмяРеквизита";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Значение;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеОбщейНастройкиEDI(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", ИмяНастройки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	|ГДЕ
	|	КонтурEDI_ДополнительныеРеквизиты.Свойство = &Свойство";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Автоконвертация

Функция НастройкиДополнительныхРеквизитовЗаполнены() Экспорт
	
	Если Метаданные.Справочники.Найти("КонтурЛогистика_НастройкиДополнительныхРеквизитов") = Неопределено Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	СправочникКонтурЛогистика_НастройкиДополнительныхРеквизитов = Вычислить("Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов");
	
	Выборка = СправочникКонтурЛогистика_НастройкиДополнительныхРеквизитов.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьНастройкиДополнительныхРеквизитов(ПерезаполнитьНастройкиКонвертации = Ложь, ТихийРежим = Ложь) Экспорт
	КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ЗаполнитьНастройкиДополнительныхРеквизитов(ПерезаполнитьНастройкиКонвертации, ТихийРежим);
	КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФ.ЗаполнитьНастройкиДополнительныхРеквизитов(ПерезаполнитьНастройкиКонвертации, ТихийРежим);
КонецПроцедуры

Процедура ДобавитьДополнительныйРеквизитВНКД(НастройкаКонвертацииОбъект, ИмяРеквизита, ИмяДополнительногоРеквизита) Экспорт
	
	Если НастройкаКонвертацииОбъект.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		Или НастройкаКонвертацииОбъект.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3
		Или НастройкаКонвертацииОбъект.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда 
		ЕстьТовары = Истина;
	Иначе
		ЕстьТовары = Ложь;
	КонецЕсли;
	
	Если НастройкаКонвертацииОбъект.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
				
		СформироватьРеквизитДляНКД(НастройкаКонвертацииОбъект.ПравилаКонвертацииГлавногоДокумента, 
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ИмяГлавногоДокументаКонтурЛогистика(НастройкаКонвертацииОбъект.ТипДокументаЛогистика), 
			ИмяРеквизита, ИмяДополнительногоРеквизита);
				
		СформироватьРеквизитДляНКД(НастройкаКонвертацииОбъект.ПравилаКонвертацииТитулаРеквизиты, 
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(НастройкаКонвертацииОбъект.ТипДокументаЛогистика), 
			ИмяРеквизита, ИмяДополнительногоРеквизита);	
						
	Иначе
		
		СформироватьРеквизитДляНКД(НастройкаКонвертацииОбъект.ПравилаКонвертацииТитулаРеквизиты, 
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(НастройкаКонвертацииОбъект.ТипДокументаЛогистика), 
			ИмяРеквизита, ИмяДополнительногоРеквизита);
		
	КонецЕсли;
		
	Если ЕстьТовары Тогда 
		СформироватьРеквизитДляНКД(НастройкаКонвертацииОбъект.ПравилаКонвертацииТитулаТабЧастьТовары, 
			"ТЧ" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(НастройкаКонвертацииОбъект.ТипДокументаЛогистика), 
			ИмяРеквизита, ИмяДополнительногоРеквизита);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДополнительныйРеквизитВНКС(НастройкаКонвертацииОбъект, ИмяРеквизита, ИмяДополнительногоРеквизита) Экспорт
	
	РеквизитОбъектМетаданных = Метаданные.Справочники[НастройкаКонвертацииОбъект.ТипСправочникаЛогистика].Реквизиты.Найти(ИмяРеквизита);
	
	Если РеквизитОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	НоваяСтрокаТч = НастройкаКонвертацииОбъект.ПравилаКонвертации.Добавить();
	НоваяСтрокаТч.РеквизитСправочникаЛогистика = РеквизитОбъектМетаданных.Имя;
	НоваяСтрокаТч.Картинка = 3;
	НоваяСтрокаТч.РеквизитСправочникаЛогистикаТипЗначения = РеквизитОбъектМетаданных.Тип;
	НоваяСтрокаТч.РеквизитСправочникаЛогистикаПредставление = РеквизитОбъектМетаданных.Синоним;
	НоваяСтрокаТч.РеквизитСправочникаЛогистикаКомментарий = РеквизитОбъектМетаданных.Комментарий;	
			
	НоваяСтрокаТч.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС;
	НоваяСтрокаТч.ВыражениеВычисления = ИмяДополнительногоРеквизита;	
				
	НоваяСтрокаТч.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.БезДопОбработки;
			
КонецПроцедуры

Процедура СформироватьРеквизитДляНКД(ТабличнаяЧастьНастройки, Знач ИмяДокЛогистика, ИмяРеквизита, ИмяДополнительногоРеквизита)
	
	Если Лев(ИмяДокЛогистика,2) = "ТЧ" Тогда
		ЭтоТЧ = Истина;
		ИмяДокЛогистика = Сред(ИмяДокЛогистика, 3);
		МетаданыеРеквизитов = Метаданные.Документы["КонтурЛогистика_" + ИмяДокЛогистика].ТабличныеЧасти.Товары.Реквизиты;
	Иначе
		ЭтоТЧ = Ложь;
		МетаданыеРеквизитов = Метаданные.Документы["КонтурЛогистика_" + ИмяДокЛогистика].Реквизиты;
	КонецЕсли;
	
	РеквизитОбъектМетаданных = МетаданыеРеквизитов.Найти(ИмяРеквизита);
	
	Если РеквизитОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	НоваяСтрокаТч = ТабличнаяЧастьНастройки.Добавить();
	НоваяСтрокаТч.РеквизитТитула = РеквизитОбъектМетаданных.Имя;
	НоваяСтрокаТч.Картинка = 3;
	НоваяСтрокаТч.РеквизитТитулаТипЗначения = РеквизитОбъектМетаданных.Тип;
	НоваяСтрокаТч.РеквизитТитулаКомментарий = РеквизитОбъектМетаданных.Комментарий;	
			
	НоваяСтрокаТч.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования;
	НоваяСтрокаТч.ВыражениеВычисления = ИмяДополнительногоРеквизита;	
				
	НоваяСтрокаТч.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.БезДопОбработки;
	
КонецПроцедуры

Процедура ВыполнитьНастройкуАвтоконвертации(СписокНастроекКонвертации, НастройкаДопРеквизита, ЭтоРеквизитТЧ, 
	ИмяДополнительногоРеквизита, СвойстваАвтоконвертации) Экспорт
	            		
	НастройкаКонвертации = Неопределено;
	ДоступныеПравилаКонвертации = Новый Массив;
	Если ТипЗнч(СвойстваАвтоконвертации.ТипОбъектаЛогистика) = Тип("Строка") Тогда
		
		Отбор = Новый Структура("РеквизитСправочникаЛогистика", СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика);
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника(
			СвойстваАвтоконвертации.ТипОбъектаЛогистика, СвойстваАвтоконвертации.ТипОбъекта1С, СвойстваАвтоконвертации.РеквизитТитула);
			
		ДоступныеПравилаКонвертации.Добавить("ПравилаКонвертации");
		
		СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС;
		
	Иначе
		
		Отбор = Новый Структура("РеквизитТитула", СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика);
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			СвойстваАвтоконвертации.ТипОбъектаЛогистика, СвойстваАвтоконвертации.ТипОбъекта1С);
			
		Если ЭтоРеквизитТЧ Тогда
			ДоступныеПравилаКонвертации.Добавить("ПравилаКонвертацииТитулаТабЧастьТовары");	
		Иначе
			ДоступныеПравилаКонвертации.Добавить("ПравилаКонвертацииГлавногоДокумента");
			ДоступныеПравилаКонвертации.Добавить("ПравилаКонвертацииТитулаРеквизиты");
		КонецЕсли;
		
		СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования;
		
	КонецЕсли;
				
	Если Не ЗначениеЗаполнено(КонтекстНастройкиКонвертации.НастройкаКонвертации)
		Или КонтекстНастройкиКонвертации.НастройкаКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Замещающая Тогда
		Возврат;	
	КонецЕсли;
	
	НастройкаКонвертацииОбъект = КонтекстНастройкиКонвертации.НастройкаКонвертации.ПолучитьОбъект();
		
	НастройкаИзменена = Ложь;
	РеквизитЕстьВНастройкеКонвертации = Ложь;
		
	Для каждого ИмяПравилаКонвертации Из ДоступныеПравилаКонвертации Цикл
		
		ПравилаКонвертацииТЧ = НастройкаКонвертацииОбъект[ИмяПравилаКонвертации].НайтиСтроки(Отбор);
	
		Если ПравилаКонвертацииТЧ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитЕстьВНастройкеКонвертации = Истина;
				
		Для каждого ПравилоКонвертацииСтрока Из ПравилаКонвертацииТЧ Цикл
			
			Если ЗначениеЗаполнено(НастройкаДопРеквизита) И НастройкаДопРеквизита.Отображать Тогда
				Если Не (ПравилоКонвертацииСтрока.СпособМаппинга = СпособМаппинга И ПравилоКонвертацииСтрока.ВыражениеВычисления = ИмяДополнительногоРеквизита) Тогда
					ПравилоКонвертацииСтрока.СпособМаппинга = СпособМаппинга;
					ПравилоКонвертацииСтрока.ВыражениеВычисления = ИмяДополнительногоРеквизита;
					НастройкаИзменена = Истина;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(НастройкаДопРеквизита) И Не НастройкаДопРеквизита.Отображать Тогда
				Если ПравилоКонвертацииСтрока.СпособМаппинга = СпособМаппинга И ПравилоКонвертацииСтрока.ВыражениеВычисления = ИмяДополнительногоРеквизита Тогда
					ПравилоКонвертацииСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
					ПравилоКонвертацииСтрока.ВыражениеВычисления = "";
					НастройкаИзменена = Истина;
				КонецЕсли;
			Иначе
				Если ПравилоКонвертацииСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять Тогда
					ПравилоКонвертацииСтрока.СпособМаппинга = СпособМаппинга;
					ПравилоКонвертацииСтрока.ВыражениеВычисления = ИмяДополнительногоРеквизита;
					НастройкаИзменена = Истина;
				КонецЕсли;
			КонецЕсли;		
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не РеквизитЕстьВНастройкеКонвертации И 
		(ЗначениеЗаполнено(НастройкаДопРеквизита) И НастройкаДопРеквизита.Отображать 
			Или Не ЗначениеЗаполнено(НастройкаДопРеквизита)) Тогда
			
		Если ТипЗнч(КонтекстНастройкиКонвертации.НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииДокументов") Тогда
			КонтурЛогистика_ОбщегоНазначенияСервер.ДобавитьДополнительныйРеквизитВНКД(НастройкаКонвертацииОбъект, СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика, ИмяДополнительногоРеквизита);
		Иначе
			КонтурЛогистика_ОбщегоНазначенияСервер.ДобавитьДополнительныйРеквизитВНКС(НастройкаКонвертацииОбъект, СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика, ИмяДополнительногоРеквизита)
		КонецЕсли;
		
		НастройкаИзменена = Истина;
		
	КонецЕсли;
	
	Если НастройкаИзменена Тогда
		
		НастройкаКонвертацииОбъект.Записать();
		
		Если СписокНастроекКонвертации.Найти(НастройкаКонвертацииОбъект.Ссылка) = Неопределено Тогда
			СписокНастроекКонвертации.Добавить(НастройкаКонвертацииОбъект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;						
			
КонецПроцедуры

Процедура ВывестиСообщенияЗаполненияНастроекДополнительнымиРеквизитами(СписокНастроекКонвертации) Экспорт
	
	Если СписокНастроекКонвертации.Количество() > 0 Тогда
		
		Для каждого НастройкаКонвертации Из СписокНастроекКонвертации Цикл
			Если ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников") Тогда
				ТипНастройки = "НКС";
			Иначе
				ТипНастройки = "НКД";
			КонецЕсли;
			Сообщить("Заполнение " + ТипНастройки + " " + """" + НастройкаКонвертации.Наименование + """" + " дополнительными реквизитами выполнено");
		КонецЦикла;
		
	Иначе

		Сообщить("Настройки конвертации в актуальном состоянии");	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныйРеквизитДокумента(ДокументОбъект, ДокументОснование, ИмяДопРеквизита, ИмяРеквизита, ЭтоРеквизиТЧ = Ложь) Экспорт
	
	Если Не ЭтоРеквизиТЧ И ДокументОбъект.Метаданные().Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Значение = ДокументОснование[ИмяДопРеквизита];
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;	
	КонецЕсли;
				
	КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ПроверитьВычислитьДополнительныйРеквизит(
		ИмяДопРеквизита, Значение);
		
	ДокументОбъект[ИмяРеквизита] = Значение;
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныйРеквизитСправочника(СправочникОснование, ИмяДопРеквизита, ИмяРеквизита, Результат) Экспорт

	Значение = СправочникОснование[ИмяДопРеквизита];
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;	
	КонецЕсли;
				
	КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ПроверитьВычислитьДополнительныйРеквизит(
		ИмяДопРеквизита, Значение);
				
	ДобавитьВВычисленныеРеквизиты(ИмяРеквизита, Значение, Результат);	
	
КонецПроцедуры

Процедура ЗаполнитьСконвертированныйДополнительныйРеквизитДокумента(ДокументОбъект, ДокументОснование, ИмяДопРеквизита, ИмяРеквизита, СпособКонвертации) Экспорт
	
	Если ДокументОбъект.Метаданные().Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Значение = ДокументОснование[ИмяДопРеквизита];
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;	
	КонецЕсли;
	
	ДокументОбъект[ИмяРеквизита] = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОснование[ИмяДопРеквизита], ИмяРеквизита,
				Перечисления.КонтурЛогистика_СпособыКонвертации[СпособКонвертации],
				ДокументОснование, ДокументОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьСконвертированныйДополнительныйРеквизитСправочника(СправочникОснование, Значение, ИмяРеквизита, СпособКонвертации, Результат) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;	
	КонецЕсли;
	
	РезультатКонвертации = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_КонвертироватьЗначениеВОбъектЛогистики(
		Значение, Перечисления.КонтурЛогистика_СпособыКонвертации[СпособКонвертации],
		ИмяРеквизита, СправочникОснование);
				
	Если РезультатКонвертации.Успешно Тогда
		ДобавитьВВычисленныеРеквизиты(ИмяРеквизита, РезультатКонвертации.Значение, Результат);	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьВВычисленныеРеквизиты(ИмяРеквизита, ВычисленноеЗначение, Результат) Экспорт
		
	НайденныйВычисленныйРеквизит = Результат.ВычисленныеРеквизиты.Найти(ИмяРеквизита, "Реквизит");
	Если НайденныйВычисленныйРеквизит = Неопределено Тогда
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			ИмяРеквизита, ВычисленноеЗначение);
		Иначе
		НайденныйВычисленныйРеквизит.Значение = ВычисленноеЗначение;
	КонецЕсли;	
	
КонецПроцедуры

#Область Аутентификация

Функция ДанныеАутентификацииПоОрганизации(Знач Организация = Неопределено, Знач boxID = Неопределено) Экспорт
	
	ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииПоОрганизации(Организация, boxID);
	
	// Аутентификация не выполнялась
	Если Не ЗначениеЗаполнено(ДанныеАутентификации.ТокенДоступа) Тогда
		Возврат ДанныеАутентификации;
	КонецЕсли;
	
	// Токен доступа не просрочен
	Если ДанныеАутентификации.ДатаОкончания > ТекущаяДатаСеанса() Тогда
		ДанныеАутентификации.Успех = Истина;
		Возврат ДанныеАутентификации;
	КонецЕсли;
	
	// Пробуем обновить токен
	Результат = ОбновитьСессиюОрганизации(ДанныеАутентификации.Организация);
	Если Результат Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииПоОрганизации(Организация, boxID);
		Если ДанныеАутентификации.ДатаОкончания > ТекущаяДатаСеанса() Тогда
			ДанныеАутентификации.Успех = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеАутентификации;
	
КонецФункции

Функция ДанныеАутентификацииЛюбойОрганизации() Экспорт
	
	ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииЛюбойОрганизации();
	
	// Аутентификация не выполнялась
	Если Не ЗначениеЗаполнено(ДанныеАутентификации.ТокенДоступа) Тогда
		Возврат ДанныеАутентификации;
	КонецЕсли;
	
	// Токен доступа не просрочен
	Если ДанныеАутентификации.ДатаОкончания > ТекущаяДатаСеанса() Тогда
		ДанныеАутентификации.Успех = Истина;
		Возврат ДанныеАутентификации;
	КонецЕсли;
	
	// Пробуем обновить токен
	Результат = ОбновитьСессиюОрганизации(ДанныеАутентификации.Организация);
	Если Результат Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииПоОрганизации(ДанныеАутентификации.Организация);
		Если ДанныеАутентификации.ДатаОкончания > ТекущаяДатаСеанса() Тогда
			ДанныеАутентификации.Успех = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеАутентификации;
	
КонецФункции

Функция ОбновитьСессиюОрганизации(Знач Организация)
	
	// Сформируем отбор сессии
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Организация);
	
	// ПортальныйИд без обновления токена
	ДанныеДоБлокировки = РегистрыСведений.КонтурЛогистика_Аутентификация.ДанныеАутентификацииПоОрганизации(Организация);
	ПортальныйИд = ДанныеДоБлокировки.ПортальныйИд;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		Если Не КонтурЛогистика_ОбщегоНазначенияСервер.АвтоматическийРежимБлокировкиДанный() Тогда
			
			ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ОбновлениеАвторизации;
			
			БлокировкаДанных = Новый БлокировкаДанных();
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КонтурЛогистика_ПроизвольныеДанные");
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировкиДанных.УстановитьЗначение("ОрганизацияДиадок", Организация);
			ЭлементБлокировкиДанных.УстановитьЗначение("ТипДанных", ТипДанных);
			
			Если ЗначениеЗаполнено(ПортальныйИд) Тогда
				// Общий ключ для всех организаций этого портального пользователя
				ЭлементБлокировкиДанных.УстановитьЗначение("ОрганизацияДиадок", Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
				ЭлементБлокировкиДанных.УстановитьЗначение("Разрез1", ПортальныйИд);
			Иначе
				// Нет ПортальныйИд — блокируем по организации
				ЭлементБлокировкиДанных.УстановитьЗначение("ОрганизацияДиадок", Организация);
			КонецЕсли;
			
			БлокировкаДанных.Заблокировать();
			
		КонецЕсли;
		
		// После входа в критическую секцию перечитываем данные:
		ОбновитьПовторноИспользуемыеЗначения();
		ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииПоОрганизации(Организация);
		
		Если Не ЗначениеЗаполнено(ДанныеАутентификации.ТокенДоступа) Тогда
			ЗафиксироватьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		// Другой поток уже мог обновить токен до нас
		Если ДанныеАутентификации.ДатаОкончания > ТекущаяДатаСеанса() Тогда
			ЗафиксироватьТранзакцию();
			Возврат Истина;
		КонецЕсли;
		
		// Инициализируем библиотеку аутентификации
		Аутентификатор = КлиентАутентификации(ОтборСессий);
		
		// Получаем текущую сессию
		ТекущаяСессия = Аутентификатор.ПолучитьСессию();
		
		ЗафиксироватьТранзакцию();
		
		Возврат ТекущаяСессия <> Неопределено;
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция КлиентАутентификации(Знач ОтборСессий = Неопределено)
	
	КонфигурацияПриложения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонфигурацияПриложения();
	КонфигурацияПровайдера = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонфигурацияПровайдера();
	НастройкиПрокси = НастройкиПрокси();
	Если ОтборСессий = Неопределено Тогда
		Отбор = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий();
	Иначе
		Отбор = ОтборСессий;
	КонецЕсли;
	
	Результат = Обработки.КонтурЛогистика_Аутентификатор.Создать();
	Результат.УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	Результат.УстановитьКонфигурациюПровайдера(КонфигурацияПровайдера);
	Результат.УстановитьНастройкиПрокси(НастройкиПрокси);
	Результат.УстановитьХранилищеСессий("КонтурЛогистика_Аутентификация");
	Результат.УстановитьОтборСессий(Отбор);
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиПрокси() Экспорт
	
	НастройкиПроксиЛок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.НастройкиПрокси();
	
	НастройкиПрокси = КонтурЛогистика_КоннекторHTTP.СоздатьНастройкиПрокси();
	
	Если НастройкиПроксиЛок.РежимПрокси = "NoProxy" Тогда
		
		НастройкиПрокси.ИспользоватьСистемныеНастройки = Ложь;
		
	ИначеЕсли НастройкиПроксиЛок.РежимПрокси = "UseDefaultProxy" Тогда
		
		НастройкиПрокси.ИспользоватьСистемныеНастройки = Истина;
		
	ИначеЕсли НастройкиПроксиЛок.РежимПрокси = "UseProxy" Тогда
		
		НастройкиПрокси.ИспользоватьСистемныеНастройки = Ложь;
		
		// Заполним настройки подключения
		НастройкиПрокси.ПротоколОбщий.Сервер = НастройкиПроксиЛок.АдресПроксиСервера;
		НастройкиПрокси.ПротоколОбщий.Порт = НастройкиПроксиЛок.ПортПроксиСервера;
		НастройкиПрокси.ПротоколОбщий.Пользователь = НастройкиПроксиЛок.ЛогинПроксиСервера;
		НастройкиПрокси.ПротоколОбщий.Пароль = НастройкиПроксиЛок.ПарольПроксиСервера;
		
	КонецЕсли;
	
	Возврат НастройкиПрокси;
	
КонецФункции

Процедура УдалитьСессиюАутентификацииПоОрганизации(Организация, Интерактивно = Ложь) Экспорт
	
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Организация);
	
	УведомлятьАдминистратора = Ложь;
	РегистрыСведений.КонтурЛогистика_Аутентификация.УдалитьСессию(ОтборСессий, УведомлятьАдминистратора,, Интерактивно);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОчиститьВсеАвторизации() Экспорт
	
	РегистрыСведений.КонтурЛогистика_Аутентификация.ОчиститьВсеАвторизации();
	
КонецПроцедуры

Функция ЕстьПортальныеАвторизации() Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_Аутентификация.ЕстьАвторизации();
	
КонецФункции

Процедура ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка, ТипДокумента, ТаблицаОшибок, Знач ОтправительФайла = Неопределено) Экспорт
	
	// Проверка только для OIDC
	РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
	Если РежимАвторизации <> Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		Возврат;
	КонецЕсли;
		
	// Определим отправителя файла. 
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипДокумента) Тогда
		
		// ЭТрН
		ДокументЭТРН = ДокументОбъектИлиСсылка.ДокументЭТРН;
		Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
			
			Если ЗначениеЗаполнено(ДокументОбъектИлиСсылка.Составитель) Тогда
				
				ОтправительФайла = ДокументОбъектИлиСсылка.Составитель;
				
			ИначеЕсли ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку
				И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда
				
				ОтправительФайла = ДокументЭТРН.ПогрузкуОсуществляет;
				
			Иначе
				
				ОтправительФайла = ДокументЭТРН.Грузоотправитель;
				
			КонецЕсли;
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
			Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4
			Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
			Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7
			Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8 Тогда
			
			ОтправительФайла = ДокументОбъектИлиСсылка.ДокументЭТРН.Перевозчик;
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3 Тогда
			
			Если ЗначениеЗаполнено(ДокументОбъектИлиСсылка.Грузополучатель) Тогда 
				ОтправительФайла = ДокументОбъектИлиСсылка.Грузополучатель;
			Иначе
				ОтправительФайла = ДокументОбъектИлиСсылка.ДокументЭТРН.Грузополучатель;
			КонецЕсли;
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6 Тогда
			
			ОтправительФайла = ДокументОбъектИлиСсылка.ДокументЭТРН.Грузоотправитель;
			
		КонецЕсли;
		
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипДокумента) Тогда
		
		// Путевой лист
		Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
			
			ОтправительФайла = ДокументОбъектИлиСсылка.ЛицоОформившееПЛ;
			
		Иначе
			
			Титул1 = ДокументОбъектИлиСсылка.Титул1;
			Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
				Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02 Тогда
				
				ОргМедикСторонняя = ЗначениеЗаполнено(Титул1.ОрганизацияМедик) И Титул1.ОрганизацияМедик <> Титул1.ЛицоОформившееПЛ;
				ОтправительФайла = ?(ОргМедикСторонняя, Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ);
				
			ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3 Тогда
				
				ОргТехСторонняя = ЗначениеЗаполнено(Титул1.ОрганизацияТехСостояние) И Титул1.ОрганизацияТехСостояние <> Титул1.ЛицоОформившееПЛ;
				ОтправительФайла = ?(ОргТехСторонняя, Титул1.ОрганизацияТехСостояние, Титул1.ЛицоОформившееПЛ);
				
			ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4 Тогда
				
				ОргОдометрСторонняя = ЗначениеЗаполнено(Титул1.ОрганизацияОдометр) И Титул1.ОрганизацияОдометр <> Титул1.ЛицоОформившееПЛ;
				ОтправительФайла = ?(ОргОдометрСторонняя, Титул1.ОрганизацияОдометр, Титул1.ЛицоОформившееПЛ);
				
			ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5 Тогда
				
				ОргОдометрСторонняя = ЗначениеЗаполнено(Титул1.ОрганизацияОдометр) И Титул1.ОрганизацияОдометр <> Титул1.ЛицоОформившееПЛ;
				ОтправительФайла = ?(ОргОдометрСторонняя, Титул1.ОрганизацияОдометр, Титул1.ЛицоОформившееПЛ);
				
			ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
				Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
				
				ОргМедикСторонняя = ЗначениеЗаполнено(Титул1.ОрганизацияМедик) И Титул1.ОрганизацияМедик <> Титул1.ЛицоОформившееПЛ;
				ОтправительФайла = ?(ОргМедикСторонняя, Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ);			
				
			ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
				Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02 Тогда
				
				ОтправительФайла = ДокументОбъектИлиСсылка.Титул1.ЛицоОформившееПЛ;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтправительФайла) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем авторизацию отправителя файла
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ОтправительФайла);
	Если ПараметрыСервиса.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow
		И Не ПараметрыСервиса.АвторизацияВыполнена Тогда
		
		КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
		ТекстОшибки = "Организация отправитель не авторизована";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок,,,, КатегорияОшибка, ТекстОшибки, "Авторизоваться");
	КонецЕсли;
	
КонецПроцедуры

// Валидация прав
//
// Параметры:
//  РолиОрганизации	 - Структура		 - Ключ: имя роли, Значение: включена или нет роль (булево)
//  ОписанияПрав	 - Структура		 - См. МанифестОписанияПравОрганизацииВСервисах()
//  ДокументСсылка	 - ДокументСсылка	 - Документ из которого ведется проверка прав
// 
// Возвращаемое значение:
//  Структура - результат валидации
//
Функция ВалидацияПравПользователяПоОрганизации(РолиОрганизации, ОписанияПравВСервисах, ДокументСсылка = Неопределено) Экспорт
	
	РазделыЛогистики = Новый Структура;
	РазделыЛогистики.Вставить("ПЛ", Новый Массив);
	РазделыЛогистики.Вставить("ТРН", Новый Массив);
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("Диадок", Новый Массив);
	Результат.Вставить("Логистика", РазделыЛогистики);
	
	Если ДокументСсылка = Неопределено Тогда
		ИспользуетсяЗЗ = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка");
		ИспользуетсяПЛ = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист");
		ИспользуетсяПЛ502 = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02");
		ИспользуетсяТРН = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН");
		ИспользуетсяПЭ = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПоручениеЭкспедитору");
		ИспользуетсяЭР = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка");
		ИспользуетсяСР = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяСкладскаяРасписка");
	Иначе
		// Отфильтруем по типу документов
		ИспользуетсяЗЗ = Ложь;
		ИспользуетсяПЛ = Ложь;
		ИспользуетсяПЛ502 = Ложь;
		ИспользуетсяТРН = Ложь;
		ИспользуетсяЭР = Ложь;
		ИспользуетсяПЭ = Ложь;
		ИспользуетсяСР = Ложь;
		
		Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(ДокументСсылка) Тогда
			ИспользуетсяЗЗ = Истина;
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(ДокументСсылка) Тогда
			ИспользуетсяПЛ = Истина;
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ_5_02(ДокументСсылка) Тогда
			ИспользуетсяПЛ502 = Истина;
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(ДокументСсылка) Тогда
			ИспользуетсяТРН = Истина;
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЭР(ДокументСсылка) Тогда
			ИспользуетсяЭР = Истина;
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулСР(ДокументСсылка) Тогда
			ИспользуетсяСР = Истина;
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЭ(ДокументСсылка) Тогда
			ИспользуетсяПЭ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Расчитаем перечень необходимых прав для работы
	ПереченьНеобходимыхРолей = Новый Структура;
	ПереченьНеобходимыхРолей.Вставить("Диадок", Новый Массив);
	ПереченьНеобходимыхРолей.Вставить("Логистика", Новый Массив);
	
	Если ИспользуетсяТРН И
		(РолиОрганизации.Грузоотправитель
			Или РолиОрганизации.Перевозчик
			Или РолиОрганизации.Грузополучатель) Тогда
		
		ПереченьНеобходимыхРолей.Диадок.Добавить("ManageCounteragents");
		
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-archive");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-create");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-edit");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-pass-to-driver");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-pass-to-other-organization");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-pass-to-sign");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-sign");
		ПереченьНеобходимыхРолей.Логистика.Добавить("trn-sign-primary-documents");
	КонецЕсли;
	
	Если ИспользуетсяЗЗ И
		(РолиОрганизации.Грузоотправитель
			Или РолиОрганизации.Перевозчик) Тогда
		
		ПереченьНеобходимыхРолей.Диадок.Добавить("SignDocuments");
		ПереченьНеобходимыхРолей.Диадок.Добавить("ManageCounteragents");
	КонецЕсли;
	
	Если (ИспользуетсяЭР Или ИспользуетсяПЭ Или ИспользуетсяСР)
		И РолиОрганизации.Экспедитор Тогда
		
		ПереченьНеобходимыхРолей.Диадок.Добавить("SignDocuments");
		ПереченьНеобходимыхРолей.Диадок.Добавить("ManageCounteragents");
	КонецЕсли;
	
	Если ИспользуетсяПЛ Или ИспользуетсяПЛ502 Тогда
		
		Если РолиОрганизации.Оформитель Тогда
			ПереченьНеобходимыхРолей.Логистика.Добавить("epl-create-edit-t1");
		КонецЕсли;
		
		Если РолиОрганизации.Медик Тогда
			ПереченьНеобходимыхРолей.Логистика.Добавить("epl-create-edit-t2");
			ПереченьНеобходимыхРолей.Логистика.Добавить("epl-create-edit-t6");
		КонецЕсли;
		
		Если РолиОрганизации.ТехОсмотр Или (ИспользуетсяПЛ502 И РолиОрганизации.Оформитель) Тогда
			ПереченьНеобходимыхРолей.Логистика.Добавить("epl-create-edit-t3");
			ПереченьНеобходимыхРолей.Логистика.Добавить("epl-create-edit-t4");
		КонецЕсли;
		
		Если РолиОрганизации.Одометр Или (ИспользуетсяПЛ502 И РолиОрганизации.Оформитель) Тогда
			ПереченьНеобходимыхРолей.Логистика.Добавить("epl-create-edit-t5");
		КонецЕсли;
		
	КонецЕсли;
	
	// Избавимся от повторов
	ПереченьНеобходимыхРолей.Диадок = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(
		ПереченьНеобходимыхРолей.Диадок);
	ПереченьНеобходимыхРолей.Логистика = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(
		ПереченьНеобходимыхРолей.Логистика);
	
	// Сравним требуемый перечень и имеющийся Диадок
	ПереченьПравилСервисов = ПереченьПравилСервисов();
	Для Каждого ИмяРоли Из ПереченьНеобходимыхРолей.Диадок Цикл
		
		ПравоСервиса = ОписанияПравВСервисах.ПереченьПрав.Найти(ИмяРоли);
		Если ПравоСервиса <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПравилоСервиса = ПереченьПравилСервисов.Получить(ИмяРоли);
		Если ПравилоСервиса = Неопределено Тогда
			Результат.Диадок.Добавить(ИмяРоли);
		Иначе
			Результат.Диадок.Добавить(ПравилоСервиса);
		КонецЕсли;
		
	КонецЦикла;
	
	// Подробное описание, что включить для ПЛ
	Если ИспользуетсяПЛ502 Тогда
		
		Если РолиОрганизации.Медик И Не РолиОрганизации.Оформитель И Не РолиОрганизации.Перевозчик Тогда
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Медицинский работник""";
		ИначеЕсли РолиОрганизации.Оформитель И Не РолиОрганизации.Медик Тогда
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Диспетчер, механик""";
		Иначе
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Служебный пользователь""";
		КонецЕсли;
		
	Иначе
		
		Если РолиОрганизации.Медик И Не РолиОрганизации.Оформитель И Не РолиОрганизации.ТехОсмотр
			И Не РолиОрганизации.Одометр И Не РолиОрганизации.Перевозчик Тогда
			
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Медицинский работник""";
		ИначеЕсли РолиОрганизации.Оформитель И Не РолиОрганизации.Медик
			И Не РолиОрганизации.ТехОсмотр И Не РолиОрганизации.Одометр Тогда
			
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Диспетчер""";
		ИначеЕсли (РолиОрганизации.Оформитель Или РолиОрганизации.ТехОсмотр Или РолиОрганизации.Одометр)
			И Не РолиОрганизации.Медик Тогда
			
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Диспетчер, механик""";
		Иначе
			ОписаниеПЛ = "Включите в разделе ""Путевые листы"" роль ""Служебный пользователь""";
		КонецЕсли;
		
	КонецЕсли;
	
	// Сравним требуемый перечень и имеющийся Логистика
	Для Каждого ИмяРоли Из ПереченьНеобходимыхРолей.Логистика Цикл
		
		ПравоСервиса = ОписанияПравВСервисах.ПереченьПрав.Найти(ИмяРоли);
		Если ПравоСервиса <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПравилоСервиса = ПереченьПравилСервисов.Получить(ИмяРоли);
		Если ПравилоСервиса = Неопределено Тогда
			Результат.Логистика.ТРН.Добавить(ИмяРоли);
		Иначе
			Если Лев(ИмяРоли, 4) = "epl-" Тогда
				Результат.Логистика.ПЛ.Добавить(ОписаниеПЛ);
			Иначе
				Результат.Логистика.ТРН.Добавить(ПравилоСервиса);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	Результат.Логистика.ПЛ = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(
		Результат.Логистика.ПЛ);
	
	// Отказ
	Если Результат.Диадок.Количество() <> 0
		Или Результат.Логистика.ПЛ.Количество() <> 0
		Или Результат.Логистика.ТРН.Количество() <> 0 Тогда
		
		Результат.Отказ = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Описания прав пользователя организации в сервисах
//
// Параметры:
//  СписокОрганизаций	 - Массив из СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - организации
//  Токен				 - Строка	 - токен
// 
// Возвращаемое значение:
//  Соответствие - доступы по каждой организации (см. МанифестОписанияПравОрганизацииВСервисах())
//
Функция ОписанияПравОрганизацииВСервисах(Организации, Токен = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Токен) Тогда
		ТокенЛок = Токен;
	Иначе
		ТокенЛок = Неопределено;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	
	Если Организации.Количество() = 0 Тогда 
		Возврат Результат;
	КонецЕсли;	
	
	// Права Диадока
	Для Каждого ТекущаяОрганизация Из Организации Цикл
		
		РезультатаПроверкиПравОрганизации = МанифестОписанияПравОрганизацииВСервисах();
		
		ПраваИзДиадока = КонтурЛогистика_API_Диадок.ПраваРаботыВСервисе(ТекущаяОрганизация, ТокенЛок);
		
		Результат.Вставить(ТекущаяОрганизация, ПраваИзДиадока);
		
	КонецЦикла;
	
	// Права Логистики
	ПраваИзЛогистики = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПраваРаботыВСервисе(Организации[0], ТокенЛок);
	Для Каждого ТекущаяОрганизация Из Организации Цикл
		
		ПереченьПрав = ПраваИзЛогистики.Получить(ТекущаяОрганизация.ID);
		
		Если ПереченьПрав = Неопределено Тогда
			
			Результат[ТекущаяОрганизация].ЗарегистрироватьВЛогистике = Истина;
			
		Иначе
			
			Для Каждого ТекущаяСтрока Из ПереченьПрав Цикл
				Результат[ТекущаяОрганизация].ПереченьПрав.Добавить(ТекущаяСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция МанифестОписанияПравОрганизацииВСервисах() Экспорт
	
	Манифест = Новый Структура;
	Манифест.Вставить("ЭтоАдминистратор", Ложь);
	Манифест.Вставить("ОплатаТарифа", Истина);
	Манифест.Вставить("ЗарегистрироватьВЛогистике", Ложь);
	Манифест.Вставить("ПереченьПрав", Новый Массив);
	Манифест.Вставить("ТекстОшибки");
	
	Возврат Манифест;
	
КонецФункции

Функция ПереченьПравилСервисов()
	
	Права = Новый Соответствие;
	
	// Диадок
	Права.Вставить("CreateDocuments", "Создавать и редактировать документы и черновики");
	Права.Вставить("DeleteRestoreDocuments", "Удалять документы и черновики, восстанавливать документы");
	Права.Вставить("SignDocuments", "Подписывать документы");
	Права.Вставить("AddResolutions", "Согласовывать документы");
	Права.Вставить("RequestResolutions", "Передавать на подпись и согласование");
	Права.Вставить("ManageCounteragents", "Видеть списки контрагентов и работать с ними");
	Права.Вставить("InsufficientAccessToDocuments", "Недостаточный доступ к документам");
	
	// Логистика
	Права.Вставить("epl-create-edit-t1", "Путевой лист. Создавать титул 1");
	Права.Вставить("epl-create-edit-t2", "Путевой лист. Создавать титул 2");
	Права.Вставить("epl-create-edit-t3", "Путевой лист. Создавать титул 3");
	Права.Вставить("epl-create-edit-t4", "Путевой лист. Создавать титул 4");
	Права.Вставить("epl-create-edit-t5", "Путевой лист. Создавать титул 5");
	Права.Вставить("epl-create-edit-t6", "Путевой лист. Создавать титул 6");
	Права.Вставить("epl-section-watch", "epl-section-watch");
	Права.Вставить("epl-sign", "epl-sign");
	Права.Вставить("epl-archive", "epl-archive");
	
	Права.Вставить("trn-archive", "Архивировать");
	Права.Вставить("trn-create", "Создавать титулы и исправления");
	Права.Вставить("trn-create-edit", "Создавать титулы и исправления");
	Права.Вставить("trn-edit", "Редактировать черновики");
	Права.Вставить("trn-employee-report-download", "Отчеты");
	Права.Вставить("trn-pass-to-driver", "Отправлять на согласование водителю");
	Права.Вставить("trn-pass-to-other-organization",
		"Создавать прототип и отправлять на подпись грузоотправителю (лицу осуществляющему погрузку)");
	Права.Вставить("trn-pass-to-sign", "Отправлять на подпись");
	Права.Вставить("trn-section-watch", "trn-section-watch");
	Права.Вставить("trn-sign", "Подписывать КЭПом");
	Права.Вставить("trn-sign-primary-documents", "Подписывать первичные документы (фиксировать Стоимость перевозки)");
	
	Возврат Права;
	
КонецФункции

Функция РолиОрганизации(Организация) Экспорт
	
	РеквизитыРолей = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли();
	РеквизитыРолейСтрока = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(РеквизитыРолей, ",");
	
	РолиОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
		Организация, РеквизитыРолейСтрока);
	
	Возврат РолиОрганизации;
	
КонецФункции

Процедура ЗапишемРолиВОрганизацию(ОрганизацияДиадок, ДанныеРолей) Экспорт
	
	НачатьТранзакцию_();
	Попытка

		Если Не АвтоматическийРежимБлокировкиДанный() Тогда
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировкиДанных = Блокировка.Добавить("Справочник.КонтурЛогистика_ОрганизацииДиадок");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ОрганизацияДиадок);
			Блокировка.Заблокировать();
		КонецЕсли;
			
		ОрганизацияДиадокОбъект = ОрганизацияДиадок.ПолучитьОбъект();
		
		Для Каждого ИмяРоли Из Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли() Цикл
			ЗначениеРоли = ДанныеРолей[ИмяРоли];
			ОрганизацияДиадокОбъект[ИмяРоли] = ЗначениеРоли;
		КонецЦикла;
		
		ОрганизацияДиадокОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение "Не удалось дождаться освобождения организации: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Функция ЕстьНастройкиКонвертацииДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
		|ГДЕ
		|	Не КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Область НастройкиПользователей

Функция УстановитьНастройкуПоказыватьТехническиеКомандыНаРабочемСтоле() Экспорт
	
	Если (КонтурЛогистика_Привилегированный.РольСуществует("КонтурЛогистика_НастройкаПодсистемы") 
			И РольДоступна("КонтурЛогистика_НастройкаПодсистемы"))
		 Или (КонтурЛогистика_Привилегированный.РольСуществует("КонтурЛогистика_ПолныеПраваЛогистика") 
		 	И РольДоступна("КонтурЛогистика_ПолныеПраваЛогистика"))
		 Или (КонтурЛогистика_Привилегированный.РольСуществует("КонтурЛогистика_УдалитьАдминистратор") 
		 	И РольДоступна("КонтурЛогистика_УдалитьАдминистратор"))
		 Или (КонтурЛогистика_Привилегированный.РольСуществует("КонтурЛогистика_УдалитьПродвинутыйПользователь") 
		 	И РольДоступна("КонтурЛогистика_УдалитьПродвинутыйПользователь"))
		Или (КонтурЛогистика_Привилегированный.РольСуществует("УчетнаяСистема_Администрирование") 
		 	И РольДоступна("УчетнаяСистема_Администрирование"))
		Или (КонтурЛогистика_Привилегированный.РольСуществует("АдминистраторСистемы") 
		 	И РольДоступна("АдминистраторСистемы")) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПереносСопоставленийОрганизацийМодулейКонтура

Функция ПереносСопоставленийОрганизацийСОбъектамиУС(ОрганизацииДиадок, ПараметрыУстановкиМодулейКонтура) Экспорт
	
	Результат = Ложь;
	
	Для Каждого ТекущаяОрганизация Из ОрганизацииДиадок Цикл
		
		АдресЯщикаДиадок = КонтурЛогистика_API_Диадок.ИдентификаторВАдресЯщика(ТекущаяОрганизация.Ссылка.ID);
		ОрганизацииСопоставленные = ПереносСопоставленийОрганизацииСОбъектамиУС(АдресЯщикаДиадок, ПараметрыУстановкиМодулейКонтура);
		
		Если ОрганизацииСопоставленные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Перенесем связи в карточку
		ОрганизацияОбъект = ТекущаяОрганизация.Ссылка.ПолучитьОбъект();
		Для Каждого ТекущаяСопоставленнаяОрганизация Из ОрганизацииСопоставленные Цикл
			
			// Проверим дубли
			ЕстьДубли = Ложь;
			Для Каждого ТекущаяСвязь Из ОрганизацияОбъект.СвязанныеОбъекты Цикл
				Если ТекущаяСвязь.СвязанныйОбъект = ТекущаяСопоставленнаяОрганизация Тогда
					ЕстьДубли = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьДубли Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = ОрганизацияОбъект.СвязанныеОбъекты.Добавить();
			НоваяСтрока.СвязанныйОбъект = ТекущаяСопоставленнаяОрганизация;
			
		КонецЦикла;
		
		// Почистим пустые строки
		НаУдаление = Новый Массив;
		Для Каждого ТекущаяСвязь Из ОрганизацияОбъект.СвязанныеОбъекты Цикл
			Если ЗначениеЗаполнено(ТекущаяСвязь.СвязанныйОбъект) Тогда
				Продолжить;
			КонецЕсли;
			
			НаУдаление.Добавить(ТекущаяСвязь);
		КонецЦикла;
		Для Каждого ТекущаяСтрокаНаУдаление Из НаУдаление Цикл
			ОрганизацияОбъект.СвязанныеОбъекты.Удалить(ТекущаяСтрокаНаУдаление);
		КонецЦикла;
		
		Попытка
			ОрганизацияОбъект.Записать();
			Результат = Истина;
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПереносСопоставленийОрганизацииСОбъектамиУС(АдресЯщикаДиадок, ПараметрыУстановкиМодулейКонтура)
	
	Результат = Новый Массив;
	
	Если ПараметрыУстановкиМодулейКонтура = Неопределено Тогда
		
		ПараметрыУстановкиМодулейКонтура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПараметрыУстановкиМодулей();
		
	КонецЕсли;
	
	Если ПараметрыУстановкиМодулейКонтура.Диадок.МодульУстановлен Тогда
		
		СопоставленныеОрганизации = СопоставленныеОрганизацииДиадок(ПараметрыУстановкиМодулейКонтура.Диадок, АдресЯщикаДиадок);
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, СопоставленныеОрганизации);
		
	КонецЕсли;
	
	Если Результат.Количество() = 0 И ПараметрыУстановкиМодулейКонтура.EDI.МодульУстановлен Тогда
		
		СопоставленныеОрганизации = СопоставленныеОрганизацииEDI(АдресЯщикаДиадок);
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, СопоставленныеОрганизации);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеОрганизацииДиадок(НастройкиДиадок, АдресЯщикаДиадок)
	
	Результат = Новый Массив;
	
	Если НастройкиДиадок.ИспользоватьТиповуюПодсистему1С = Истина Тогда
		
		// Получи свойство по имени настройки
		ИмяСвойства = "ЯщикДиадокДляОрганизации";
		Если НастройкиДиадок.ЭтоУФ Тогда
			СвойствоНастройки = ПланыВидовХарактеристик["ДополнительныеРеквизитыИСведения"].НайтиПоНаименованию(ИмяСвойства, Истина);
		Иначе
			СвойствоНастройки = ПланыВидовХарактеристик["СвойстваОбъектов"].НайтиПоНаименованию(ИмяСвойства, Истина);
		КонецЕсли;
		
		Если СвойствоНастройки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получим значение по свойству
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", СвойствоНастройки);
		Запрос.УстановитьПараметр("Значение", АдресЯщикаДиадок);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение";
		
		Если НастройкиДиадок.ЭтоУФ Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектов", "ДополнительныеСведения");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Объект) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Добавить(Выборка.Объект);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИмяСправочника", "Организации");
		Запрос.УстановитьПараметр("ID", АдресЯщикаДиадок);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник1,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник2 КАК СвязанныйСправочник2,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник3 КАК СвязанныйСправочник3
		|ИЗ
		|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
		|ГДЕ
		|	Диадок_ЮрФизЛица.ИмяСправочника = &ИмяСправочника
		|	И Диадок_ЮрФизЛица.ID = &ID";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник1) Тогда
				Результат.Добавить(Выборка.СвязанныйСправочник1);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник2) Тогда
				Результат.Добавить(Выборка.СвязанныйСправочник2);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник3) Тогда
				Результат.Добавить(Выборка.СвязанныйСправочник3);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СопоставленныеОрганизацииEDI(АдресЯщикаДиадок)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", "DiadocBoxId");
	Запрос.УстановитьПараметр("Значение", АдресЯщикаДиадок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурEDI_ДополнительныеРеквизиты.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	|ГДЕ
	|	КонтурEDI_ДополнительныеРеквизиты.Свойство = &Свойство
	|	И КонтурEDI_ДополнительныеРеквизиты.Значение = &Значение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Объект) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Выборка.Объект);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнформацияДляТехПоддержки

Функция ИнформацияДляПоддержки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИнформацияОМодуле", ИнформацияОМодуле());
	Результат.Вставить("ИнформацияОКонфигурации", ИнформацияОКонфигурации());
	Результат.Вставить("ИнформацияОНастройкахМодуля", ИнформацияОНастройкахМодуля());
	Результат.Вставить("ИнформацияОРасширениях", ИнформацияОРасширениях());
	Результат.Вставить("ИнформацияОСервере", ИнформацияОСервере());
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияОМодуле()
	
	ИнформацияОМодуле = Новый Структура;
	ИнформацияОМодуле.Вставить("ВерсияМодуля",       ВерсияОбработки());
	ИнформацияОМодуле.Вставить("ВерсияПлагина",      ВерсияПлагина());
	ИнформацияОМодуле.Вставить("РасположениеМодуля", ?(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение(), "Расширение", "В составе конфигурации"));
	ИнформацияОМодуле.Вставить("ИмяМодуля",          "КонтурЛогистика");
	
	Возврат ИнформацияОМодуле;
	
КонецФункции

Функция ВерсияОбработки() Экспорт
	
	Возврат КонтурЛогистика_ОбновлениеВерсииМодуля.ТекущаяВерсияПодсистемыКонтурЛогистика();
	
КонецФункции

Функция ВерсияПлагина() Экспорт
	
	ОбработкаПлагин = Обработки.КонтурЛогистика_КонтурПлагин.Создать();
	Возврат ОбработкаПлагин.ВерсияОбработки();
	
КонецФункции

Функция ИнформацияОКонфигурации()
	
	ВерсияРежимаСовместимости = Строка(Метаданные.РежимСовместимости);
	Если ВерсияРежимаСовместимости = ВерсияОбработки() Тогда
		ВерсияРежимаСовместимости = "";
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Конфигурация",              СинонимКонфигурации()); 
	Результат.Вставить("ВерсияКонфигурации",        Метаданные.Версия); 
	Результат.Вставить("ОсновнойРежимЗапуска",      Метаданные.ОсновнойРежимЗапуска);
	Результат.Вставить("ВерсияРежимаСовместимости", ВерсияРежимаСовместимости); 
	Результат.Вставить("СтрокаСоединения",          СтрокаСоединенияИнформационнойБазы());
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияОНастройкахМодуля()
	
	Результат = Новый Структура;
	
	ОкружениеТекст = "Продуктивный сервер";
	Если Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок") = Истина Тогда 
		ОкружениеТекст = "Тестовый сервер (стэйджинг)";
	КонецЕсли;
	Результат.Вставить("Окружение", ОкружениеТекст);
	Результат.Вставить("ПодключаемыйМодуль", Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПодключаемыйМодульТип"));
	Результат.Вставить("ИдентификаторБазы", Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("СлужебныйИдентификаторБазыДанных"));
	Результат.Вставить("ОбщепродуктовыйИдентификаторБазы", КонтурЛогистика_Метрика.ИдентификаторИБ());
	Результат.Вставить("РазрешитьПодписьНаСервере", Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("РазрешитьПодписьНаСервере"));
	Результат.Вставить("Прокси_Использовать", Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПроксиИспользовать"));
	Результат.Вставить("ЛогинАвторизацииДиадокАПИ", Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ЛогинАвторизацииДиадокАПИ"));
	
	РасположениеСертификатов = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере КАК СертификатНаСервере
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(&Дата, ) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтроковоеРасположение = ?(ВыборкаДетальныеЗаписи.СертификатНаСервере, "на сервере", "на клиенте");
		РасположениеСертификатов = ?(ЗначениеЗаполнено(РасположениеСертификатов), 
			РасположениеСертификатов + " и " + СтроковоеРасположение, СтроковоеРасположение);
	КонецЦикла;
	
	Результат.Вставить("РасположениеСертификатов", РасположениеСертификатов);
	
	Возврат Результат;
	
КонецФункции

Функция СинонимКонфигурации()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.Контур_ОпределитьКонфигурацию();
	
КонецФункции

Функция ИнформацияОРасширениях()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НайденныеРасширения = РасширенияКонфигурации.Получить();
	Исключение
		НайденныеРасширения = Новый Массив;
	КонецПопытки;
	
	Если НайденныеРасширения.Количество() > 0 Тогда
		
		СписокРасширений = Новый Массив;
		
		Для Каждого Расширение Из НайденныеРасширения Цикл
			Если Найти(Расширение.Имя, "КонтурЛогистика") > 0 Тогда
				СписокРасширений.Добавить(Расширение.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокРасширений.Количество() = 0 Тогда
			СписокРасширений = "Нет";
		Иначе
			СписокРасширений = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(СписокРасширений, ", ");
		КонецЕсли;
		
	Иначе
		
		СписокРасширений = "Нет";
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("СписокРасширений", СписокРасширений);
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияОСервере()
	
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	
	ИнформацияОСНаСервере = Новый Структура;
	ИнформацияОСНаСервере.Вставить("ВерсияОС", ИнформацияОСистеме.ВерсияОС);
		
	Возврат ИнформацияОСНаСервере;
	
КонецФункции

Процедура ДобавитьПодменюПомощьВТитул(Форма)
	
	Если Не КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъектаЛок(Форма, "Объект") 
		Или Не (КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Объект.Ссылка)
				Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Объект.Ссылка)
				Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Объект.Ссылка)
				Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЭ(Форма.Объект.Ссылка)
				Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЭР(Форма.Объект.Ссылка)
				Или КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулСР(Форма.Объект.Ссылка)) Тогда
		Возврат
	КонецЕсли;
	
	ПодменюПомощь = Форма.Элементы.Найти("ГруппаПомощь");
	Если ПодменюПомощь = Неопределено Тогда
		ПодменюПомощь = Форма.Элементы.Добавить("КонтурЛогистикаПодключаемыйГруппаПомощь", Тип("ГруппаФормы"), Форма.КоманднаяПанель);
		ПодменюПомощь.Заголовок = "Помощь";
		ПодменюПомощь.Картинка = БиблиотекаКартинок.КонтурЛогистика_Email;
		ПодменюПомощь.Вид = ВидГруппыФормы.Подменю;		
	КонецЕсли;
		
	КонтурЛогистика_ОнбордингСервер.СоздатьКнопкуСправка(Форма, ПодменюПомощь);
	СоздатьКнопкуИнформацияПоТитулуДляТехПоддержки(Форма, ПодменюПомощь);
	СоздатьКнопкуНаписатьВПоддержку(Форма, ПодменюПомощь);
	
КонецПроцедуры

Функция СоздатьКнопкуИнформацияПоТитулуДляТехПоддержки(Форма, Родитель)
	
	ИмяКнопоки = "КонтурЛогистикаДинамическаяКнопкаИнформацияПоТитулуВТехподдержку";
	
	ЭлементКнопки = Форма.Элементы.Найти(ИмяКнопоки);
	
	Если ЭлементКнопки <> Неопределено Тогда
		Возврат ЭлементКнопки;
	КонецЕсли;
	
	ЗаголовокКнопки = "Информация для техподдержки";
	
	ИмяДействия = "КонтурЛогистикаПодключаемый_ВыполнитьКоманду";
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(Форма, ИмяКнопоки,, ИмяДействия);  
	
	Возврат КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(Форма, ИмяКнопоки, Родитель, ЗаголовокКнопки, ИмяКнопоки);
	
КонецФункции

Функция СоздатьКнопкуНаписатьВПоддержку(Форма, Родитель)
	
	ИмяКнопоки = "КонтурЛогистикаДинамическаяКнопкаНаписатьВПоддержку";
	
	ЭлементКнопки = Форма.Элементы.Найти(ИмяКнопоки);
	
	Если ЭлементКнопки <> Неопределено Тогда
		Возврат ЭлементКнопки;
	КонецЕсли;
	
	ЗаголовокКнопки = "Написать: help.logistika@kontur.ru";
	
	ИмяДействия = "КонтурЛогистикаПодключаемый_ВыполнитьКоманду";
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_Email);

	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(Форма, ИмяКнопоки,, ИмяДействия, СтруктураСвойств);  
	
	Возврат КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(Форма, ИмяКнопоки, Родитель, ЗаголовокКнопки, ИмяКнопоки);
	
КонецФункции

#КонецОбласти


#Область ТребованияПартнеров

// Загружает JSON требований торговых сетей с сервиса обновлений и сохраняет в РС ПроизвольныеДанные.
//
// Параметры:
//  ТихийРежим - Булево - если Истина, не выводить сообщения хода выполнения
//
// Возвращаемое значение:
//  Структура:
//   * Успешно - Булево
//   * Количество - Число - число сетей в networks_settings
//   * ТекстОшибки - Строка
//
Функция ОбновитьТребованияПартнеров(ТихийРежим = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Количество", 0);
	Результат.Вставить("ТекстОшибки", "");
	
	СообщитьХодОбновленияТребованийПартнеров(
		"Начало обновления требований партнеров с сервиса обновлений.",
		ТихийРежим);
	
	Ответ = СерверОбновлений_ТребованияПартнеров();
	
	Если Не Ответ.Успешно Тогда
		
		Результат.ТекстОшибки = "Не удалось скачать требования партнеров: "
			+ Ответ.Ошибка
			+ ". Существующий кэш не изменен.";
		СообщитьХодОбновленияТребованийПартнеров(Результат.ТекстОшибки, ТихийРежим);
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		ДанныеТребований = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета, Ложь);
		
	Исключение
		
		Результат.ТекстОшибки = "Ошибка разбора JSON требований партнеров: "
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			+ ". Существующий кэш не изменен.";
		СообщитьХодОбновленияТребованийПартнеров(Результат.ТекстОшибки, ТихийРежим);
		Возврат Результат;
		
	КонецПопытки;
	
	Если ТипЗнч(ДанныеТребований) <> Тип("Структура")
		Или Не ДанныеТребований.Свойство("networks_settings")
		Или ТипЗнч(ДанныеТребований.networks_settings) <> Тип("Массив") Тогда
		
		Результат.ТекстОшибки =
			"Некорректный формат JSON требований партнеров (ожидается networks_settings). Существующий кэш не изменен.";
		СообщитьХодОбновленияТребованийПартнеров(Результат.ТекстОшибки, ТихийРежим);
		Возврат Результат;
		
	КонецЕсли;
	
	КоличествоСетей = ДанныеТребований.networks_settings.Количество();
	ЗаписатьТребованияПартнеровВРегистр(ДанныеТребований, КоличествоСетей, "", Истина);
	
	Результат.Успешно = Истина;
	Результат.Количество = КоличествоСетей;
	
	СообщитьХодОбновленияТребованийПартнеров(
		"Обновление требований партнеров завершено. Сетей: " + Строка(Результат.Количество) + ".",
		ТихийРежим);
	
	Возврат Результат;
	
КонецФункции

// Дата актуальности кэша требований партнеров из РС ПроизвольныеДанные.
//
// Возвращаемое значение:
//  Дата - дата записи или пустая дата, если записи нет
//
Функция ДатаАктуальностиТребованийПартнеров() Экспорт
	
	ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ТребованияПартнеров;
	ПустаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	ПустойРазрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ПустаяОрганизация);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("Разрез1", "");
	Запрос.УстановитьПараметр("Разрез2", ПустойРазрез2);
	Запрос.УстановитьПараметр("Разрез3", "");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = &Разрез1
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = &Разрез3";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

// Признак необходимости обновления кэша требований партнеров:
// тот же гейт, что у кэша ИНН+КПП партнеров EDI.
//
// Возвращаемое значение:
//  Булево
//
Функция ТребуетсяАктуализацияТребованийПартнеров() Экспорт
	
	Возврат КонтурЛогистика_ИнтеграцияEDI_Сервер.ТребуетсяАктуализацияКэшаПартнеровEDI();
	
КонецФункции

Функция СерверОбновлений_ТребованияПартнеров()
	
	//https://update.kontur.ru/1c/v1/logist-retail-requirements/json
	
	АдресМетода = "/1c/v1/logist-retail-requirements/json";
	
	Возврат КонтурЛогистика_ОбновлениеСервер.ВыполнитьHTTPЗапросКСерверуОбновлений(АдресМетода);
	
КонецФункции

Процедура ЗаписатьТребованияПартнеровВРегистр(ДанныеТребований, КоличествоСетей, ТекстОшибки, УспешноПолученСписок)
	
	ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ТребованияПартнеров;
	ПустаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	ПустойРазрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.ПустаяСсылка();
	
	НаборЗаписей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияДиадок.Установить(ПустаяОрганизация);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.Разрез1.Установить("");
	НаборЗаписей.Отбор.Разрез2.Установить(ПустойРазрез2);
	НаборЗаписей.Отбор.Разрез3.Установить("");
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ОрганизацияДиадок = ПустаяОрганизация;
	НоваяЗапись.ТипДанных = ТипДанных;
	НоваяЗапись.Разрез1 = "";
	НоваяЗапись.Разрез2 = ПустойРазрез2;
	НоваяЗапись.Разрез3 = "";
	НоваяЗапись.Дата = ТекущийМоментВремениМСК();
	НоваяЗапись.Количество = КоличествоСетей;
	НоваяЗапись.ТекстОшибки = ТекстОшибки;
	НоваяЗапись.ДанныеХранилище = Новый ХранилищеЗначения(ДанныеТребований, Новый СжатиеДанных(6));
	
	Если УспешноПолученСписок Тогда
		НоваяЗапись.СинхронизацияССервисом = Перечисления.КонтурЛогистика_СтатусыСинхронизации.УспешноЗавершена;
	Иначе
		НоваяЗапись.СинхронизацияССервисом = Перечисления.КонтурЛогистика_СтатусыСинхронизации.Ошибка;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура СообщитьХодОбновленияТребованийПартнеров(Текст, ТихийРежим)
	
	Если ТихийРежим Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(Текст);
	
КонецПроцедуры

#КонецОбласти
// Функция возвращает значение, есть ли в расширение расширяемый определяемый тип GLN
// При сборке с помощью logistSubsystem\tools\ExtBuild\GLN\GLN.py для расширений _DEF_GLN возвращаемый результат заменяется на Истина
Функция ЭтоРасширениеGLN() Экспорт	
	Возврат Ложь;			
КонецФункции