
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроверкаОтвета", РежимПроверкиОтвета);
	
	Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Ложь;
	ИзменитьРасположениеПанелиОшибок();
	
	ОбновитьДанныеФормы();
	
	Элементы.ДокументОснование.Доступность = ТипыДокументаОснованияНастроеныДляТитула();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	Если Объект.УсловияПриемаГрХран.Количество() < 2 Тогда
		ПереключательУсловияПриема = 0;
	Иначе
		ПереключательУсловияПриема = 1;
	КонецЕсли;
	
	// Привет, обратная совместимость с 8.2
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ГруппаКоличественныеХарактеристикиПартииТоваров.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ВалютаУчетаГруза.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;	// Иначе улетает в космос
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьИтоги();
	
	ПроверитьДокумент();
	
	УправлениеВидимостьюИДоступностью();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И (Параметр = Объект.Ссылка
			Или (Параметр <> Неопределено
				И ТипЗнч(Параметр) = Тип("Массив")
				И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ВвестиДокумент");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерДокПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспедиторПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспедицияДоговорПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРасшифровкиПриИзменении(Элемент)
	
	Если Не ПереключательУсловияПриема Тогда
		Если Объект.УсловияПриемаГрХран.Количество() = 0 Тогда
			НоваяСтрока = Объект.УсловияПриемаГрХран.Добавить();
			Элементы.УсловияПриемаГрХран.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ИначеЕсли Объект.УсловияПриемаГрХран.Количество() = 1 Тогда
			Если Элементы.УсловияПриемаГрХран.ТекущаяСтрока = Неопределено Тогда
				Элементы.УсловияПриемаГрХран.ТекущаяСтрока = Объект.УсловияПриемаГрХран[0].ПолучитьИдентификатор();
			КонецЕсли;
		ИначеЕсли Объект.УсловияПриемаГрХран.Количество() > 1 Тогда
			ОчиститьСообщения();
			ТекстСообщения = "Переключение в режим без разбиения невозможно, если в условиях хранения введено более одной строки!";
			Сообщить(ТекстСообщения);
			ПереключательУсловияПриема = 1;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Титул1ПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ПЭ_Титул1) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоПоручениюЗавершение", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Вы уверены, что хотите перезаполнить документ?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПоручениюЗавершение(Ответ, ДополнительынеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполниьТитулПоПЭТитул1();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Титул1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Состояние", СостояниеПЭЗавершено());
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Документ.КонтурЛогистика_ПЭ_Титул1.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"ПЭ_Титул1НачалоВыбораЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПЭ_Титул1НачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПЭ_Титул1 = Результат;
		ЗаполниьТитулПоПЭТитул1();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЗамечанияПриИзменении(Элемент)
	
	Если ЕстьЗамечания Тогда
		СостояниеГруза = "";
	Иначе
		СостояниеГруза = ТекстЗамечанияПоГрузунет();
	КонецЕсли;
	
	Элементы.СостояниеГруза.Видимость = ЕстьЗамечания;
	
	Если Объект.УсловияПриемаГрХран.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	Объект.УсловияПриемаГрХран[0].СостояниеГруза = СостояниеГруза;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеМаркировкиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиГрузаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияПриемаГрХранПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыТовары

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьИтоги();
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	
	КоличествоСтрок = 0;
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.Товары Цикл
		
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСтрок = КоличествоСтрок + 1;
		
	КонецЦикла;
	
	Форма.Элементы.СтраницаТовары.Заголовок = "Партия груза (" + КоличествоСтрок + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ТоварыТребуемоеДействие" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		ТекСтрТребуемоеДействие = ТекДанные.ТребуемоеДействие;
		ПараметрыТекСтрока = ВыбраннаяСтрока;
		Если ТекСтрТребуемоеДействие = "Указать Номенклатуру" Тогда
			
			ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(
				"Справочник." + ТипСправочникаНоменклатура + ".ФормаВыбора",,
				ЭтаФорма, ЭтаФорма, "ОбработчикВыбораНоменклатуры", ПараметрыТекСтрока);
			
		ИначеЕсли ТекСтрТребуемоеДействие = "Указать Единицу измерения" Тогда
			Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
			Элементы.Товары.ИзменитьСтроку();
		ИначеЕсли ТекСтрТребуемоеДействие = "Указать Количество" Тогда
			Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
			Элементы.Товары.ИзменитьСтроку();
		ИначеЕсли ТекСтрТребуемоеДействие = "Установить соответствие" Или ТекСтрТребуемоеДействие = "Не учитывается" Тогда
			ОткрытьСоответствияТекущейСтроки();
		Иначе // требуемое действие от таблицы ошибок
			ОбработатьТребуемоеДействие(ТекСтрТребуемоеДействие, Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	Если ПолеТаблицыОшибок <> Неопределено Тогда
		КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе
		
		КонтурЛогистика_КонвертацияКлиент.ОткрытьСоответствияНоменклатуры(ТекущиеДанные.Номенклатура,
			ТекущиеДанные.УпаковкаЕдиницаИзмерения, ТекущиеДанные.Характеристика, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(
		"ИдентификаторСтрокиТоваров", ТекущиеДанные.ИдентификаторСтроки);
	
	Элементы.СведенияГосСистем.ОтборСтрок = ОтборСтрок;
	Элементы.ИнфУпГруз.ОтборСтрок = ОтборСтрок;
	Элементы.Марк.ОтборСтрок = ОтборСтрок;
	Элементы.ИнфПолТовара.ОтборСтрок = ОтборСтрок;
	
	СведенияПоТовару_СтранаПроисхождения = КонтурЛогистика_ОбщегоНазначенияКлиент.РассчитатьПредставлениеСтран(
		Объект.СтраныПроисхожденияПродукции, ТекущиеДанные.ИдентификаторСтроки);
	
	Элементы.ГруппаСведенияПоТовару.Видимость = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары);
	Элементы.ГруппаПодробныеСведенияГосСист.Видимость = ТекущиеДанные.ПодлежитУчетуВГосСист;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Учитывать = Истина;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроверитьДокумент();
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИдентификаторСтрокиТоваров = ТекущиеДанные.ИдентификаторСтроки;
		УдалитьВсеСвязиТовара(ИдентификаторСтрокиТоваров);
	КонецЕсли;
	
	ПроверитьДокумент();
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСвязиТовара(ИдентификаторСтрокиТоваров)
	
	ИмяКлюча = "ИдентификаторСтрокиТоваров";
	
	УдалитьСвязиИзТаблицы("СведенияГосСистем", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("ИнфУпГруз", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("Марк", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("ИнфПол", ИмяКлюча, ИдентификаторСтрокиТоваров);
	УдалитьСвязиИзТаблицы("СтраныПроисхожденияПродукции", ИмяКлюча, ИдентификаторСтрокиТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвязиИзТаблицы(ИмяТаблицы, ИмяКлюча, ЗначениеКлюча)
	
	СтрокиНаУдаление = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицы] Цикл
		
		Если ТекущаяСтрока[ИмяКлюча] <> ЗначениеКлюча Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиНаУдаление.Добавить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из СтрокиНаУдаление Цикл
		Объект[ИмяТаблицы].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)
	
	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре
	
	Если Не СтрокаТовара.Учитывать Тогда
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) Тогда
				
				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;
				
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
		Иначе
			
			Если СтрокаТовара.КартинкаОшибок = 2 Тогда
				СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПодлежитУчетуВГосСистПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаПодробныеСведенияГосСист.Видимость = ТекущиеДанные.ПодлежитУчетуВГосСист;
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовОсновныеСведенияПоТовару

&НаКлиенте
Процедура ТоварыОсобыеОтметкиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияПоТовару_СтранаПроисхожденияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = ТекущиеДанные.ИдентификаторСтроки;
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтран = Новый Массив;
	ОтборПоСтрокеТоваров = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	
	Для Каждого СтрокаСтраны Из Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборПоСтрокеТоваров) Цикл
		
		Если ЗначениеЗаполнено(СтрокаСтраны.Страна) Тогда
			МассивСтран.Добавить(СтрокаСтраны.Страна);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	ПараметрыФормы.Вставить("МассивСтран", МассивСтран);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_СтраныМира.Форма.ФормаВыбораСтранПроисхождениеПродукции",
		ПараметрыФормы,
		ЭтаФорма,
		ЭтаФорма,
		"ПослеВыбораСтран");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтран(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = Результат.Идентификатор;
	ОтборПоСтрокеТоваров = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиТоваров);
	СтрокиКУдалению = Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборПоСтрокеТоваров);
	
	Для Каждого СтрокаСтраны Из СтрокиКУдалению Цикл
		Объект.СтраныПроисхожденияПродукции.Удалить(СтрокаСтраны);
	КонецЦикла;
	
	Для Каждого Страна Из Результат.МассивСтран Цикл
		
		НоваяСтрока = Объект.СтраныПроисхожденияПродукции.Добавить();
		НоваяСтрока.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		НоваяСтрока.Страна = Страна;
		
	КонецЦикла;
	
	СведенияПоТовару_СтранаПроисхождения = КонтурЛогистика_ОбщегоНазначенияКлиент.РассчитатьПредставлениеСтран(
		Объект.СтраныПроисхожденияПродукции, ИдентификаторСтрокиТоваров);
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОписаниеОпасногоГрузаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКодТНВЭДПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПрзИзъятВещПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСведенияОКонтейнерах

&НаКлиенте
Процедура СведенияОКонтейнерахПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКонтейнерахПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Номер = Элемент.ТекущиеДанные.НомерСтроки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСведенияГосСистем

&НаКлиенте
Процедура СведенияГосСистемПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыИнфУпГруз

&НаКлиенте
Процедура ИнфУпГрузПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфУпГрузПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыМарк

&НаКлиенте
Процедура МаркПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыИнфПол

&НаКлиенте
Процедура ИнфПолТовараПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолТовараПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// Если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(
		ТекущийСтатус, ЭтаФорма, РезультатПроверки, ТекущийКодСостоянияДокументооборота = "r-rejected");
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СкладскаяРасписка"), Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
	КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	Если ТекущийКодСостоянияДокументооборота = "wr-wait-forwarder"
		Или ТекущийКодСостоянияДокументооборота = "wr-wait-cargo-owner"
		Или ТекущийКодСостоянияДокументооборота = "wr-completed" Тогда
		
		ВсегдаВыводитьРезультатВалидации = Ложь;
	Иначе
		ВсегдаВыводитьРезультатВалидации = Истина;
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(
		ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	
	УправлениеВидимостьюИДоступностью(); // Доступность команд
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЕстьЭкспедиторскаяРасписка = ЗначениеЗаполнено(Объект.ЭкспедиторскаяРасписка);
	Элементы.ПЭ_Титул1.Видимость = Не ЕстьЭкспедиторскаяРасписка;
	Элементы.ЭкспедиторскаяРасписка.Видимость = ЕстьЭкспедиторскаяРасписка;
	
	УстановитьФорматыКолонокСКоличеством();
	
	Элементы.ГруппаУсловияПриемаГрузаЕдиничная.Видимость = (ПереключательУсловияПриема = 0);
	Элементы.ГруппаУсловияПриемаГрузаМножественная.Видимость = (ПереключательУсловияПриема = 1);
	
	ЕстьЗамечания = (СостояниеГруза <> ТекстЗамечанияПоГрузунет());
	Элементы.СостояниеГруза.Видимость = ЕстьЗамечания;
	
	Элементы.ГруппаСведенияПоТовару.Видимость = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары);
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
	ЕстьПоручениеЭкспедитора = ЗначениеЗаполнено(Объект.ПЭ_Титул1);
	Элементы.Клиент.ТолькоПросмотр = ЕстьПоручениеЭкспедитора;
	Элементы.Экспедитор.ТолькоПросмотр = ЕстьПоручениеЭкспедитора;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "МассаНеттоКг", Элементы.ТоварыМассаБруттоКг);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "МассаНеттоКг", Элементы.ТоварыМассаНеттоКг);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_СкладскаяРасписка.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ТекущийСтатус = СтатусТитула(Объект.Ссылка);
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусТитула(ДокументСсылка)
	
	Возврат РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументСсылка, Истина);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму()
	
	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийКодСостоянияДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка).Код;
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка);
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(
		Объект.Ссылка, Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = Не ЭтоВходящий И ЕстьДокУчСист;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;
	
	ТребуетсяПодтверждение = ТребуетсяПодтверждение();
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.Видимость = ТребуетсяПодтверждение;
	Если ТребуетсяПодтверждение Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость =
		Не (ТребуетсяПодтверждение Или ТекущийКодСостоянияДокументооборота = "wr-completed");
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.Видимость = Ложь;
	
	Если Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.Видимость Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ОткрытьНастройкуКонвертации.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Если ПереключательУсловияПриема = 0 И Объект.УсловияПриемаГрХран.Количество() > 0 Тогда
		ТекущиеУсловия = Объект.УсловияПриемаГрХран[0];
		
		СрокХран = ТекущиеУсловия.СрокХран;
		ФДатХран = ТекущиеУсловия.ФДатХран;
		ФВрХран = ТекущиеУсловия.ФВрХран;
		ЛицоПриемки = ТекущиеУсловия.ЛицоПриемки;
		ДоговорЛицаПриемки = ТекущиеУсловия.ДоговорЛицаПриемки;
		
		СостояниеГруза = ТекущиеУсловия.СостояниеГруза;
		СостояниеМаркировки = ТекущиеУсловия.СостояниеМаркировки;
		СостояниеОпломбирования = ТекущиеУсловия.СостояниеОпломбирования;
		СостояниеТары = ТекущиеУсловия.СостояниеТары;
		СостояниеУпаковки = ТекущиеУсловия.СостояниеУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяПодтверждение()
	
	Если ТекущийКодСостоянияДокументооборота = "wr-forwarding-cargo-owner" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипыДокументаОснованияНастроеныДляТитула()
	
	ТипыНастроены = Истина;
	
	РеквизитМД = Метаданные.Документы["КонтурЛогистика_СкладскаяРасписка"].Реквизиты.ДокументОснование;
	
	МассивТипов = РеквизитМД.Тип.Типы();
	
	Если МассивТипов.Количество() = 1 И МассивТипов.Найти(Тип("ДокументСсылка.КонтурЛогистика_Вспомогательный")) = 0 Тогда
		ТипыНастроены = Ложь;
	КонецЕсли;
	
	Возврат ТипыНастроены;
	
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		
		ЛокальныйТолькоПросмотр = Ложь;
	Иначе
		ЛокальныйТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВозможностьПодписанияИОтправки = Не ЛокальныйТолькоПросмотр;
	
	Элементы.ГруппаШапка.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаУсловияПриемаГруза.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаТовары.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаСведенияОКонтейнерах.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаДополнительныеПоля.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.ГруппаСведенияПоТовару.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	
	// ПодменюУправление
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена", Не ЛокальныйТолькоПросмотр);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", ВозможностьПодписанияИОтправки);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", ВозможностьПодписанияИОтправки);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_Согласовать", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьЭлемента(ИмяЭлемента, ЗначениеДоступности)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Доступность = ЗначениеДоступности;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоги()
	
	Объект.КоличествоМест = Итог("КоличествоМест");
	ИтогОбъемКубМ = Итог("ОбъемКубМ");
	Объект.МассаНеттоКг = Итог("МассаНеттоКг");
	Объект.МассаБруттоКг = Итог("МассаБруттоКг");
	
	Объект.Стоимость = Итог("Стоимость");
	Если Объект.Товары.Количество() <> 0
		И Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		Объект.Валюта = Объект.Товары[0].Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Итог(ПолеИтога)
	
	Итого = 0;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Итого = Итого + СтрокаТовары[ПолеИтога];
	КонецЦикла;
	
	Возврат Итого;
	
КонецФункции

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции

&НаСервереБезКонтекста
Функция СостояниеПЭЗавершено()
	
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pe-completed");
	
КонецФункции

&НаКлиенте
Процедура ЗаполниьТитулПоПЭТитул1()
	
	ЗаполнитьПоПоручению();
	ОбновитьДанныеФормы();
	РассчитатьИтоги();
	ПроверитьДокумент();
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПоручению()
	
	Объект.УсловияПриемаГрХран.Очистить();
	Объект.РеквЗаказПок.Очистить();
	Объект.Товары.Очистить();
	Объект.СведенияГосСистем.Очистить();
	Объект.ИнфУпГруз.Очистить();
	Объект.СведенияОКонтейнерах.Очистить();
	Объект.Марк.Очистить();
	Объект.СопрДок.Очистить();
	Объект.ИнфПол.Очистить();
	
	ПараметрыФормы = Новый Структура("Основание", Объект.ПЭ_Титул1);
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ПЭ_Титул1);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗамечанияПоГрузунет()
	
	Возврат Документы.КонтурЛогистика_СкладскаяРасписка.СостояниеГруза();
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки;
	
КонецПроцедуры

#Область ПанельОшибок

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокКоманднаяПанельСвернутьНажатие(Элемент)
	
	Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Ложь;
	Элементы.ПанельОшибокКоманднаяПанельРазвернуть.Видимость = Истина;
	
	ИзменитьРасположениеПанелиОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокКоманднаяПанельРазвернутьНажатие(Элемент)
	
	Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Истина;
	Элементы.ПанельОшибокКоманднаяПанельРазвернуть.Видимость = Ложь;
	
	ИзменитьРасположениеПанелиОшибок();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРасположениеПанелиОшибок()
	
	ПанельСвернута = (Элементы.ПанельОшибокКоманднаяПанельСвернуть.Видимость = Истина);
	
	Если ПанельСвернута Тогда
		НовыйРодитель = Элементы.ВсяФорма;
		НовоеМестоположение = Неопределено;
		Элементы.ПанельОшибок.Ширина = 35;
		Элементы.ПанельОшибок.РастягиватьПоГоризонтали = Ложь;
	Иначе
		НовыйРодитель = Элементы.ВспомогательнаяЧасть;
		НовоеМестоположение = Элементы.ГруппаСведенияПоТовару;
		Элементы.ПанельОшибок.Ширина = 0;
		Элементы.ПанельОшибок.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ПанельОшибокРазвернутая, НовыйРодитель, НовоеМестоположение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
