
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЗаполнитьСписокДанныеПолучателя();
	ЗаполнитьНаборыКомплекты();
	АссортиментВыделитьЦветом();
	
КонецПроцедуры

&НаКлиенте
Процедура ОД_ПриОткрытииПосле(Отказ)

	Если QWERTY_Сервер.Получить_РольДоступна("Операционист")
		ИЛИ QWERTY_Сервер.Получить_РольДоступна("МенеджерПоПродажамУправлениеРазделом")
		ИЛИ QWERTY_Сервер.Получить_РольДоступна("РуководительОтделаПродажДополнительно") Тогда
		
		ДанныеЗаказа = ПолучитьДанныеЗаказа(Объект.Ссылка);
		
		Если ДанныеЗаказа.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки")
			ИЛИ ДанныеЗаказа.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки")
			ИЛИ ДанныеЗаказа.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию") Тогда
			
			Если ДанныеЗаказа.СуммаОтгрузки > 0 Тогда
				Сообщить("Запрещено редактирование документа! Проведена реализация");
			КонецЕсли;
			Если ДанныеЗаказа.СуммаОплаты > 0 Тогда
				Сообщить("Запрещено редактирование документа! Проведена оплата");
			КонецЕсли;
			Если ЕстьЗаданиеНаПеревозку(Объект.Ссылка) Тогда
				Сообщить("Запрещено редактирование документа! Проведено задание на перевозку");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОД_ПослеЗаписиПосле(ПараметрыЗаписи)
	ЗаполнитьНаборыКомплекты();
КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Закрытие_РедактированиеКомплекта" Тогда
		ЗаполнитьНаборыКомплекты();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&После("ОбработкаВыбораПодборНаКлиентеПослеВопроса")
Процедура ОД_ОбработкаВыбораПодборНаКлиентеПослеВопроса(Ответ, ДополнительныеПараметры)
	ЗаполнитьНаборыКомплекты();
КонецПроцедуры

&НаСервере
&После("ПриУдаленииКомплектующихНаСервере")
Процедура ОД_ПриУдаленииКомплектующихНаСервере(ИмяТЧ, ДополнительныйПараметр)
	ЗаполнитьНаборыКомплекты();
КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		ЗаполнитьНаборыКомплекты();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОД_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОД_ОбщиеФункции.УправлениеАссортиментом(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	
	// 24.04.2024
	Орг = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7706469887"); // ООО Керамика
	ОргРезерва = Справочники.Организации.НайтиПоНаименованию("Сергиенко 1", Истина); // ООО Керамика

	Если Объект.Организация = Орг Тогда
		Для каждого Т Из Объект.Товары Цикл

			Если Т.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.Отгрузить
				И Т.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.СоСклада Тогда
				Продолжить;
			КонецЕсли;

			Если Т.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				ОстатокКОформлению = ОД_ОбщиеФункции.ОстатокКОформлению(Т.Номенклатура, Объект.ДатаОтгрузки, Объект.Ссылка);
				Если ОстатокКОформлению = 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ОстатокОбщий = ОД_ОбщиеФункции.ОстатокТовараПоОрганизации(Т.Номенклатура, Объект.ДатаОтгрузки);
			ОстатокРезерв = ОД_ОбщиеФункции.ОстатокТовараПоОрганизации(Т.Номенклатура, Объект.ДатаОтгрузки, ОргРезерва);
			
			ОстатокРасчетный = ОстатокОбщий - ОстатокРезерв;
			
			Если Т.Количество > ОстатокРасчетный Тогда
				Отказ = Истина;
				Сообщить("Недостаточно товара по организации. Товар: " + Т.Номенклатура);
				Сообщить("   Остаток всего: " + ОстатокОбщий);
				Сообщить("   Остаток по организации, зарезервировано: " + ОстатокРезерв);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// 11.07.2026 контроль номенклатуры сегмента
	Если ЗначениеЗаполнено(Объект.Соглашение)
		И ЗначениеЗаполнено(Объект.Соглашение.СегментНоменклатуры) Тогда
		
		Для каждого Т Из Объект.Товары Цикл
			ЕстьВСегменте = ЕстьВСегменте(Объект.Соглашение.СегментНоменклатуры, Т.Номенклатура);
			Если НЕ ЕстьВСегменте Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - нет в сегменте");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;

	// 20.07.2026 контроль сегмента запрета отгрузки
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		Если Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
			Если ОД_ОбщиеФункции.УстановленЗапретОтгрузкиПоСегменту(ТекущийОбъект.Партнер, ТекущийОбъект.Соглашение) Тогда
				Сообщить("Отгрузка клиенту запрещена (установлен сегмент запрета отгрузки)");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;

		// 20.07.2026 контроль запрета отгрузки по превышению кредита
		Если Элементы.КартинкаОтгрузкаЗапрещена.Видимость Тогда
			ОтгрузкаСверхЛимита = УправлениеСвойствами.ЗначениеСвойства(Объект.Соглашение, "ОтгрузкаСверхЛимита");
			Если НЕ ОтгрузкаСверхЛимита <> Неопределено 
				ИЛИ НЕ ОтгрузкаСверхЛимита Тогда
				Сообщить("Отгрузка клиенту запрещена (превышение кредита)");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// 13.07.2026 Менеджерам запрещенио устанавливать произвольные цены
	Если РольДоступна("Операционист")
		ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
		ИЛИ РольДоступна("РуководительОтделаПродажДополнительно") Тогда
		Для каждого Т Из Объект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(Т.ВидЦены) Тогда
				Сообщить("Строка: " + Т.НомерСтроки + ", " + Т.Номенклатура + " - не установлен вид цены");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&Вместо("ПолучитьСтрокиИзБуфераОбмена")
Процедура ОД_ПолучитьСтрокиИзБуфераОбмена()
	
	ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();
	
	Если ОперацииПередачи.Найти(Объект.ХозяйственнаяОперация) <> Неопределено Тогда
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("ОтборПоТипуНоменклатуры",НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре());
		ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена(ПараметрыОтбора);
	Иначе
		ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена();
	КонецЕсли;
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
		ТекущаяСтрока.ИндексНабора = ?(ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора), 1, 0);
		Если НЕ ИспользоватьРучныеСкидкиВПродажах Тогда
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			ТекущаяСтрока.СуммаРучнойСкидки = 0;
		КонецЕсли;
		
		Если Объект.НеОтгружатьЧастями Тогда
			ТекущаяСтрока.ДатаОтгрузки = Объект.ДатаОтгрузки;
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата, ПоДатеОтгрузки", Объект.НалогообложениеНДС, Объект.Дата, Истина));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		СтруктураДействий.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);

		// 03.07.2026
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
		
		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		Если ЗначениеЗаполнено(СтрокаТовара.НоменклатураНабора) Тогда
			
			ВидЦены = Объект.Соглашение.ВидЦен;

			Набор = СтрокаТовара.НоменклатураНабора;

			ВариантРасчетаЦены = QWERTY_Сервер.ПолучитьВариантРасчетаЦены(Набор);
			
			Если  ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
				// распределение не нужно, будет выполнено в процедуре обработки строки
			Иначе // цена задается на набор, нужно распределение
				
				ЦенаНабора			= QWERTY_Сервер.ПолучитьЦену(Набор, ВидЦены, ТекущаяДатаСеанса());
				ЦенаНабораАкционная	= QWERTY_Сервер.ПолучитьЦену(Набор, QWERTY_Сервер.ВидЦеныАкционная(), ТекущаяДатаСеанса());
				Если ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную Тогда
					ЦенаНабораАкционная = 0;
				КонецЕсли;
				Если ЦенаНабораАкционная > 0 Тогда
					ЦенаНабора = ЦенаНабораАкционная;
					ТекущаяСтрока.ВидЦены = QWERTY_Сервер.ВидЦеныАкционная();
				КонецЕсли;
				
				ТЗ_Комплектующие = Комплектующие(Набор, ВидЦены);
				
				ОбщаяСтоимость = ТЗ_Комплектующие.Итог("Цена");
				
				Если  ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
					Если ОбщаяСтоимость = 0 Тогда // 01.04.2026
						Продолжить;
					КонецЕсли;
					Для каждого Т Из ТЗ_Комплектующие Цикл
						ЦенаКомлектующейИсходная = Т.Цена;
						Если Т.Количество > 0 Тогда
							НоваяЦена = (ЦенаКомлектующейИсходная/Т.Количество / ОбщаяСтоимость) * ЦенаНабора;
						Иначе
							НоваяЦена = 0;
						КонецЕсли;
						НоваяЦена = Окр(НоваяЦена, 2);
						Т.ЦенаРасчетная = НоваяЦена;
						Т.СуммаРасчетная = НоваяЦена * Т.Количество;
					КонецЦикла;
				ИначеЕсли  ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда
					Для каждого Т Из ТЗ_Комплектующие Цикл
						НоваяЦена = (Т.ДоляСтоимости/100) * ЦенаНабора;
						НоваяЦена = Окр(НоваяЦена, 2);
						Т.ЦенаРасчетная = НоваяЦена;
						Т.СуммаРасчетная = НоваяЦена * Т.Количество;
					КонецЦикла;
				КонецЕсли;

				Погрешность = ЦенаНабора - ТЗ_Комплектующие.Итог("СуммаРасчетная");
				Если Погрешность > 0 Тогда
					ТЗ_Комплектующие.Сортировать("Количество");
					Если ТЗ_Комплектующие.Количество() > 0 Тогда
						ТЗ_Комплектующие[0].ЦенаРасчетная = ТЗ_Комплектующие[0].ЦенаРасчетная + Погрешность; 
					КонецЕсли;
				КонецЕсли;
				СтрНайдено = ТЗ_Комплектующие.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура));
				Если СтрНайдено.Количество() > 0 Тогда
					ТекущаяСтрока.Цена = СтрНайдено[0].ЦенаРасчетная;
				КонецЕсли;				

			КонецЕсли; // вариант расчета цены
		КонецЕсли; // это элемент набора

	КонецЦикла;
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
&После("ПартнерПриИзменении")
Процедура ОД_ПартнерПриИзменении(Элемент)

	ЗаполнитьСписокДанныеПолучателя();
	
	Объект.Проект = "";
	УправлениеДоступностьюПоляПроект();

КонецПроцедуры

&НаКлиенте
Процедура ОД_СпособДоставкиНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СписокВыбора = Элементы.СпособДоставки.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика"), "Перевозчик (с нашего склада)");
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки"), "На усмотрение транспортной службы");

КонецПроцедуры

&НаКлиенте
Процедура ОД_ТоварыПриИзмененииПосле(Элемент)

	АссортиментВыделитьЦветом();

КонецПроцедуры

&НаКлиенте
Процедура ОД_ДанныеПолучателяНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ИмяРеквизитаАдресаДоставки = "ДанныеПолучателя";
	
	АдресПредставление = Объект[ИмяРеквизитаАдресаДоставки];
	АдресЗначенияПолей = Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"];
	АдресЗначение = Объект[ИмяРеквизитаАдресаДоставки + "Значение"];
	
	ЗначенияПолей = ДоставкаТоваровКлиентСервер.ПреобразоватьСтрокуВСписокПолей(АдресЗначенияПолей);
	
	Если ПустаяСтрока(ЗначенияПолей) И ЗначениеЗаполнено(АдресПредставление) Тогда
		ЗначенияПолей = КонтактнаяИнформацияПоПредставлению(АдресПредставление);
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", 	ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПартнера"));
	ПараметрыОткрытия.Вставить("ЗначенияПолей",				ЗначенияПолей );
	ПараметрыОткрытия.Вставить("Значение",					АдресЗначение);
	ПараметрыОткрытия.Вставить("Представление",				АдресПредставление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",						Объект);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдресаДоставки", 	ИмяРеквизитаАдресаДоставки);
	ДополнительныеПараметры.Вставить("Элемент", 					Элементы.ДанныеПолучателя);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);

КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура ОД_Подключаемый_ВыполнитьКоманду(Команда)

	ИмяПФ = "ЗаявкаАвтотранспортаВер2";
	
	Если Команда.Имя = "ПодменюПечатьОбычное_" + ИмяПФ Тогда
		
		ДанныеЗаданиеНаПеревозку = ЗаданиеНаПеревозку(Объект.Ссылка);
		
		Если ПустаяСтрока(ДанныеЗаданиеНаПеревозку.КлючСвязи) Тогда
			Сообщить("! не определен документ Задание на перевозку");
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		
		ТекущийОбъектПечати = Новый Массив;
		ТекущийОбъектПечати.Добавить(ДанныеЗаданиеНаПеревозку.ЗаданиеНаПеревозку);
		ТекущийОбъектПечати.Добавить(ДанныеЗаданиеНаПеревозку.КлючСвязи);
		
		ТекМенеджерПечати = "Обработка." + ИмяПФ;
		ИД_ПечатнойФормы = "ВнешняяПечатнаяФорма." + ИмяПФ; 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТекМенеджерПечати, ИД_ПечатнойФормы, ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
	Иначе	
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область УправлениеВидимостьюПолей
	
&Вместо("УстановитьВидимостьЭлементовПоРолям")
Процедура ОД_УстановитьВидимостьЭлементовПоРолям()
	
	//Если РольДоступна("Операционист")
	//	ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
	//	ИЛИ РольДоступна("РуководительОтделаПродажДополнительно") Тогда
	//	
	//	// вкладка Основное
	//	Элементы.Организация.Доступность			= Ложь;
	//	//Элементы.Склад.Доступность					= Ложь;
	//	Элементы.ХозяйственнаяОперация.Доступность	= Ложь;

	//	// вкладка Товары
	//	Элементы.ГруппаЦеныСкидки.Видимость				= Ложь;
	//	Элементы.ТоварыПроцентРучнойСкидки.Доступность	= Ложь;
	//	Элементы.ТоварыСуммаРучнойСкидки.Доступность	= Ложь;
	//	Элементы.ТоварыСумма.Доступность				= Ложь;
	//	Элементы.ТоварыВидЦены.Доступность				= Ложь;

	//	НайденЭлемент = Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ТоварыСкопироватьСтроки");
	//	НайденЭлемент.Видимость = Ложь;
	//	НайденЭлемент = Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ТоварыВставитьСтроки");
	//	НайденЭлемент.Видимость = Ложь;
	//	НайденЭлемент = Элементы.Товары.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("ТоварыКонтекстноеМенюСкопироватьСтроки");
	//	НайденЭлемент.Видимость = Ложь;
	//	НайденЭлемент = Элементы.Товары.КонтекстноеМеню.ПодчиненныеЭлементы.Найти("ТоварыКонтекстноеМенюВставитьСтроки");
	//	НайденЭлемент.Видимость = Ложь;

	//	Если Объект.Товары.Итог("СуммаРучнойСкидки") > 0 Тогда
	//		Элементы.ТоварыКоличествоУпаковок.Доступность = Ложь;
	//		Элементы.ГруппаТоварыПодвал.ТолькоПросмотр = Истина;
	//		Элементы.Товары.ТолькоПросмотр = Истина;
	//		
	//		Для каждого ПЭ Из Элементы.Товары.ПодчиненныеЭлементы Цикл
	//			Если ПЭ.Имя = "ТоварыДатаОтгрузки" Тогда
	//				Продолжить
	//			КонецЕсли;
	//			ПЭ.ТолькоПросмотр = Истина;
	//		КонецЦикла;
	//		
	//		Элементы.ТоварыОткрытьПодбор.Видимость = Ложь;
	//		Элементы.ТоварыЗагрузитьИзВнешнегоФайла.Видимость = Ложь;
	//		
	//	КонецЕсли;

	//	// вкладка Доставка
	//	Элементы.АдресДоставкиПеревозчика.Видимость				= Ложь;
	//	Элементы.ЗонаДоставкиПолучателя.Видимость				= Ложь;
	//	Элементы.ЗонаДоставкиПеревозчика.Видимость				= Ложь;
	//	Элементы.ДополнительнаяИнформацияПоДоставке.Видимость	= Ложь;
	//	Элементы.ДополнительнаяИнформацияПоДоставке1.Видимость	= Ложь;
	//	Элементы.ДополнительнаяИнформацияПоДоставке2.Видимость	= Ложь;

	//	// вкладка Дополнительно
	//	Элементы.Менеджер.Доступность			= Ложь;
	//	Элементы.НалогообложениеНДС.Доступность = Ложь;
	//	Элементы.ГруппаВалюта.Доступность		= Ложь;
	//	
	//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//		УстановитьДоступностьПечати(Объект.Ссылка);
	//	КонецЕсли;
	//	
	//	ДанныеЗаказа = ПолучитьДанныеЗаказа(Объект.Ссылка);
	//	
	//	Если ДанныеЗаказа.Состояние = Перечисления.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки
	//		ИЛИ ДанныеЗаказа.Состояние = Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки
	//		ИЛИ ДанныеЗаказа.Состояние = Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию Тогда
	//	
	//		ЗакрытьДатуОтгрузки = Ложь;
	//		
	//		Если ДанныеЗаказа.СуммаОтгрузки > 0 Тогда
	//			Элементы.ДокументОснование.Доступность			= Ложь;	
	//			Элементы.ГруппаШапка.Доступность				= Ложь;	
	//			Элементы.ГруппаИндексыСПАРКРиски.Доступность	= Ложь;
	//			Элементы.ГруппаЭтапыОплатыРасчеты.Доступность	= Ложь;
	//			Элементы.ГруппаПодпискаНаОповещения.Доступность	= Ложь;
	//			
	//			Элементы.Товары.ТолькоПросмотр					= Истина;
	//			Элементы.ГруппаТоварыПодвал.Доступность			= Ложь;
	//			
	//			Элементы.АдресДоставкиПолучателя.Доступность	= Ложь;
	//			Элементы.АдресДоставкиПолучателя2.Доступность	= Ложь;
	//			Элементы.АдресДоставкиПеревозчика.Доступность	= Ложь;
	//			
	//			Элементы.ГруппаПараметры.Доступность				= Ложь;
	//			Элементы.ДополнительнаяИнформация.Доступность		= Ложь;
	//			Элементы.ГруппаДополнительныеРеквизиты.Доступность	= Ложь;
	//			Элементы.ГруппаПечать.Доступность					= Ложь;
	//			
	//			ЗакрытьДатуОтгрузки = Истина;
	//		КонецЕсли;
	//	
	//		Если ДанныеЗаказа.СуммаОплаты > 0 Тогда
	//			Элементы.ГруппаПартнер.Доступность				= Ложь;	
	//			Элементы.Контрагент.Доступность					= Ложь;	
	//			Элементы.Склад.Доступность						= Ложь;
	//			Элементы.ТоварыНоменклатура.Доступность			= Ложь;
	//			Элементы.ТоварыВариантОбеспечения.Доступность	= Ложь;
	//			Элементы.ТоварыКоличествоУпаковок.Доступность	= Ложь;

	//			ЗакрытьДатуОтгрузки = Истина;
	//		КонецЕсли;
	//		
	//		Если ЕстьЗаданиеНаПеревозку(Объект.Ссылка) Тогда
	//			Элементы.ГруппаПартнер.Доступность				= Ложь;	
	//			Элементы.Контрагент.Доступность					= Ложь;	
	//			Элементы.Склад.Доступность						= Ложь;
	//			Элементы.ТоварыНоменклатура.Доступность			= Ложь;
	//			Элементы.ТоварыВариантОбеспечения.Доступность	= Ложь;
	//			Элементы.ТоварыКоличествоУпаковок.Доступность	= Ложь;
	//			
	//			Элементы.ГруппаСервисДоставки.Доступность			= Ложь;
	//			Элементы.ГруппаСпособДоставкиПеревозчик.Доступность	= Ложь;
	//			Элементы.СтраницыДоставки.Доступность				= Ложь;
	//			Элементы.Проект.Доступность							= Ложь;

	//			ЗакрытьДатуОтгрузки = Истина;
	//		КонецЕсли;
	//		
	//		// 03.07.2026
	//		Если ЗакрытьДатуОтгрузки Тогда
				
				Для каждого Т Из Объект.Товары Цикл
					Если Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
						Т.ЗакрытьДатуОтгрузки = Истина;
					КонецЕсли;
				КонецЦикла;
			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если РольДоступна("РабочееМестоМенеджераПоЗакупкам") Тогда
		Элементы.ПодменюСоздатьНаОснованииВажное.Видимость = Ложь;
		Элементы.ПодменюСоздатьНаОснованииСмТакже.Видимость = Ложь;
		// убрать все создания на основании, кроме Заказ поставщику
		АдресТаблицыКоманд = (ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
		Если АдресТаблицыКоманд <> Неопределено И ЭтоАдресВременногоХранилища(АдресТаблицыКоманд) Тогда
			ТабКоманд = ПолучитьИзВременногоХранилища(АдресТаблицыКоманд);
			СтрокаТабКоманд = ТабКоманд.Найти("Заказ поставщику", "Представление");
			Если СтрокаТабКоманд <> Неопределено Тогда
				ИД = СтрокаТабКоманд.Идентификатор;
				Для каждого ПЭ Из Элементы.ПодменюСоздатьНаОснованииОбычное.ПодчиненныеЭлементы Цикл
					Если СтрНайти(ПЭ.Имя, ИД) > 0 Тогда
						ПЭ.Видимость = Истина;
					Иначе
						ПЭ.Видимость = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ГруппаСтраницы.ТолькоПросмотр = Истина;
		Элементы.ГруппаПодвал.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если РольДоступна("РабочееМестоРуководительСервисногоОтдела") Тогда
		Элементы.ПодменюСоздатьНаОсновании.Видимость = Ложь;
		// убрать все отчеты, кроме Связанные документы
		АдресТаблицыКоманд = (ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
		Если АдресТаблицыКоманд <> Неопределено И ЭтоАдресВременногоХранилища(АдресТаблицыКоманд) Тогда
			ТабКоманд = ПолучитьИзВременногоХранилища(АдресТаблицыКоманд);
			СтрокаТабКоманд = ТабКоманд.Найти("Связанные документы", "Представление");
			Если СтрокаТабКоманд <> Неопределено Тогда
				ИД = СтрокаТабКоманд.Идентификатор;
				Элементы.ПодменюОтчетыВажное.Видимость = Ложь;
				Элементы.ПодменюОтчетыОбычное.Видимость = Ложь;
				Для каждого ПЭ Из Элементы.ПодменюОтчетыСмТакже.ПодчиненныеЭлементы Цикл
					Если СтрНайти(ПЭ.Имя, ИД) > 0 Тогда
						ПЭ.Видимость = Истина;
					Иначе
						ПЭ.Видимость = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// 25.07.2024
	Если РольДоступна("РабочееМестоМенеджерПоМаркетингу") Тогда
		
		АдресТаблицыКоманд = (ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
		Если АдресТаблицыКоманд <> Неопределено И ЭтоАдресВременногоХранилища(АдресТаблицыКоманд) Тогда
			ТабКоманд = ПолучитьИзВременногоХранилища(АдресТаблицыКоманд);
			СтрокаТабКоманд = ТабКоманд.Найти("Заказ поставщику", "Представление");
			Если СтрокаТабКоманд <> Неопределено Тогда
				ИД = СтрокаТабКоманд.Идентификатор;
				Для каждого ПЭ Из Элементы.ПодменюСоздатьНаОснованииОбычное.ПодчиненныеЭлементы Цикл
					Если СтрНайти(ПЭ.Имя, ИД) > 0 Тогда
						ПЭ.Видимость = Истина;
					Иначе
						ПЭ.Видимость = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// убрать все отчеты, кроме Связанные документы
			СтрокаТабКоманд = ТабКоманд.Найти("Связанные документы", "Представление");
			Если СтрокаТабКоманд <> Неопределено Тогда
				ИД = СтрокаТабКоманд.Идентификатор;
				Элементы.ПодменюОтчетыВажное.Видимость = Ложь;
				Элементы.ПодменюОтчетыОбычное.Видимость = Ложь;
				Для каждого ПЭ Из Элементы.ПодменюОтчетыСмТакже.ПодчиненныеЭлементы Цикл
					Если СтрНайти(ПЭ.Имя, ИД) > 0 Тогда
						ПЭ.Видимость = Истина;
					Иначе
						ПЭ.Видимость = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;

		Элементы.Склад.Доступность = Ложь;
		
	КонецЕсли;
	
	// 05.09.2024
	Если РольДоступна("РабочееМестоРуководительСклада") Тогда
		
		Элементы.ПодменюОтчетыОбычное.Видимость = Ложь;
		
		АдресТаблицыКоманд = (ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
		Если АдресТаблицыКоманд <> Неопределено И ЭтоАдресВременногоХранилища(АдресТаблицыКоманд) Тогда
			ТабКоманд = ПолучитьИзВременногоХранилища(АдресТаблицыКоманд);
			
			// убрать все отчеты, кроме
			СтрокаТабКоманд = ТабКоманд.Найти("Связанные документы", "Представление");
			Если СтрокаТабКоманд <> Неопределено Тогда
				ИД = СтрокаТабКоманд.Идентификатор;
				Для каждого ПЭ Из Элементы.ПодменюОтчетыСмТакже.ПодчиненныеЭлементы Цикл
					Если СтрНайти(ПЭ.Имя, ИД) > 0 Тогда
						ПЭ.Видимость = Истина;
					Иначе
						ПЭ.Видимость = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// убрать все отчеты, кроме
			СтрокаТабКоманд = ТабКоманд.Найти("Состояние выполнения", "Представление");
			Если СтрокаТабКоманд <> Неопределено Тогда
				ИД = СтрокаТабКоманд.Идентификатор;
				Для каждого ПЭ Из Элементы.ПодменюОтчетыВажное.ПодчиненныеЭлементы Цикл
					Если СтрНайти(ПЭ.Имя, ИД) > 0 Тогда
						ПЭ.Видимость = Истина;
					Иначе
						ПЭ.Видимость = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Если РольДоступна("РабочееМестоМенеджераПоЗакупкамПоставщикиРФ")
		ИЛИ РольДоступна("РабочееМестоМенеджераПоЗакупкам") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ЗабратьВозврат.Видимость = Ложь;
	// 14.07.2026
	Элементы.ОсобыеУсловияПеревозкиДоставкаПеревозчиком.Видимость = Ложь;
	Элементы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Видимость = Ложь;
	
	УправлениеДоступностьюПоляПроект();
	
КонецПроцедуры

Функция ПолучитьДанныеЗаказа(п_Ссылка)

	Рез = Новый Структура();
	Рез.Вставить("Состояние", "");
	Рез.Вставить("СуммаОплаты", 0);
	Рез.Вставить("ПроцентОплаты", 0);
	Рез.Вставить("СуммаОтгрузки", 0);
	Рез.Вставить("ПроцентОтгрузки", 0);
	Рез.Вставить("СуммаДолга", 0);
	Рез.Вставить("СуммаОплаты", 0);
	Рез.Вставить("ПроцентДолга", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
		|	СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты,
		|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
		|	СостоянияЗаказовКлиентов.СуммаОтгрузки КАК СуммаОтгрузки,
		|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки,
		|	СостоянияЗаказовКлиентов.СуммаДолга КАК СуммаДолга,
		|	СостоянияЗаказовКлиентов.ПроцентДолга КАК ПроцентДолга
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|ГДЕ
		|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", п_Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
		Возврат Рез;
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ()

Функция ЕстьЗаданиеНаПеревозку(п_Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
		|ГДЕ
		|	ЗаданиеНаПеревозку.Распоряжения.Распоряжение = &Распоряжение
		|	И ЗаданиеНаПеревозку.Проведен";
	
	Запрос.УстановитьПараметр("Распоряжение", п_Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции // ()

Функция УправлениеДоступностьюПоляПроект()

	Если ЗначениеЗаполнено(Объект.Партнер) 
		И ЗначениеЗаполнено(Объект.Партнер.Проект) Тогда
		
		Элементы.Проект.Доступность = Истина;
		Элементы.Проект.КнопкаОткрытия = Ложь;
		Элементы.Проект.КнопкаСоздания = Ложь;
		Элементы.Проект.РежимВыбораИзСписка = Истина;
		Элементы.Проект.СписокВыбора.Очистить();
		Элементы.Проект.СписокВыбора.Добавить(Объект.Партнер.Проект);
		
	Иначе
		Элементы.Проект.Доступность = Ложь;
	КонецЕсли;

КонецФункции // ()

// 03.07.2026
&НаСервере
&После("УстановитьУсловноеОформление")
Процедура ОД_УстановитьУсловноеОформление()

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДатаОтгрузки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗакрытьДатуОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(192, 192, 192));
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

	// ассортимент
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатура.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.АссортиментВыделитьЦветом");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	
КонецПроцедуры

#КонецОбласти

#Область Логистика

&НаКлиенте
&После("АдресДоставкиОбработкаВыбора")
Процедура ОД_АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(ВыбранноеЗначение.АдресДоставки);
	
	УстановитьКонтактыДоставки(Контакты);

КонецПроцедуры

&НаКлиенте
&После("СпособМестоДоставкиПеревозчикПриИзменении")
Процедура ОД_СпособМестоДоставкиПеревозчикПриИзменении(Элемент)
	
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента") Тогда
		// Доставка по Москве и МО (отключено)
		Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(Объект.АдресДоставки);
		УстановитьКонтактыДоставки(Контакты);
		ЗаполнитьСписокВыбораАдресаПолучателя();
	ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") Тогда
		// Наша транспортная служба до перевозчика (отключено)
		//Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(Объект.АдресДоставкиПеревозчика);
		Объект.АдресДоставкиПеревозчика = "-";
	ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика") Тогда
		// Перевозчик с нашего склада (активно)
		// Вкладка: СтраницаДоставкаПеревозчиком
		// Элементы.АдресДоставкиПолучателя2
		УстановитьПеревозчикПартнер();
		ЗаполнитьСписокВыбораАдресаПолучателя2();
		Элементы.ОсобыеУсловияПеревозкиДоставкаПеревозчиком.Видимость = Ложь;
		Элементы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Видимость = Ложь;

	ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки") Тогда
		// На усмотрение транспортной службы (активно)
		// Вкладка: СтраницаДоставкаДоПолучателя
		// Элементы.АдресДоставкиПолучателя
		Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(Объект.АдресДоставки);
		ЗаполнитьСписокВыбораАдресаПолучателя();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКонтактыДоставки(п_Контакты)

	Если ЗначениеЗаполнено(п_Контакты.ВремяДоставкиС) Тогда
		Объект.ВремяДоставкиС = п_Контакты.ВремяДоставкиС;
	КонецЕсли;
	Если ЗначениеЗаполнено(п_Контакты.ВремяДоставкиПо) Тогда
		Объект.ВремяДоставкиПо = п_Контакты.ВремяДоставкиПо;
	КонецЕсли;
	Объект.КонтактноеЛицо						= п_Контакты.КонтактноеЛицо;
	Объект.ДополнительнаяИнформацияПоДоставке	= п_Контакты.ДополнительнаяИнформацияПоДоставке;

КонецПроцедуры

Функция АдресаПолучателяИзКонтактнойИнформации(п_Партнер)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС_ДополнительнаяИнформация
		|		ПО КонтактнаяИнформация.Представление = РС_ДополнительнаяИнформация.АдресДоставки
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И НЕ ЕСТЬNULL(РС_ДополнительнаяИнформация.НеАктуален, ЛОЖЬ)");
		
	Запрос.УстановитьПараметр("ПолучательОтправитель", п_Партнер);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСписокДанныеПолучателя()

	УстановитьПривилегированныйРежим(Истина);
	
	//АдресаПолучателяИзКонтактнойИнформации = АдресаПолучателяИзКонтактнойИнформации(Объект.Партнер);
	АдресаПолучателяИзКонтактнойИнформации = ОД_Логистика.ФактАдресаКонтрагента(Объект.Контрагент);

	СписокВыбора = Элементы.ДанныеПолучателя.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации Цикл
		СписокВыбора.Добавить(Стр.АдресДоставки, Стр.Вид + ": " + Стр.АдресДоставки);
	КонецЦикла;

КонецПроцедуры

#Область Доработка_05_07_2026__14_07_2026
	
Процедура ЗаполнитьСписокВыбораАдресаПолучателя2()

	Объект.АдресДоставки = "";

	ФактАдресаПартнера = АдресаПолучателяИзКонтактнойИнформации(Объект.ПеревозчикПартнер);
		
	СписокВыбора = Новый СписокЗначений;
	Для Каждого Стр Из ФактАдресаПартнера Цикл
		НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		Если НайденныйЭлементСЗ = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.АдресДоставки);
		Иначе
			ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
		КонецЕсли;
	КонецЦикла;

	Элементы.АдресДоставкиПолучателя2.СписокВыбора.Очистить();
	Для Каждого Эл Из СписокВыбора Цикл
		Элементы.АдресДоставкиПолучателя2.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораАдресаПолучателя()

	Объект.АдресДоставки = "";

	Если ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		ФактАдресаКонтрагента = ОД_Логистика.ФактАдресаКонтрагента(Объект.Грузополучатель);
	Иначе
		ФактАдресаКонтрагента = ОД_Логистика.ФактАдресаКонтрагента(Объект.Контрагент);
	КонецЕсли;
		
	СписокВыбора = Новый СписокЗначений;
	Для Каждого Стр Из ФактАдресаКонтрагента Цикл
		НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		Если НайденныйЭлементСЗ = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.АдресДоставки);
		Иначе
			ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
		КонецЕсли;
	КонецЦикла;

	Элементы.АдресДоставкиПолучателя.СписокВыбора.Очистить();
	Для Каждого Эл Из СписокВыбора Цикл
		Элементы.АдресДоставкиПолучателя.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
КонецПроцедуры

Функция СтруктураВыбора()
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции

Процедура ДозаполнитьПустыеСвойства(СтруктураПриемник, Источник);
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область ДобавитьАдрес

&НаСервере
Процедура ЗаписатьАдресДоставки(п_Владелец, п_Адрес)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РодительКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Контрагенты""", Истина);
	ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Фактический адрес", Истина, РодительКИ);
	ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(п_Адрес, ВидКИ);
	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(п_Владелец, ЗначенияПолей, ВидКИ,,Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Результат, Параметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ИмяРеквизитаАдресаДоставки = "АдресДоставки" Тогда
		Объект.АдресДоставки = Результат.Представление;
	ИначеЕсли Параметры.ИмяРеквизитаАдресаДоставки = "ДанныеПолучателя" Тогда
		Объект.ДанныеПолучателя = Результат.Представление;
		Элементы.ДанныеПолучателя.СписокВыбора.Добавить(Результат.Представление);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		ЗаписатьАдресДоставки(Объект.Грузополучатель, Результат.Представление);
	Иначе
		ЗаписатьАдресДоставки(Объект.Контрагент, Результат.Представление);
	КонецЕсли; 
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОД_ДобавитьАдресПосле(Команда)

	СтандартнаяОбработка = Ложь;

	Если ТекущийЭлемент.Имя = "ДобавитьАдрес" Тогда
		ИмяРеквизитаАдресаДоставки = "АдресДоставки";
	ИначеЕсли ТекущийЭлемент.Имя = "ДобавитьАдрес1" Тогда
		ИмяРеквизитаАдресаДоставки = "ДанныеПолучателя";
	Иначе
		Возврат;
	КонецЕсли;
	
	АдресПредставление = Объект[ИмяРеквизитаАдресаДоставки];
	АдресЗначенияПолей = Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"];
	АдресЗначение = Объект[ИмяРеквизитаАдресаДоставки + "Значение"];
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(Элементы.ДанныеПолучателя, АдресПредставление, АдресЗначенияПолей, Ложь);
	
	// Откроем диалог редактирования КИ
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПартнера"));
	ПараметрыОткрытия.Вставить("ЗначенияПолей",           ДоставкаТоваровКлиентСервер.ПреобразоватьСтрокуВСписокПолей(АдресЗначенияПолей));
	ПараметрыОткрытия.Вставить("Значение",                АдресЗначение);
	ПараметрыОткрытия.Вставить("Представление",           АдресПредставление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",						Объект);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдресаДоставки", 	ИмяРеквизитаАдресаДоставки);
	ДополнительныеПараметры.Вставить("Элемент", 					Элементы.ДанныеПолучателя);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);

КонецПроцедуры

#КонецОбласти

Функция КонтактнаяИнформацияПоПредставлению(АдресПредставление)

	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(АдресПредставление,
			Перечисления.ТипыКонтактнойИнформации.Адрес);

КонецФункции // ()

Процедура УстановитьПеревозчикПартнер()
	
	Если ЗначениеЗаполнено(Объект.ПеревозчикПартнер) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.ПеревозчикПартнер КАК ПеревозчикПартнер
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.ПеревозчикПартнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ПеревозчикПартнер = Выборка.ПеревозчикПартнер;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область НаборыКомплекты

&НаСервере
&Вместо("ПолучитьЗагруженныеТоварыИзХранилища")
Процедура ОД_ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	// 18.03.2026, Т-6, получить загр. товары из хранилища
	// Зинаков 09.03.2026/1
	// Зинаков 05.12.2024/5
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтрокаТЧТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров,,"КодСтроки");
		Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
			Если ЗначениеЗаполнено(Объект.Соглашение.ВидЦен) Тогда
				ВидЦены = Объект.Соглашение.ВидЦен;
				Цена = ПолучитьЦену(СтрокаТоваров.Номенклатура, ВидЦены);
				СтрокаТЧТовары.ВидЦены = ВидЦены;
				СтрокаТЧТовары.Цена = Цена;
				
				Сообщить("Т-6, ЗаказКлиента.МодульФормы, ОД_ПолучитьЗагруженныеТоварыИзХранилища");
				
				// 01.04.2026
				СтруктураПараметровОтбора = Новый Структура("Дата, ВидЦеныДокумента, ВидЦеныАкционная, Номенклатура, НоменклатураНабора");
				СтруктураПараметровОтбора.Номенклатура			= СтрокаТоваров.Номенклатура;
				СтруктураПараметровОтбора.Дата					= ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
				СтруктураПараметровОтбора.ВидЦеныАкционная		= QWERTY_Сервер.ВидЦеныАкционная();
				СтруктураПараметровОтбора.ВидЦеныДокумента		= ВидЦены;
				СтруктураПараметровОтбора.НоменклатураНабора	= Справочники.Номенклатура.ПустаяСсылка();
				
				ЦенаАкционная = QWERTY_Сервер.ПолучитьЦенуПоОтбору(СтруктураПараметровОтбора);
					
				Если ЦенаАкционная > 0 Тогда
					СтрокаТЧТовары.ВидЦены = СтруктураПараметровОтбора.ВидЦеныАкционная;
					СтрокаТЧТовары.Цена = ЦенаАкционная;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		

		Если ЗначениеЗаполнено(СтрокаТоваров.НоменклатураНабора) Тогда
			
			Набор = СтрокаТоваров.НоменклатураНабора;

			ВариантРасчетаЦены = QWERTY_Сервер.ПолучитьВариантРасчетаЦены(Набор);
			
			Если  ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
				// распределение не нужно, будет выполнено в процедуре обработки строки
			Иначе // цена задается на набор, нужно распределение
				
				ЦенаНабора			= QWERTY_Сервер.ПолучитьЦену(Набор, ВидЦены, ТекущаяДатаСеанса());
				ЦенаНабораАкционная	= QWERTY_Сервер.ПолучитьЦену(Набор, QWERTY_Сервер.ВидЦеныАкционная(), ТекущаяДатаСеанса());
				Если ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную Тогда
					ЦенаНабораАкционная = 0;
				КонецЕсли;
				Если ЦенаНабораАкционная > 0 Тогда
					ЦенаНабора = ЦенаНабораАкционная;
					СтрокаТЧТовары.ВидЦены = QWERTY_Сервер.ВидЦеныАкционная();
				КонецЕсли;
				
				ТЗ_Комплектующие = Комплектующие(Набор, ВидЦены);
				
				ОбщаяСтоимость = ТЗ_Комплектующие.Итог("Цена");
				
				Если  ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам Тогда
					Если ОбщаяСтоимость = 0 Тогда // 01.04.2026
						Продолжить;
					КонецЕсли;
					Для каждого Т Из ТЗ_Комплектующие Цикл
						ЦенаКомлектующейИсходная = Т.Цена;
						Если Т.Количество > 0 Тогда
							НоваяЦена = (ЦенаКомлектующейИсходная/Т.Количество / ОбщаяСтоимость) * ЦенаНабора;
						Иначе
							НоваяЦена = 0;
						КонецЕсли;
						НоваяЦена = Окр(НоваяЦена, 2);
						Т.ЦенаРасчетная = НоваяЦена;
						Т.СуммаРасчетная = НоваяЦена * Т.Количество;
					КонецЦикла;
				ИначеЕсли  ВариантРасчетаЦены = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям Тогда
					Для каждого Т Из ТЗ_Комплектующие Цикл
						НоваяЦена = (Т.ДоляСтоимости/100) * ЦенаНабора;
						НоваяЦена = Окр(НоваяЦена, 2);
						Т.ЦенаРасчетная = НоваяЦена;
						Т.СуммаРасчетная = НоваяЦена * Т.Количество;
					КонецЦикла;
				КонецЕсли;

				Погрешность = ЦенаНабора - ТЗ_Комплектующие.Итог("СуммаРасчетная");
				Если Погрешность > 0 Тогда
					ТЗ_Комплектующие.Сортировать("Количество");
					Если ТЗ_Комплектующие.Количество() > 0 Тогда
						ТЗ_Комплектующие[0].ЦенаРасчетная = ТЗ_Комплектующие[0].ЦенаРасчетная + Погрешность; 
					КонецЕсли;
				КонецЕсли;
				СтрНайдено = ТЗ_Комплектующие.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧТовары.Номенклатура));
				Если СтрНайдено.Количество() > 0 Тогда
					СтрокаТЧТовары.Цена = СтрНайдено[0].ЦенаРасчетная;
				КонецЕсли;				

			КонецЕсли; // вариант расчета цены
		КонецЕсли; // это элемент набора
		
		Если Объект.НеОтгружатьЧастями Тогда
			СтрокаТЧТовары.ДатаОтгрузки = Объект.ДатаОтгрузки;
		КонецЕсли;
		
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);

		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧТовары, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

Процедура ЗаполнитьНаборыКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ_Товары.Номенклатура КАК Номенклатура,
		|	ТЗ_Товары.НоменклатураНабора КАК НоменклатураНабора,
		|	ТЗ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТЗ_Товары.СуммаСНДС КАК СуммаСНДС
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(ВТ_Товары.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_Товары.СуммаСНДС) КАК Сумма,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВТ_Товары.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок) КАК КоличествоВНаборе,
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Наборы.Набор КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Сумма / (ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе)
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
		|		ПО ВТ_Наборы.ВариантКомплектации = ВТ_ВариантыКомплектации.ВариантКомплектации";
	
	Запрос.УстановитьПараметр("ТЗ_Товары", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();

	Наборы.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Наборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	НаборыКомплектыКоличество = Наборы.Количество();

КонецПроцедуры

// 18.03.2026 доработать функ. Комплектующие, добавить ДоляСтоимости
Функция Комплектующие(п_Набор, п_ВидЦены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК Цена,
		|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
		|	0 КАК ЦенаРасчетная,
		|	0 КАК СуммаРасчетная
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦены, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", п_Набор);
	Запрос.УстановитьПараметр("ВидЦены", п_ВидЦены);
	Запрос.УстановитьПараметр("ДатаЦены", НачалоДня(ТекущаяДатаСеанса()));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;

КонецФункции // ()

#КонецОбласти

#Область Дополнительно

Функция ЗаданиеНаПеревозку(п_ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПеревозку,
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", п_ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Рез = Новый Структура();
	Рез.Вставить("ЗаданиеНаПеревозку", "");
	Рез.Вставить("КлючСвязи", "");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()


Процедура АссортиментВыделитьЦветом()
	Для каждого Т Из Объект.Товары Цикл
		Т.АссортиментВыделитьЦветом = ОД_ОбщиеФункции.АссортиментВыделитьЦветом(Т.Номенклатура, Объект.Дата);
	КонецЦикла;
КонецПроцедуры

Функция ЕстьВСегменте(п_Сегмент, п_Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСегмента.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|ГДЕ
		|	НоменклатураСегмента.Сегмент = &Сегмент
		|	И НоменклатураСегмента.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Сегмент", п_Сегмент);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции // ()

#КонецОбласти