#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		СсылкаОбъекта = Неопределено;
		Если ДополнительныеСвойства.Свойство("СсылкаНового") Тогда
			СсылкаОбъекта = ДополнительныеСвойства.СсылкаНового;
			УстановитьСсылкуНового(СсылкаОбъекта);
		ИначеЕсли ЗначениеЗаполнено(Ссылка) Тогда
			СсылкаОбъекта = Ссылка;
		Иначе
			СсылкаОбъекта = Документы.ДокументКадровогоЭДО.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаОбъекта);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			Если ЗначениеЗаполнено(ИдентификаторЗаявкиКабинетСотрудника) Тогда
				ИдентификаторДокумента = ИдентификаторЗаявкиКабинетСотрудника;
			Иначе
				ИдентификаторДокумента = Строка(ЭлектронныйДокумент.УникальныйИдентификатор());
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если ПометкаУдаления И Не Пользователи.ЭтоПолноправныйПользователь(, , Ложь) Тогда
			Если Не ДополнительныеСвойства.Свойство("РазрешенаПометкаУдаления") Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Пометка на удаление объектов ""%1"" не предусмотрена'"),
					Метаданные().Синоним);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли