
&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Ремонт") Тогда
	
		Для каждого Т Из ДанныеЗаполнения.Запчасти Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
			НоваяСтрока.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
			НоваяСтрока.АналитикаРасходов = ДанныеЗаполнения.Партнер;
			Если ЗначениеЗаполнено(ДанныеЗаполнения.ПартнерОсуществляетРемонт) Тогда
				НоваяСтрока.АналитикаРасходов = ДанныеЗаполнения.ПартнерОсуществляетРемонт;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОснование	= ДанныеЗаполнения;
		Организация			= ДанныеЗаполнения.Организация;
		Склад				= ДанныеЗаполнения.ПриемкаВРемонт;
		Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);
		
		Если ДанныеЗаполнения.Запчасти.Количество() > 0 Тогда
			ТекСклад = ДанныеЗаполнения.Запчасти[0].Склад;
			Если ЗначениеЗаполнено(ТекСклад) Тогда
				Склад = ТекСклад;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
