
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформированныйДокумент = Неопределено;
	Попытка
		МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("Отчеты.ВизуализацияВходящихИзвещенийФНС");
		ДеревоЗагрузки = УведомлениеОСпецрежимахНалогообложения.СформироватьДеревоЗагрузки(Параметры.ПредставлениеXML);
		УзелКНД = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(ДеревоЗагрузки, "Файл/Документ/КНД", "ИмяЭлемента");
		
		Если УзелКНД.ЗначениеЭлемента = "1152006" Тогда 
			СформированныйДокумент = МодульМенеджера.Сформировать_СообщениеОбИсчисленнойСуммеТранспортногоНалога501(
				ДеревоЗагрузки, Параметры.Владелец);
		ИначеЕсли УзелКНД.ЗначениеЭлемента = "1153007" Тогда 
			СформированныйДокумент = МодульМенеджера.Сформировать_СообщениеОбИсчисленнойСуммеЗемельногоНалога501(
				ДеревоЗагрузки, Параметры.Владелец);
		ИначеЕсли УзелКНД.ЗначениеЭлемента = "1152029" Тогда 
			СформированныйДокумент = МодульМенеджера.Сформировать_СообщениеОбИсчисленныхСуммахНалогов501(
				ДеревоЗагрузки, Параметры.Владелец);
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать представление");
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(СформированныйДокумент) = Тип("ТабличныйДокумент") Тогда 
		СтруктураРеквизитовУведомления = Новый Структура("СписокПечатаемыхЛистов", Новый СписокЗначений);
		УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Неопределено,
			СтруктураРеквизитовУведомления.СписокПечатаемыхЛистов, СформированныйДокумент, 1, Ложь);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать представление");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ВладелецФормы, "Открыть", Ложь, СтруктураРеквизитовУведомления.СписокПечатаемыхЛистов);
	Отказ = Истина;
КонецПроцедуры
