#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаЭкспедиторскаяРасписка(
		Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет заполненность документа
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	// ПользовательПодписант
	СтатусДокументаоборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка);
	Если СтатусДокументаоборота = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеСостоянияДО("fr-сheck-forwarder")
		Или СтатусДокументаоборота = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеСостоянияДО("fr-сheck-cargo-owner") Тогда
		
		ПроверитьПодписанта(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПараметрыФормированияФайлов);
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументОбъектИлиСсылка.Ссылка);
		Если КрайнийФайл <> Неопределено И Не КрайнийФайл.ПодписьВерна Тогда
			
			ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПараметрыФормированияФайлов);
			
		КонецЕсли;
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда
		
		ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПараметрыФормированияФайлов);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

#Область ТекстовыеКонстанты

Функция ТекущаяВерсияСТД() Экспорт
	
	Возврат "kl_fr_05_01_02";
	
КонецФункции

Функция КНД() Экспорт
	
	Возврат "1110489";
	
КонецФункции

Функция НаимДок() Экспорт
	
	Возврат "электронная экспедиторская расписка";
	
КонецФункции

Функция СодОпер() Экспорт
	
	Возврат "груз принят во владение экспедитором";
	
КонецФункции

Функция ОбязЭксп() Экспорт
	
	Возврат "В соответствии с поручением экспедитора";
	
КонецФункции

Функция СпособДоставкиГруза() Экспорт
	
	Возврат "В соответствии с поручением экспедитора";
	
КонецФункции

Функция СостояниеГруза() Экспорт
	
	Возврат "Замечаний по грузу нет";
	
КонецФункции

#КонецОбласти

#Область НастройкиКонвертацииДокументов

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Клиент");
	МассивОбязательных.Добавить("Грузоотправитель");
	МассивОбязательных.Добавить("Экспедитор");
	МассивОбязательных.Добавить("ЭкспедицияДоговор");
	МассивОбязательных.Добавить("НомерДок");
	МассивОбязательных.Добавить("ДатаДок");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МассаБруттоКг");
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовПрототипа() Экспорт
	
	МассивОбязательных = Новый Массив();
	// если выяснятся обязательные для прототипа - укажем их здесь	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	МассивКлючевых.Добавить("ДатИнфЭксп");
	МассивКлючевых.Добавить("ВрИнфЭксп");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция МассивЭлементовНедоступныхДляИсправления() Экспорт
	
	Массив = Новый Массив;
	
	Возврат Массив;
	
КонецФункции

Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("КодТНВЭД");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("ОбъемКубМ");
	МассивОбязательных.Добавить("МассаПлановаяНеттоКг");
	МассивОбязательных.Добавить("КоличествоПаллет");
	МассивОбязательных.Добавить("ДопИнформация");
	МассивОбязательных.Добавить("ОбъявленнаяЦенность");
	МассивОбязательных.Добавить("ОбъявленнаяЦенностьВалюта");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("Плотность");
	МассивОбязательных.Добавить("УчетГрузаВГИС");
	МассивОбязательных.Добавить("ЗначениеМаркировки");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка",
		"МаркировкиМассив", "Маркировки", "Маркировка(и) товара", "МассивСтрок или Строка", 3));
	
	Возврат МассивДополнительных;
	
КонецФункции

#КонецОбласти

Функция ПолучитьДанныеДляМетрик(Документ) Экспорт
	
	Результат = Новый Структура("Переменные, Path_Category, Path_View");
	Результат.Path_Category = "Подписание и отправка ЭР";
	Результат.Path_View = "Документ.КонтурЛогистика_ЭкспедиторскаяРасписка.Форма.ФормаДокумента";
	
	Переменные = Новый Структура("BoxIdОтправителя", Документ.Экспедитор.ID);
	Результат.Переменные = Переменные;
	
	Возврат Результат;
	 	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗаполнения

Процедура ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПараметрыФормированияФайлов)
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	
	ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	ПроверитьЗаякиНаМаршрут(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Если Не ЗначениеЗаполнено(ДокументОбъектИлиСсылка.ОтправительШаблона) Тогда
		ПроверитьПодписанта(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПараметрыФормированияФайлов);
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьОтправителя(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
КонецПроцедуры

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
		
	Если Не Объект.Экспедитор.Экспедитор Тогда
		ТекстОшибки = "Для организации указанной экспедитором нужно включить роль Экспедитора";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"Экспедитор.Экспедитор", КатегорияОшибка, ТекстОшибки, "Указать");
	КонецЕсли;
	
	// Регистрационный номер записи в реестре уведомлений о транспортно-экспедиционной деятельности
	Если Не ЗначениеЗаполнено(Объект.Экспедитор.НомРеестр) Тогда
		ТекстОшибки = "Необходимо указать номер экспедитора в реестре";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"Экспедитор.НомРеестр", КатегорияОшибка, ТекстОшибки, "Указать");
	КонецЕсли;
	
	// Дата записи в реестре уведомлений о транспортно-экспедиционной деятельности
	Если Не ЗначениеЗаполнено(Объект.Экспедитор.ДатаРеестр) Тогда
		ТекстОшибки = "Необходимо указать дату регистрации экспедитора в реестре";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"Экспедитор.ДатаРеестр", КатегорияОшибка, ТекстОшибки, "Указать");
	КонецЕсли;
	
	// Фактическая дата получения груза экспедитором
	Если Не ЗначениеЗаполнено(Объект.ФДатПол) Тогда
		ТекстОшибки = "Необходимо указать фактическую дату получения груза экспедитором";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"ФДатПол", КатегорияОшибка, ТекстОшибки, "Указать");
	КонецЕсли;
	
	// Способ доставки груза (СпДостГруз)
	Если Не ЗначениеЗаполнено(Объект.СпособДоставкиГруза) Тогда
		ТекстОшибки = "Необходимо указать способ доставки груза";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"СпособДоставкиГруза", КатегорияОшибка, ТекстОшибки, "Заполнить");
	КонецЕсли;
	
	// Основание, по которому экономический субъект является лицом, осуществляющим прием
	// груза во владение от имени экспедитора (СвЛицПриемГр и ОснДовПриемГр)
	Если ЗначениеЗаполнено(Объект.ЛицоПриемки)
		И Не ЗначениеЗаполнено(Объект.ДоговорЛицаПриемки) Тогда
		
		ТекстОшибки = "Необходимо указать Документ дающий право на приемку";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"ДоговорЛицаПриемки", КатегорияОшибка, ТекстОшибки, "Заполнить");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Стоимость)
		И Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		ТекстОшибки = "Необходимо указать Валюту";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"Валюта", КатегорияОшибка, ТекстОшибки, "Заполнить");
	КонецЕсли;
	
	// Реквизиты документа, подтверждающего полномочия лица, производящего погрузку груза,
	// на проведение указанных действий (СвЛицПогрГр и РеквДокЛицо)
	Если Объект.ЛицоПогрузки = 2 И Не ЗначениеЗаполнено(Объект.ДоговорЛицаПогрузки) Тогда
		ТекстОшибки = "Необходимо указать Документ дающий право на погрузку ";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
			"ДоговорЛицаПогрузки", КатегорияОшибка, ТекстОшибки, "Заполнить");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.МестоПогрузки) Тогда
		ПроверитьАдресПунктаМаршрута(Объект.МестоПогрузки, "МестоПогрузки.АдресИнфАдрес", "места погрузки", ТаблицаОшибок);
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" Или Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			текКатегория = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
			
			ТекстОшибки = "Укажите " + СинонимРеквизита(ОбязательныйРевизит);
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "", "", ОбязательныйРевизит, текКатегория, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаякиНаМаршрут(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	Если Объект.ЗаявкиНаМаршрут.Количество() = 0 Тогда
		ТекстОшибки = "Необходимо указать хотя бы один маршрут";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
			ТаблицаОшибок,,,
			"МаршрутыИГрузы", КатегорияОшибка, ТекстОшибки, "Заполнить");
	КонецЕсли;
	
	Для Каждого ТекущаяСтрокаМаршрута Из Объект.ЗаявкиНаМаршрут Цикл
		
		// Валюта
		Если ЗначениеЗаполнено(ТекущаяСтрокаМаршрута.Стоимость)
			И Не ЗначениеЗаполнено(ТекущаяСтрокаМаршрута.Валюта) Тогда
			
			ТекстОшибки = "Необходимо указать валюту";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "МаршрутыИГрузы",,
				"Валюта", КатегорияОшибка, ТекстОшибки, "Заполнить",
				ТекущаяСтрокаМаршрута.ИдентификаторСтроки);
		КонецЕсли;
		
		// Признак перевозки (ПрзПрвз)
		Если Не ЗначениеЗаполнено(ТекущаяСтрокаМаршрута.ПризнакПеревозки) Тогда
			ТекстОшибки = "Укажите Признак перевозки по маршруту";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "МаршрутыИГрузы",,
				"Контейнеры", КатегорияОшибка, ТекстОшибки, "Заполнить",
				ТекущаяСтрокаМаршрута.ИдентификаторСтроки,, "Указать признак перевозки");
		КонецЕсли;
		
		// Сведения о контейнерах (ПрзПрвз и СвКонтейн)
		Если ТекущаяСтрокаМаршрута.ПризнакПеревозки = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.ПодачаПорожнегоКонтейнераГрузоотправителю
			Или ТекущаяСтрокаМаршрута.ПризнакПеревозки = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.ПриемКПеревозкеГруженогоКонтейнера Тогда
			
			ПроверитьКонтейнерыМаршрута(Объект, ТаблицаОшибок, КатегорияОшибка, ТекущаяСтрокаМаршрута);
		КонецЕсли;
		
		// Фактическое состояние груза при приеме груза экспедитором (ФСостГруз)
		Если Не ЗначениеЗаполнено(ТекущаяСтрокаМаршрута.СостояниеГруза) Тогда
			ТекстОшибки = "Необходимо указать фактическое состояние груза при приеме груза экспедитором";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "МаршрутыИГрузы",,
				"СведенияОМаршруте_СостояниеГруза", КатегорияОшибка, ТекстОшибки, "Заполнить",
				ТекущаяСтрокаМаршрута.ИдентификаторСтроки);
		КонецЕсли;
		
		// Обязательства экспедитора (ОбязЭксп)
		ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ТекущаяСтрокаМаршрута.ИдентификаторСтроки);
		НайденныеОбязательстваЭкспедитора = Объект.ОбязательстваЭкспедитора.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеОбязательстваЭкспедитора.Количество() = 0 Тогда
			ТекстОшибки = "Необходимо указать Обязательства экспедитора";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "МаршрутыИГрузы",,
				"СведенияОМаршруте_ОбязательстваЭкспедитора_0", КатегорияОшибка, ТекстОшибки, "Заполнить",
				ТекущаяСтрокаМаршрута.ИдентификаторСтроки);
		КонецЕсли;
		
		// Проверим товары маршрута
		ПроверитьТовары(Объект, ТаблицаОшибок, ТекущаяСтрокаМаршрута.ИдентификаторСтроки, ТекущаяСтрокаМаршрута.ЗаявкаНаМаршрут);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьТовары(Знач Объект, ТаблицаОшибок, ИдентификаторСтрокиЗаявкиНаМаршрут, ЗаявкаНаМаршрут)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "МаршрутыИГрузы";
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстОшибки = "Нет ни одного груза для маршрута: " + ЗаявкаНаМаршрут;
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
			ТаблицаОшибок, "", "", "", КатегорияОшибка, ТекстОшибки, "Добавить груз");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовара Из НайденныеСтроки Цикл
		
		// Наименование груза (НаимГруз)
		Если Не ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Отгрузочное наименование по грузу";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать отгрузочное наименование");
		КонецЕсли;
		
		// Количество грузовых мест (КолМестГр)
		Если Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) Тогда
			ТекстОшибки = "Укажите Количество мест по грузу";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать кол-во мест");
		КонецЕсли;
		
		// Особые отметки (Отмет)
		Если Не ЗначениеЗаполнено(СтрокаТовара.ОсобыеОтметки) Тогда
			ТекстОшибки = "Укажите Особые отметки по грузу";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"СведенияПоТовару_ОсобыеОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать особые отметки");
		КонецЕсли;
		
		// Сведения о стране происхождения груза (СвСтрПроисх)
		ПроверитьСтрануПроисхождения(Объект, ТаблицаОшибок, КатегорияОшибка, ИмяТЧ, СтрокаТовара);
		
		// Вес груза (МассаБруттоКг)
		Если Не ЗначениеЗаполнено(СтрокаТовара.МассаБруттоКг) Тогда
			ТекстОшибки = "Укажите Массу (брутто) груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"МассаБруттоКг", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать массу брутто");
		КонецЕсли;
		
		// Вес груза (МассаНеттоКг)
		Если Не ЗначениеЗаполнено(СтрокаТовара.МассаНеттоКг) Тогда
			ТекстОшибки = "Укажите Массу (нетто) груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"МассаНеттоКг", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать массу нетто");
		КонецЕсли;
		
		// Код товарной номенклатуры (КодТовНом)
		Если Не ЗначениеЗаполнено(СтрокаТовара.КодТНВЭД) Тогда
			ТекстОшибки = "Укажите ТН ВЭД груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"СведенияПоТовару_КодТНВЭД", КатегорияПредупреждение, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать ТН ВЭД");
		КонецЕсли;
		
		// Валюта
		Если ЗначениеЗаполнено(СтрокаТовара.Стоимость)
			И Не ЗначениеЗаполнено(СтрокаТовара.Валюта) Тогда
			
			ТекстОшибки = "Укажите Валюту груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ,,
				"Валюта", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать валюту");
		КонецЕсли;
		
		// Подлежит учету в государственной информационной системе (УчГосСист и СвГосСист)
		Если СтрокаТовара.ПодлежитУчетуВГосСист Тогда
			ПроверитьГосСисТовара(Объект, ТаблицаОшибок, КатегорияОшибка, ИмяТЧ, СтрокаТовара);
		КонецЕсли;
		
		// Информация об упаковке груза (ИнфУпГруз)
		ПроверитьУпаковкиТовара(Объект, ТаблицаОшибок, КатегорияОшибка, ИмяТЧ, СтрокаТовара);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСтрануПроисхождения(Знач Объект, ТаблицаОшибок, КатегорияОшибка, ИмяТЧ, СтрокаТовара)
	
	ОтборСтранСтроки = Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки);
	СтранаЗаполнена = Ложь;
	Для Каждого СтрокаСтраны Из Объект.СтраныПроисхожденияПродукции.НайтиСтроки(ОтборСтранСтроки) Цикл
		
		Если ЗначениеЗаполнено(СтрокаСтраны.Страна) Тогда
			СтранаЗаполнена = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не СтранаЗаполнена Тогда
		ТекстОшибки = "Укажите Сведения о стране происхождения груза";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
			ТаблицаОшибок, ИмяТЧ,,
			"СведенияПоТовару_СтранаПроисхождения", КатегорияОшибка, ТекстОшибки, "Заполнить",
			СтрокаТовара.ИдентификаторСтроки,, "Указать сведения о стране происхождения груза");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьГосСисТовара(Знач Объект, ТаблицаОшибок, КатегорияОшибка, ИмяТЧ, СтрокаТовара)
	
	ИмяТЧГосСист = "СведенияГосСистем_";
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки);
	СведенияГосСистем = Объект.СведенияГосСистем.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого ТекущаяСтрока Из СведенияГосСистем Цикл
		
		// Наименование государственной системы (НаимГосСист)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.НаимГосСист) Тогда
			ТекстОшибки = "Укажите Наименование государственной системы";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧГосСист + "НаимГосСист", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
		// Наименование государственной системы: иное (НаимГосСистИное)
		Если ТекущаяСтрока.НаимГосСист = Перечисления.КонтурЛогистика_НаименованиеГИСа.Иное
			И Не ЗначениеЗаполнено(ТекущаяСтрока.НаимГосСистИное) Тогда
			
			ТекстОшибки = "Укажите Наименование государственной системы";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧГосСист + "НаимГосСистИное", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
		// Идентификационный номер учетной единицы в государственной системе (ИдНомУчетЕд)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИдНомУчетЕд) Тогда
			ТекстОшибки = "Укажите Идентификационный номер";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧГосСист + "ИдНомУчетЕд", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКонтейнерыМаршрута(Знач Объект, ТаблицаОшибок, КатегорияОшибка, ТекущаяСтрокаМаршрута)
	
	ЕстьОшибки = Ложь;
	ТекстОшибки = "Укажите сведения о контейнерах";
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗаявкиНаМаршрут", ТекущаяСтрокаМаршрута.ИдентификаторСтроки);
	СведенияОКонтейнерах = Объект.СведенияОКонтейнерах.НайтиСтроки(ПараметрыОтбора);
	
	Если СведенияОКонтейнерах.Количество() = 0 Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из СведенияОКонтейнерах Цикл
		
		// Порядковый номер контейнера (НомКонтейн)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номер) Тогда
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;
		
		// ISO контейнера
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИСО)
			И СтрДлина(ТекущаяСтрока.ИСО) <> 4 Тогда
			
			ЕстьОшибки = Истина;
			ТекстОшибки = "ISO контейнера должен быть длиной 4";
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
			ТаблицаОшибок, "МаршрутыИГрузы",,
			"Контейнеры", КатегорияОшибка, ТекстОшибки, "Заполнить",
			ТекущаяСтрокаМаршрута.ИдентификаторСтроки,, "Указать");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУпаковкиТовара(Знач Объект, ТаблицаОшибок, КатегорияОшибка, ИмяТЧ, СтрокаТовара)
	
	ИмяТЧУпак = "ИнфУпГруз_";
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки);
	УпаковкиТовара = Объект.ИнфУпГруз.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого ТекущаяСтрока Из УпаковкиТовара Цикл
		
		// Вид упаковки (ВидУпак)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидУпак) Тогда
			ТекстОшибки = "Укажите Вид упаковки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧУпак + "ВидУпак", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
		// Вес упаковки, в килограммах (ВесУпак)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВесУпак) Тогда
			ТекстОшибки = "Укажите Вес упаковки, в килограмма";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧУпак + "ВесУпак", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
		// Высота, в метрах (ВесУпак)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВысЗнач) Тогда
			ТекстОшибки = "Укажите Высота, в метрах";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧУпак + "ВысЗнач", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
		// Длина, в метрах (ДлЗнач)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДлЗнач) Тогда
			ТекстОшибки = "Укажите Длина, в метрах";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧУпак + "ДлЗнач", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
		// Ширина, в метрах (ШирЗнач)
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ШирЗнач) Тогда
			ТекстОшибки = "Укажите Ширина, в метрах";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, ИмяТЧ, ТекущаяСтрока.НомерСтроки,
				ИмяТЧУпак + "ШирЗнач", КатегорияОшибка, ТекстОшибки, "Заполнить",
				СтрокаТовара.ИдентификаторСтроки,, "Указать");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт
	
	Попытка
		Возврат Метаданные.Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.Реквизиты[ИмяРеквизита].Синоним;
	Исключение
		Возврат ИмяРеквизита;
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьПодписанта(ДокументОбъектИлиСсылка, ТаблицаОшибок, ПараметрыФормированияФайлов)
	
	Если ЗначениеЗаполнено(ДокументОбъектИлиСсылка.ПользовательПодписант) Тогда
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	Иначе
		
		ТекстОшибки = "Укажите пользователя подписанта документа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
			ТаблицаОшибок, "", "", "ПользовательПодписант", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка,
			ТекстОшибки, "Указать");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьАдресПунктаМаршрута(ПунктМаршрута, ИмяПоля, ПредставленияОбъекта, ТаблицаОшибок)
	
	ТекстОшибки = "Укажите адрес " + ПредставленияОбъекта + " в его карточке";
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьАдресПунктаМаршрута(
		ПунктМаршрута, ТаблицаОшибок, ИмяПоля, ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли