#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоЗаявкеНаМршрут(ДокументЗаявкаНаМаршрут) Экспорт
	
	// Строка маршрута
	НоваяСтрокаЗаявки = ЗаявкиНаМаршрут.Добавить();
	НоваяСтрокаЗаявки.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	НоваяСтрокаЗаявки.ЗаявкаНаМаршрут = ДокументЗаявкаНаМаршрут;
	НоваяСтрокаЗаявки.Номер = ДокументЗаявкаНаМаршрут.НомПарт;
	НоваяСтрокаЗаявки.Идентификатор = ДокументЗаявкаНаМаршрут.ИдПарт;
	НоваяСтрокаЗаявки.КоличествоМест = ДокументЗаявкаНаМаршрут.КолМестПарт;
	
	НоваяСтрокаЗаявки.МассаБруттоКг = ДокументЗаявкаНаМаршрут.МассаБруттоКг;
	НоваяСтрокаЗаявки.МассаНеттоКг = ДокументЗаявкаНаМаршрут.МассаНеттоКг;
	
	НоваяСтрокаЗаявки.ТипСтоимости = ДокументЗаявкаНаМаршрут.ТипСтоимости;
	НоваяСтрокаЗаявки.Стоимость = ДокументЗаявкаНаМаршрут.СтоимостьГруза;
	НоваяСтрокаЗаявки.Валюта = ДокументЗаявкаНаМаршрут.ВалютаУчетаГруза;
	
	НоваяСтрокаЗаявки.СостояниеГруза = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.СостояниеГруза();
	
	НоваяСтрокаЗаявки.ПризнакПеревозки = ДокументЗаявкаНаМаршрут.ПрзПрвз;
	Если Не ЗначениеЗаполнено(НоваяСтрокаЗаявки.ПризнакПеревозки) Тогда
		НоваяСтрокаЗаявки.ПризнакПеревозки = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.НетКонтейнера;
	КонецЕсли;
	
	// Сведения о контейнерах
	Для Каждого ТекущаяСтрока Из ДокументЗаявкаНаМаршрут.СведенияОКонтейнерах Цикл
		НоваяСтрокаКонтейнера = СведенияОКонтейнерах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаКонтейнера, ТекущаяСтрока);
		НоваяСтрокаКонтейнера.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяСтрокаЗаявки.ИдентификаторСтроки;
	КонецЦикла;
	
	// Товары
	ЗаполнитьТабличнуюЧастьЭРПоСвГруз(ДокументЗаявкаНаМаршрут, НоваяСтрокаЗаявки);
	
	// Итоги
	МассаБруттоКг = Товары.Итог("МассаБруттоКг");
	МассаНеттоКг = Товары.Итог("МассаНеттоКг");
	КоличествоМест = Товары.Итог("КоличествоМест");
	ТипСтоимости = НоваяСтрокаЗаявки.ТипСтоимости;
	Стоимость = Товары.Итог("Стоимость");
	Валюта = НоваяСтрокаЗаявки.Валюта;
	
	// Обязательства экспедитора
	НовоеОбязательство = ОбязательстваЭкспедитора.Добавить();
	НовоеОбязательство.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяСтрокаЗаявки.ИдентификаторСтроки;
	НовоеОбязательство.ОбязЭксп = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.ОбязЭксп();
	
	// Реквизиты заказа на поставку
	Для Каждого ТекущаяСтрока Из ДокументЗаявкаНаМаршрут.РеквЗакПост Цикл
		НоваяСтрокаРеквизитов = РеквЗакПост.Добавить();
		НоваяСтрокаРеквизитов.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяСтрокаЗаявки.ИдентификаторСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизитов, ТекущаяСтрока);
	КонецЦикла;
	
	// Сопр док парт
	Для Каждого ТекущаяСтрока Из ДокументЗаявкаНаМаршрут.РеквЗакПост Цикл
		НоваяСтрокаСопрДок = СопрДокПарт.Добавить();
		НоваяСтрокаСопрДок.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяСтрокаЗаявки.ИдентификаторСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСопрДок, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет табличную часть Товары данными из документа КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут, 
// включая табличные части упаковки, контейнеров и государственных систем
//
Процедура ЗаполнитьТабличнуюЧастьЭРПоСвГруз(ДокументСсылка, СтрокаЗаявки) Экспорт
	
	КопируемыеРеквизитыСтрокиТовара = "Номенклатура, Характеристика, Количество, УпаковкаЕдиницаИзмерения, Учитывать,
		|ОтгрузочноеНаименование, КоличествоМест, ОбъемКубМ, ПрзИзъятВещ, ТипСтоимости, КодТНВЭД, МассаБруттоКг, МассаНеттоКг";
	
	Для Каждого ТекущийТовар Из ДокументСсылка.Товары Цикл
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		НоваяСтрокаТовара.ИдентификаторСтрокиЗаявкиНаМаршрут = СтрокаЗаявки.ИдентификаторСтроки;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, ТекущийТовар, КопируемыеРеквизитыСтрокиТовара);
		
		НоваяСтрокаТовара.ОписаниеОпасногоГруза = ТекущийТовар.СвОпаснГруз;
		НоваяСтрокаТовара.ПодлежитУчетуВГосСист = ТекущийТовар.УчГосСист;
		
		НоваяСтрокаТовара.Стоимость = ТекущийТовар.СтоимостьГруза;
		НоваяСтрокаТовара.Валюта = ТекущийТовар.ВалютаУчетаГруза;
		
		НоваяСтрокаТовара.ОсобыеОтметки = "Отсутствует";
		
		// Сведения гос систем
		СкопироватьТаблицу("СведенияГосСистем", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		
		// Маркировка
		СкопироватьТаблицу("Марк", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		
		// Информация об упаковке груза
		СкопироватьТаблицу("ИнфУпГруз", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		
		// Страны происхождения продукции
		СкопироватьТаблицу("СтраныПроисхожденияПродукции", НоваяСтрокаТовара.ИдентификаторСтроки,
			ТекущийТовар.ИдентификаторСтроки, ДокументСсылка);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СтрокаЗаявки.ТипСтоимости) Тогда
		
		// Установим тип стоимости и валюту для маршрута, если одно значение в ТЧ
		ТипыСтоимости = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(Товары.Выгрузить().ВыгрузитьКолонку("ТипСтоимости"));
		Если ТипыСтоимости.Количество() = 1 Тогда
			СтрокаЗаявки.ТипСтоимости = ТипыСтоимости[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаЗаявки.Валюта) Тогда
		
		// Установим тип стоимости и валюту для маршрута, если одно значение в ТЧ
		Валюты = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(Товары.Выгрузить().ВыгрузитьКолонку("Валюта"));
		Если Валюты.Количество() = 1 Тогда
			СтрокаЗаявки.Валюта = Валюты[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Из документа учетной системы
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		
	// Загружен из сервиса, создаем из файла обмена
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	// Из документа ЭТрН Т1
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1") Тогда
		
		ЗаполнитьПоДокументуТрНТитул1(ДанныеЗаполнения);
		
	// Из поручения экспедитору
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул2") Тогда
		
		ЗаполнитьПоДокументуПоручениеЭкспедитору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И (ТипЗнч(ДанныеЗаполнения.ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1")
			Или ТипЗнч(ДанныеЗаполнения.ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул2")) Тогда
		
		ЗаполнитьПоДокументуПоручениеЭкспедитору(ДанныеЗаполнения.ПредыдущийТитул);
		
	// Из мастера по массиву маршрутов
	ИначеЕсли ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Массив")
		И ДанныеЗаполнения.Количество() <> 0 Тогда
		
		ПЭ_Титул1 = ДанныеЗаполнения[0].Титул1;
		ЗаполнитьПоМассивуМаршрутов(ДанныеЗаполнения);
		
	// Копирование
	ИначеЕсли ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Титул")
		И ДанныеЗаполнения.Свойство("Скопировать")
		И ДанныеЗаполнения.Скопировать Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Титул);
		Для Каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл
			Для Каждого Стр Из ДанныеЗаполнения.Титул[ТЧ.Имя] Цикл
				НоваяСтрока = ЭтотОбъект[ТЧ.Имя].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			КонецЦикла;
		КонецЦикла;
		
		Номер = "";
		Дата = ТекущаяДатаСеанса();
		ДатаДок = ТекущаяДатаСеанса();
		КонтурЛогистика_ОбработкаДокументовСервер.ДобавитьНомерКопииКНомеруДокумента(НомерДок, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка);
	
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоПользователю();
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ЭкспедиторскаяРасписка_ОбработкаЗаполнения_После", Истина, ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	УИД_ЭкспР = "";
	kl_id = "";
	ДатИнфЭксп = Неопределено;
	ВрИнфЭксп = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ЭкспедиторскаяРасписка_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				Экспедитор,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуПоручениеЭкспедитору(ДокументСсылка)
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЭ_Титул1") Тогда
		ПЭ_Титул1 = ДокументСсылка;
	Иначе
		ПЭ_Титул1 = ДокументСсылка.Титул1;
	КонецЕсли;
	
	Запрос = Документы.КонтурЛогистика_ПЭ_Титул1.ПолучитьЗапросСпискаДокументовМаршрута(ПЭ_Титул1);
	Маршруты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если Маршруты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоМассивуМаршрутов(Маршруты);
	
КонецПроцедуры

Процедура ЗаполнитьПоМассивуМаршрутов(Маршруты)
	
	ПерваяЗаявкаНаМаршрут = Маршруты[0];
	
	// Основные реквизиты
	НомерДок = ПЭ_Титул1.НомДок;
	ДатаДок = ПЭ_Титул1.ДатаДок;
	Клиент = ПЭ_Титул1.СвКлиент;
	Экспедитор = ПЭ_Титул1.СвЭксп;
	ЭкспедицияДоговор = ПЭ_Титул1.ДогТрЭксп;
	
	Грузоотправитель = ПерваяЗаявкаНаМаршрут.СвГО;
	МестоПогрузки = ПерваяЗаявкаНаМаршрут.АдрГруз;
	ФДатПол = ПерваяЗаявкаНаМаршрут.ДатОтгрС;
	ФВрПол = ПерваяЗаявкаНаМаршрут.ВрОтгрС;
	
	СпособДоставкиГруза = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.СпособДоставкиГруза();
	
	ПользовательПодписант = ПЭ_Титул1.ПользовательПодписант;
	ПараметрНастроекПодписания = ПЭ_Титул1.ПараметрНастроекПодписания;
	
	Для Каждого ЗаявкаНаМаршрут Из Маршруты Цикл
		ЗаполнитьПоЗаявкеНаМршрут(ЗаявкаНаМаршрут);
	КонецЦикла;
	
	// Сопр док
	Для Каждого ТекущаяСтрока Из ПЭ_Титул1.СопрДок Цикл
		НоваяСтрокаСопрДок = СопрДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСопрДок, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьТаблицу(ТаблицаКопирования, ИдентификаторСтрокиТоваров, ИдентификаторСтрокиГруза, ДокументСсылка)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиТоваров", ИдентификаторСтрокиГруза);
	
	Строки = ДокументСсылка[ТаблицаКопирования].НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаКопирования Из Строки Цикл
		
		СтрокаПриемник = ЭтотОбъект[ТаблицаКопирования].Добавить();
		СтрокаПриемник.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаКопирования,, "ИдентификаторСтрокиТоваров");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	Разделитель = Неопределено;
	
	ДанныеЗаполнения.Свойство("Разделитель", Разделитель);
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ДанныеЗаполнения.ТипЛогистика, ДанныеЗаполнения.ДокументОснование);
	
	Если КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации Тогда
		Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(
			ЭтотОбъект, ДокументОснование, КонтекстНастройкиКонвертации.НастройкаКонвертации, "");
	Иначе
		Переменные = Неопределено;
	КонецЕсли;
	
	// Заполнить ЭтотТитул
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
	//Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда
	//	КоличествоМест = 0;
	//	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Учитывать", Истина));
	//	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
	//		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
	//	КонецЦикла;
	//КонецЕсли;
	//Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда
	//	МассаБруттоКг = 0;
	//	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Учитывать", Истина));
	//	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
	//		МассаБруттоКг = МассаБруттоКг + ТекущаяСтрока.МассаБруттоКг;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуТрНТитул1(ТрН_Титул1)
	
	РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(ТрН_Титул1.ДокументЭТРН,
		"УИД, НомерТрН, ДатаТрН, Грузоотправитель, ЭкспедицияЗаказчик, Грузоотправитель");
	
	НомерДок = РеквизитыЭТРН.НомерТрН;
	ДатаДок = РеквизитыЭТРН.ДатаТрН;
	
	ОтправительШаблона = РеквизитыЭТРН.ЭкспедицияЗаказчик;
	Грузоотправитель = РеквизитыЭТРН.ЭкспедицияЗаказчик;
	Клиент = РеквизитыЭТРН.ЭкспедицияЗаказчик;
	Экспедитор = РеквизитыЭТРН.Грузоотправитель;
	
	КоличествоМест = ТрН_Титул1.КоличествоМест;
	МассаБруттоКг = ТрН_Титул1.МассаБруттоКг;
	
	Для Каждого ТекущаяСтрока Из ТрН_Титул1.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ТрН_Титул1.ИнфПол Цикл
		НоваяСтрока = ИнфПол.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	// Для связи документов
	Если ЗначениеЗаполнено(РеквизитыЭТРН.УИД) Тогда
		НоваяСтрока = ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "ЭТрН_УИД";
		НоваяСтрока.Значение = РеквизитыЭТРН.УИД;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыЭТРН.НомерТрН) Тогда
		НоваяСтрока = ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "ЭТрН_Номер";
		НоваяСтрока.Значение = РеквизитыЭТРН.НомерТрН;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыЭТРН.ДатаТрН) Тогда
		НоваяСтрока = ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "ЭТрН_Дата";
		НоваяСтрока.Значение = РеквизитыЭТРН.ДатаТрН;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	Перем СодИнфЭксп;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
	Если XDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыУчастниковЭДО = КС.ИдентификаторыСторонИзИмениФайлаТитула(
		ФайлСсылка.ИмяФайла, КС.XDTO_ПолучитьЗначениеСвойства(XDTO, "ИдФайл"));
	
	ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодИнфЭксп, ИдентификаторыУчастниковЭДО);
	
	ЗаполнитьЗаявкиНаМаршрутИзXDTO(СодИнфЭксп);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, СодИнфЭксп, ИдентификаторыУчастниковЭДО)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	ТипДокументооборота = "__ForwardingReceipt";
	
	// Электронная экспедиторская расписка, информация экспедитора (Документ)
	ЭлДокумент = КС.XDTO_Вычислить(XDTO, "Документ");
	Если ЭлДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДатИнфЭксп = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(ЭлДокумент, "ДатИнфЭксп"));
	ВрИнфЭксп = КС.Конвертировать_ВремяТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(ЭлДокумент, "ВрИнфЭксп"));
	
	// Содержание электронной экспедиторской расписки, информация экспедитора (СодИнфЭксп)
	СодИнфЭксп = КС.XDTO_Вычислить(ЭлДокумент, "СодИнфЭксп");
	Если СодИнфЭксп = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УИД_ЭкспР_raw = КС.XDTO_Вычислить(СодИнфЭксп, "УИД_ЭкспР");
	Если ЗначениеЗаполнено(УИД_ЭкспР_raw) Тогда
		УИД_ЭкспР = УИД_ЭкспР_raw;
	КонецЕсли;
	
	НомерДок = КС.XDTO_Вычислить(СодИнфЭксп, "НомДок");
	ДатаДок = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "ДатаДок"));
	
	ФДатПол = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "ФДатПол"));
	ФВрПол = КС.Конвертировать_ВремяТип_вДата(КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "ФВрПол"));
	
	КоличествоМест = КС.XDTO_Вычислить(СодИнфЭксп, "КолМестГрВсего");
	
	// Итоговая стоимость
	ЗаполнитьСтоимость(СодИнфЭксп, ЭтотОбъект, "Общая");
	
	// Адрес приема груза (МестоПогрузки)
	XDTO_АдресПользТип = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "АдрПриемГруз");
	Если XDTO_АдресПользТип <> Неопределено Тогда 
		XDTO_АдресТип = КС.XDTO_ПолучитьЗначениеСвойства(XDTO_АдресПользТип, "Адрес");
		XDTO_ВладИнфр = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "ВладИнфр");
		Если XDTO_АдресТип <> Неопределено Тогда 
			МестоПогрузки = КС.Конвертировать_АдресТип_вПунктМаршрутаЛогистика(XDTO_АдресТип,,, XDTO_ВладИнфр);
		КонецЕсли;
	КонецЕсли;
	// Сведения о сторонах
	СвКлнт = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СвКлнт");
	Клиент = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		СвКлнт, ИдентификаторыУчастниковЭДО.Клиент, Истина);
	
	СвЭксп = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СвЭксп");
	Экспедитор = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		СвЭксп, ИдентификаторыУчастниковЭДО.Экспедитор, Истина);
	
	СвГО = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СвГО");
	Грузоотправитель = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(СвГО);
	
	// Реквизиты договора транспортной экспедиции
	ДогТрЭксп = КС.XDTO_Вычислить(СодИнфЭксп, "ДогТрЭксп");
	ЭкспедицияДоговор = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ДогТрЭксп, "Рекв");
	
	// Сопроводительные документы
	СопрДок.Очистить();
	КС.ЗаполнитьРеквДокТип(СодИнфЭксп, "СопрДок", ЭтотОбъект);
	
	// Общий вес груза
	ВесГрВсего = КС.XDTO_Вычислить(СодИнфЭксп, "ВесГрВсего");
	МассаБруттоКг = КС.XDTO_ВычислитьЧисло(ВесГрВсего, "ВесБрутто");
	МассаНеттоКг = КС.XDTO_ВычислитьЧисло(ВесГрВсего, "ВесНетто");
	
	// Лицо приемки груза - Лицо
	СвЛицПриемГр = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфЭксп, "СвЛицПриемГр");
	ЛицоПриемки = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(СвЛицПриемГр);
	
	// Лицо приемки груза - Договор
	ОснДовПриемГр = КС.XDTO_Вычислить(СодИнфЭксп, "ОснДовПриемГр");
	ДоговорЛицаПриемки = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ОснДовПриемГр, "Рекв");
	
	// Лицо погрузки груза
	ЛицоПогрузки = КС.XDTO_ВычислитьЧисло(СодИнфЭксп, "СвЛицПогрГр.ЛицоПогруз");
	Если ЛицоПогрузки = 2 Тогда
		РеквДокЛицо = КС.XDTO_Вычислить(СодИнфЭксп, "СвЛицПогрГр.РеквДокЛицо");
		ДоговорЛицаПогрузки = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(РеквДокЛицо, "Рекв");
	КонецЕсли;
	
	// Информационные поля
	КС.ЗаполнитьИнфПолИзXDTO(СодИнфЭксп, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьЗаявкиНаМаршрутИзXDTO(Знач СодИнфЭксп)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ЗаявкиНаМаршрут.Очистить();
	РеквЗакПост.Очистить();
	СопрДокПарт.Очистить();
	ОбязательстваЭкспедитора.Очистить();
	
	Товары.Очистить();
	СведенияГосСистем.Очистить();
	ИнфУпГруз.Очистить();
	СведенияОКонтейнерах.Очистить();
	Марк.Очистить();
	СтраныПроисхожденияПродукции.Очистить();
	
	СвГруз = КС.XDTO_Вычислить(СодИнфЭксп, "СвГруз");
	СвГрузов = КС.XDTO_ВычислитьМассивXDTO(СвГруз);
	
	Для Каждого ТекущаяСтрока Из СвГрузов Цикл
		
		НоваяЗаякаНаМаршрут = ЗаявкиНаМаршрут.Добавить();
		НоваяЗаякаНаМаршрут.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяЗаякаНаМаршрут.Номер = КС.XDTO_Вычислить(ТекущаяСтрока, "НомПартГруз");
		НоваяЗаякаНаМаршрут.Идентификатор = КС.XDTO_Вычислить(ТекущаяСтрока, "ИдентПартГруз");
		НоваяЗаякаНаМаршрут.КоличествоМест = КС.XDTO_ВычислитьЧисло(ТекущаяСтрока, "КолМестПарт");
		
		// Стоимость груза
		ЗаполнитьСтоимость(ТекущаяСтрока, НоваяЗаякаНаМаршрут, "Партия");
		
		// Признак перевозки
		ПрзПрвз = КС.XDTO_Вычислить(ТекущаяСтрока, "ПрзПрвз");
		НоваяЗаякаНаМаршрут.ПризнакПеревозки = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.Десериализовать(ПрзПрвз);
		
		// Сведения о контейнерах
		ЗаполнитьСведенияОКонтейнерах(НоваяЗаякаНаМаршрут.ИдентификаторСтроки, ТекущаяСтрока);
		
		// Вес партии груза
		ВесГрузПарт = КС.XDTO_Вычислить(ТекущаяСтрока, "ВесГрузПарт");
		Если ВесГрузПарт <> Неопределено Тогда
			НоваяЗаякаНаМаршрут.МассаБруттоКг = КС.XDTO_ВычислитьЧисло(ВесГрузПарт, "ВесБрутто");
			НоваяЗаякаНаМаршрут.МассаНеттоКг = КС.XDTO_ВычислитьЧисло(ВесГрузПарт, "ВесНетто");
		КонецЕсли;
		
		// Условия приема груза экспедитором
		УслПрием_raw = КС.XDTO_Вычислить(ТекущаяСтрока, "УслПрием");
		Если УслПрием_raw <> Неопределено Тогда
			НоваяЗаякаНаМаршрут.СостояниеГруза = КС.XDTO_Вычислить(УслПрием_raw, "ФСостГруз");
			НоваяЗаякаНаМаршрут.СостояниеТары = КС.XDTO_Вычислить(УслПрием_raw, "ФСостТар");
			НоваяЗаякаНаМаршрут.СостояниеУпаковки = КС.XDTO_Вычислить(УслПрием_raw, "ФСостУп");
			НоваяЗаякаНаМаршрут.СостояниеМаркировки = КС.XDTO_Вычислить(УслПрием_raw, "ФСостМарк");
			НоваяЗаякаНаМаршрут.СостояниеОпломбирования = КС.XDTO_Вычислить(УслПрием_raw, "ФСостПломб");
			
			ОбязЭксп = КС.XDTO_Вычислить(УслПрием_raw, "ОбязЭксп");
			Если ОбязЭксп <> Неопределено Тогда
				Для Каждого ТекущееОбязательство Из КС.XDTO_ВычислитьМассивXDTO(ОбязЭксп) Цикл
					НовоеОбязательство = ОбязательстваЭкспедитора.Добавить();
					НовоеОбязательство.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяЗаякаНаМаршрут.ИдентификаторСтроки;
					НовоеОбязательство.ОбязЭксп = ТекущееОбязательство;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// Реквизиты заказа на поставку
		РеквЗаказПост_raw = КС.XDTO_Вычислить(ТекущаяСтрока, "РеквЗаказПост");
		Если РеквЗаказПост_raw <> Неопределено Тогда
			Для Каждого ТекущийРеквизит Из КС.XDTO_ВычислитьМассивXDTO(РеквЗаказПост_raw) Цикл
				СтрокаДатаТип = КС.XDTO_ПолучитьЗначениеСвойства(ТекущийРеквизит, "РеквДатаДок");
				
				НовыйРеквизитЗаказа = РеквЗакПост.Добавить();
				НовыйРеквизитЗаказа.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяЗаякаНаМаршрут.ИдентификаторСтроки;
				НовыйРеквизитЗаказа.РеквНаимДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНаимДок");
				НовыйРеквизитЗаказа.РеквНомерДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНомерДок");
				НовыйРеквизитЗаказа.РеквДатаДок = КС.Конвертировать_ДатаТип_вДата(СтрокаДатаТип);
			КонецЦикла;
		КонецЕсли;
		
		// Сведения о сопроводительных документах на партию груза
		СопрДокПарт_raw = КС.XDTO_Вычислить(ТекущаяСтрока, "СопрДокПарт");
		Если СопрДокПарт_raw <> Неопределено Тогда
			Для Каждого ТекущийРеквизит Из КС.XDTO_ВычислитьМассивXDTO(СопрДокПарт_raw) Цикл
				СтрокаДатаТип = КС.XDTO_ПолучитьЗначениеСвойства(ТекущийРеквизит, "РеквДатаДок");
				
				НовыйРеквизитЗаказа = СопрДокПарт.Добавить();
				НовыйРеквизитЗаказа.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяЗаякаНаМаршрут.ИдентификаторСтроки;
				НовыйРеквизитЗаказа.РеквНаимДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНаимДок");
				НовыйРеквизитЗаказа.РеквНомерДок = КС.XDTO_Вычислить(ТекущийРеквизит, "РеквНомерДок");
				НовыйРеквизитЗаказа.РеквДатаДок = КС.Конвертировать_ДатаТип_вДата(СтрокаДатаТип);
			КонецЦикла;
		КонецЕсли;
		
		// Поиск маршрута по идентификатору
		Если ЗначениеЗаполнено(НоваяЗаякаНаМаршрут.Идентификатор) Тогда
			НоваяЗаякаНаМаршрут.ЗаявкаНаМаршрут = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.НайтиЗаявкуНаМаршрут(
				НоваяЗаякаНаМаршрут.Идентификатор);
			Если Не ЗначениеЗаполнено(ПЭ_Титул1) И ЗначениеЗаполнено(НоваяЗаякаНаМаршрут.ЗаявкаНаМаршрут) Тогда
				ПЭ_Титул1 = НоваяЗаякаНаМаршрут.ЗаявкаНаМаршрут.Титул1;
			КонецЕсли;
		КонецЕсли;
		
		// Информационные поля
		ИнфПол_raw = КС.XDTO_Вычислить(ТекущаяСтрока, "ИнфПол");
		ИнфПолМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПол_raw);
		Для Каждого ЭлементИнфПолXDTO Из ИнфПолМассив Цикл
			
			ИнфПолТекстИнф_raw = КС.XDTO_Вычислить(ЭлементИнфПолXDTO, "ТекстИнф");
			ИнфПолТекстИнфМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПолТекстИнф_raw);
			
			Для Каждого ЭлементИнфПолТекстИнфXDTO Из ИнфПолТекстИнфМассив Цикл
				НоваяСтрокаИнфПол = ИнфПол.Добавить();
				НоваяСтрокаИнфПол.ИдентификаторСтрокиЗаявкиНаМаршрут = НоваяЗаякаНаМаршрут.ИдентификаторСтроки;
				НоваяСтрокаИнфПол.Идентиф = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Идентиф");
				НоваяСтрокаИнфПол.Значение = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Значение");
			КонецЦикла;
			
		КонецЦикла;
		
		// Товары
		ЗаполнитьТоварыИзXDTO(ТекущаяСтрока, НоваяЗаякаНаМаршрут.ИдентификаторСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыИзXDTO(Знач СвГруз, ИдентификаторСтрокиЗаявкиНаМаршрут)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ОпГруз = КС.XDTO_Вычислить(СвГруз, "ОпГруз");
	ОпГрузов = КС.XDTO_ВычислитьМассивXDTO(ОпГруз);
	
	Для Каждого ТекущаяСтрока Из ОпГрузов Цикл
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаТовара.ИдентификаторСтрокиЗаявкиНаМаршрут = ИдентификаторСтрокиЗаявкиНаМаршрут;
		НоваяСтрокаТовара.Учитывать = Истина;
		НоваяСтрокаТовара.ОтгрузочноеНаименование = КС.XDTO_Вычислить(ТекущаяСтрока, "НаимГруз");
		НоваяСтрокаТовара.КоличествоМест = КС.XDTO_ВычислитьЧисло(ТекущаяСтрока, "КолМестГр");
		
		// Способ доставки груза
		СпДостГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "СпДостГруз");
		Если ЗначениеЗаполнено(СпДостГруз) Тогда
			СпособДоставкиГруза = СпДостГруз;
		КонецЕсли;
		
		// Объем груза, в кубических метрах
		НоваяСтрокаТовара.ОбъемКубМ = КС.XDTO_ВычислитьЧисло(ТекущаяСтрока, "Объем");
		
		// Особые отметки
		НоваяСтрокаТовара.ОсобыеОтметки = КС.XDTO_Вычислить(ТекущаяСтрока, "Отмет");
		
		// Сведения об опасном грузе
		ПрзОпаснГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "ПрзОпаснГруз");
		Если ПрзОпаснГруз = "1" Тогда
			
			СвОпаснГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "СвОпаснГруз");
			СвОпаснГрузов = КС.XDTO_ВычислитьМассивXDTO(СвОпаснГруз);
			
			Если СвОпаснГрузов.Количество() <> 0 Тогда
				
				ТекущийСвОпаснГруз = СвОпаснГрузов[0];
				
				НомерООН = КС.XDTO_Вычислить(ТекущийСвОпаснГруз, "ИдОпаснООН");
				ОписаниеОпасногоГруза = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.ПолучитьОписаниеОпасногоГруза(НомерООН);
				Если ЗначениеЗаполнено(ОписаниеОпасногоГруза) Тогда
					НоваяСтрокаТовара.ОписаниеОпасногоГруза = ОписаниеОпасногоГруза;
				Иначе
					НоваяСтрокаТовара.ОписаниеОпасногоГруза = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.СоздатьНовыйПоXDTO(
						ТекущийСвОпаснГруз);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Признак наличия в составе груза предметов и веществ, изъятых из гражданского оборота или ограниченно оборотоспособных
		НоваяСтрокаТовара.ПрзИзъятВещ = (КС.XDTO_Вычислить(ТекущаяСтрока, "ПрзИзъятВещ") = "1");
		
		// Информация об упаковке груза
		НаличиеУпаковки = (КС.XDTO_Вычислить(ТекущаяСтрока, "НалУпак") = "1");
		Если НаличиеУпаковки Тогда
			ЗаполнитьИнформациюОбУпаковкеГруза(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		КонецЕсли;
		
		// Сведения о товаре, подлежащем идентификации и учету в государственной информационной системе
		УчГосСист = КС.XDTO_Вычислить(ТекущаяСтрока, "УчГосСист");
		НоваяСтрокаТовара.ПодлежитУчетуВГосСист = (УчГосСист <> "0");
		Если НоваяСтрокаТовара.ПодлежитУчетуВГосСист Тогда
			ЗаполнитьСведенияОГосударственныхСистемах(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		КонецЕсли;
		
		// Стоимость груза
		ЗаполнитьСтоимость(ТекущаяСтрока, НоваяСтрокаТовара, "Груз");
		
		// Код товарной номенклатуры
		НоваяСтрокаТовара.КодТНВЭД = КС.XDTO_Вычислить(ТекущаяСтрока, "КодТовНом");
		
		// КодТовОКПД2
		// КодГрузГНГ
		// КодГрузЕТСНГ
		
		// Маркировка груза
		ЗаполнитьМарк(НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		
		// Сведения о стране происхождения груза
		Справочники.КонтурЛогистика_СтраныМира.ЗаполнитьСтраныПроисхожденияПродукции(
			ЭтотОбъект, НоваяСтрокаТовара.ИдентификаторСтроки, ТекущаяСтрока);
		
		// Вес груза
		ВесГруз = КС.XDTO_Вычислить(ТекущаяСтрока, "ВесГруз");
		НоваяСтрокаТовара.МассаБруттоКг = КС.XDTO_ВычислитьЧисло(ВесГруз, "ВесБрутто");
		НоваяСтрокаТовара.МассаНеттоКг = КС.XDTO_ВычислитьЧисло(ВесГруз, "ВесНетто");
		
		// Информационные поля
		ИнфПол_raw = КС.XDTO_Вычислить(ТекущаяСтрока, "ИнфПол");
		ИнфПолМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПол_raw);
		Для Каждого ЭлементИнфПолXDTO Из ИнфПолМассив Цикл
			
			ИнфПолТекстИнф_raw = КС.XDTO_Вычислить(ЭлементИнфПолXDTO, "ТекстИнф");
			ИнфПолТекстИнфМассив = КС.XDTO_ВычислитьМассивXDTO(ИнфПолТекстИнф_raw);
			
			Для Каждого ЭлементИнфПолТекстИнфXDTO Из ИнфПолТекстИнфМассив Цикл
				НоваяСтрокаИнфПол = ИнфПол.Добавить();
				НоваяСтрокаИнфПол.ИдентификаторСтрокиТоваров = НоваяСтрокаТовара.ИдентификаторСтроки;
				НоваяСтрокаИнфПол.Идентиф = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Идентиф");
				НоваяСтрокаИнфПол.Значение = КС.XDTO_Вычислить(ЭлементИнфПолТекстИнфXDTO, "Значение");
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтоимость(ОпГруз, ЗаполняемыйОбъект, ИмяМеста)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Если ИмяМеста = "Общая" Тогда
		ИмяСвойстваПризнакаНаличие = "ВозмУкОбщСтГруз";
		ИмяСвойстваДействительнойСтоимости = "ДейстСтГрВсего";
		ИмяСвойстваОбъявленнойСтоимости = "ОбъявлСтГрВсего";
	ИначеЕсли ИмяМеста = "Партия" Тогда
		ИмяСвойстваПризнакаНаличие = "ВозмУкСтПарт";
		ИмяСвойстваДействительнойСтоимости = "ДейстСтГрузПарт";
		ИмяСвойстваОбъявленнойСтоимости = "ОбъявлСтГрузПарт";
	ИначеЕсли ИмяМеста = "Груз" Тогда
		ИмяСвойстваПризнакаНаличие = "ВозмУкСтГруз";
		ИмяСвойстваДействительнойСтоимости = "ДейстСтГруз";
		ИмяСвойстваОбъявленнойСтоимости = "ОбъявлСтГруз";
	Иначе
		ВызватьИсключение "Не заполнен параметр ИмяМеста в методе ЗаполнитьСтоимость";
	КонецЕсли;
	
	СтоимостьОбъявл = КС.XDTO_Вычислить(ОпГруз, ИмяСвойстваОбъявленнойСтоимости, Неопределено);
	СтоимостьДейст = КС.XDTO_Вычислить(ОпГруз, ИмяСвойстваДействительнойСтоимости, Неопределено);
	
	Если СтоимостьОбъявл <> Неопределено Тогда
		Стоимость_raw = СтоимостьОбъявл;
		ЗаполняемыйОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ОбъявленнаяСтоимость;
	ИначеЕсли СтоимостьДейст <> Неопределено Тогда
		Стоимость_raw = СтоимостьДейст;
		ЗаполняемыйОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ДействительнаяСтоимость;
	Иначе
		Возврат;
	КонецЕсли;
	
	КодВалюты = КС.XDTO_Вычислить(Стоимость_raw, "КодОКВ");
	НаименованиеВалюты = КС.XDTO_Вычислить(Стоимость_raw, "НаимОКВ");
	
	ЗаполняемыйОбъект.Валюта = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С(КодВалюты, НаименованиеВалюты);
	ЗаполняемыйОбъект.Стоимость = КС.XDTO_ВычислитьЧисло(Стоимость_raw, "СтГр");
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОбУпаковкеГруза(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВидУпак", "ВидУпак", "ОКВГУМТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВесУпак", "ВесУпак", "Число"); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "КолУпак", "КолУп", "Число"); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВысЗнач", "ГабарУпак.ВысЗнач", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДлЗнач", "ГабарУпак.ДлЗнач", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ШирЗнач", "ГабарУпак.ШирЗнач", "Число"); 
	
	МассивЗначений = КС.XDTO_Вычислить(ОпГруз, "ИнфУпГруз", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаТЧ = ИнфУпГруз.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Значение, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОГосударственныхСистемах(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НаимГосСист", "НаимГосСист", "НаимГосСист");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НаимГосСистИное", "НаимГосСистИное", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "УчетЕд", "УчетЕд", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИнаяИнф", "ИнаяИнф", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИдНомУчетЕд", "ИдНомУчетЕд", "");
	
	МассивЗначений = КС.XDTO_Вычислить(ОпГруз, "СвГосСист", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаТЧ = СведенияГосСистем.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Значение, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМарк(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ЭлементXDTO = КС.XDTO_Вычислить(ОпГруз, "Марк");
	МассивXDTO = КС.XDTO_ВычислитьМассивXDTO(ЭлементXDTO);
	
	Для Каждого Значение Из МассивXDTO Цикл
		
		Если Значение = "Отсутствует" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Марк.Добавить();
		НоваяСтрока.МаркировкаГруза = Значение;
		НоваяСтрока.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОКонтейнерах(ИдентификаторСтрокиЗаявкиНаМаршрут, СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЗначений = КС.XDTO_Вычислить(СвГруз, "СвКонтейн", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		
		СтрокаТЧ = СведенияОКонтейнерах.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиЗаявкиНаМаршрут = ИдентификаторСтрокиЗаявкиНаМаршрут;
		СтрокаТЧ.Номер = КС.XDTO_ВычислитьЧисло(Значение, "НомКонтейн");
		СтрокаТЧ.ИдентификационныйНомер = КС.XDTO_Вычислить(Значение, "ИдКонтейнМежд");
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификационныйНомер) Тогда
			СтрокаТЧ.ИдентификационныйНомер = КС.XDTO_Вычислить(Значение, "ИдКонтейнНест");
		КонецЕсли;
		СтрокаТЧ.ИСО = КС.XDTO_Вычислить(Значение, "ИСОКонтейн");
		
		ПредКонтейн = КС.XDTO_Вычислить(Значение, "ПредКонтейн");
		СтрокаТЧ.ПредоставленКлиентом = Перечисления.КонтурЛогистика_ПредоставлениеКонтейнера.Десериализовать(ПредКонтейн);
		
		СтрокаТЧ.ВесГруза = КС.XDTO_ВычислитьЧисло(Значение, "СумВесГруз");
		СтрокаТЧ.ВесТары = КС.XDTO_ВычислитьЧисло(Значение, "ВесТара");
		СтрокаТЧ.КоличествоПломб = КС.XDTO_ВычислитьЧисло(Значение, "КолПломб");
		
		НомераПломбЛок = КС.XDTO_Вычислить(Значение, "НомПломб", Новый Массив);
		НомераПломбЛок = КС.XDTO_ВычислитьМассивXDTO(НомераПломбЛок);
		СтрокаТЧ.НомераПломб = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(НомераПломбЛок, ";");
		
		СтрокаТЧ.Высота = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ВысЗнач");
		СтрокаТЧ.Длина = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ДлЗнач");
		СтрокаТЧ.Ширина = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ШирЗнач");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуСоответствия(МассивЭлементов, Реквизит1С, РеквизитСхемы, Тип)
	
	КонтурЛогистика_КонструкторыXDTO.ДобавитьСтрокуСоответствия(МассивЭлементов, Реквизит1С, РеквизитСхемы, Тип);
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Если ПараметрыФайлаРеквизиты = Неопределено Тогда 
		ПараметрыФайлаРеквизиты = Новый Структура;
	КонецЕсли;
	
	// Блокировка
	Попытка
		Заблокировать();
	Исключение
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если Не РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфЭксп = ТекущаяДатаСеанса();
	ВрИнфЭксп = ТекущаяДатаСеанса();
	
	Попытка
		
		// Формируем текст XML
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфЭксп, ВрИнфЭксп);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
			
			ТекстОшибок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста);
			Результат.МассивОшибок.Добавить(ТекстОшибок);
			Результат.Успешно = Ложь;
			
			Возврат Результат;
			
		КонецЕсли;
		
		// Запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
			РезультатФормированияТекста, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка,
			ПараметрыФайлаРеквизиты, Ссылка);
		
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(
				Ссылка, Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена,, Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
			// Установим шаблон основания
			Если ПараметрыФайлаРеквизиты.Свойство("ТребуетсяПодпись") И ПараметрыФайлаРеквизиты.ТребуетсяПодпись Тогда
				ПервыйФайлДокумента = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйФайлДокумента(Ссылка);
				
				Если ЗначениеЗаполнено(ПервыйФайлДокумента)
					И (ПервыйФайлДокумента.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.Получен
						Или ПервыйФайлДокумента.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.Отправлен) Тогда
					
					ФайлОбъект = РезультатСозданияФайла.Файл.ПолучитьОбъект();
					ФайлОбъект.ШаблонОснование = ПервыйФайлДокумента;
					ФайлОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		// Запишем ДатИнфЭксп и ВрИнфЭксп
		Записать();
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		
		Разблокировать();
		
		Результат.Успешно = Ложь;
		Результат.МассивОшибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	НомерТитула = "";
	Формат = "5.01";
	ТипДокументооборота = "__ForwardingReceipt";
	ТипКодировки = "utf-8";
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ОтправительШаблона) Тогда
		Если ОтправительШаблона = Клиент Тогда
			Получатель = Экспедитор;
		Иначе
			Получатель = Клиент;
		КонецЕсли;
		Отправитель = ОтправительШаблона;
	Иначе
		Получатель = Клиент;
		Отправитель = Экспедитор;
	КонецЕсли;
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаЭР(Получатель, Отправитель, GUID);
	Результат.Вставить("ИдФайл", XDTO_Файл.ИдФайл);
	
	// Подписант
	ПодписантСтруктура = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		Экспедитор, ПользовательПодписант, ДатаДок, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант = КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда
		Результат.Вставить("ИдентификаторМЧД", ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ = КС.XDTO_Документ(
		НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	XDTO_Файл.Документ.НаимДок = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.НаимДок();
	
	// Содержание экспедиторской расписки
	XDTO_СодИнфЭксп = КС.XDTO_СодИнфЭксп(НомерТитула, ТипДокументооборота, Формат, ЭтотОбъект);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфЭксп", XDTO_СодИнфЭксп);
	
	// Текст файла
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат, ТипКодировки);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID", GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура СконвертироватьСтрокуТоваров1СвЛогистика(НомерСтроки) Экспорт
	
	СтрокаТоваров = Товары.Найти(НомерСтроки, "НомерСтроки");
	
	// Сформировать расширенную (с упаковками) строку товаров
	ТЗ_ТоварыВременная = Товары.ВыгрузитьКолонки(); 
	
	СтрокаТоваровВременная = ТЗ_ТоварыВременная.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТоваровВременная, СтрокаТоваров);
	
	КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
	
	// Положить расширенную строку товаров обратно в ТоварыДокумента1С
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаТоваровВременная);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли