
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	УточнениеТипаЛогистика = "";
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
		Если Форма.Элементы.Найти("ТипЛогистика") <> Неопределено Тогда
			УточнениеТипаЛогистика = Форма.ТипЛогистика;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	ПараметрКоманды = ОтфильтроватьМассивДокументовКОбработкеПоНастройкамНКД(ПараметрКоманды, Истина, УточнениеТипаЛогистика);
	Если ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	Для Каждого ТекущийДокументСсылка Из ПараметрКоманды Цикл
		ТекущееТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный");
		НовоеТребуемоеДействие = КонтурЛогистика_ОбработкаДокументовСервер.ТребуемоеДействиеРазрешенияРаботыСДокументамиПользователя(
			ТекущееТребуемоеДействие, ТекущийДокументСсылка);
		Если ТекущееТребуемоеДействие = НовоеТребуемоеДействие Тогда
			МассивДокументов.Добавить(ТекущийДокументСсылка);
		Иначе
			ТекстСообщения = "Нет права подписания по документу: " + Строка(ТекущийДокументСсылка);
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВводаДокументов = Новый Структура;
	ПараметрыВводаДокументов.Вставить("МассивДокументов", МассивДокументов);
	ПараметрыВводаДокументов.Вставить("УточнениеТипаЛогистика", УточнениеТипаЛогистика);
	ПараметрыВводаДокументов.Вставить("Интерактивно");
	
	Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
	МассивФайловОбмена = ИзготовитьФайлыОбмена(ПараметрыВводаДокументов);
	
	#Если ВебКлиент Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрКоманды", МассивДокументов);
		ДополнительныеПараметры.Вставить("МассивФайловОбмена", МассивФайловОбмена);
		
		Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", ЭтотОбъект, ДополнительныеПараметры);	
		НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
		
	#Иначе
		
		// Так как ПЛ может отправлять сразу несколько титулов, то в таком случае отправка в фоне не возможна.
		// При подписании мы это понимаем и сбрасываем признак ИспользоватьОтправкуВФоне.
		ИспользоватьОтправкуВФоне = Истина;
		МассивПодписанныхФайловОбмена = ПодписатьФайлы(МассивФайловОбмена, ИспользоватьОтправкуВФоне);
		
		Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		КонтурЛогистика_ОбработкаДокументовКлиент.ОтправитьФайлы(МассивПодписанныхФайловОбмена, ИспользоватьОтправкуВФоне);
		
		Состояние("Отправляем QR-коды", 80, "получаем и отправляем QR-коды водителям", БиблиотекаКартинок.КонтурЛогистика_Email);
		ОтправитьQRКодыДокументов(МассивПодписанныхФайловОбмена);
		
		Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		ОповеститьОбИзменении(ТипЗнч(МассивДокументов[0]));
		Оповестить("КонтурЛогистика_ОбновитьЗадачи", МассивДокументов);
		
	#КонецЕсли	

КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	ОповещениеПодписатьФайлыЗавершение = Новый ОписаниеОповещения("ПодписатьФайлыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Состояние("Подписываем документы", 60, "создаем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);	
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПодписатьФайлыОбменаАсинхронно(ДополнительныеПараметры.МассивФайловОбмена, ОповещениеПодписатьФайлыЗавершение);
	
КонецПроцедуры

&НаКлиенте
Функция ПодписатьФайлыЗавершение(МассивПодписанныхФайловОбмена, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ОтправитьФайлы(МассивПодписанныхФайловОбмена);
	
	Состояние("Отправляем QR-коды", 80, "получаем и отправляем QR-коды водителям", БиблиотекаКартинок.КонтурЛогистика_Email);
	ОтправитьQRКодыДокументов(МассивПодписанныхФайловОбмена);
	
	Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
	ОповеститьОбИзменении(ТипЗнч(ДополнительныеПараметры.ПараметрКоманды[0]));
	Оповестить("КонтурЛогистика_ОбновитьЗадачи", ДополнительныеПараметры.ПараметрКоманды);
	
Конецфункции

&НаСервере
Функция ОтфильтроватьМассивДокументовКОбработкеПоНастройкамНКД(МассивДокументов, ТребуетсяПодпись, УточнениеТипаЛогистика)
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.ОтфильтроватьМассивДокументовКОбработкеПоНастройкамНКД(
		МассивДокументов, ТребуетсяПодпись, УточнениеТипаЛогистика);
	
КонецФункции

&НаСервере
Функция ИзготовитьФайлыОбмена(ПараметрыВводаДокументов)
	
	ПараметрыФормированияФайловРеквизиты = Новый Структура;
	ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
	
	МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);	
	Возврат МассивФайловОбмена;
	
КонецФункции

&НаКлиенте
Функция ПодписатьФайлы(МассивФайловОбмена, ИспользоватьОтправкуВФоне)
	
	Состояние("Подписываем документы", 60, "создаем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	
	МассивПодписанныхФайловОбмена = КонтурЛогистика_ОбработкаДокументовКлиент.ПодписатьФайлыОбмена(МассивФайловОбмена, ИспользоватьОтправкуВФоне);
	
	Возврат МассивПодписанныхФайловОбмена;
	
КонецФункции

&НаСервере
Процедура ОтправитьQRКодыДокументов(Документы)
	
	Если Не Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("АвтоматическоеПолучениеИОтправкаQRКодов") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКОбработке = Новый Массив;
	
	Для Каждого ТекущийДокумент Из Документы Цикл
		
		ТипДокумента = ТипЗнч(ТекущийДокумент);
		
		Если ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул4") Тогда
			
			ДокументыКОбработке.Добавить(ТекущийДокумент.Титул1);
			
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2")
			Или ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7")
			Или ТипДокумента = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул8") Тогда
			
			ДокументыКОбработке.Добавить(ТекущийДокумент.ДокументЭТРН);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументыКОбработке.Количество() <> 0 Тогда
		РегистрыСведений.КонтурЛогистика_ОчередьОтправкиQRКодов.ПолучитьОтправить(ДокументыКОбработке);
	КонецЕсли;
	
КонецПроцедуры
