#Область ПрограммныйИнтерфейс

Процедура ДокументПриСозданииНаСервереПосле(Форма) Экспорт
	
	СкрытьКомандыЛогистики(Форма);
	
	Если Найти(Форма.ИмяФормы, "ФормаСписка") = 0 Тогда
		
		// Проверим настройки отображения
		Если Не КонтурЛогистика_ИнтеграцияТиповыеСервер.ОтображениеПанелиВключеноВНастройках(Форма) Тогда
			Возврат;
		КонецЕсли;
		
		МодульКонтурИнтеграция = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурИнтеграция");
		Если МодульКонтурИнтеграция = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		МодульКонтурИнтеграцияКлиентСервер = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурИнтеграцияКлиентСервер");
		Если МодульКонтурИнтеграцияКлиентСервер = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Основания команда
		ДокументыУчетнойСистемы = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(Форма.Объект.Ссылка);
		СостояниеЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.СостояниеЭПД(ДокументыУчетнойСистемы);
		
		НомерКоманды = 1;
		ОписаниеКоманды1 = МодульКонтурИнтеграцияКлиентСервер.ОписаниеКоманды("Логистика", НомерКоманды);
		ОписаниеКоманды1.Заголовок = СостояниеЭПД.Заголовок;
		ОписаниеКоманды1.Видимость = Истина;
		ОписаниеКоманды1.Доступность = Истина;
		
		ОсновныеКоманды = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(ОписаниеКоманды1);
		МодульКонтурИнтеграция.ДобавитьОсновныеКоманды(Форма, ОсновныеКоманды);
		
		//
		
		// Дополнительная команда
		НомерКоманды = 1;
		ДополнительнаяКоманда = МодульКонтурИнтеграцияКлиентСервер.ОписаниеКоманды("Логистика", НомерКоманды);
		ДополнительнаяКоманда.Заголовок = "Логистика";
		МодульКонтурИнтеграция.ДобавитьДополнительнуюКоманду(Форма, ДополнительнаяКоманда);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкрытьКомандыЛогистики(Форма)
	
	ИменаСкрываемыхКоманд = Новый Массив;
	ИменаСкрываемыхКоманд.Добавить("УчетнаяСистема_КопироватьУчетныеДокументы");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ВыполнитьДействияПоУмолчанию");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ОтправитьНеподписанный");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПодготовитьНеподписанныйКОтправке");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПодписатьИОтправить");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПодписатьИПодготовитьКОтправке");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПропуститьДокумент");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_СоздатьЧерновик");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_Создать1ТрнПоВыделенным");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_Создать1ПлПоВыделенным");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_Создать1ЗзПоВыделенным");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПередатьНаПодписание");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПередатьНаСогласованиеВодителю");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_РаспечататьТранспортнуюНакладную");
	ИменаСкрываемыхКоманд.Добавить("КонтурЛогистика_ПоказатьПечатнуюФормуТранспортнойНакладной");
	
	Для Каждого ТекущееИмяКоманды Из ИменаСкрываемыхКоманд Цикл
		ОтключитьВидимостьКоманды(Форма, ТекущееИмяКоманды);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьВидимостьКоманды(Форма, ИмяКоманды)
	
	Если ИмяКоманды = "КонтурЛогистика_КомандыВводаДокументов" Тогда
		ИмяЭлемента = "Форма" + ИмяКоманды;
	Иначе
		ИмяЭлемента = "ФормаОбщаяКоманда" + ИмяКоманды;
	КонецЕсли;
	
	НайденныйЭлемент = Форма.Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти