
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	КонтактыИзАдреса = ОД_Логистика.ПолучитьКонтактыИзАдреса(ПредставлениеАдреса);
	
	КонтактноеЛицо						= КонтактыИзАдреса.КонтактноеЛицо;
	ДополнительнаяИнформацияПоДоставке	= КонтактыИзАдреса.ДополнительнаяИнформацияПоДоставке;
	ВремяДоставкиС						= КонтактыИзАдреса.ВремяДоставкиС;
	ВремяДоставкиПо						= КонтактыИзАдреса.ВремяДоставкиПо;
	Телефон								= КонтактыИзАдреса.Телефон;
	НеАктуален							= КонтактыИзАдреса.НеАктуален;
	ЗонаДоставки						= КонтактыИзАдреса.ЗонаДоставки;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПодтвердитьИЗакрыть")
Процедура ОД_ПодтвердитьИЗакрыть(Результат, ДополнительныеПараметры)

	Если ПустаяСтрока(КонтактноеЛицо) Тогда 
		Сообщить(" - заполните контактное лицо");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда // При немодифицированности работает как "отмена".
		
		Контекст = ОписаниеКонтекста();
		
		Результат = РезультатВыбора(Контекст, ВозвращатьСписокЗначений);
		
		// Флаги вида были прочитаны заново.
		ВидКонтактнойИнформации = Контекст.ВидКонтактнойИнформации;
		
		Если (ВидКонтактнойИнформации.ПроверятьКорректность	И Не РазрешитьВводАдресаВСвободнойФорме
			Или ВидКонтактнойИнформации.МеждународныйФорматАдреса)
			И Результат.ОшибкиЗаполнения.Количество() > 0 Тогда
			
			СообщитьОбОшибкахЗаполнения(Результат.ОшибкиЗаполнения, Ложь);
			Возврат;
			
		КонецЕсли;
		
		Результат = Результат.ДанныеВыбора;
		Если ВидКонтактнойИнформации.ХранитьИсториюИзменений Тогда
			ОбработатьКонтактнуюИнформациюСИсторией(Результат);
		КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Результат.Вставить("КонтактнаяИнформацияОписаниеДополнительныхРеквизитов", КонтактнаяИнформацияОписаниеДополнительныхРеквизитов);
		КонецЕсли;
		
		СброситьМодифицированностьПриВыборе();
#Если ВебКлиент Тогда
		ФлагЗакрытия = ЗакрыватьПриВыборе;
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(Результат);
		ЗакрыватьПриВыборе = ФлагЗакрытия;
#Иначе
		ОповеститьОВыборе(Результат);
#КонецЕсли
		СохранитьСостояниеФормы();
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Если (МодальныйРежим Или ЗакрыватьПриВыборе) И Открыта() Тогда
		СброситьМодифицированностьПриВыборе();
		СохранитьСостояниеФормы();
		Закрыть(Результат);
	КонецЕсли;
	
	ДопИнфо = Новый Структура();
	ДопИнфо.Вставить("АдресДоставки",						СокрЛП(ПредставлениеАдреса));
	ДопИнфо.Вставить("КонтактноеЛицо",						СокрЛП(КонтактноеЛицо));
	ДопИнфо.Вставить("ДополнительнаяИнформацияПоДоставке",	СокрЛП(ДополнительнаяИнформацияПоДоставке));
	ДопИнфо.Вставить("ВремяДоставкиС",						ВремяДоставкиС);
	ДопИнфо.Вставить("ВремяДоставкиПо",						ВремяДоставкиПо);
	ДопИнфо.Вставить("Телефон",								СокрЛП(Телефон));
	ДопИнфо.Вставить("НеАктуален",							НеАктуален);
	ДопИнфо.Вставить("ЗонаДоставки",						ЗонаДоставки);
	
	ОД_Логистика.ЗаписатьКонтактыВАдрес(ДопИнфо);	

КонецПроцедуры
