#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КлючНастроекВариантовФильтров", КлючНастроекВариантовФильтров);
	Параметры.Свойство("КлючОбъектаВариантовФильтров", КлючОбъектаВариантовФильтров);
	
	ПрочитатьВариантыФильтров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Элементы.ВариантыФильтровТЗ.ОтборСтрок = Новый ФиксированнаяСтруктура("Представление", СтрокаПоиска);
	Иначе
		Элементы.ВариантыФильтровТЗ.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	
	ТекущиеДанные = Элементы.ВариантыФильтровТЗ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВыбора(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНазвание(Команда)
	
	ТекущиеДанные = Элементы.ВариантыФильтровТЗ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВариантФильтра = ТекущиеДанные.Идентификатор;
	
	Если Не ЗначениеЗаполнено(ТекущийВариантФильтра) Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Выберите вариант фильтра для переименования.");
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводСтроки_КонтурЛогистика(
		ТекущиеДанные.Представление, "Новое имя варианта фильтра", Ложь, ЭтаФорма,
		"ПереименоватьВариантФильтраЗавершение", ТекущийВариантФильтра);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФильтр(Команда)
	
	ТекущиеДанные = Элементы.ВариантыФильтровТЗ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВариантФильтра = ТекущиеДанные.Идентификатор;
	
	ТекстВопроса = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок(
		"Удалить вариант фильтра ""%1""?", ТекущиеДанные.Представление);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
		ТекстВопроса, РежимДиалогаВопрос.ДаНет, "Контур.Логистика", 0,
		ЭтаФорма, "УдалитьВариантФильтраЗавершение", ТекущийВариантФильтра);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьВариантыФильтров()
	
	Сохраненное = ХранилищеОбщихНастроек.Загрузить(
		КлючОбъектаВариантовФильтров,
		КлючНастроекВариантовФильтров);
	
	Если ТипЗнч(Сохраненное) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Сохраненное.Свойство("Варианты") Или ТипЗнч(Сохраненное.Варианты) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыФильтров.Очистить();
	
	Для Каждого ТекущаяСтрока Из Сохраненное.Варианты Цикл
		
		НоваяСтрока = ВариантыФильтров.Добавить();
		НоваяСтрока.Идентификатор = ТекущаяСтрока.Идентификатор;
		НоваяСтрока.Представление = ТекущаяСтрока.Имя;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереименоватьВариантФильтраЗавершение(ИмяВарианта, ИдентификаторВарианта) Экспорт
	
	Если ИмяВарианта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВарианта = СокрЛП(ИмяВарианта);
	Если Не ЗначениеЗаполнено(ИмяВарианта) Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Укажите название настройки");
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(ИмяВарианта) > 70 Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Длина названия настройки не должна быть длинее 70 символов");
		Возврат;
	КонецЕсли;
	
	// Проверим что имя уникально
	Для Каждого ТекущаяСтрока Из ВариантыФильтров Цикл
		
		Если ТекущаяСтрока.Представление <> ИмяВарианта Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ИдентификаторВарианта", ИдентификаторВарианта);
		ПараметрыОбработчика.Вставить("ИмяВарианта", ИмяВарианта);
		ПараметрыОбработчика.Вставить("ИдентификаторСтарогоВарианта", ТекущаяСтрока.Идентификатор);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
			"Перезаписать существующий?", РежимДиалогаВопрос.ДаНет,
			"Фильтр с таким названием уже существует",, ЭтаФорма,
			"ПерезаписатьСуществующуюНастройкуЗавершение", ПараметрыОбработчика);
		
		Возврат;
		
	КонецЦикла;
	
	ПереименоватьВариантФильтровНаСервере(ИдентификаторВарианта, ИмяВарианта);
	ПрочитатьВариантыФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьСуществующуюНастройкуЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим старый
	УдалитьВариантФильтровНаСервере(ДополнительныеПараметры.ИдентификаторСтарогоВарианта);
	
	// Переименуем текущий
	ПереименоватьВариантФильтровНаСервере(ДополнительныеПараметры.ИдентификаторВарианта, ДополнительныеПараметры.ИмяВарианта);
	
	ПрочитатьВариантыФильтров();
	
КонецПроцедуры

&НаСервере
Процедура ПереименоватьВариантФильтровНаСервере(ИдентификаторВарианта, ИмяВарианта)
	
	Контейнер = ХранилищеОбщихНастроек.Загрузить(
		КлючОбъектаВариантовФильтров,
		КлючНастроекВариантовФильтров);
	
	Для Каждого Вариант Из Контейнер.Варианты Цикл
		
		Если ТипЗнч(Вариант) = Тип("Структура")
			И Вариант.Свойство("Идентификатор")
			И Вариант.Идентификатор = ИдентификаторВарианта Тогда
			
			Вариант.Имя = ИмяВарианта;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Контейнер.ПоследнийИдентификатор = ИдентификаторВарианта;
	
	ХранилищеОбщихНастроек.Сохранить(
		КлючОбъектаВариантовФильтров,
		КлючНастроекВариантовФильтров,
		Контейнер);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВариантФильтраЗавершение(РезультатВопроса, ИдентификаторВарианта) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВариантФильтровНаСервере(ИдентификаторВарианта);
	ПрочитатьВариантыФильтров();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВариантФильтровНаСервере(ИдентификаторВарианта)
	
	Контейнер = ХранилищеОбщихНастроек.Загрузить(
		КлючОбъектаВариантовФильтров,
		КлючНастроекВариантовФильтров);
	
	НовыеВарианты = Новый Массив;
	
	Для Каждого Вариант Из Контейнер.Варианты Цикл
		
		Если ТипЗнч(Вариант) = Тип("Структура")
			И Вариант.Свойство("Идентификатор")
			И Вариант.Идентификатор = ИдентификаторВарианта Тогда
			Продолжить;
		КонецЕсли;
		
		НовыеВарианты.Добавить(Вариант);
		
	КонецЦикла;
	
	Контейнер.Варианты = НовыеВарианты;
	
	Если Контейнер.ПоследнийИдентификатор = ИдентификаторВарианта Тогда
		Контейнер.ПоследнийИдентификатор = "";
	КонецЕсли;
	
	ХранилищеОбщихНастроек.Сохранить(
		КлючОбъектаВариантовФильтров,
		КлючНастроекВариантовФильтров,
		Контейнер);
	
КонецПроцедуры

#КонецОбласти