#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.МассивСтран) = Тип("Массив") Тогда
		
		Для Каждого Страна Из Параметры.МассивСтран Цикл
			СтрокаТЗ = СписокСтран.Добавить();
			СтрокаТЗ.Страна = Страна;
		КонецЦикла;
		
	КонецЕсли;
	
	ИдентификаторСтрокиТоваров = Параметры.ИдентификаторСтрокиТоваров;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	Закрыть(РезультатВыбора());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РезультатВыбора()
	
	ВыбранныеСтраны = Новый Массив;
	
	Для Каждого СтрокаСписка Из СписокСтран Цикл
		
		Если ЗначениеЗаполнено(СтрокаСписка.Страна) Тогда
			ВыбранныеСтраны.Добавить(СтрокаСписка.Страна);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", ИдентификаторСтрокиТоваров);
	Результат.Вставить("МассивСтран", ВыбранныеСтраны);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
