
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивДокументовУчетнойСистемы.ЗагрузитьЗначения(Параметры.МассивДокументовУчетнойСистемы);
	
	ПереформироватьДерево();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ВвестиДокумент"
		Или ИмяСобытия = "КонтурЛогистика_ОбновитьФормуСпискаЗадач"
		Или ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
		Или ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" Тогда
		
		ОбработчикОбновить();
		
	ИначеЕсли ИмяСобытия = "ЗавершениеФоновогоЗадания"
		И Параметр.Свойство("КлючФЗ")
		И Параметр.КлючФЗ = "Выполнение обмена" Тогда
		
		ОбработчикОбновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоСвязейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ДеревоСвязей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ДеревоСвязейТребуемоеДействие" Тогда 
		
		Если ТекСтрока.ТребуемоеДействие = "Ввести док. основание для ЭПД" Тогда
			
			ВвестиДокументУчетнойСистемыОснование(ТекСтрока.ДокументОснование, ТекСтрока.ТипУчетногоДляВводаЭПД);
			
		ИначеЕсли ТекСтрока.ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление") Тогда 
			
			ОткрытьЭПДПродолжитьОформление(ТекСтрока);
			
		ИначеЕсли ТекСтрока.ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Оформить") Тогда
			
			ВвестиЭПДпоТекСтроке(ТекСтрока);
			
		ИначеЕсли ТекСтрока.ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВыполнитьОбмен") Тогда
			
			ВыполнитьОбмен();
			ТекСтрока.ТребуемоеДействие = "Обмен запущен";
			
		Иначе
			Если ЗначениеЗаполнено(ТекСтрока.ДокументЭПД) Тогда 
				ОткрытьЭПДТекСтроки(ТекСтрока);
			Иначе
				// ничего не делаем
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ДеревоСвязейДокументОснование" Тогда
		
		// открыть док
		Если ЗначениеЗаполнено(ТекСтрока.ДокументЭПД) Тогда
			
			ОткрытьЭПДТекСтроки(ТекСтрока);
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ДокументОснованиеЭПД) Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекСтрока.ДокументОснованиеЭПД);
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ДокументОснование) Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекСтрока.ДокументОснование);
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ДеревоСвязейСтатус" Тогда
		
		Если ТекСтрока.Статус = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("on-the-way") Тогда 
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ДокументСсылка", ТекСтрока.ДокументЭПД);
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ОтправкаQRКода", ПараметрыОткрытия);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбработчикОбновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьУсловноеОформление()
	
	ЦветВыделения = Новый Цвет(0, 170, 144);
	
	УсловноеОформление.Элементы.Очистить();
	
	// Ожидается оформление заказа (заявки)
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументЭПД.Имя);
	
	ГруппаОтборов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеЗЗ();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Ожидается оформление заказа (заявки)");
	
	//
	
	// Ожидается оформление ЭТРН
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументЭПД.Имя);
	
	ГруппаОтборов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеТРН();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Ожидается оформление ЭТРН");
	
	//
	
	// Ожидается оформление ПЭ
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументЭПД.Имя);
	
	ГруппаОтборов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЭ();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Ожидается оформление поручения экспедитору");
	
	//
	
	// Ожидается оформление ПЛ
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументЭПД.Имя);
	
	ГруппаОтборов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Ожидается оформление путевого листа (ф. 5.01)");
	
	//
	
	// Ожидается оформление ПЛ 5.02
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументЭПД.Имя);
	
	ГруппаОтборов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ_5_02();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Ожидается оформление путевого листа");
	
	//
	
	// Цвет требуемого действия
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейТребуемоеДействие.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументЭПД.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ГруппаОтборов = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеЗЗ();
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеТРН();
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЭ();
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ();
	
	ОтборЭлемента = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ТипЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ_5_02();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветВыделения);
	
	//
	
	// (основание)
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСвязейДокументОснованиеЭПД.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДокументОснование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДеревоСвязейДокументОснованиеЭПД");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСвязей.ДеревоСвязейДокументОснованиеЭПД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "(основание)");
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьДерево()
	
	УстановитьПривилегированныйРежим(Истина);
	
	текДеревоСвязей = КонтурЛогистика_ИнтеграцияКонтурСервер.СостояниеЭПДДерево(МассивДокументовУчетнойСистемы.ВыгрузитьЗначения());
	текДеревоСвязей.Колонки.Добавить("Картинка");
	текДеревоСвязей.Колонки.Добавить("КартинкаТД");
	текДеревоСвязей.Колонки.Добавить("КартинкаСтатус");
	
	ПроставитьКартинки(текДеревоСвязей);
	
	ЗначениеВРеквизитФормы(текДеревоСвязей, "ДеревоСвязей");
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ПереформироватьДерево();
	КоллекцияЭлементовДерева = ДеревоСвязей.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоСвязей.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
	ИдентификаторФЗ_ВыполнитьОбмен = "";
	АдресРезультатаВыполнитьОбмен = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ОбработчикОбновить();
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьКартинки(текДеревоСвязей)

	Для Каждого Строка1 Из текДеревоСвязей.Строки Цикл 
		Для Каждого Строка2 Из Строка1.Строки Цикл 
			
			ПроставитьКартинкиСтрок(Строка2);
			
			Для Каждого СтрокаЭПД Из Строка2.Строки Цикл 
				
				ПроставитьКартинкиСтрок(СтрокаЭПД);
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПроставитьКартинкиСтрок(Знач СтрокаЭПД)
	
	Если СтрокаЭПД.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.Оформить Тогда
		СтрокаЭПД.КартинкаТД = БиблиотекаКартинок.КонтурЛогистика_Пункт;
	Иначе
		Если СтрокаЭПД.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеЗЗ() Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_ЛогоСКарандашом;
		ИначеЕсли СтрокаЭПД.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеТРН() Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_Грузовик;
		ИначеЕсли СтрокаЭПД.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЭ() Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_Грузовик;
		ИначеЕсли СтрокаЭПД.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ() Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_Грузовик;
		ИначеЕсли СтрокаЭПД.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ_5_02() Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_Грузовик;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаЭПД.Статус = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("on-the-way")
		Или СтрокаЭПД.Статус = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("pd-on-the-way")
		Или СтрокаЭПД.Статус = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("pl-on-the-way") Тогда
		
		СтрокаЭПД.КартинкаСтатус = БиблиотекаКартинок.КонтурЛогистика_QR16;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭПДПродолжитьОформление(Знач ТекСтрока)
	
	ГлавныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.ОпределитьГлавныйДокументПоТитулу(ТекСтрока.ДокументЭПД);
	
	ДоступныеТитулы = КонтурЛогистика_ОбработкаДокументовСервер.МожноВвестиТитулы(ГлавныйДокумент);
	
	Если ДоступныеТитулы.Количество() = 0 Тогда
		
		// Не удалось понять, что открыть. Открываем текущий титул
		ОткрытьЭПДТекСтроки(ТекСтрока);
		
	Иначе
		
		Для Каждого ТекущаяСтрока Из ДоступныеТитулы Цикл
			
			ИмяТипа = ТекущаяСтрока.Ключ;
			ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов." + ИмяТипа);
			
			ПредыдущийТитул = ОпределитьПредыдущийТитул(ТипДокумента, ТекСтрока.ДокументЭПД, ГлавныйДокумент);
			Если ПредыдущийТитул = Неопределено Тогда
				// Не удалось понять, что открыть. Открываем текущий титул
				ОткрытьЭПДТекСтроки(ТекСтрока);
			КонецЕсли;
			
			ДопПараметрыДействия = Новый Структура;
			
			КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(
				ТипДокумента, ПредыдущийТитул, ЭтаФорма, ДопПараметрыДействия);
			
			// Если возможно создать несколько, то открываем форму, только для первого
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьПредыдущийТитул(ТипДокумента, ДокументЭПД, ГлавныйДокумент)
	
	ПредыдущийТитул = Неопределено;
	
	ПредыдущийТипДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ПредыдущийТипДокумента(ТипДокумента);
	ПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ПредыдущийТипДокумента, ГлавныйДокумент);
	
	Возврат ПредыдущийТитул;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьЭПДТекСтроки(Знач ТекСтрока)
	
	// открыть титул
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
		ТекСтрока.ДокументЭПД,
		ЭтаФорма,
		"ОбработчикОбновить",
		Новый Структура("ДокументЭПД", ТекСтрока.ДокументЭПД));

КонецПроцедуры

&НаКлиенте
Процедура ВвестиЭПДпоТекСтроке(Знач ТекСтрока)
	
	Перем массивОснованийЭПД, ПараметрыВводаЭПД, ТекРодитель;
	
	ТекРодитель = ТекСтрока.ПолучитьРодителя(); 
	ПараметрыВводаЭПД = Новый Структура();
	ПараметрыВводаЭПД.Вставить("Форма", ЭтаФорма);
	ПараметрыВводаЭПД.Вставить("ИмяОбработчикаОповещения", "ОбработчикОповеститьОВыполненииКоманды"); 
	ПараметрыВводаЭПД.Вставить("ПараметрыОбработчика", Новый Структура("ИсходныйДокумент", ТекРодитель.ДокументОснованиеЭПД));
	
	массивОснованийЭПД = Новый Массив;
	массивОснованийЭПД.Добавить(ТекРодитель.ДокументОснованиеЭПД);
	
	Если ТекСтрока.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеЗЗ() Тогда
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиЗаказЗаявкуПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	ИначеЕсли ТекСтрока.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеТРН() Тогда
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиЭТРНПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	ИначеЕсли ТекСтрока.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЭ() Тогда
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиПоручениеЭкспедиторуПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	ИначеЕсли ТекСтрока.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ() Тогда
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиПутевойЛистПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	ИначеЕсли ТекСтрока.ТипЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЛ_5_02() Тогда
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиПутевойЛист502ПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен()
	
	Если ЗначениеЗаполнено(ИдентификаторФЗ_ВыполнитьОбмен) Тогда 
		
		// Открываем отслеживание
		КонтурЛогистика_ДлительныеОперацииКлиент.СледитьЗаФоновымЗаданиемВФорме(ИдентификаторФЗ_ВыполнитьОбмен, "Фоновое задание Выполнение обмена", Ложь);
		
	Иначе
		
		// Запускаем новое
		АдресРезультатаВыполнитьОбмен = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",,
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
			"Фоновое задание Выполнение обмена",
			АдресРезультатаВыполнитьОбмен);
		
		Если РезультатЗапуска.Статус = "Выполняется" Тогда
			
			ИдентификаторФЗ_ВыполнитьОбмен = РезультатЗапуска.ИдентификаторЗадания;
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", 0.1, Истина);
			
		ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
			
			ИдентификаторФЗ_ВыполнитьОбмен = "";
			ПроверитьФоновоеЗаданиеВыполнитьОбмен();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеВыполнитьОбмен() Экспорт
	
	ИнтервалОбработчикаОжидания = 2;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ВыполнитьОбмен);
	
	Если ЗаданиеЕщеВыполняется Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		ОбработчикОбновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументУчетнойСистемыОснование(ДокументОснование, ТипУчетногоДляВводаЭПД = "")

	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ИмяКонфигурации = "УФ_УТ" 
		ИЛИ ИмяКонфигурации = "ERP" 
		ИЛИ ИмяКонфигурации = "КА_2" Тогда
		
		// ввести док ТРН
		ERP_ВвестиТранспортнуюНакладную(ДокументОснование, ТипУчетногоДляВводаЭПД);
		
	ИначеЕсли ИмяКонфигурации = "КЛ" Тогда
		
		КЛ_ВвестиТранспортнуюНакладную(ДокументОснование);
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для вашей конфигурации не удалось найти обработчик ввода подходящего документа");
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КЛ_ВвестиТранспортнуюНакладную(ДокументОснование)

	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Документ.УчетнаяСистема_ТранспортнаяНакладная.ФормаОбъекта", ПараметрыФормы,,,,,
	Новый ОписаниеОповещения("ОбработчикОбновить", ЭтаФорма));

КонецПроцедуры 

&НаКлиенте
Процедура ERP_ВвестиТранспортнуюНакладную(ДокументОснование, ТипУчетногоДляВводаЭПД)
	
	Если ТипУчетногоДляВводаЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.ПредставлениеПЭ() Тогда
		Попытка
			Основания = Новый Массив;
			Основания.Добавить(ДокументОснование);
			ПараметрыФормы = Новый Структура("Основание", Основания);			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"Документ.ПоручениеЭкспедитору.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
    // если есть задание на перевозку - открыть его, если нет - открыть управление доставкой
	
	ЗаданияНаПеревозку = ЗаданияНаперевозкуПоРТУ(ДокументОснование);
	
	Если ЗаданияНаПеревозку.Количество() > 0 Тогда 
		ПоказатьЗначение(Новый ОписаниеОповещения("ОбработчикОбновить", ЭтаФорма), ЗаданияНаПеревозку[0]);
	Иначе
		ОткрытьФорму("Обработка.РабочееМестоМенеджераПоДоставке.Форма.Форма",,ЭтаФорма,,,,Новый ОписаниеОповещения("ОбработчикОбновить", ЭтаФорма));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданияНаперевозкуПоРТУ(Распоряжение)
	
	МассивЗаданий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПревозку
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ПометкаУдаления
	|	И ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";

	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);

	Результат = Запрос.Выполнить();
	МассивЗаданий = Результат.Выгрузить().ВыгрузитьКолонку("ЗаданиеНаПревозку");
	
	Возврат МассивЗаданий;
	
КонецФункции

#КонецОбласти