
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
КонецПроцедуры

Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
	ТабДок = ОбработкаОбъект.СформироватьОтчет();

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
	ОбработкаОбъект.ВыполнитьКоманду("СписокЗаказовXLSX_Ручн");

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
КонецПроцедуры
