#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеКлючейПоиска() Экспорт
	
	// Поиск договора осуществляется по:
	// 1. Рег. номер
	// 2. VIN
	// 3. СТС
	
	ШаблонСтрокиПоиска = " И КонтурЛогистика_Справочник.%1 = &%1";
	
	КлючиПоиска = Новый Массив;
		
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "РегНомер", ШаблонСтрокиПоиска); // TODO научиться искать без пробелов
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "VIN", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "СТС", ШаблонСтрокиПоиска);

	Возврат КлючиПоиска;
	
КонецФункции

Функция ТекстОшибкиНеЗаполненыКлючевыеРеквизиты() Экспорт
	
	ТекстОшибки = "Ошибка при поиске Транспортного средства. Не заполнен один из ключевых реквизитов в одном из вариантов поиска: 
					|1. Рег. номер 
					|2. VIN
					|3. СТС";
	
	Возврат ТекстОшибки;
	
КонецФункции

// Параметры:
//  ДанныеТС - СправочникОбъект - данные, содержащие сведения, необходимые для проверки (ВидВладения, АрендодательЛизингодатель, ДоговорАрендаЛизинг)
//  Отказ	 - Булево - стандартный флаг прерывания обработчиков
//
// Возвращаемое значение:
//	Результат - Структура (см. ОписаниеРезультатаПроверки()) - возвращает сведения об ошибках заполнения транспортного средства
//
Функция РезультатПроверкиАрендатораДоговора(ДанныеТС, Отказ) Экспорт
	
	Результат = ОписаниеРезультатаПроверки();
	Результат.ДанныеОбъекта = ДанныеТС;
	
	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ДанныеТС.ВидВладения = ЗначениеПеречисления("ВидыВладенияТранспортнымСредством", "Собственность_1")
		Или ДанныеТС.ВидВладения = ЗначениеПеречисления("ВидыВладенияТранспортнымСредством", "СовместнаяСобственностьСупругов_2") Тогда
		
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеТС.ДоговорАрендаЛизинг) Тогда
		
		ЗафиксироватьОшибку(Результат, "ДоговорАрендаЛизинг",
			"Поле ""Договор аренды / лизинга / безв. польз."" должно быть заполнено для этого вида владения");
		
		Возврат Результат;
		
	КонецЕсли;
	
	ДоговорАрендаЛизинг = ДанныеТС.ДоговорАрендаЛизинг;
	
	// Идентифицирующие реквизиты сторон, составивших документ
	Если Не ДанныеУчастниковЗаполненны(ДоговорАрендаЛизинг) Тогда
		ЗафиксироватьОшибку(Результат, "ДоговорАрендаЛизинг.Организация",
			"Поле ""Договор аренды / лизинга / безв. польз."" должен содержать данные участников события (сделки)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорАрендаЛизинг.ИдДок) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДоговорАрендаЛизинг.Наименование) Тогда
		ЗафиксироватьОшибку(Результат, "ДоговорАрендаЛизинг.Наименование",
			"Поле ""Договор аренды / лизинга / безв. польз."" должен содержать наименование или идентификатор файла документа");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДоговорАрендаЛизинг.НомерДокумента) Тогда
		ЗафиксироватьОшибку(Результат, "ДоговорАрендаЛизинг.НомерДокумента",
			"Поле ""Договор аренды / лизинга / безв. польз."" должен содержать номер договора или идентификатор файла документа");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДоговорАрендаЛизинг.ДатаДокумента) Тогда
		ЗафиксироватьОшибку(Результат, "ДоговорАрендаЛизинг.ДатаДокумента",
			"Поле ""Договор аренды / лизинга / безв. польз."" должен содержать дату договора или идентификатор файла документа");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеУчастниковЗаполненны(ДоговорАрендаЛизинг)
	
	Если ЗначениеЗаполнено(ДоговорАрендаЛизинг.Организация)
		Или ЗначениеЗаполнено(ДоговорАрендаЛизинг.Контрагент) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорАрендаЛизинг.ОрганизацияИНН) Тогда
		
		ДлинаИНН = СтрДлина(СокрЛП(ДоговорАрендаЛизинг.ОрганизацияИНН));
		Если ДлинаИНН = 12 Или ДлинаИНН = 10 Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорАрендаЛизинг.КонтрагентИНН) Тогда
		
		ДлинаИНН = СтрДлина(СокрЛП(ДоговорАрендаЛизинг.КонтрагентИНН));
		Если ДлинаИНН = 12 Или ДлинаИНН = 10 Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Другие участники
	Для Каждого ТекущийУчастник Из ДоговорАрендаЛизинг.Участники Цикл
		
		Если ЗначениеЗаполнено(ТекущийУчастник.Участник) Тогда
			
			Возврат Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущийУчастник.УчастникИНН) Тогда
			
			ДлинаИНН = СтрДлина(СокрЛП(ТекущийУчастник.УчастникИНН));
			Если ДлинаИНН = 12 Или ДлинаИНН = 10 Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Выводит сообщения об ошибках из результата, полученного функцией РезультатПроверкиАрендатораДоговора(ДанныеТС, Отказ)
//
Процедура ВывестиРезультатПроверкиПолей(РезультатПроверки) Экспорт
	
	Если Не РезультатПроверки.ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
	
	Для Каждого ОшибкаПоля Из РезультатПроверки.ОшибкиПолей Цикл
		ПараметрыСообщения.Текст = ОшибкаПоля.ТекстОшибки;
		ПараметрыСообщения.Поле  = ОшибкаПоля.ИмяПоля;
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения, 
			РезультатПроверки.ДанныеОбъекта);
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиТранспортноеСредствоПоРегНомер(РегНомер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегНомер", РегНомер);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТранспортныеСредства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ТранспортныеСредства КАК КонтурЛогистика_ТранспортныеСредства
	|ГДЕ
	|	КонтурЛогистика_ТранспортныеСредства.РегНомер = &РегНомер
	|	И НЕ КонтурЛогистика_ТранспортныеСредства.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

// Тип печатной формы по типу транспортного средства
//
// Параметры:
//  ТипТранспортногоСредства - Строка	 - ТипТС из карточки транспорта
// 
// Возвращаемое значение:
//  Строка - имя печатной формы
//
Функция ТипПечатнойФормыПоТипуТранспортногоСредства(Знач ТипТранспортногоСредства) Экспорт
	
	ЗанчениеПоУмолчанию = Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ГрузовогоАвтомобиляФорма4С;
	
	Если ТипТранспортногоСредства = Неопределено
		Или Не ЗначениеЗаполнено(ТипТранспортногоСредства)
		Или ТипЗнч(ТипТранспортногоСредства) <> Тип("Строка") Тогда
		
		Возврат ЗанчениеПоУмолчанию;
	КонецЕсли;
	
	Если КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(НРег(ТипТранспортногоСредства), "легковой") <> 0 Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ЛегковогоАвтомобиляФорма3;
		
	ИначеЕсли КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(НРег(ТипТранспортногоСредства), "грузовой") <> 0
		Или КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(НРег(ТипТранспортногоСредства), "тягач") <> 0 Тогда
		
		Возврат Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ГрузовогоАвтомобиляФорма4С;
		
	Иначе
		
		Возврат ЗанчениеПоУмолчанию;
		
	КонецЕсли;
	
КонецФункции

Функция ОбязательныеРеквизиты() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("VIN");
	МассивОбязательных.Добавить("РегНомер");
	МассивОбязательных.Добавить("СТС");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция УсловноОбязательныеРеквизиты() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ВидВладения");
	МассивОбязательных.Добавить("ВместимостьКубМ");
	МассивОбязательных.Добавить("ГрузоподъемностьТонн");
	
	Возврат МассивОбязательных;
	
КонецФункции

#КонецОбласти

#Область ПереходНаЭПЛ502

Процедура ЗаполнитьТипТСПоКлассификатору(ТихийРежим = Истина) Экспорт
	
	Выборка = Справочники.КонтурЛогистика_ТранспортныеСредства.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТС = Выборка.Ссылка;
		
		Если ТС.ЭтоПрицеп Или ЗначениеЗаполнено(ТС.ТипТСПоКлассификатору) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипТСПоКлассификатору = Неопределено;  
		Если Найти(НРег(ТС.ТипТС), "грузов") > 0 Или Найти(НРег(ТС.ТипТС), "тягач") > 0 Тогда
			ТипТСПоКлассификатору = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Грузовой;
		ИначеЕсли Найти(НРег(ТС.ТипТС), "легков") > 0 Тогда
			ТипТСПоКлассификатору = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Легковой;
		ИначеЕсли Найти(НРег(ТС.ТипТС), "автобус") > 0 Тогда
			ТипТСПоКлассификатору = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Автобус;
		ИначеЕсли Найти(НРег(ТС.ТипТС), "трамвай") > 0 Или Найти(НРег(ТС.ТипТС), "троллейбус") > 0 Тогда
			ТипТСПоКлассификатору = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.ТрамвайТроллейбус;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипТСПоКлассификатору) Тогда
			ТСОбъект = ТС.ПолучитьОбъект();
			ТСОбъект.ТипТСПоКлассификатору = ТипТСПоКлассификатору;
			ТСОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ТихийРежим Тогда
		Сообщить("Заполнение типа ТС по классификатору выполнено");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗафиксироватьОшибку(Результат, ИмяПоля, ТекстОшибки)
	
	Результат.ЕстьОшибки = Истина;
	ОшибкаПоля = ОписаниеОшибкиПоля();
	ОшибкаПоля.ИмяПоля 	   = ИмяПоля;
	ОшибкаПоля.ТекстОшибки = ТекстОшибки;
	Результат.ОшибкиПолей.Добавить(ОшибкаПоля);	
	
КонецПроцедуры

Функция ЗначениеПеречисления(ИмяПеречисления, ИмяЗначения)
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(ИмяПеречисления, ИмяЗначения);
	
КонецФункции

Функция ОписаниеОшибкиПоля()
	
	Возврат Новый Структура("ИмяПоля, ТекстОшибки");
	
КонецФункции

Функция ОписаниеРезультатаПроверки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки", 	Ложь);
	Результат.Вставить("ДанныеОбъекта", Неопределено);
	Результат.Вставить("ОшибкиПолей", 	Новый Массив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли