
&Вместо("Комплектующие")
Функция ОД_Комплектующие(Параметры, ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Параметры.ВариантКомплектацииНоменклатуры) Тогда
		ВариантКомплектацииНоменклатуры = ВариантКомплектацииНоменклатурыПоУмолчанию(
			Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
	Иначе
		ВариантКомплектацииНоменклатуры = Параметры.ВариантКомплектацииНоменклатуры;
	КонецЕсли;
	
	Если Не Параметры.Свойство("КоличествоУпаковок") Тогда
		Параметры.Вставить("КоличествоУпаковок", 1);
	КонецЕсли;
	
	ПодобранныеТовары = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ВариантКомплектацииНоменклатуры) Тогда
		ТекстОшибки = НСтр("ru = 'Для номенклатуры %1 не определен состав набора'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			Параметры.НоменклатураНабора,
			Параметры.ХарактеристикаНабора);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат ПодобранныеТовары;
	КонецЕсли;
	
	Комплектующие = НаборыСервер.СоздатьТаблицуСоставаНабора(КолонкиНабора());
	Комплектующие.Колонки.Добавить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	Комплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	ВариантРасчетаЦеныНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантКомплектацииНоменклатуры, "ВариантРасчетаЦеныНабора");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	СУММА(Т.Количество) КАК Количество
		|ПОМЕСТИТЬ ОстаткиИзЗаказов
		|ИЗ
		|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
		|ГДЕ
		|	Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
		|	И Т.Количество < 0
		|	И &ФильтрСкладыТ
		|СГРУППИРОВАТЬ ПО
		|	Т.Номенклатура,
		|	Т.Характеристика
		|////////////////////////////////////////////////////////////////////////////////////
		|
		|;
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости
		|ПОМЕСТИТЬ
		|	ВариантыКомплектацииНоменклатурыТовары
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстатки.ВРезервеПодЗаказОстаток, 0) -
		|	ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0) + ЕСТЬNULL(ОстаткиИзЗаказов.Количество, 0)) КАК Доступно,
		|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличии
		|ПОМЕСТИТЬ
		|	ДоступностьТоваров
		|ИЗ
		|	ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.СвободныеОстатки.Остатки(
		|			,
		|			(Номенклатура,Характеристика) В
		|				(ВЫБРАТЬ
		|					ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|					ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика
		|				ИЗ
		|					ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары)
		|			И &ФильтрСклады
		|		) КАК СвободныеОстатки
		|	ПО СвободныеОстатки.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|		И СвободныеОстатки.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		ОстаткиИзЗаказов КАК ОстаткиИзЗаказов
		|		ПО ОстаткиИзЗаказов.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|		 И ОстаткиИзЗаказов.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|;
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости КАК ДоляСтоимости,
		|	ДоступностьТоваров.Доступно / ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Доступно,
		|	ДоступностьТоваров.ВНаличии / ЕстьNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ВНаличии
		|ИЗ
		|	ВариантыКомплектацииНоменклатурыТовары КАК ВариантыКомплектацииНоменклатурыТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ ДоступностьТоваров КАК ДоступностьТоваров
		|	ПО ДоступностьТоваров.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|	И ДоступностьТоваров.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика
		|");
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения)",
		"ВЫРАЗИТЬ(ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Справочник.Номенклатура)"));
		
	Запрос.УстановитьПараметр("Ссылка",  ВариантКомплектацииНоменклатуры);
	
	Если ДополнительныеПараметры.Свойство("Склады") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСкладыТ", "Т.Склад В(&Склады)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрСклады",  "Склад В (&Склады)");
		Запрос.УстановитьПараметр("Склады",  ДополнительныеПараметры.Склады);
	Иначе
		Запрос.УстановитьПараметр("ФильтрСклады",  Истина);
		Запрос.УстановитьПараметр("ФильтрСкладыТ", Истина);
	КонецЕсли;
		
	Выборка = Запрос.ВыполнитьПакет()[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок   = НоваяСтрока.КоличествоУпаковок;
		НоваяСтрока.Количество           = НоваяСтрока.Количество;
		НоваяСтрока.НоменклатураНабора   = Параметры.НоменклатураНабора;
		НоваяСтрока.ХарактеристикаНабора = Параметры.ХарактеристикаНабора;
		
	КонецЦикла;
	
	Если ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
		
		Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
				Комплектующие,
				Неопределено, // Массив строк или структура отбора.
				ПараметрыЗаполнения);
		ИначеЕсли ДополнительныеПараметры.Свойство("Соглашение") Тогда
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыЗаполнения.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыЗаполнения.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыЗаполнения.Вставить("РассчитыватьНаборы", Истина);
			ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
			
			ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
				Комплектующие,
				Неопределено, // Массив строк или структура отбора.
				ПараметрыЗаполнения);
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Комплектующие Цикл
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = СтрокаТЧ.Номенклатура;
			ПараметрыТовара.Характеристика     = СтрокаТЧ.Характеристика;
			ПараметрыТовара.Упаковка           = СтрокаТЧ.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = СтрокаТЧ.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = СтрокаТЧ.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения    = СтрокаТЧ.ЕдиницаИзмерения;
			ПараметрыТовара.ВидЦены            = СтрокаТЧ.ВидЦены;
			ПараметрыТовара.Цена               = СтрокаТЧ.Цена;
			ПараметрыТовара.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = СтрокаТЧ.Количество * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Доступно           = СтрокаТЧ.Доступно;
			ПараметрыТовара.ВНаличии           = СтрокаТЧ.ВНаличии;
			
			Если ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
				ИЛИ ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
			
			ПодобранныеТовары.Добавить(ПараметрыТовара);
			
		КонецЦикла;
		
	Иначе
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
			И ДополнительныеПараметры.Свойство("Соглашение")
			И ЗначениеЗаполнено(ДополнительныеПараметры.Соглашение) Тогда
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("Соглашение", ДополнительныеПараметры.Соглашение);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		Иначе
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("Дата", ДополнительныеПараметры.Дата);
			ПараметрыРасчета.Вставить("Валюта", ДополнительныеПараметры.Валюта);
			ПараметрыРасчета.Вставить("ВидЦены", ДополнительныеПараметры.ВидЦены);
			ПараметрыРасчета.Вставить("ПоляЗаполнения", "Цена");
			
		КонецЕсли;
		
		КоэффициентыПропорциональностиРасчетаЦенНаборов = НаборыСервер.КоэффициентыРаспределения(
			Комплектующие.Скопировать(), ПараметрыРасчета);
		
		ОбщаяСтоимость = 0;
		Для Каждого ТекущаяСтрока Из КоэффициентыПропорциональностиРасчетаЦенНаборов Цикл
			ОбщаяСтоимость = ОбщаяСтоимость + ТекущаяСтрока.Цена;
		КонецЦикла;

		СуммаКРаспределению = ДополнительныеПараметры.Цена * Параметры.КоличествоУпаковок;
		
		СлужебнаяТЧ = Новый ТаблицаЗначений;
		СлужебнаяТЧ.Колонки.Добавить("СтрокаТЧ");
		СлужебнаяТЧ.Колонки.Добавить("НомерСтроки");
		
		Комплектующие.Сортировать("КоличествоУпаковок Убыв");
		Для Каждого ТекущаяСтрока Из Комплектующие Цикл
			
			Стоимость = КоэффициентыПропорциональностиРасчетаЦенНаборов.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки").Цена;
			
			ПараметрыТовара = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыТовара, Параметры);
			
			ПараметрыТовара.Номенклатура       = ТекущаяСтрока.Номенклатура;
			ПараметрыТовара.Характеристика     = ТекущаяСтрока.Характеристика;
			ПараметрыТовара.Упаковка           = ТекущаяСтрока.Упаковка;
			ПараметрыТовара.ТипНоменклатуры    = ТекущаяСтрока.ТипНоменклатуры;
			ПараметрыТовара.ВидНоменклатуры    = ТекущаяСтрока.ВидНоменклатуры;
			ПараметрыТовара.ЕдиницаИзмерения   = ТекущаяСтрока.ЕдиницаИзмерения;
			ПараметрыТовара.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок * Параметры.КоличествоУпаковок;
			ПараметрыТовара.Количество         = ТекущаяСтрока.Количество * Параметры.КоличествоУпаковок;
			
			Если ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
				ИЛИ ПараметрыТовара.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				ПараметрыТовара.Склад = Неопределено;
			КонецЕсли;
			
			Если ДополнительныеПараметры.Свойство("ВидЦены") Тогда
				ПараметрыТовара.ВидЦены = ДополнительныеПараметры.ВидЦены;
			Иначе
				ПараметрыТовара.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
			КонецЕсли;
			
			Если ПараметрыТовара.КоличествоУпаковок <> 0 И ОбщаяСтоимость <> 0 Тогда
				ПараметрыТовара.Цена = Окр(((Стоимость / ОбщаяСтоимость) * СуммаКРаспределению) / ПараметрыТовара.КоличествоУпаковок, 2);
			Иначе
				ПараметрыТовара.Цена = 0;
			КонецЕсли;
			
			ОбщаяСтоимость = ОбщаяСтоимость - Стоимость;
			СуммаКРаспределению = СуммаКРаспределению - ПараметрыТовара.Цена * ПараметрыТовара.КоличествоУпаковок;
			
			ПараметрыТовара.Доступно = ТекущаяСтрока.Доступно;
			ПараметрыТовара.ВНаличии = ТекущаяСтрока.ВНаличии;
			
			ПараметрыТовара.ХарактеристикиИспользуются = ?(ЗначениеЗаполнено(ПараметрыТовара.Характеристика), Истина, Ложь);
			
			СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
			СлужебнаяСтрока.СтрокаТЧ = ПараметрыТовара;
			СлужебнаяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
			
		КонецЦикла;
		
		Если СуммаКРаспределению <> 0 И СлужебнаяТЧ.Количество() > 0 Тогда
			
			ПоследняяСтрока = СлужебнаяТЧ[СлужебнаяТЧ.Количество() - 1];
			ИсходнаяСтрока = ПоследняяСтрока.СтрокаТЧ;
			
			Если ИсходнаяСтрока.КоличествоУпаковок > 1 Тогда
				НоваяСтрока = ПодборТоваровКлиентСервер.ПараметрыТовара();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
				
				ИсходнаяСтрока.КоличествоУпаковок = ИсходнаяСтрока.КоличествоУпаковок - 1;
				НоваяСтрока.КоличествоУпаковок = 1;
				НоваяСтрока.Цена = НоваяСтрока.Цена + СуммаКРаспределению;
				
				СлужебнаяСтрока = СлужебнаяТЧ.Добавить();
				СлужебнаяСтрока.СтрокаТЧ = НоваяСтрока;
				СлужебнаяСтрока.НомерСтроки = ПоследняяСтрока.НомерСтроки;
				
			Иначе
				
				ИсходнаяСтрока.Погрешность = СуммаКРаспределению;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СлужебнаяТЧ.Сортировать("НомерСтроки Возр");
		Для Каждого СтрокаТЧ Из СлужебнаяТЧ Цикл
			ПодобранныеТовары.Добавить(СтрокаТЧ.СтрокаТЧ);
		КонецЦикла;
		
	КонецЕсли;
	
	// 18.03.2026, Т-5, информационное сообщение, доработки не требуются
	Сообщить("Т-5, ОМ НаборыВызовСервера, расчет цены набора, вызов из подбора");

	Возврат ПодобранныеТовары;
	
КонецФункции
