
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользовательАдминистратор 	= КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор();
	ТекПользовательМожетВНастройки  = РольДоступна("КонтурЛогистика_НастройкаПодписания");
	
	Если Не ТекПользовательАдминистратор И Не ТекПользовательМожетВНастройки Тогда
		Элементы.ФормаСкопировать.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюСкопировать.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ТекПользовательАдминистратор Тогда
		Элементы.СписокКонтекстноеМенюУдалить.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Сертификат") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сертификат");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		ЭлементОтбора.ПравоеЗначение = Параметры.Сертификат;
		
		СертификатОтбор = Параметры.Сертификат;
		
		Элементы.СертификатОтбор.Видимость = Истина;
		
	КонецЕсли;
	
	КонтурЛогистика_ОнбордингСервер.ПриСозданииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	ПодключитьОбработчикОжидания("ОткрытьОнбординг", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	Оповестить("КонтурЛогистика_ОбновитьНастройкиПодписанияВСтартовомПомощнике");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОнбординг()
	
	КонтурЛогистика_ОнбордингКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Оповестить("ВыполнитьПроверкуСертификатов");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(СертификатОтбор) Тогда
		
		Отказ = истина;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Сертификат", СертификатОтбор);
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
							"РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи",
							Параметрыформы,
							ЭтаФорма,
							ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры
