
#Область ПрограммныйИнтерфейс

Функция НайтиСуществующийМаршрут(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	// TODO проработать проблему если найдем несколько
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.НомДок = &НомДок
	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СвЭксп = &СвЭксп
	|	И НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомДок", ДЛ_ЗаявкаНаДоставку.НомерЗаказа);
	Запрос.УстановитьПараметр("СвЭксп", КонтурЛогистика_ИнтеграцияДЛСервер.ДЛ_ОрганизацияЭкспедитор());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДокументыОснования(ДЛ_ЗаявкаНаДоставку) Экспорт

	Возврат ДЛ_ЗаявкаНаДоставку.ДокументыОснования.Выгрузить(,"Документ").ВыгрузитьКолонку("Документ");	

КонецФункции

Функция СоздатьМаршрут(ДЛ_ЗаявкаНаДоставку) Экспорт

	ДанныеЗаполнения = Новый Структура("ДЛ_ЗаявкаНаДоставку", ДЛ_ЗаявкаНаДоставку);
	
	ОбъектМаршрут = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СоздатьДокумент();
	ОбъектМаршрут.Заполнить(ДанныеЗаполнения);  // TODO передать параметр заполнения
	Если Не ЗначениеЗаполнено(ОбъектМаршрут.Дата) Тогда
		ОбъектМаршрут.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	ОбъектМаршрут.Записать();
	
 	Возврат ОбъектМаршрут.Ссылка;

КонецФункции

Функция ЗаполнитьМаршрутИВернутьПоручение(Знач СуществующийМаршрут, ДЛ_ЗаявкаНаДоставку) Экспорт
	
	ДанныеЗаполнения = Новый Структура("ДЛ_ЗаявкаНаДоставку", ДЛ_ЗаявкаНаДоставку);
	
	ОбъектМаршрут = СуществующийМаршрут.ПолучитьОбъект();
	ОбъектМаршрут.Заполнить(ДанныеЗаполнения);
	ОбъектМаршрут.Записать();
	ПЭ = ОбъектМаршрут.Титул1;
	
	Возврат ПЭ;
	
КонецФункции

Функция ВведенныеМаршрутыПорученияЭкспедитору(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	ДокументыОснования = ДЛ_ЗаявкаНаДоставку.ДокументыОснования.Выгрузить(,"Документ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления
	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ДокументОснование В(&ДокументыОснования)";
	
	Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
	
	Результат = Запрос.Выполнить();
	МассивМаршрутов = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивМаршрутов;
	
КонецФункции

Функция ПараметрыЗаполненияКонтурЛогистика(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	//ДокументОснование = 
	ПараметрыФормы = Новый Структура;
	Возврат ПараметрыФормы;

КонецФункции

Функция СоздатьПЭПоМассивуМаршрутов(СуществующиеМаршруты) Экспорт
	
	НовоеПЭ = Документы.КонтурЛогистика_ПЭ_Титул1.СоздатьДокумент();
	
	НовоеПЭ.Заполнить(Новый Структура("МассивПартий", СуществующиеМаршруты));
	Если Не ЗначениеЗаполнено(НовоеПЭ.Дата) Тогда 
		НовоеПЭ.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НовоеПЭ.Записать();
	
	Для Каждого Маршрут Из СуществующиеМаршруты Цикл
		МаршрутОбъект = Маршрут.ПолучитьОбъект();
		МаршрутОбъект.Титул1 = НовоеПЭ.Ссылка;
		МаршрутОбъект.ОбменДанными.Загрузка = Истина;
		МаршрутОбъект.Записать();
	КонецЦикла;
	
	Возврат НовоеПЭ.Ссылка;

КонецФункции

Функция СтруктураОтображенияСтатусаПорученияЭкспедиторуДеловыеЛинии(ДЛ_ЗаявкаНаДоставку) Экспорт
	
	// TODO разделить через документ основание и через поиск по номеру
	// сейчас здесь только по номеру
	Маршрут = НайтиСуществующийМаршрут(ДЛ_ЗаявкаНаДоставку);
	Если Не ЗначениеЗаполнено(Маршрут) Тогда 
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью, "Оформить ЭПД");
	КонецЕсли;
	
	ПоручениеЭкспедитору = Маршрут.Титул1;
	Если Не ЗначениеЗаполнено(ПоручениеЭкспедитору) Тогда 
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью, "Оформить ЭПД");
	КонецЕсли;
	
	СтатусПоручения = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ПоручениеЭкспедитору, Истина);
	Если СтатусПоручения.Код = "pe-wait-forwarder" Тогда 
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЧеловекГалстук, "Ожидание подписи ДЛ");
	ИначеЕсли СтатусПоручения.Код = "pe-completed" Тогда
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_Рукопожатие, "ЭПД подписан");
	Иначе
		Возврат Новый Структура("Отображать, Картинка, Заголовок", Истина, БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью, "Подписать ЭПД");
	КонецЕсли;
	
КонецФункции

Функция ДЛ_ЗаказыПоОснованиям(МассивОснований) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Ссылка.НомерЗаказа КАК НомерЗаказа,
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Ссылка КАК ДЛ_ЗаявкаНаДоставку,
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Документ.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ДЛ_ЗаявкаНаДоставку.ДокументыОснования КАК ДЛ_ЗаявкаНаДоставкуДокументыОснования
	|ГДЕ
	|	ДЛ_ЗаявкаНаДоставкуДокументыОснования.Документ В(&СписокДокументовОснований)";
	
	Запрос.УстановитьПараметр("СписокДокументовОснований", МассивОснований);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗаказов = Результат.Выгрузить();
	
	Возврат ТаблицаЗаказов;
	
КонецФункции

Функция ДЛ_ОрганизацияЭкспедитор() Экспорт
	
	НайденнаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиОрганизациюПоКлючевымРеквизитам("7826156685", "781001001");
	Если ЗначениеЗаполнено(НайденнаяОрганизация) Тогда 
		Возврат НайденнаяОрганизация;
	Иначе
		
		НоваяОрганизацияДД = Справочники.КонтурЛогистика_ОрганизацииДиадок.СоздатьЭлемент();
		НоваяОрганизацияДД.ИНН = "7826156685";
		НоваяОрганизацияДД.КПП = "781001001";
		НоваяОрганизацияДД.Наименование = "ООО""Деловые Линии""";
		НоваяОрганизацияДД.НаименованиеОрганизацииПолное = НоваяОрганизацияДД.Наименование;
		
		НоваяОрганизацияДД.ТелефонОсновной = "8-800-100-80-00";
		НоваяОрганизацияДД.АдресСтрока = "196210, город Санкт-Петербург, Стартовая ул., д. 8 литер а, офис 132";
		
		НоваяОрганизацияДД.Записать();
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(НоваяОрганизацияДД.Ссылка);
		Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(МассивОрганизаций);
		НоваяОрганизацияДД.СинхронизироватьИзСервисаЛогистика();
		
		Возврат НоваяОрганизацияДД.Ссылка;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
