#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьНазваниеРеквизита(Значение) Экспорт
	
	Если Значение = ОбъявленнаяСтоимость Тогда 
		Возврат "ОбъявлСтГруз";
	ИначеЕсли Значение = ДействительнаяСтоимость Тогда
		Возврат "ДейстСтГруз";
	Иначе
		Возврат "ОбъявлСтГруз";	
	КонецЕсли;	 	
	
КонецФункции	 

Функция ПолучитьТипПоНазваниюРеквизита(Значение) Экспорт
	
	Если Найти(Значение, "ОбъявлСт") Тогда 
		Возврат ОбъявленнаяСтоимость;
	ИначеЕсли Найти(Значение, "ДейстСт") Тогда
		Возврат ДействительнаяСтоимость
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;	 	
	
КонецФункции

#КонецЕсли