
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	УточнениеТипаЛогистика = "";
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
		Если Форма.Элементы.Найти("ТипЛогистика") <> Неопределено Тогда
			УточнениеТипаЛогистика = Форма.ТипЛогистика;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	ПараметрКоманды = ОтфильтроватьМассивДокументовКОбработкеПоНастройкамНКД(ПараметрКоманды, Ложь, УточнениеТипаЛогистика);
	Если ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ПараметрКоманды, УточнениеТипаЛогистика);
	
	Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
	МассивФайловОбмена = ИзготовитьФайлыОбмена(ПараметрыВводаДокументов);
	
	Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	КонтурЛогистика_ОбработкаДокументовКлиент.ОтправитьФайлы(МассивФайловОбмена);
	
	Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
	
	ОповеститьОбИзменении(ТипЗнч(ПараметрКоманды[0]));
	Оповестить("КонтурЛогистика_ОбновитьЗадачи", ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Функция ОтфильтроватьМассивДокументовКОбработкеПоНастройкамНКД(МассивДокументов, ТребуетсяПодпись, УточнениеТипаЛогистика)
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.ОтфильтроватьМассивДокументовКОбработкеПоНастройкамНКД(
		МассивДокументов, ТребуетсяПодпись, УточнениеТипаЛогистика);
	
КонецФункции

&НаСервере
Функция ИзготовитьФайлыОбмена(ПараметрыВводаДокументов)
	
	ПараметрыФормированияФайловРеквизиты = Новый Структура;
	ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
	
	МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
		ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
	
	Возврат МассивФайловОбмена;
	
КонецФункции




