
&НаКлиенте
&Вместо("ПодборТаблицаНоменклатураВыборЗавершение")
Процедура ОД_ПодборТаблицаНоменклатураВыборЗавершение(Результат, ДополнительныеПараметры)
	
	ИмяСобытия = "Обработка.ПодборТоваровВДокументПродажи.Форма.Событие.ПодборТаблицаНоменклатураВыборЗавершение";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, ИмяСобытия);
	
	СтрокаТаблицыНоменклатуры = ДополнительныеПараметры.Элемент.ТекущиеДанные;
	
	Если СтрокаТаблицыНоменклатуры.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьХарактеристикиНоменклатуры 
		И СтрокаТаблицыНоменклатуры.ХарактеристикиИспользуются Тогда
		
		ПерейтиКСпискуХарактеристик();
		ПодборТоваровКлиент.ПослеПереходаКСпискуХарактеристик(ЭтаФорма);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыТовара = ПолучитьПараметрыТовараПередДобавлениеВКорзину(ПараметрыФормы);
		
		// 18.03.2026, Т-7, для подбора товара и наборов с установленной ценой на комплектующие
		//ВидЦеныАкционная = QWERTY_Сервер.ВидЦеныАкционная();
		//ЦенаАкционная = QWERTY_Сервер.ПолучитьЦену(ПараметрыТовара.Номенклатура, ВидЦеныАкционная, ТекущаяДата());
		
		// 01.04.2026
		СтруктураПараметровОтбора = Новый Структура("Дата, ВидЦеныДокумента, ВидЦеныАкционная, Номенклатура, НоменклатураНабора");
		СтруктураПараметровОтбора.Номенклатура			= ПараметрыТовара.Номенклатура;
		СтруктураПараметровОтбора.Дата					= ТекущаяДата();
		СтруктураПараметровОтбора.ВидЦеныАкционная		= QWERTY_Сервер.ВидЦеныАкционная();
		СтруктураПараметровОтбора.ВидЦеныДокумента		= ПараметрыТовара.ВидЦены;
		СтруктураПараметровОтбора.НоменклатураНабора	= ПараметрыТовара.НоменклатураНабора;
		
		ЦенаАкционная = QWERTY_Сервер.ПолучитьЦенуПоОтбору(СтруктураПараметровОтбора);
		
		
		Если ЦенаАкционная > 0 Тогда
			ПараметрыТовара.Цена = ЦенаАкционная;
			ПараметрыТовара.ВидЦены = СтруктураПараметровОтбора.ВидЦеныАкционная;
			Сообщить("Т-7, Обработка ПодборТоваровВДокумент, переназначен вид цены на Акционная");
		КонецЕсли;
		
		ДобавитьВКорзину(ПараметрыТовара, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ДобавитьВКорзину")
Процедура ОД_ДобавитьВКорзину(ПараметрыТовара, ПараметрыФормы)

	Если Не ЗначениеЗаполнено(ПараметрыТовара) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьКоличество И Не РежимПодбораБезКоличественныхПараметров Тогда
		
		Если Не ЗначениеЗаполнено(ПараметрыФормы) Тогда
			ПараметрыФормы = Новый Структура;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Номенклатура",                      ПараметрыТовара.Номенклатура);
		ПараметрыФормы.Вставить("Характеристика",                    ПараметрыТовара.Характеристика);
		ПараметрыФормы.Вставить("ВидЦены",                           ПараметрыТовара.ВидЦены);
		ПараметрыФормы.Вставить("Соглашение",                        Соглашение);
		ПараметрыФормы.Вставить("Упаковка",                          ПараметрыТовара.Упаковка);
		ПараметрыФормы.Вставить("Цена",                              ПараметрыТовара.Цена);
		ПараметрыФормы.Вставить("Склад",                             ПараметрыТовара.Склад);
		ПараметрыФормы.Вставить("ДатаОтгрузки",                      ПараметрыТовара.ДатаОтгрузки);
		ПараметрыФормы.Вставить("ТипНоменклатуры",                   ПараметрыТовара.ТипНоменклатуры);
		ПараметрыФормы.Вставить("Дата",                              Дата);
		ПараметрыФормы.Вставить("Валюта",                            Валюта);
		ПараметрыФормы.Вставить("СкрытьЦену",                        РежимПодбораБезСуммовыхПараметров Или Не ЗапрашиватьЦену);
		ПараметрыФормы.Вставить("РедактироватьВидЦены",              Элементы.КорзинаВидЦены.Видимость);
		ПараметрыФормы.Вставить("Склады",                            Склады.ВыгрузитьЗначения());
		ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",          ИспользоватьДатыОтгрузки);
		ПараметрыФормы.Вставить("ИспользоватьСкладыВТабличнойЧасти", РежимПодбораИспользоватьСкладыВТабличнойЧасти);
		ПараметрыФормы.Вставить("ЦенаВключаетНДС",                   Объект.ЦенаВключаетНДС);
		ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",              СкрыватьРучныеСкидки Или РежимПодбораБезСуммовыхПараметров Или Не ЗапрашиватьЦену);
		ПараметрыФормы.Вставить("ИспользоватьРучныеСкидкиВПродажах", ИспользоватьРучныеСкидкиВПродажах);
		ПараметрыФормы.Вставить("ВидыЦен",                           ВидыЦен.ВыгрузитьЗначения());
		ПараметрыФормы.Вставить("ОтображатьОстатки",                 ОтображатьОстатки);
		ПараметрыФормы.Вставить("БезОтбораПоВключениюНДСВЦену",      БезОтбораПоВключениюНДСВЦену);
		ПараметрыФормы.Вставить("ПодборТоваров",                     Истина);
		ПараметрыФормы.Вставить("ПараметрыУказанияСерий",            ПараметрыУказанияСерий);
		Если ЗначениеЗаполнено(ОтборПоНазначению) Тогда
			ПараметрыФормы.Вставить("Назначение",                    ОтборПоНазначению);
		Иначе
			ПараметрыФормы.Вставить("Назначение",                    Назначение);
		КонецЕсли;
		ПараметрыФормы.Вставить("Подразделение",                     Подразделение);
		ПараметрыФормы.Вставить("КоличествоОформлено",               0);
		ПараметрыФормы.Вставить("Регистратор",                       ДокументСсылка);
		ПараметрыФормы.Вставить("ПодборВариантовОбеспечения",        ПодборВариантовОбеспечения);
		ПараметрыФормы.Вставить("ТолькоОбособленно",                 ТолькоОбособленно);
		ПараметрыФормы.Вставить("ВариантыОбеспечения",               ВариантыОбеспечения);
		ПараметрыФормы.Вставить("ОграничиватьВариантыОбеспечения",   ОграничиватьВариантыОбеспечения);
		
		Если ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения
			И (ПодборВариантовОбеспечения
				Или (Не (ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
				Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")))
				И (ПараметрыТовара.СтатусУказанияСерий <> 0
					И НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(ПараметрыТовара.СтатусУказанияСерий, ПараметрыУказанияСерий)
				Или Склады.Количество()>1))
			И (Не ОграничиватьВариантыОбеспечения
			Или (Не (ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
				Или ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"))))
			И Не СкрыватьКомандуОстаткиНаСкладах 		
			И (ЗначениеЗаполнено(Склад) Или ОстаткиПоВсемСкладам) Тогда
			ПараметрыФормы.Вставить("Склад",                         Склад);
			ИмяФормыЗапросаКоличества = "Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличестваИСерий";
		Иначе
			Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор") Тогда
				ИмяФормыЗапросаКоличества = "Обработка.ПодборТоваровВДокументПродажи.Форма.СоставНабора";
			Иначе
				ИмяФормыЗапросаКоличества = "Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличества";
			КонецЕсли;
		КонецЕсли;
		
		ОткрытьФорму(
			ИмяФормыЗапросаКоличества, 
			ПараметрыФормы, 
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ДобавитьВКорзинуПослеВыбораКоличества", ЭтотОбъект, ПараметрыТовара),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	Иначе
		
		НовыеСтроки = Новый Массив;
		
		Если ПараметрыТовара.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор")
			И (Не НеРазбиватьНаборыПоКомплектующим) Тогда
			
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(ПараметрыКомплектующих, ПараметрыТовара);
			ПараметрыКомплектующих.НоменклатураНабора   = ПараметрыТовара.Номенклатура;
			ПараметрыКомплектующих.ХарактеристикаНабора = ПараметрыТовара.Характеристика;
			Если Склады.Количество() = 1 Тогда
				ПараметрыКомплектующих.Склад = Склады.Получить(0).Значение;
			КонецЕсли;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Дата", Дата);
			ДополнительныеПараметры.Вставить("Валюта", Валюта);
			ДополнительныеПараметры.Вставить("Склады", Склады.ВыгрузитьЗначения());
			ДополнительныеПараметры.Вставить("Соглашение", Соглашение);
			ДополнительныеПараметры.Вставить("Цена", ПараметрыТовара.Цена);
			ДополнительныеПараметры.Вставить("ВидЦены", ПараметрыТовара.ВидЦены);
			ПодобранныеТовары = НаборыВызовСервера.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
			
			Для Каждого ПодобранныйТовар Из ПодобранныеТовары Цикл
				НовыеСтроки.Добавить(ПодобранныйТовар);
			КонецЦикла;
			
		Иначе
			НоваяСтрока = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыТовара);

			// 18.03.2026, Т-2
			СтруктураПараметровОтбора = Новый Структура("Дата, ВидЦеныДокумента, ВидЦеныАкционная, Номенклатура, НоменклатураНабора");
			СтруктураПараметровОтбора.Номенклатура			= НоваяСтрока.Номенклатура;
			СтруктураПараметровОтбора.Дата					= ТекущаяДатаСеанса;
			СтруктураПараметровОтбора.ВидЦеныАкционная		= QWERTY_Сервер.ВидЦеныАкционная();
			СтруктураПараметровОтбора.ВидЦеныДокумента		= НоваяСтрока.ВидЦены;
			//СтруктураПараметровОтбора.НоменклатураНабора	= Справочники.Номенклатура.ПустаяСсылка();
			
			ЦенаАкционная = QWERTY_Сервер.ПолучитьЦенуПоОтбору(СтруктураПараметровОтбора);
			Если ЦенаАкционная > 0 Тогда
				НоваяСтрока.Цена		= ЦенаАкционная;
				НоваяСтрока.ВидЦены	= СтруктураПараметровОтбора.ВидЦеныАкционная;
				Сообщить("Т-2, добавление обычного товара в корзину");
			КонецЕсли;
			
			НовыеСтроки.Добавить(НоваяСтрока);
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьВКорзинуЗавершение(ПараметрыТовара, НовыеСтроки);

КонецПроцедуры
