
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвторизацияПриОткрытии") Тогда
		АвторизацияПриОткрытии = Истина;
	КонецЕсли;
	
	ЗаполнитьСписокНашихОрганизаций();
	
	УстановитьУсловноеОформление();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		
		Элементы.ДекорацияГруппаВыбратьВсе.Видимость = Ложь;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(
		Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации;
	
	ОбновитьВидимостьДоступность();
	
	Если АвторизацияПриОткрытии Тогда
		РежимСпискаОрганизаций = "ДобавитьОрганизацию";
		ПодключитьОбработчикОжидания("АвторизацияОрганизации", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОрганизацияЗаписана"
		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации Тогда
		
		ЗаполнитьСписокНашихОрганизаций();
		
		ОбновитьВидимостьДоступность();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы Тогда
		Оповестить("КонтурЛогистика_Аутентификация");
		Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияАвторизоватьсяНажатие(Элемент)
	
	АвторизоватьсяНаПортале();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОнлайнКонсультантНажатие(Элемент)
	
	КонтурЛогистика_ЦентрПоддержкиКлиент.ОткрытьЦентрПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНетНужнойОрганизацииНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(
		"https://support.kontur.ru/logistika-1s/82041-avtorizaciya_v_module#header_82041_1");
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Авторизация", "Нет нужной организации",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСписокОрганизацийПустПодсказка8Нажатие(Элемент)
	
	ТекстСсылка = "https://diadoc.kontur.ru/";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТекстСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСписокОрганизацийПустПодсказка9Нажатие(Элемент)
	
	ТекстСсылка = "https://support.kontur.ru/logistika/51865-avtoregistraciya_organizacij)";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТекстСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНашихОрганизаций

&НаКлиенте
Процедура СписокНашихОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "СписокНашихОрганизацийДействие1"
		Или Поле.Имя = "СписокНашихОрганизацийДействие2" Тогда
		
		Если Поле.Имя = "СписокНашихОрганизацийДействие1" Тогда
			ТекущееДействие = ТекущиеДанные.Действие1;
		Иначе
			ТекущееДействие = ТекущиеДанные.Действие2;
		КонецЕсли;
		
		Если ТекущееДействие = "Авторизоваться" Тогда
			
			АвторизоватьсяНаПортале(ТекущиеДанные.Организация);
			
			ДопИнформация = Новый Структура;
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Авторизоваться",
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
			
		ИначеЕсли ТекущееДействие = "Обновить" Тогда
			
			ОбновитьАвторизациюНаПортале(ТекущиеДанные.Организация);
			
		ИначеЕсли Лев(ТекущееДействие, 5) = "Выйти" Тогда
			
			ЗавершитьСессиюНаПортале(ТекущиеДанные.Организация);
			
			ОбновитьВидимостьДоступность();
			
			ДопИнформация = Новый Структура;
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Выйти",
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокОрганизацийОрганизация" Тогда
		
		ПоказатьЗначение(, ТекущиеДанные.Организация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНашихОрганизацийОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНашихОрганизацийОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОрганизаций

&НаКлиенте
Процедура СписокОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "СписокОрганизацийДействие" Тогда
		
		Если ТекущиеДанные.ПраваДоступа = "Недостаточно прав"
			Или ТекущиеДанные.ПраваДоступа = "Необходимо выбрать роли" Тогда
			
			РолиОрганизации = РолиОрганизацииИзСписка(ТекущиеДанные.Роли);
			ОткрытьФормуРедактированияРолей(ТекущиеДанные.Организация, Токен, РолиОрганизации);
			
		ИначеЕсли ТекущиеДанные.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЭтоАдминистратор", ТекущиеДанные.ЭтоАдминистратор);
			ПараметрыФормы.Вставить("DiadocBoxId", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаКакЗарегистрироватьОрганизацию", ПараметрыФормы,
				ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
			
			ДопИнформация = Новый Структура;
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
			
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Авторизация", "Зарегистрировать в Логистике",
				"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
			
		ИначеЕсли ТекущиеДанные.ПраваДоступа = "Ошибка" Тогда
			
			Сообщить(ТекущиеДанные.ТекстОшибки);
			
		ИначеЕсли ТекущиеДанные.ПраваДоступа = "Необходима оплата тарифа АПИ" Тогда
			
			СсылкаНаПриобритение = "https://kontur.ru/logistika#order";
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНаПриобритение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеПриИзменении(Элемент)
	
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если ТекущаяСтрока.ПраваДоступа = "" Тогда
			ТекущаяСтрока.Наш = ВыбратьВсе;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийНашПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокОрганизаций.ТекущиеДанные;
	
	Если ТекущиеДанные.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
		ТекстСообщения = "Необходимо зарегистрировать организацию в Логистике";
	ИначеЕсли ТекущиеДанные.ПраваДоступа = "Необходима оплата тарифа АПИ" Тогда
		ТекстСообщения = "Необходима оплата тарифа АПИ";
	ИначеЕсли ТекущиеДанные.ПраваДоступа = "Ошибка" Тогда
		ТекстСообщения = "Необходима исправить ошибку: " + ТекущиеДанные.ТекстОшибки;
	ИначеЕсли ТекущиеДанные.ПраваДоступа = "Необходимо выбрать роли" Тогда
		Если ТекущиеДанные.Наш Тогда
			ТекущиеДанные.Пояснение = "Необходимо выбрать роли";
			ТекущиеДанные.Действие = "Выбрать";
		Иначе
			ТекущиеДанные.Пояснение = "";
			ТекущиеДанные.Действие = "";
		КонецЕсли;
		ТекстСообщения = "";
	Иначе
		ТекстСообщения = "";
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		Сообщить(ТекстСообщения);
		ТекущиеДанные.Наш = Ложь;
	КонецЕсли;
	
	ВсеНаши = Истина;
	
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если Не ТекущаяСтрока.Наш Тогда
			ВсеНаши = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВыбратьВсе = ВсеНаши;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьОрганизацию(Команда)
	
	РежимСпискаОрганизаций = "ДобавитьОрганизацию";
	
	Если ЕстьАвторизации() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыборАвторизацииЗавершение", ЭтаФорма);
		
		АвторизованныеПользователи = АвторизованныеПользователи();
		АвторизованныеПользователи.Вставить(0, "<Новая>", "<Новая авторизация>");
		АвторизованныеПользователи.ПоказатьВыборЭлемента(Оповещение, "Выбор авторизации");
		
	Иначе
		
		АвторизацияОрганизации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборАвторизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "<Новая>" Тогда
		
		АвторизацияОрганизации();
		
	Иначе
		
		ДанныеАвторизации = УстановитьОбщуюАвторизацию(Результат.Значение);
		Если ДанныеАвторизации = Неопределено Тогда
			
			АвторизацияОрганизации();
			
		Иначе
			
			// Список доступных
			Токен = ДанныеАвторизации.ТокенДоступа;
			ФИО = ДанныеАвторизации.ФИО;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданиеЗагрузкиОрганизаций;
			
			ПодключитьОбработчикОжидания("ЗаполнитьСписокОрганизацийПослеАутентификации", 0.1, Истина);
			
			ОбновитьВидимостьДоступность();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизоватьОрганизации(Команда)
	
	РежимСпискаОрганизаций = "АвторизоватьОрганизации";
	
	Если ЕстьАвторизации() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыборАвторизацииЗавершение", ЭтаФорма);
		
		АвторизованныеПользователи = АвторизованныеПользователи();
		АвторизованныеПользователи.Вставить(0, "<Новая>", "<Новая авторизация>");
		АвторизованныеПользователи.ПоказатьВыборЭлемента(Оповещение, "Выбор авторизации");
		
	Иначе
		
		АвторизацияОрганизации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КАвторизации(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(
		ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка"));
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизация(Команда)
	
	ДобавитьНашуОрганизацию();
	
	ЗаполнитьСписокНашихОрганизаций();
	
	КАвторизации(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриступитьКРаботе(Команда)
	
	ЕстьАвторизции = КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьПортальныеАвторизации();
	
	ДопИнформация = Новый Структура;
	Для Каждого ТекущиеДанные Из СписокНашихОрганизаций Цикл
		Если Лев(ТекущиеДанные.Действие1, 5) = "Выйти" Тогда
			ДопИнформация.Вставить("BoxID", ТекущиеДанные.DiadocBoxId);
		КонецЕсли;
	КонецЦикла;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Авторизоваться",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций",,, ДопИнформация);
	
	Если ЕстьАвторизции Тогда
		ЗапуститьОбновлениеПодписокИОплатыВФоне();
	КонецЕсли;
	
	Закрыть(ЕстьАвторизции);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Можно подключить
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокОрганизацийПояснение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокОрганизаций.ПраваДоступа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(192, 192, 192));
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<можно подключить>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ФормаДобавитьОрганизацию.Видимость = Ложь;
	Элементы.ФормаАвторизоватьОрганизации.Видимость = Ложь;
	Элементы.КАвторизации.Видимость = Ложь;
	Элементы.ГруппаОнлайнКонсультант.Видимость = Ложь;
	Элементы.ПриступитьКРаботе.Видимость = Ложь;
	Элементы.Авторизация.Видимость = Ложь;
	Элементы.ГруппаДействияДекорацияРасширитель1.Видимость = Ложь;
	Элементы.ГруппаДействияДекорацияРасширитель2.Видимость = Истина;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации Тогда
		
		Заголовок = "Наши организации";
		Элементы.ГруппаОнлайнКонсультант.Видимость = Истина;
		Элементы.ФормаДобавитьОрганизацию.Видимость = Истина;
		Элементы.ФормаАвторизоватьОрганизации.Видимость = (СписокНашихОрганизаций.Количество() <> 0);
		Элементы.ПриступитьКРаботе.Видимость = Истина;
		
		Элементы.ФормаАвторизоватьОрганизации.Доступность = Ложь;
		Для Каждого ТекущаяСтрока Из СписокНашихОрганизаций Цикл
			Если ТекущаяСтрока.Действие1 = "Авторизоваться" Тогда
				Элементы.ФормаАвторизоватьОрганизации.Доступность = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданияАвторизации
		Или Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНеудачаАвторизации
		Или Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданиеЗагрузкиОрганизаций Тогда
		
		Заголовок = "Авторизация...";
		Элементы.КАвторизации.Видимость = Истина;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизацийПуст Тогда
		
		Заголовок = "Выбор организации для работы в модуле";
		Элементы.КАвторизации.Видимость = Истина;
		Элементы.ГруппаОнлайнКонсультант.Видимость = Истина;
		Элементы.ГруппаДействияДекорацияРасширитель1.Видимость = Истина;
		Элементы.ГруппаДействияДекорацияРасширитель2.Видимость = Ложь;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций Тогда
		
		Заголовок = "Выбор организации для работы в модуле";
		Элементы.КАвторизации.Видимость = Истина;
		Элементы.Авторизация.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНашихОрганизаций(Организация = Неопределено)
	
	СписокНашихОрганизаций.Очистить();
	
	// Получим данные
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН + ""-"" + КонтурЛогистика_ОрганизацииДиадок.КПП КАК ОрганизацияИННКПП,
	|	КонтурЛогистика_Аутентификация.ФИО КАК Авторизация,
	|	КонтурЛогистика_ОрганизацииДиадок.Наш КАК Наш,
	|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК АвторизацияСрок,
	|	КонтурЛогистика_ОрганизацииДиадок.ID КАК DiadocBoxId
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|		ПО (КонтурЛогистика_Аутентификация.Организация = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления";
	
	ПереченьОрганизаций = Запрос.Выполнить().Выгрузить();
	
	СписокНашихОрганизаций.Загрузить(ПереченьОрганизаций);
	
	// Проствим действие
	Для Каждого ТекущаяСтрока Из СписокНашихОрганизаций Цикл
		
		Если Не ТекущаяСтрока.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Авторизация) Тогда
			ТекущаяСтрока.Действие1 = "Выйти (" + ТекущаяСтрока.Авторизация + ")";
			ТекущаяСтрока.Действия1ИндексКартинки = 2;
			ТекущаяСтрока.Действие2 = "";
			ТекущаяСтрока.Действия2ИндексКартинки = 4;
		Иначе
			ТекущаяСтрока.Действие1 = "Авторизоваться";
			ТекущаяСтрока.Действия1ИндексКартинки = 0;
			ТекущаяСтрока.Действие2 = "";
			ТекущаяСтрока.Действия2ИндексКартинки = 4;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) И ТекущаяСтрока.Организация = Организация Тогда
			ИдентификаторТекущейСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторТекущейСтроки) Тогда
		// Спозицианируемся на ней
		Элементы.СписокНашихОрганизаций.ТекущаяСтрока = ИдентификаторТекущейСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизаций()
	
	СписокОрганизаций.Очистить();
	ДоступныеОрганизации.Очистить();
	
	Если Токен <> "" Тогда
		
		// Если первый запуск, то будет пусто
		ЕстьОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьОрганизации();
		
		// Получим доступные организации из Диадока
		МоиОрганизацииДиадок = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMyOrganizations(Токен);
		
		Если МоиОрганизацииДиадок.Organizations.Количество() = 0 Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизацийПуст;
			Возврат;
		КонецЕсли;
		
		Для Каждого ДанныеОрганизации Из МоиОрганизацииДиадок.Organizations Цикл
			
			ОрганизацияПоДанным = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("OrgId", ДанныеОрганизации.OrgId);
			Если Не ЗначениеЗаполнено(ОрганизацияПоДанным) Тогда
				ОрганизацияПоДанным = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеОрганизации);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОрганизацияПоДанным) Тогда
				ДоступныеОрганизации.Добавить(ОрганизацияПоДанным);
			Иначе
				Сообщить("Не удалось создать организацию: " + ДанныеОрганизации.FullName + "(" + ДанныеОрганизации.Inn + ")");
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьОрганизации Тогда
			// Перенесем из модулей Контура
			ПараметрыУстановкиМодулейКонтура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПараметрыУстановкиМодулей();
			КонтурЛогистика_ОбщегоНазначенияСервер.ПереносСопоставленийОрганизацийСОбъектамиУС(
				ДоступныеОрганизации.ВыгрузитьЗначения(), ПараметрыУстановкиМодулейКонтура);
		КонецЕсли;
		
	КонецЕсли;
	
	ВсеРоли = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли();
	
	// Получим данные
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ДоступныеОрганизации.ВыгрузитьЗначения());
	
	Если РежимСпискаОрганизаций = "ДобавитьОрганизацию" Тогда
		
		// Добавление организации
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
		|	КонтурЛогистика_ОрганизацииДиадок.ИНН + ""-"" + КонтурЛогистика_ОрганизацииДиадок.КПП КАК ОрганизацияИННКПП,
		|	КонтурЛогистика_Аутентификация.ФИО КАК Авторизация,
		|	КонтурЛогистика_ОрганизацииДиадок.Наш КАК Наш,
		|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК АвторизацияСрок,
		|	КонтурЛогистика_ОрганизацииДиадок.ID КАК DiadocBoxId
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
		|		ПО (КонтурЛогистика_Аутентификация.Организация = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&ДоступныеОрганизации)
		|	И НЕ КонтурЛогистика_ОрганизацииДиадок.Наш";
		
	Иначе
		
		// Добавление авторизации для наших организаций
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
		|	КонтурЛогистика_ОрганизацииДиадок.ИНН + ""-"" + КонтурЛогистика_ОрганизацииДиадок.КПП КАК ОрганизацияИННКПП,
		|	КонтурЛогистика_Аутентификация.ФИО КАК Авторизация,
		|	КонтурЛогистика_ОрганизацииДиадок.Наш КАК Наш,
		|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК АвторизацияСрок,
		|	КонтурЛогистика_ОрганизацииДиадок.ID КАК DiadocBoxId
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
		|		ПО (КонтурЛогистика_Аутентификация.Организация = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&ДоступныеОрганизации)
		|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		|	И КонтурЛогистика_ОрганизацииДиадок.Наш
		|	И КонтурЛогистика_Аутентификация.ФИО ЕСТЬ NULL";
		
	КонецЕсли;
	
	// Добавим получение данных по всем ролям
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	Для Каждого ТекущаяРоль Из ВсеРоли Цикл
		ИмяПоля = "КонтурЛогистика_ОрганизацииДиадок." + ТекущаяРоль;
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить(ИмяПоля);
	КонецЦикла;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ПереченьОрганизаций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ПереченьОрганизаций Цикл
		НоваяСтрока = СписокОрганизаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		Для Каждого ТекущаяРоль Из ВсеРоли Цикл
			ЗначениеРоли = ТекущаяСтрока[ТекущаяРоль];
			Если ЗначениеРоли = Истина Тогда
				НоваяСтрока.Роли.Добавить(ТекущаяРоль);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Права в сервисах
	Организации = СписокОрганизаций.Выгрузить().ВыгрузитьКолонку("Организация");
	ОписанияПравОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ОписанияПравОрганизацииВСервисах(Организации, Токен);
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		ОписанияПравОрганизации = ОписанияПравОрганизаций.Получить(ТекущаяСтрока.Организация);
		
		ТекущаяСтрока.ЭтоАдминистратор = ОписанияПравОрганизации.ЭтоАдминистратор;
		ТекущаяСтрока.ТекстОшибки = ОписанияПравОрганизации.ТекстОшибки;
		
		Если ОписанияПравОрганизации.ЗарегистрироватьВЛогистике Тогда
			
			ТекущаяСтрока.ПраваДоступа = "Зарегистрировать в Логистике";
			
		ИначеЕсли Не ОписанияПравОрганизации.ОплатаТарифа Тогда
			
			ТекущаяСтрока.ПраваДоступа = "Необходима оплата тарифа АПИ";
			
		ИначеЕсли АвторизацияПриОткрытии Тогда
			
			// Не проверяем права и роли, первая авторизация в модуле из стартового помощника
			ТекущаяСтрока.ПраваДоступа = "";
			
		ИначеЕсли ТекущаяСтрока.Роли.Количество() = 0 Тогда
			
			ТекущаяСтрока.ПраваДоступа = "Необходимо выбрать роли";
			
		Иначе
			
			РолиОрганизации = РолиОрганизацииИзСписка(ТекущаяСтрока.Роли);
			РезультатВалидацииПрав = КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияПравПользователяПоОрганизации(
				РолиОрганизации, ОписанияПравОрганизации);
			Если РезультатВалидацииПрав.Отказ Тогда
				ТекущаяСтрока.ПраваДоступа = "Недостаточно прав";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Расчитаем индекс сортировки, пояснения и действие
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если ТекущаяСтрока.ПраваДоступа = "" Тогда
			ТекущаяСтрока.ИндексСортировки = 0;
			ТекущаяСтрока.Пояснение = "";
			ТекущаяСтрока.Действие = "";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Недостаточно прав" Тогда
			ТекущаяСтрока.ИндексСортировки = 1;
			ТекущаяСтрока.Пояснение = "Недостаточно прав у пользователя";
			ТекущаяСтрока.Действие = "Настройте";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Необходимо выбрать роли" Тогда
			ТекущаяСтрока.ИндексСортировки = 0;
			ТекущаяСтрока.Пояснение = "";
			ТекущаяСтрока.Действие = "";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
			ТекущаяСтрока.ИндексСортировки = 3;
			ТекущаяСтрока.Пояснение = "Нет в сервисе Контур.Логистика";
			ТекущаяСтрока.Действие = "Зарегистрируйте";
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Необходима оплата тарифа АПИ" Тогда
			ТекущаяСтрока.ИндексСортировки = 4;
			ТекущаяСтрока.Пояснение = "Необходима оплата тарифа АПИ";
			ТекущаяСтрока.Действие = "Оставить заявку";
		Иначе
			ТекущаяСтрока.ИндексСортировки = 5;
			ТекущаяСтрока.Пояснение = "Возникла непредвиденная ошибка";
			ТекущаяСтрока.Действие = "Исправить ошибку";
		КонецЕсли;
		
	КонецЦикла;
	СписокОрганизаций.Сортировать("ИндексСортировки");
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций;
	
	ВыбратьВсе = Истина;
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если Не ТекущаяСтрока.Наш Тогда
			ВыбратьВсе = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РолиОрганизацииИзСписка(РолиСписокЗначений)
	
	Результат = Новый Структура;
	
	ВсеРоли = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеРоли();
	Для Каждого ИмяРоли Из ВсеРоли Цикл
		Если РолиСписокЗначений.НайтиПоЗначению(ИмяРоли) = Неопределено Тогда
			ЗначениеРоли = Ложь;
		Иначе
			ЗначениеРоли = Истина;
		КонецЕсли;
		
		Результат.Вставить(ИмяРоли, ЗначениеРоли);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура АвторизоватьсяНаПортале(Организация = Неопределено)
	
	// Очистим пустую сессию
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(
		ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГруппаСтраницы", Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ДополнительныеПараметры.Вставить("Организация", Организация);
	Иначе
		ДополнительныеПараметры.Вставить("Организация", ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка"));
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданияАвторизации;
	
	Оповещение = Новый ОписаниеОповещения("ПослеАутентификации", ЭтаФорма, ДополнительныеПараметры, "ОшибкаАутентификации", ЭтаФорма);
	
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПолучениеСессии(Оповещение, ОтборСессий);
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНашуОрганизацию()
	
	КоличествоНашихОрганизаций = 0;
	
	Организации = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если Не ТекущаяСтрока.Наш Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоНашихОрганизаций = КоличествоНашихОрганизаций + 1;
		
		Организации.Добавить(ТекущаяСтрока.Организация);
		
		Если РежимСпискаОрганизаций = "АвторизоватьОрганизации" Тогда
			// Организация уже наша
			Продолжить;
		КонецЕсли;
		
		ОрганизацияОбъект = ТекущаяСтрока.Организация.ПолучитьОбъект();
		ОрганизацияОбъект.Наш = Истина;
		ОрганизацияОбъект.Записать();
		
		Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(
			ТекущаяСтрока.Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок, Истина);
		
		Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(
			ТекущаяСтрока.Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики, Истина);
		
	КонецЦикла;
	
	РегистрыСведений.КонтурЛогистика_Аутентификация.ПодменитьОбщуюАутентификациюПодКонкретные(Организации);
	
	// Синхронизируем контрагентов
	Если РежимСпискаОрганизаций = "ДобавитьОрганизацию" Тогда
		Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
			
			Если Не ТекущаяСтрока.Наш Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не КонтрагентыОрганизацииСинхронизированы(ТекущаяСтрока.Организация) Тогда
				// Синхронизируем контрагентов
				ПараметрыМетода = Новый Структура;
				ПараметрыМетода.Вставить("ОрганизацияСсылка", ТекущаяСтрока.Организация);
				
				КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(
					"КонтурЛогистика_ДлительныеОперацииСервер.СинхронизироватьКонтрагентовОрганизации",
					ПараметрыМетода,, "Синхронизировать контрагентов организации");
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если КоличествоНашихОрганизаций <> 0 Тогда
		ПеременныеСтатистики = Новый Структура;
		ПеременныеСтатистики.Вставить("КоличествоОрганизацийДляАвторЦизации", КоличествоНашихОрганизаций);
		
		КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(ПеременныеСтатистики,
			"Авторизация", "Авторизоваться", "РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентыОрганизацииСинхронизированы(ОрганизацияСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияСсылка", ОрганизацияСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОрганизацииДиадокКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.Контрагенты КАК КонтурЛогистика_ОрганизацииДиадокКонтрагенты
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокКонтрагенты.Ссылка = &ОрганизацияСсылка";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьАвторизациюНаПортале(Организация)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("ГруппаСтраницы", Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	Оповещение = Новый ОписаниеОповещения("ПослеАутентификации", ЭтаФорма, ДополнительныеПараметры);
	
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОбновитьСессии(Оповещение, ОтборСессий);
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСессиюНаПортале(Организация)
	
	Интерактивно = Истина;
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(Организация, Интерактивно);
	
	ЗаполнитьСписокНашихОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНеудачаАвторизации;
		
	Иначе
		
		Если ДополнительныеПараметры.ГруппаСтраницы = Элементы.ГруппаНашиОрганизации Тогда
			
			// Получим доступные организации
			МоиОрганизацииДиадок = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMyOrganizations(Результат.ТокенДоступа);
			
			Если МоиОрганизацииДиадок.Organizations.Количество() = 0 Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизацийПуст;
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				Возврат;
			КонецЕсли;
			
			// Проверим, что текущая организация доступна текущему пользователю
			ОрганизацияДоступна = Ложь;
			ТекущийOrgId = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				ДополнительныеПараметры.Организация, "OrgId");
			Для Каждого ТекущаяСтрока Из МоиОрганизацииДиадок.Organizations Цикл
				Если ТекущаяСтрока.OrgId = ТекущийOrgId Тогда
					ОрганизацияДоступна = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ОрганизацияДоступна Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНашиОрганизации;
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				Сообщить("Авторизованный пользователь не имеет доступа к выбранной организации: "
					+ Строка(ДополнительныеПараметры.Организация));
				Возврат;
			КонецЕсли;
			
			// По нашей организации
			Организации = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ЗначениеВМассивеЛок(ДополнительныеПараметры.Организация);
			ОписанияПравОрганизаций = КонтурЛогистика_ОбщегоНазначенияСервер.ОписанияПравОрганизацииВСервисах(
				Организации, Результат.ТокенДоступа);
			ОписанияПравОрганизации = ОписанияПравОрганизаций.Получить(ДополнительныеПараметры.Организация);
			
			Если ОписанияПравОрганизации.ЗарегистрироватьВЛогистике Тогда
				
				Сообщить("Зарегистрировать в Логистике");
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				
			ИначеЕсли Не ОписанияПравОрганизации.ОплатаТарифа Тогда
				
				Сообщить("Необходима оплата тарифа АПИ");
				КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
				
			Иначе
				
				РолиОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.РолиОрганизации(ДополнительныеПараметры.Организация);
				РезультатВалидацииПрав = КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияПравПользователяПоОрганизации(
					РолиОрганизации, ОписанияПравОрганизации);
				Если РезультатВалидацииПрав.Отказ Тогда
					ОткрытьФормуРедактированияРолей(ДополнительныеПараметры.Организация, Результат.ТокенДоступа, РолиОрганизации);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаполнитьСписокНашихОрганизаций(ДополнительныеПараметры.Организация);
			
			// Отправить метрику успешной авторизации
			ОрганизацийДД = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.Организация);
			КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьАвторизацию(ОрганизацийДД, "OIDC_Админ");
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = ДополнительныеПараметры.ГруппаСтраницы;
			
		Иначе
			
			// Список доступных
			Токен = Результат.ТокенДоступа;
			ФИО = Результат.ФИО;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОжиданиеЗагрузкиОрганизаций;
			
			ПодключитьОбработчикОжидания("ЗаполнитьСписокОрганизацийПослеАутентификации", 0.1, Истина);
			
			ОбновитьВидимостьДоступность();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокОрганизацийПослеАутентификации()
	
	ЗаполнитьСписокОрганизаций();
	
	ЗарегистрироватьПолучениеОрганизацийВМетриках();
	
	// Отправить метрику успешной авторизации
	ОрганизацийДД = Новый Массив;
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		Если ТекущаяСтрока.ПраваДоступа = "" Тогда
			ОрганизацийДД.Добавить(ТекущаяСтрока.Организация);
		КонецЕсли;
	КонецЦикла;
	Если ОрганизацийДД.Количество() <> 0 Тогда
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьАвторизацию(ОрганизацийДД, "OIDC_Админ");
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьПолучениеОрганизацийВМетриках()
	
	Переменные = Новый Структура;
	Переменные.Вставить("КоличествоОрганизаций", СписокОрганизаций.Количество());
	Переменные.Вставить("НедостаточноПрав", 0);
	Переменные.Вставить("НетВЛогистике", 0);
	Переменные.Вставить("Ошибка", 0);
	
	Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
		
		Если ТекущаяСтрока.ПраваДоступа = "Ошибка" Тогда
			
			Переменные.Ошибка = Переменные.Ошибка + 1;
			
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Недостаточно прав" Тогда
			
			Переменные.НедостаточноПрав = Переменные.НедостаточноПрав + 1;
			
		ИначеЕсли ТекущаяСтрока.ПраваДоступа = "Зарегистрировать в Логистике" Тогда
			
			Переменные.НетВЛогистике = Переменные.НетВЛогистике + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(Переменные, "Авторизация", "Получение организаций из ДД",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияРолей(Организация, Токен, РолиОрганизации)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("РолиОрганизации", РолиОрганизации);
	ПараметрыФормы.Вставить("Токен", Токен);
	ПараметрыФормы.Вставить("Метрики_Категоря", "Авторизация");
	ПараметрыФормы.Вставить("Метрики_МестоВызова", ЭтаФорма.ИмяФормы);
	ПараметрыФормы.Вставить("Метрики_Действие", "Выбор роли");
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Организация", Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаРедактированияРолей", ПараметрыФормы, ЭтаФорма,
		ЭтаФорма, "ОткрытьФормуРедактированияРолейЗавершение", ПараметрыОбработки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияРолейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗапишемРолиВОрганизацию(ДополнительныеПараметры.Организация, Результат);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций Тогда
		
		ВыбранныеОрганизации = ВыбранныеОрганизации();
		
		ЗаполнитьСписокОрганизаций();
		
		// Перейдем на строку с организацией
		Для Каждого ТекущаяСтрока Из СписокОрганизаций Цикл
			
			Если ВыбранныеОрганизации.Найти(ТекущаяСтрока.Организация) <> Неопределено Тогда
				ТекущаяСтрока.Наш = Истина;
				Если ТекущаяСтрока.ПраваДоступа = "Необходимо выбрать роли" Тогда
					ТекущаяСтрока.ИндексСортировки = 0;
					ТекущаяСтрока.Пояснение = "Необходимо выбрать роли";
					ТекущаяСтрока.Действие = "Выбрать";
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяСтрока.Организация <> ДополнительныеПараметры.Организация Тогда
				Продолжить;
			КонецЕсли;
			
			Элементы.СписокОрганизаций.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНеудачаАвторизации;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

// Возвращает список организаций, отмеченных как "Наша организация" в таблице формы СписокОрганизаций.
// 
// Возвращаемое значение:
//  Массив - Массив ссылок на организации (СправочниСсылка.КонтурЛогистика_ОрганизацииДиадок), у которых в колонке "Наш" установлено значение Истина.
// 
&НаКлиенте
Функция ВыбранныеОрганизации()
	
	Результат = Новый Массив;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Наш", Истина);
	
	НайденныеСтроки = СписокОрганизаций.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Результат.Добавить(НайденнаяСтрока.Организация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура АвторизацияОрганизации()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокОрганизаций;
	
	АвторизоватьсяНаПортале();
	
	ОбновитьВидимостьДоступность();
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Наши организации", "Добавить организацию",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаАвторизацииОрганизаций");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапуститьОбновлениеПодписокИОплатыВФоне()
	
	Если Не КонтурЛогистика_ПодпискиИОплатаСервер.ПодпискиИОплатаДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(
		"КонтурЛогистика_ДлительныеОперацииСервер.СинхронизироватьДанныеПодписокИОплаты",,
		"СинхронизацияПодписокИОплаты",
		"Синхронизация данных подписок и оплаты (ТихийРежим)");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьАвторизации()
	
	Возврат РегистрыСведений.КонтурЛогистика_Аутентификация.ЕстьАвторизации();
	
КонецФункции

&НаСервереБезКонтекста
Функция АвторизованныеПользователи()
	
	Возврат РегистрыСведений.КонтурЛогистика_Аутентификация.АвторизованныеПользователи();
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьОбщуюАвторизацию(ПортальныйИд)
	
	Возврат РегистрыСведений.КонтурЛогистика_Аутентификация.УстановитьОбщуюАвторизацию(ПортальныйИд);
	
КонецФункции

#КонецОбласти