Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//ПараметрыРегистрации = Новый Структура;
	//МассивНазначений = Новый Массив;
	//ТБКоманды = Новый ТаблицаЗначений;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 	
	ПараметрыРегистрации = ДокументОбъект.СведенияОВнешнейОбработке();
	МассивИсточник = ПараметрыРегистрации.Назначение;
	МассивНазначений = Новый Массив;

	Для каждого стрМас из МассивИсточник цикл
		МассивНазначений.Добавить(Тип(СтрЗаменить(стрМас,"Документ.","ДокументСсылка.")));
	КонецЦикла;

	ЭтаФорма.Элементы.ДокСсылка.ОграничениеТипа = Новый ОписаниеТипов(МассивНазначений);
	ТБКоманды = ПараметрыРегистрации.Команды;
	Элементы.КомандаПечати.СписокВыбора.ЗагрузитьЗначения(ТБКоманды.ВыгрузитьКолонку("Идентификатор"));
	
КонецПроцедуры

&НаСервере
Процедура СтартНаСервере(ДокСсылка, ИмяМакета)
	
	ПараметрыИсточникаОбъектыНазначения = новый массив;
	ПараметрыИсточникаОбъектыНазначения.Добавить(ДокСсылка);
	
	Макеты = Новый ТаблицаЗначений;
	Макеты.Колонки.Добавить("ИмяМакета");
	Макеты.Колонки.Добавить("ИмяВРЕГ");
	Макеты.Колонки.Добавить("СинонимМакета");
	Макеты.Колонки.Добавить("ТабличныйДокумент");
	Макеты.Колонки.Добавить("Экземпляров");
	Макеты.Колонки.Добавить("Картинка");
	Макеты.Колонки.Добавить("ПолныйПутьКМакету");
	Макеты.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	Макет = Макеты.Добавить();
	Макет.ИмяМакета = ИмяМакета;
	Макет.ИмяВРЕГ = ВРег(ИмяМакета);
	Макет.Экземпляров = 1;
	
	КоллекцияПечатныхФорм = Макеты;
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	ОбъектыПечати = Новый СписокЗначений;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 	
	
	ДокументОбъект.Печать(
		ПараметрыИсточникаОбъектыНазначения,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода);
		
	Если КоллекцияПечатныхФорм.Количество() > 0 тогда
		МойТабличныйДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере(Объект.ДокСсылка, СокрЛП(КомандаПечати));
КонецПроцедуры

