#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСтрокиТабличныхЧастейБезИдентификатораСтроки();
	УдалитьПустыеСтрокиВ_ТЧ();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Партия") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ОбщиеДанные);
		
		ЗаполнитьОсновныеРеквизитыИзXDTO(ДанныеЗаполнения.Партия);
		ЗаполнитьОпГруз(ДанныеЗаполнения.Партия);
		
		// при загрузке считаем что документ прошел проверку
		Валидация = Истина;
		
		Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ЗаполнитьСуммыПоТабличнойЧасти(ЭтотОбъект);
		
		ЗаполнитьРеквизитыИнтеграцияСДругимиСистемами();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		
		Если ДанныеЗаполнения.Свойство("Перезаполнить") Тогда 
			ОчиститьТабличныеЧасти();
		КонецЕсли;
		
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
		ДанныеЗаполнения.Свойство("Разделитель", Разделитель);
		
		ЗаполнитьПоДокОснованию(ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_ЗаявкаНаМаршрут);
		
		Если ДанныеЗаполнения.Свойство("КлючевыеРеквизиты") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.КлючевыеРеквизиты);
		КонецЕсли;	
		
		ЗаполнитьРеквизитыИнтеграцияСДругимиСистемами();
		
		Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ЗаполнитьДефолты(ЭтотОбъект);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДЛ_ЗаявкаНаДоставку")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДЛ_ЗаявкаНаДоставку) Тогда
		
		ДЛ_СинхронизироватьЗаявку(ДанныеЗаполнения.ДЛ_ЗаявкаНаДоставку);
		
		Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ЗаполнитьДефолты(ЭтотОбъект);
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЭ_ЗаявкаНаМаршрут_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);

КонецПроцедуры

Процедура УдалитьПустыеСтрокиВ_ТЧ()
	
	// УведСторон
	МассивУдаляемыхОбъектов = Новый Массив;
	Для Каждого Сторона Из УведСторон Цикл
		
		СтрокаПустая = Не ЗначениеЗаполнено(Сторона.Сторона)
			Или (Сторона.Сторона = 3 И Не ЗначениеЗаполнено(Сторона.ИноеУвед));
		
		Если СтрокаПустая Тогда
			МассивУдаляемыхОбъектов.Добавить(Сторона);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхОбъектов Цикл
		УведСторон.Удалить(Элемент);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыИнтеграцияСДругимиСистемами()

	// Интеграция с Деловыми Линиями
	
	Возврат; // Интеграция с ДЛ отключена до релиза 1.19.1
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные("Документы.ДЛ_ЗаявкаНаДоставку") Тогда 
		
		ДокументыОснования = Новый Массив;
		ДокументыОснования.Добавить(ДокументОснование);
		ЗаявкиДЛ = 	КонтурЛогистика_ИнтеграцияДЛСервер.ДЛ_ЗаказыПоОснованиям(ДокументыОснования);
		
		// Извлечь реквизиты из заявки ДЛ и синхронизировать в маршрут и ПЭ
		Для Каждого СтрокаЗаявкиДЛ из ЗаявкиДЛ Цикл
			
			ДЛ_СинхронизироватьЗаявку(СтрокаЗаявкиДЛ.ДЛ_ЗаявкаНаДоставку);

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ИнтеграцияДеловыеЛинии

Процедура ДЛ_СинхронизироватьЗаявку(Знач ДЛ_ЗаявкаНаДоставку)
	
	ОбщийМодульДЛ = Вычислить("ДЛ_ДеловыеЛинии");
	
	НомДок = ДЛ_ЗаявкаНаДоставку.НомерЗаказа;
	ДатаДок = ДЛ_ЗаявкаНаДоставку.Дата; // дату далее взять из ответа сервиса
	
	Если ЗначениеЗаполнено(ДЛ_ЗаявкаНаДоставку.НомерЗаказа) Тогда
		
		Попытка
			
			ДанныеЗаказаСтрокой = ОбщийМодульДЛ.ПолучитьЖурналОтправок(Новый Структура("ИдентификаторДокумента", ДЛ_ЗаявкаНаДоставку.НомерЗаказа), Истина);
			ДанныеЗаказа = ОбщийМодульДЛ.ДесериализоватьСтруктуруПараметров(ДанныеЗаказаСтрокой);
			
			СведенияОЗаказе = ДанныеЗаказа.Получить("orders");
			Если ТипЗнч(СведенияОЗаказе) = Тип("Массив")
				И СведенияОЗаказе.Количество() > 0 Тогда 
				
				// https://dev.dellin.ru/api/orders/search/#_header11
				Заказ = СведенияОЗаказе[0];
				
				Если Заказ.Получить("state") = "declined" Тогда 
					ВызватьИсключение "Заказ "+ НомДок + " в статусе ""Заявка отклонена""";
				КонецЕсли;
				
				ДатаДок_raw = Заказ.Получить("orderedAt"); // Дата создания заказа, это UTC
				ДатаДок = КонтурЛогистика_КонструкторыXDTO.Конвертировать_ДатаТип_вДата(Лев(ДатаДок_raw,10));	
				
				orderDates = Заказ.Получить("orderDates"); 	// сведения о датах
				ДЛ_ИзвлечьСведенияОДатахПогрузкиИРазгрузки(orderDates);
				
				ДЛ_ИзвлечьПунктыПогрузкиИВыгрузки(Заказ);
				
				Если ВидТС.Количество() = 0 Тогда 
					НовыйВидТССтр = ВидТС.Добавить();
					НовыйВидТССтр.ВидТС = Перечисления.КонтурЛогистика_ВидыТранспорта._1;
					НовыйВидТССтр.ТипКузов = "Любой";
				КонецЕсли;
				
				_documents = Заказ.Получить("documents");
				Если ТипЗнч(_documents) = Тип("Массив")
					И _documents.Количество() > 0 Тогда 
					
					sender = _documents[0].Получить("sender"); // Информация о ГО
					Если sender <> Неопределено Тогда 
						СвГО = ДЛ_СинхронизироватьУчастника(СвГО, sender, Заказ.Получить("sender"));
					КонецЕсли;
					
					receiver = _documents[0].Получить("receiver"); // Информация о ГП
					Если receiver <> Неопределено Тогда 
						СвГП = ДЛ_СинхронизироватьУчастника(СвГП, receiver, Заказ.Получить("receiver"));
					КонецЕсли;
					
				КонецЕсли;
				
				// Сведения о грузе https://dev.dellin.ru/api/orders/search/#_header14
				freight = Заказ.Получить("freight"); 
				Если Товары.Количество() = 0 
					И ЗначениеЗаполнено(freight) Тогда
					
					НовыйГруз = Товары.Добавить();
					НовыйГруз.ОтгрузочноеНаименование 	= freight.Получить("name");
					НовыйГруз.КоличествоМест 			= freight.Получить("places");
					НовыйГруз.ОбъемКубМ 				= freight.Получить("volume");
					НовыйГруз.МассаБруттоКг 			= freight.Получить("weight");
					НовыйГруз.Учитывать 				= Истина;
					
				КонецЕсли;
				
				statedValue = Заказ.Получить("statedValue"); //объявленная ценность
				Если statedValue > 0 Тогда 
					СтоимостьГруза = statedValue;
					ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ОбъявленнаяСтоимость;
					Если Не ЗначениеЗаполнено(ВалютаУчетаГруза) Тогда 
						Попытка
							ВалютаУчетаГруза = Справочники["Валюты"].НайтиПоКоду("643");
						Исключение
							НичегоНеДелаем = Истина;
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
					note = Заказ.Получить("note");
					Комментарий = СокрЛП("Деловые Линии, заказ№ " + ДЛ_ЗаявкаНаДоставку.НомерЗаказа + " " + note);
				КонецЕсли;
				
			КонецЕсли;
			
			// Экспедитор - ДЛ
			СвЭксп = КонтурЛогистика_ИнтеграцияДЛСервер.ДЛ_ОрганизацияЭкспедитор();
			
			// Если Заказчик не указан - попробуем подставить его из ДЛ Плательщик
			// Имеет смысл только если плательщик сможет подписать ПЭ
			Если Не ЗначениеЗаполнено(СвКлт) Тогда 
				payer = _documents[0].Получить("payer"); // Информация о Плательщике
				Если payer <> Неопределено Тогда 
					ОрганизацияПлательщик = ДЛ_СинхронизироватьУчастника(СвКлт, payer, Заказ.Получить("payer"));
					Если ОрганизацияПлательщик.Наш Тогда 
						СвКлт = ОрганизацияПлательщик;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Обновить сведения ПЭ
			Если ЗначениеЗаполнено(Титул1) Тогда 
				Титул1Объект = Титул1.ПолучитьОбъект();
				Титул1Объект.СвЭксп = СвЭксп; 
				Титул1Объект.СвКлиент = СвКлт; 
				Титул1Объект.НомДок = НомДок; 
				Титул1Объект.ДатаДок = ДатаДок;
				Титул1Объект.Записать();
			КонецЕсли;
			
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе
		
		// Получить из данных черновика
		
		РегистрДЛМенеджер = РегистрыСведений["ДЛ_ДанныеЧерновиков"]; 
		ЗаписьРегистра = РегистрДЛМенеджер.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Заявка = ДЛ_ЗаявкаНаДоставку;
		ЗаписьРегистра.Прочитать();
		
		Если ЗначениеЗаполнено(ЗаписьРегистра.Заявка) Тогда
			СтруктураДокумета = ЗаписьРегистра.Данные.Получить();
			ДЛ_ЗаполнитьРеквизитыИзЧерновикаДЛ(СтруктураДокумета);
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

Функция ДЛ_СинхронизироватьУчастника(Знач ЗначениеВРеквизитеОбъекта, Member, Orders_Member = Неопределено)

	Если ЗначениеЗаполнено(ЗначениеВРеквизитеОбъекта)
		И ЗначениеЗаполнено(Member.Получить("inn"))
		И ЗначениеВРеквизитеОбъекта.ИНН = Member.Получить("inn") Тогда 
		
		// TODO заполнить/проверить телефон, адрес
		
	Иначе
		
		Если (Не ЗначениеЗаполнено(ЗначениеВРеквизитеОбъекта) 
				И ЗначениеЗаполнено(Member.Получить("inn")))
			Или
				(ЗначениеЗаполнено(ЗначениеВРеквизитеОбъекта) 
				И ЗначениеЗаполнено(Member.Получить("inn"))
				И ЗначениеВРеквизитеОбъекта.ИНН <> Member.Получить("inn"))Тогда
				// поискать оргу, сформировать новую оргу и вернуть ссылку
			
				НайденнаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиОрганизациюПоКлючевымРеквизитам(СокрЛП(Member.Получить("inn")));
				Если ЗначениеЗаполнено(НайденнаяОрганизация) Тогда 
					ЗначениеВРеквизитеОбъекта = НайденнаяОрганизация;
				Иначе
					
					НоваяОрганизацияДД = Справочники.КонтурЛогистика_ОрганизацииДиадок.СоздатьЭлемент();
					НоваяОрганизацияДД.ИНН = Member.Получить("inn");
					НоваяОрганизацияДД.НаименованиеОрганизацииПолное = Member.Получить("name");
					НоваяОрганизацияДД.Наименование = НоваяОрганизацияДД.НаименованиеОрганизацииПолное;
					Если ЗначениеЗаполнено(Orders_Member) Тогда 
						 НоваяОрганизацияДД.ТелефонОсновной = Orders_Member.Получить("phones");
						 НоваяОрганизацияДД.АдресСтрока = Orders_Member.Получить("address");
					КонецЕсли;
					
					НоваяОрганизацияДД.Записать();
					МассивОрганизаций = Новый Массив;
					МассивОрганизаций.Добавить(НоваяОрганизацияДД.Ссылка);
					Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(МассивОрганизаций);
					НоваяОрганизацияДД.СинхронизироватьИзСервисаЛогистика();
					
					ЗначениеВРеквизитеОбъекта = НоваяОрганизацияДД.Ссылка;
					
				КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат ЗначениеВРеквизитеОбъекта;

КонецФункции

Процедура ДЛ_ИзвлечьПунктыПогрузкиИВыгрузки(Знач Заказ)
	
	// погрузка
	derival = Заказ.Получить("derival"); // Информация о месте отправки
	
	Если derival <> Неопределено Тогда
		
		АдресОтправления = derival.Получить("address");
		
		Если АдресОтправления <> Неопределено Тогда
			// если пункт подачи заполнен - поменять адрес?
			Если ЗначениеЗаполнено(АдрГруз) Тогда 
				// проверить что адрес верный? если нет то что?
			Иначе
				// поискать такой пункт маршрута - если нет, то создать
				НайденныйПунктОтправления = Справочники.КонтурЛогистика_ПунктыМаршрута.НайтиПоРеквизиту("АдресИнфАдрес", АдресОтправления);
				Если ЗначениеЗаполнено(НайденныйПунктОтправления) Тогда 
					АдрГруз = НайденныйПунктОтправления;
				Иначе
					НовыйПунктОтправления = ДЛ_ЗаписатьНовыйПунктМаршрута(АдресОтправления, Истина);
					АдрГруз = НовыйПунктОтправления.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// ВрОтгрС,ВрОтгрПо сейчас не передаются от ДЛ, выставим дефолты если они не заполнены  
	Если Не ЗначениеЗаполнено(ВрОтгрС) Тогда 
		ВрОтгрС = Дата(1,1,1,9,0,0);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВрОтгрПо) Тогда 
		ВрОтгрПо = Дата(1,1,1,18,0,0);
	КонецЕсли;
	
	
	// доставка
	arrival = Заказ.Получить("arrival"); // Информация о месте доставки
	Если arrival <> Неопределено Тогда
		
		АдресДоставки = arrival.Получить("address");
		
		Если АдресДоставки <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(АдрПунктНазн) Тогда 
				// проверить что адрес верный? если нет то что?
			Иначе
				// поискать такой пункт маршрута - если нет, то создать
				НайденныйПунктОтправления = Справочники.КонтурЛогистика_ПунктыМаршрута.НайтиПоРеквизиту("АдресИнфАдрес", АдресДоставки);
				Если ЗначениеЗаполнено(НайденныйПунктОтправления) Тогда 
					АдрПунктНазн = НайденныйПунктОтправления;
				Иначе
					НовыйПунктОтправления = ДЛ_ЗаписатьНовыйПунктМаршрута(АдресДоставки, Ложь);
					АдрПунктНазн = НовыйПунктОтправления.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ДЛ_ЗаписатьНовыйПунктМаршрута(Знач АдресОтправления, Отправление = Истина)
	
	Перем НовыйПунктОтправления;
	
	НовыйПунктОтправления = Справочники.КонтурЛогистика_ПунктыМаршрута.СоздатьЭлемент();
	НовыйПунктОтправления.АдресИнфАдрес = АдресОтправления;
	НовыйПунктОтправления.Отправление = Отправление;
	НовыйПунктОтправления.Прибытие = Не Отправление;
	НовыйПунктОтправления.АдресИнфКодСтраны = Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643");
	НовыйПунктОтправления.Записать();
	
	Возврат НовыйПунктОтправления;

КонецФункции

Процедура ДЛ_ИзвлечьСведенияОДатахПогрузкиИРазгрузки(Знач orderDates)
	
	Перем arrivalToOspReceiver, arrivalToOspReceiverMax, arrivalToReceiver, derivalFromOspSender, giveoutFromOspReceiver, giveoutFromOspReceiverMax, pickup, ДатаДоставки_raw, ДатаПогрузки_raw;
	
	pickup 					= orderDates.Получить("pickup"); // Дата передачи груза на адресе отправителя
	derivalFromOspSender 	= orderDates.Получить("derivalFromOspSender"); // Дата отправления груза с терминала-отправителя
	Если ЗначениеЗаполнено(pickup) Тогда 
		ДатаПогрузки_raw = pickup;
	ИначеЕсли ЗначениеЗаполнено(derivalFromOspSender) Тогда
		ДатаПогрузки_raw = derivalFromOspSender;
	Иначе
		ДатаПогрузки_raw = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаПогрузки_raw) Тогда
		ДатОтгрС = КонтурЛогистика_КонструкторыXDTO.Конвертировать_ДатаТип_вДата(Лев(ДатаПогрузки_raw,10));	
		ДатОтгрПо = ДатОтгрС;	
	КонецЕсли;
	
	arrivalToReceiver 		= orderDates.Получить("arrivalToReceiver"); // Дата доставки груза до адреса (расчетная или свершившаяся)
	arrivalToOspReceiver 	= orderDates.Получить("arrivalToOspReceiver"); // Дата прибытия груза на терминал-получатель
	giveoutFromOspReceiver  = orderDates.Получить("giveoutFromOspReceiver"); // Ориентировочная дата готовности груза к выдаче на терминале-получателе
	
	Если ЗначениеЗаполнено(giveoutFromOspReceiver) Тогда
		ДатаДоставки_raw = giveoutFromOspReceiver;
	ИначеЕсли ЗначениеЗаполнено(arrivalToReceiver) Тогда 
		ДатаДоставки_raw = arrivalToReceiver;
	ИначеЕсли ЗначениеЗаполнено(arrivalToOspReceiver) Тогда
		ДатаДоставки_raw = arrivalToOspReceiver;
	Иначе
		ДатаДоставки_raw = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаДоставки_raw) Тогда
		ДатДостГрС = КонтурЛогистика_КонструкторыXDTO.Конвертировать_ДатаТип_вДата(Лев(ДатаДоставки_raw,10));
		
		// По
		arrivalToOspReceiverMax = orderDates.Получить("arrivalToOspReceiverMax"); // Максимальная дата прибытия груза на терминал-получатель (в случае, если возможно увеличение срока прибытия)
		derivalFromOspReceiver		= orderDates.Получить("derivalFromOspReceiver"); // Дата отправки с терминала-получателя
		giveoutFromOspReceiverMax  = orderDates.Получить("giveoutFromOspReceiverMax"); //Максимальная дата готовности груза к выдаче на терминале-получателе (в случае, если возможно увеличение срока готовности)
		Если ЗначениеЗаполнено(giveoutFromOspReceiverMax) Тогда
			ДатДостГрПо_raw = giveoutFromOspReceiverMax;	
		ИначеЕсли ЗначениеЗаполнено(arrivalToOspReceiverMax) Тогда
			ДатДостГрПо_raw = giveoutFromOspReceiverMax;
		ИначеЕсли ЗначениеЗаполнено(derivalFromOspReceiver) Тогда
			ДатДостГрПо_raw = derivalFromOspReceiver;
		Иначе
			ДатДостГрПо_raw = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатДостГрПо_raw) Тогда
			ДатДостГрПо = КонтурЛогистика_КонструкторыXDTO.Конвертировать_ДатаТип_вДата(Лев(ДатДостГрПо_raw,10));	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ДЛ_ЗаполнитьРеквизитыИзЧерновикаДЛ(Знач СтруктураДокумета)
	
	// Проблема: в черновик ДЛ еще не присвен номер заказа ДЛ
	// Вернемся к доработке этого алгоритма когда будет принято решение как быть
	// Сейчас здесь только набросок
	
	//// адреса откуда куда
	//АдрГруз из СтруктураДокумета.ОтправительАдресЗначение
	//АдрПунктНазн из СтруктураДокумета.ПолучательАдресЗначение
	//// как их синкать нашСпр<>карточка ДЛ?
	
	//// сроки перевозки
	//ДатОтгрС
	//ДатОтгрПо
	ВрОтгрС 		= СтруктураДокумета.ВремяОтгрузкиС;
	ВрОтгрПо 		= СтруктураДокумета.ВремяОтгрузкиПо;
	
	//ДатаВрВыдача
	//ДатДостГрС		
	//ДатДостГрПо
	ВрДостГрС		= СтруктураДокумета.ВремяДоставкиС;
	ВрДостГрПо      = СтруктураДокумета.ВремяДоставкиПо; 
	
	//// параметры груза
	ОбъемГруза 		= СтруктураДокумета.ГрузОбъем;
	КолМестПарт 	= СтруктураДокумета.ГрузКоличествоГрузовыхМест;
	МассаБруттоКг 	= СтруктураДокумета.ГрузВес;
	СтоимостьГруза  = СтруктураДокумета.ГрузСтоимость;
	
	// товары - если там нет строки или 1 строка то берем
	Если Товары.Количество() <= 1 Тогда
		Если Товары.Количество() = 0 Тогда
			СтрокаГруза = Товары.Добавить();
		Иначе
			СтрокаГруза = Товары[0];
		КонецЕсли;
		
		СтрокаГруза.ОтгрузочноеНаименование = Строка(СтруктураДокумета.ХарактерГруза);
		СтрокаГруза.КоличествоМест = КолМестПарт;
		СтрокаГруза.ОбъемКубМ = ОбъемГруза;
		СтрокаГруза.МассаБруттоКг = МассаБруттоКг;
		СтрокаГруза.СтоимостьГруза = СтоимостьГруза;
		СтрокаГруза.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ОбъявленнаяСтоимость;
		СтрокаГруза.ВалютаУчетаГруза = Справочники.Валюты.НайтиПоКоду("643");
		//СтрокаГруза.СпУпак = ;
		
		// СтруктураДокумета.ГрузМаксимальнаяВысота / длина / ширина куда положить
		
	КонецЕсли;
	
	//// Плательщик  СтруктураДокумета.ПлательщикРоль = 1 - совпадает с го
	//в ПЭ есть СвКлиент
	
	//ВидТС
	Если ВидТС.Количество() = 0 
		И СтруктураДокумета.ВидДоставки = "auto" Тогда 
		НоваяСтрокаВидаТС = ВидТС.Добавить();
		НоваяСтрокаВидаТС.ВидТС = Перечисления.КонтурЛогистика_ВидыТранспорта._1;
	КонецЕсли;
	
	//Комментарий
	
	// проставлять какие-то значения в ПЭ??? видимо в обработке заполнения ПЭ

КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьОсновныеРеквизитыИзXDTO(Партия)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДатОтгрС", "ДатОтгрС", "ДатаТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДатОтгрПо", "ДатОтгрПо", "ДатаТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВрОтгр", "ВрОтгр", "ВремяДпзТип");
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДатДостГрС", "ДатДостГрС", "ДатаТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДатДостГрПо", "ДатДостГрПо", "ДатаТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВрДостГр", "ВрДостГр", "ВремяДпзТип");
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ОтмПрием", "ОтмПрием", "Булево");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИдПарт", "ИдентПартГруз", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НомПарт", "НомПартГруз", "");
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "КолМестПарт", "КолМестГрВсего", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "МаршСлГруз", "МаршСлГруз", "");
	
	// УИГО
	// УИГП

	ДобавитьСтрокуСоответствия(МассивЭлементов, "СвГО", "СвГО", "УчастникТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "СвГП", "СвГП", "УчастникТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "УказКлнт", "УказКлнт", "ОсобыеУсловияПеревозки");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВесГрузПарт", "ВесГрузПарт", "ВесТип");
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "АдрГруз", "АдрГруз.АдрПриемГруз", "АдресПользТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "АдрПунктНазн", "АдрПунктНазн.АдрВыдГруз", "АдресПользТип"); 
	
	КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Партия, ЭтотОбъект);
	
	КС.ЗаполнитьРеквДокТип(Партия, "СопрДокПарт", ЭтотОбъект);
	КС.ЗаполнитьРеквДокТип(Партия, "РеквЗакПост", ЭтотОбъект);
	ЗаполнитьСтоимость(Партия, ЭтотОбъект, "СтГрузПарт");
	ЗаполнитьУведСторон(Партия);
	ЗаполнитьВидТС(Партия);
	ЗаполнитьСвСтрах(Партия);
	ЗаполнитьОпГруз(Партия);
	ЗаполнитьСвУсл(Партия);
	ЗаполнитьСведенияОКонтейнерах(Партия);
	
	КС.ЗаполнитьИнфПолИзXDTOсИдФайл(Партия, ЭтотОбъект, "ИнфПол", "", "ИдентификаторСтрокиТоваров");
	
КонецПроцедуры

Процедура ЗаполнитьСвУсл(Партия)
	
	КС = КонтурЛогистика_КонструкторыXDTO;

	XDTO_СвУсл = КС.XDTO_Вычислить(Партия, "СвУсл");
	XDTO_СвУсл = КС.XDTO_ВычислитьМассивXDTO(XDTO_СвУсл);
	
	Для Каждого Услуга Из XDTO_СвУсл Цикл
		
		НоваяСтрока = СвУсл.Добавить();
		НоваяСтрока.Услуга = Справочники.КонтурЛогистика_ТранспортноЭкспедиционныеУслуги.НайтиСоздатьПоОбъектуXDTO(Услуга);
		НоваяСтрока.Количество = КС.XDTO_ВычислитьЧисло(Услуга, "КолУсл");
		НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		
		КС.ЗаполнитьИнфПолИзXDTOсИдФайл(Услуга, ЭтотОбъект, "ИнфПол", НоваяСтрока.ИдентификаторСтроки, "ИдентификаторСтрокиТоваров");
	
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьСвСтрах(Партия)
	
	КС = КонтурЛогистика_КонструкторыXDTO;

	XDTO_СвСтрах = КС.XDTO_Вычислить(Партия, "СвСтрах");
	СвСтрах = Справочники.КонтурЛогистика_СведенияОСтрахованииГрузов.НайтиСоздатьПоОбъектуXDTO(XDTO_СвСтрах);
	
КонецПроцедуры	

Процедура ЗаполнитьМарк(XDTO, ЗаполняемыйОбъект, Идентификатор)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
 
	РеквизитСхемы = "Марк";
	Реквизит1С = "МаркировкаГруза";
	
	ЭлементXDTO = КС.XDTO_Вычислить(XDTO, РеквизитСхемы);
	МассивXDTO = КС.XDTO_ВычислитьМассивXDTO(ЭлементXDTO);
	
	Для Каждого Значение Из МассивXDTO Цикл
		
		Если Не Значение = "Отсутствует" Тогда
		
			НоваяСтрока = ЗаполняемыйОбъект.Добавить();
			НоваяСтрока[Реквизит1С] = Значение;
			НоваяСтрока.ИдентификаторСтрокиТоваров = Значение;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьУведСторон(Партия)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	УведомлениеСторон = КС.XDTO_Вычислить(Партия, "СвУведСторон");
	УведомлениеСторон = КС.XDTO_ВычислитьМассивXDTO(УведомлениеСторон);

	Для Каждого Уведомление Из УведомлениеСторон Цикл
		
		НовоеУведомление = УведСторон.Добавить();
		НовоеУведомление.Сторона = КС.XDTO_ВычислитьЧисло(Уведомление, "Сторона");
		НовоеУведомление.СпосУвед = КС.XDTO_Вычислить(Уведомление, "СпосУвед");
		
		УчастникТип = КС.XDTO_Вычислить(Уведомление, "ИноеУвед");
		НовоеУведомление.ИноеУвед = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(УчастникТип);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОпГруз(Партия)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Товары.Очистить();
	СтраныПроисхожденияПродукции.Очистить();
	
	ОпГруз = КС.XDTO_Вычислить(Партия, "ОпГруз");
	МассивОпГруз = КС.XDTO_ВычислитьМассивXDTO(ОпГруз);
	
	МассивЭлементов = Новый Массив;
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ОтгрузочноеНаименование", "НаимГруз", "");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "КоличествоМест", "КолМестГр", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ПрзПрвз", "ПрзПер", "ВариантыПодачиКонтейнера");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ПрзОпаснГруз", "ПрзОпаснГруз", "Булево");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ПрзИзъятВещ", "ПрзИзъятВещ", "Булево");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ОбъемКубМ", "Объем", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ЗапрПерегруз", "ЗапрПерегруз", "Булево");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "УчГосСист", "УчГосСист", "Булево"); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НалУпак", "НалУпак", "Булево");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "КодТНВЭД", "КодТовНом", "");
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "СвОпаснГруз", "СвОпаснГруз", "ОписаниеОпасногоГруза");
	
	// КодТовОКПД2
	// КодГрузГНГ
	// КодГрузЕТСНГ
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "МассаБруттоКг", "ВесГруз.ВесБрутто", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "МассаНеттоКг", "ВесГруз.ВесНетто", "Число");
	
	Для Каждого ОпГруз Из МассивОпГруз Цикл 
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаТовара.Учитывать = Истина;
		
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, ОпГруз, НоваяСтрокаТовара);
		
		ЗаполнитьМарк(ОпГруз, Марк, НоваяСтрокаТовара.ИдентификаторСтроки);
		ЗаполнитьСведенияОГосударственныхСистемах(НоваяСтрокаТовара.ИдентификаторСтроки, ОпГруз);
		Справочники.КонтурЛогистика_СтраныМира.ЗаполнитьСтраныПроисхожденияПродукции(
			ЭтотОбъект, НоваяСтрокаТовара.ИдентификаторСтроки, ОпГруз);
		ЗаполнитьИнформациюОбУпаковкеГруза(НоваяСтрокаТовара.ИдентификаторСтроки, ОпГруз);
		ЗаполнитьСтоимость(ОпГруз, НоваяСтрокаТовара, "СтГруз");
		
		КС.ЗаполнитьИнфПолИзXDTOсИдФайл(Партия, ЭтотОбъект, "ИнфПол", НоваяСтрокаТовара.ИдентификаторСтроки, "ИдентификаторСтрокиТоваров");
			
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьСтоимость(ОпГруз, ЗаполняемыйОбъект, Префикс = "")
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СтоимостьОбъявл = КС.XDTO_Вычислить(ОпГруз, "Объявл" + Префикс, Неопределено);
	СтоимостьДейст = КС.XDTO_Вычислить(ОпГруз, "Дейст" + Префикс, Неопределено);
	
	Если СтоимостьОбъявл <> Неопределено Тогда
		Стоимость = СтоимостьОбъявл;
		ЗаполняемыйОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ОбъявленнаяСтоимость;
	ИначеЕсли СтоимостьДейст <> Неопределено Тогда
		Стоимость = СтоимостьДейст;
		ЗаполняемыйОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ДействительнаяСтоимость; 
	Иначе 
		Возврат ;			 
	КонецЕсли;
		
	КодВалюты = КС.XDTO_Вычислить(Стоимость, "КодОКВ");
	НаименованиеВалюты = КС.XDTO_Вычислить(Стоимость, "НаимОКВ");
	ЗаполняемыйОбъект.ВалютаУчетаГруза = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С(КодВалюты, НаименованиеВалюты);
	ЗаполняемыйОбъект.СтоимостьГруза = КС.XDTO_ВычислитьЧисло(Стоимость, "СтГр");

КонецПроцедуры	

Процедура ЗаполнитьИнформациюОбУпаковкеГруза(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВидУпак", "ВидУпак", "ОКВГУМТип");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВесУпак", "ВесУпак", "Число"); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "КолУпак", "КолУп", "Число"); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ВысЗнач", "ГабарУпак.ВысЗнач", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ДлЗнач", "ГабарУпак.ДлЗнач", "Число");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ШирЗнач", "ГабарУпак.ШирЗнач", "Число"); 
	
	МассивЗначений = КС.XDTO_Вычислить(ОпГруз, "ИнфУпГруз", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаТЧ = ИнфУпГруз.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Значение, СтрокаТЧ);
	КонецЦикла;

КонецПроцедуры	

Процедура ЗаполнитьСведенияОГосударственныхСистемах(ИдентификаторСтрокиТоваров, ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивЭлементов = Новый Массив;
	
	ДобавитьСтрокуСоответствия(МассивЭлементов, "НаимГосСист", "НаимГосСист", "НаимГосСист");
	ДобавитьСтрокуСоответствия(МассивЭлементов, "УчетЕд", "УчетЕд", ""); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИнаяИнф", "ИнаяИнф", ""); 
	ДобавитьСтрокуСоответствия(МассивЭлементов, "ИдНомУчетЕд", "ИдНомУчетЕд", ""); 
	
	МассивЗначений = КС.XDTO_Вычислить(ОпГруз, "СвГосСист", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		СтрокаТЧ = СведенияГосСистем.Добавить();
		СтрокаТЧ.ИдентификаторСтрокиТоваров = ИдентификаторСтрокиТоваров;
		КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, Значение, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОКонтейнерах(СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ПрзПрвз = Перечисления.КонтурЛогистика_ВариантыПодачиКонтейнера.Десериализовать(КС.XDTO_Вычислить(СвГруз, "ПрзПрвз"));
	
	МассивЗначений = КС.XDTO_Вычислить(СвГруз, "СвКонтейн", Новый Массив);
	МассивЗначений = КС.XDTO_ВычислитьМассивXDTO(МассивЗначений);
	
	Для Каждого Значение Из МассивЗначений Цикл
		
		СтрокаТЧ = СведенияОКонтейнерах.Добавить();
		СтрокаТЧ.Номер = КС.XDTO_ВычислитьЧисло(Значение, "НомКонтейн");
		СтрокаТЧ.ИдентификационныйНомер = КС.XDTO_Вычислить(Значение, "ИдКонтейнМежд");
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификационныйНомер) Тогда
			СтрокаТЧ.ИдентификационныйНомер = КС.XDTO_Вычислить(Значение, "ИдКонтейнНест");
		КонецЕсли;
		СтрокаТЧ.ИСО = КС.XDTO_Вычислить(Значение, "ИСОКонтейн");
		
		ПредКонтейн = КС.XDTO_Вычислить(Значение, "ПредКонтейн");
		СтрокаТЧ.ПредоставленКлиентом = Перечисления.КонтурЛогистика_ПредоставлениеКонтейнера.Десериализовать(ПредКонтейн);
		
		СтрокаТЧ.ВесГруза = КС.XDTO_ВычислитьЧисло(Значение, "СумВесГруз");
		СтрокаТЧ.ВесТары = КС.XDTO_ВычислитьЧисло(Значение, "ВесТара");
		СтрокаТЧ.КоличествоПломб = КС.XDTO_ВычислитьЧисло(Значение, "КолПломб");
		
		НомераПломбЛок = КС.XDTO_Вычислить(Значение, "НомПломб", Новый Массив);
		НомераПломбЛок = КС.XDTO_ВычислитьМассивXDTO(НомераПломбЛок);
		СтрокаТЧ.НомераПломб = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(НомераПломбЛок, ";");
		
		СтрокаТЧ.Высота = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ВысЗнач");
		СтрокаТЧ.Длина = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ДлЗнач");
		СтрокаТЧ.Ширина = КС.XDTO_ВычислитьЧисло(Значение, "ГабарСпКонтейн.ШирЗнач");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидТС(Партия)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ВидТСМассив = КС.XDTO_Вычислить(Партия, "СвТС");
	ВидТСМассив = КС.XDTO_ВычислитьМассивXDTO(ВидТСМассив);
	
	Для Каждого ТС Из ВидТСМассив Цикл
		СтрокаТЧ = ВидТС.Добавить();
		СтрокаТЧ.ВидТС = Перечисления.КонтурЛогистика_ВидыТранспорта.Десериализовать(КС.XDTO_Вычислить(ТС, "ВидТС"));
		СтрокаТЧ.ТипКузов = КС.XDTO_Вычислить(ТС, "ТипКузов");
	КонецЦикла;
	
КонецПроцедуры	
 
Процедура СконвертироватьСтрокуТоваров1СвЛогистика(НомерСтроки) Экспорт
	
	СтрокаТоваров = Товары.Найти(НомерСтроки, "НомерСтроки");
	
	// сформировать расширенную (с упаковками) строку товаров
	ТЗ_ТоварыВременная = Товары.ВыгрузитьКолонки(); 
	
	СтрокаТоваровВременная = ТЗ_ТоварыВременная.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТоваровВременная, СтрокаТоваров);
	
	КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
	
	// положить расширенную строку товаров обратно в ТоварыДокумента1С
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаТоваровВременная);
	
КонецПроцедуры

Процедура ЗаполнитьПоДокОснованию(Знач ДокументОснование, ТипЛогистика)
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		    ТипЛогистика, ДокументОснование);
	
	// Заполнить ЭтотТитул
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОчиститьСтрокиТабличныхЧастейБезИдентификатораСтроки()

	СписокОчищаемыхТабличныхЧастей = "СведенияГосСистем,ИнфУпГруз,Марк,СтраныПроисхожденияПродукции";
	МассивИдентификаторов = Товары.ВыгрузитьКолонку("ИдентификаторСтроки");

	ОчищаемыеТЧ = КонтурЛогистика_СтдСтрКлиентСервер.РазложитьСтрокуВМассивПодстрокЛок(СписокОчищаемыхТабличныхЧастей);

	Для Каждого НазваниеТЧ Из ОчищаемыеТЧ Цикл

		ТЧ = ЭтотОбъект[НазваниеТЧ];

		Для Каждого СтрокаТЧ Из ТЧ Цикл

			Если МассивИдентификаторов.Найти(СтрокаТЧ.ИдентификаторСтрокиТоваров) = Неопределено Тогда
				ТЧ.Удалить(СтрокаТЧ);
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю(ВходящийПользователь1С = Неопределено) Экспорт
	
	// не удалять нужно для совместимости с другими документами
	
КонецПроцедуры

Процедура ОчиститьТабличныеЧасти()

	ВидТС.Очистить();
	СопрДокПарт.Очистить();
	РеквЗакПост.Очистить();
	Товары.Очистить();
	СведенияОКонтейнерах.Очистить();
	СведенияГосСистем.Очистить();
	ИнфПол.Очистить();
	СвУсл.Очистить();
	УведСторон.Очистить();
	ИнфУпГруз.Очистить();
	Марк.Очистить();
	СтраныПроисхожденияПродукции.Очистить();
	
КонецПроцедуры	

Процедура ДобавитьСтрокуСоответствия(МассивЭлементов, Реквизит1С, РеквизитСхемы, Тип)
	
	КонтурЛогистика_КонструкторыXDTO.ДобавитьСтрокуСоответствия(МассивЭлементов, Реквизит1С, РеквизитСхемы, Тип);
	
КонецПроцедуры

#КонецЕсли
