&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Выборка = Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.Выбрать();
	Если Не Выборка.Следующий() Тогда
		Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.ЗаполнитьПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.ЗаполнитьПоУмолчанию();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЗначениеНаСервере()
	Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.ЗаполнитьПоУмолчанию(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеЗначение(Команда)
	
	ДобавитьНовыеЗначениеНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры
