Функция ЦП_Сервис() Экспорт 

	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПолучитьСервисЦентраПоддержки();
	
КонецФункции

Процедура ОткрытьЦентрПоддержки(ТаргетированнаяСсылка = Неопределено, Модуль = "Главная", ДвоичныеДанные = Неопределено) Экспорт 
		
	ПараметрыСессии  = СформироватьПараметрыЦентраПоддержки(ДвоичныеДанные);
	ЦП_Сервис().ОткрытьЦентрПоддержки(ПараметрыСессии, Модуль,, ТаргетированнаяСсылка);
	
КонецПроцедуры

Функция СформироватьПараметрыЦентраПоддержки(ДвоичныеДанные = Неопределено)
	
	Результат = ЦП_Сервис().МодельПараметрыСессии();
	
	Файлы = Новый Массив;
	
	Если ДвоичныеДанные = Неопределено Тогда
		ДвоичныеДанныеНастроек = КонтурЛогистика_ЦентрПоддержкиСервер.ПолучитьДвоичныеДанныеНастроек();			
	Иначе
		ДвоичныеДанныеНастроек = ДвоичныеДанные;
	КонецЕсли;
		
	Если ДвоичныеДанныеНастроек <> Неопределено Тогда
		
		Файл = ЦП_Сервис().МодельФайла();
		Файл.ИмяФайла = "ИнформацияДляТехподдержки.zip";
		Файл.Данные =  ДвоичныеДанныеНастроек;
		Файлы.Добавить(Файл);
		
	КонецЕсли;
		
	Результат.ДополнительныеПараметры = КонтурЛогистика_ЦентрПоддержкиСервер.СобратьТехническуюИнформацию();
	Результат.Файлы = Файлы;
			
	Возврат Результат;	
	
КонецФункции

Процедура НаписатьПисьмоВТехПоддержку() Экспорт
	
	ДанныеДляПисьма = КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеДляПисьмаВТехПоддержку();
	
	Попытка		
		ЗапуститьПриложение(ДанныеДляПисьма.СтрокаКоманды);		
	Исключение
		ОписаниеОбработчика = ОписаниеОбработчикаОповещения(
			"ПоказатьШаблонаПисьмаВТехническуюПоддержку", КонтурЛогистика_ЦентрПоддержкиКлиент, ДанныеДляПисьма);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ДанныеДляПисьма.ТекстПредупреждения, "КонтурЛогистика", ,
			КонтурЛогистика_ЦентрПоддержкиКлиент, "ПоказатьШаблонаПисьмаВТехническуюПоддержку", ДанныеДляПисьма);
	КонецПопытки;
		
КонецПроцедуры

Процедура ПоказатьШаблонаПисьмаВТехническуюПоддержку(ДанныеДляПисьма) Экспорт
	
	ШаблонПисьма = Новый ТекстовыйДокумент;
	ШаблонПисьма.УстановитьТекст(ДанныеДляПисьма.ТекстШаблонаПисьма);
	ШаблонПисьма.Показать(ДанныеДляПисьма.ТекстЗаголовкаШаблонаПисьма);
	
КонецПроцедуры

Функция ОписаниеОбработчикаОповещения(Обработчик, Модуль, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Модуль", Модуль);
	Результат.Вставить("Обработчик", Обработчик);
	Результат.Вставить("ДопПараметры", ДопПараметры);
	
	Возврат Результат;
	
КонецФункции