
&НаСервере
&Вместо("НастроитьПоТипуИсполнителя")
Процедура ОД_НастроитьПоТипуИсполнителя()

	ВыполняетПеревозчик = Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
	
	Элементы.Перевозчик.Видимость       = ВыполняетПеревозчик;
	Элементы.Водитель.Видимость         = Истина;
	Элементы.КурьерЭкспедитор.Видимость = Истина;
	Элементы.РеквизитыТТН.Видимость     = ВыполняетПеревозчик
											И Объект.Операция = Перечисления.ВидыДоставки.СоСклада
											И ПолучитьФункциональнуюОпцию("ИспользоватьТТН");
	
	Если ВыполняетПеревозчик
		И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ЗаполнитьКонтрагентаИБанковскийСчетПеревозчика();
		КонецЕсли;
		
	Иначе
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		
		Перевозчик = Объект.Перевозчик;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьСлужебныеРеквизитыМаршрута")
Процедура ОД_ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки)
	
	Результат = Неопределено;
	РассчитатьНаличиеТТН = ПолучитьФункциональнуюОпцию("ИспользоватьТТН") 
		И ПравоДоступа("Чтение", Метаданные.Документы.ТранспортнаяНакладная);
		
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.НомерСтроки
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	&Распоряжения КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Маршрут.НомерСтроки,
	|	Маршрут.КлючСвязи
	|ПОМЕСТИТЬ Маршрут
	|ИЗ
	|	&Маршрут КАК Маршрут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Маршрут.НомерСтроки КАК НомерСтрокиМаршрута,
	|	Распоряжения.НомерСтроки КАК НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ РаспоряженияПоМаршрутам
	|ИЗ
	|	Маршрут КАК Маршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распоряжения КАК Распоряжения
	|		ПО Маршрут.КлючСвязи = Распоряжения.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка КАК Накладная,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ НакладныеПоЗаданиямНаПеревозку
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказНаПеремещение
	|			И Распоряжения.Склад = ДокументТовары.Ссылка.СкладОтправитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказПереработчику
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|ГДЕ
	|	(Распоряжения.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
	//++ НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаСырьяПереработчику
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаТоваровХранителю
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ВозвратТоваровПоставщику)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений КАК НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.НомерСтрокиМаршрута) КАК НомерСтрокиМаршрута,
	|	МАКСИМУМ(НЕ ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка ЕСТЬ NULL ) КАК ТранспортнаяНакладнаяОформлена,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик) КАК Перевозчик,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель) КАК ПолучательОтправитель
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК РаспоряженияПоМаршрутам
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
	|		ПО РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений = НакладныеПоЗаданиямНаПеревозку.НомерСтрокиРаспоряжений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснованияОснования
	|		ПО (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.АдресДоставки = НакладныеПоЗаданиямНаПеревозку.Адрес)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование = НакладныеПоЗаданиямНаПеревозку.Накладная)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиМаршрута,
	|	НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик),
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель)";
	
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());
	Если ОбновляемыеСтроки = Неопределено Тогда
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить(ОбновляемыеСтроки));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",	Объект.Ссылка);
		
	Результат = Запрос.Выполнить().Выбрать();
	ШаблонСПеревозчиком = НСтр("ru = '%Перевозчик% (для %ПолучателиОтправители%)'");
	Пока Результат.СледующийПоЗначениюПоля("НомерСтрокиМаршрута") Цикл
		
		СтрокаМаршрута = Объект.Маршрут[Результат.НомерСтрокиМаршрута - 1];
		ПолучателиОтправителиПоПункту = "";
		ТранспортнаяНакладнаяОформлена = Ложь;
		КоличествоРаспоряжений = 0;
		
		Пока Результат.СледующийПоЗначениюПоля("Перевозчик") Цикл
			
			ПолучателиОтправителиПоПеревозчику = "";
			Пока Результат.СледующийПоЗначениюПоля("ПолучательОтправитель") Цикл
				
				Пока Результат.Следующий() Цикл
					КоличествоРаспоряжений = КоличествоРаспоряжений + 1;
					ТранспортнаяНакладнаяОформлена = Макс(ТранспортнаяНакладнаяОформлена, Результат.ТранспортнаяНакладнаяОформлена);
				КонецЦикла;
				
				ПолучателиОтправителиПоПеревозчику = ПолучателиОтправителиПоПеревозчику + Результат.ПолучательОтправитель + "," + " ";
			КонецЦикла;
			ПолучателиОтправителиПоПеревозчику = Лев(ПолучателиОтправителиПоПеревозчику, СтрДлина(ПолучателиОтправителиПоПеревозчику)-2);
			Если ЗначениеЗаполнено(Результат.Перевозчик) Тогда
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ШаблонСПеревозчиком, "%ПолучателиОтправители%", ПолучателиОтправителиПоПеревозчику);
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ПолучателиОтправителиПоПеревозчику, "%Перевозчик%", Результат.Перевозчик);
			КонецЕсли;
			ПолучателиОтправителиПоПункту = ПолучателиОтправителиПоПункту + ПолучателиОтправителиПоПеревозчику + "," + " ";
		КонецЦикла;
		
		СтрокаМаршрута.ПолучателиОтправители = ПолучателиОтправителиПоПункту
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоРаспоряжений, НСтр("ru = 'распоряжение, распоряжения, распоряжений'"))
			+ НСтр("ru = '...'");
		
		Если РассчитатьНаличиеТТН Тогда
			СтрокаМаршрута.ТранспортнаяНакладнаяОформлена = ТранспортнаяНакладнаяОформлена;
		КонецЕсли;
		
		СтрокаМаршрута.ВремяСБезДаты   = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяС);
		СтрокаМаршрута.ВремяПоБезДаты  = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяПо);

		КА = ОД_Логистика.ПолучитьКонтактыИзАдреса(СтрокаМаршрута.Адрес);
		МассивКА = Новый Массив;
		Если НЕ ПустаяСтрока(КА.КонтактноеЛицо) Тогда
			МассивКА.Добавить(КА.КонтактноеЛицо);
		КонецЕсли;
		Если НЕ ПустаяСтрока(КА.Телефон) Тогда
			МассивКА.Добавить(КА.Телефон);
		КонецЕсли;
		КонтактыИзАдресаСтрока = СтрСоединить(МассивКА, " т.: ");
		СтрокаМаршрута.Контакты = КонтактыИзАдресаСтрока;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура ОД_Подключаемый_ВыполнитьКоманду(Команда)
	
	ИмяПФ = "ЗаявкаАвтотранспортаВер2";
	
	Если Команда.Имя = "ПодменюПечатьОбычное_" + ИмяПФ Тогда
		
		ДополнительныеПараметры = Новый Структура();
		
		ТекущийОбъектПечати = Новый Массив;
		ТекущийОбъектПечати.Добавить(Объект.Ссылка);
		
		Для каждого Пункт Из Объект.Маршрут Цикл
			Если Пункт.Доставлено Тогда
				ТекущийОбъектПечати.Добавить(Пункт.КлючСвязи);
			КонецЕсли;
		КонецЦикла;
		
		ТекМенеджерПечати = "Обработка." + ИмяПФ;
		ИД_ПечатнойФормы = "ВнешняяПечатнаяФорма." + ИмяПФ; 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТекМенеджерПечати, ИД_ПечатнойФормы, ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
	Иначе	
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	КонецЕсли;
	
КонецПроцедуры

#Область КомандыФормы
	
Функция ПолучитьМассивРаспоряжений(п_ВыделенныеСтроки)
	
	Рез = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из п_ВыделенныеСтроки Цикл
		ТекущаяСтрока = Объект.Маршрут.НайтиПоИдентификатору(ИдентификаторСтроки);
		КлючСвязи = ТекущаяСтрока.КлючСвязи;
		СтруктураПоиска = Новый Структура("Распоряжение, Склад");
		НайденныеСтроки = Объект.Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи",КлючСвязи));
		Для Каждого СтрокаРаспоряжений Из НайденныеСтроки Цикл
			Рез.Добавить(СтрокаРаспоряжений.Распоряжение);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Рез;

КонецФункции // ()

&НаКлиенте
Процедура ОД_СоздатьДокументПриобретениеУслугПосле(Команда)

	МассивСтрок = Элементы.Маршрут.ВыделенныеСтроки;
	
	МассивЗаказов = ПолучитьМассивРаспоряжений(МассивСтрок);
	
	Если МассивЗаказов.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
		ПараметрыФормы.Вставить("МассивЗаказов", МассивЗаказов);
		
		ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.ФормаОбъекта", ПараметрыФормы);		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


