&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборОбменЛогистическимиСообщениями = "Все";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборОбменЛогистическимиСообщениямиПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()

	Список.Отбор.Элементы.Очистить();
	
	Если ОтборОбменЛогистическимиСообщениями = "Наши" Тогда 
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;  
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Наш");
		ЭлементОтбора.ПравоеЗначение 	= истина;
		
	ИначеЕсли ОтборОбменЛогистическимиСообщениями = "ГотовыКЭПД" Тогда 
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;  
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусГотовностиКЭПД");
		ЭлементОтбора.ПравоеЗначение 	= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыГотовностиКЭПД.Ready");
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзДиадока(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбораПоИННКПП",
	Новый Структура("РежимПоиска", Истина)	, ЭтаФорма, ЭтаФорма, "ОбработчикОбновить",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОбновитьОрганизации" Тогда
		
		Элементы.Список.Обновить();
		
		Если ЗначениеЗаполнено(Параметр) Тогда 
			// спозиционироваться на добавленном
			Элементы.Список.ТекущаяСтрока = Параметр;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт 

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусГотовностиКЭПД(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщить("Выделите одну или несколько организаций для синхронизации реквизитов из Диадока");
		Возврат;
	КонецЕсли;
	
	ВыделенныеОрганизации =
		КонтурЛогистика_СтдКоллекцииКлиентСервер.СкопироватьРекурсивноЛок(Элементы.Список.ВыделенныеСтроки);
	
	ПараметрыМетода = Новый Структура("МассивОрганизаций", ВыделенныеОрганизации);
	
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
		"КонтурЛогистика_ДлительныеОперацииСервер.СинхронизироватьРеквизитыОрганизацийИзДиадока",
		ПараметрыМетода,
		"КлючФЗ_СинхронизироватьОрганизацииИзДиадока",
		"Синхронизация реквизитов организаций из Диадока");
		
	Сообщить("Выполняется синхронизация реквизитов организаций из Диадока");
	
	Если РезультатЗапуска.Статус = "Выполняется" Тогда
			
		ИдентификаторФЗ_ОбновитьСтатусГотовностиКЭПД = РезультатЗапуска.ИдентификаторЗадания;
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеОбновитьСтатусГотовностиКЭПД", 0.1, Истина);
		
	ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
		
		ПроверитьФоновоеЗаданиеОбновитьСтатусГотовностиКЭПД();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеОбновитьСтатусГотовностиКЭПД() Экспорт
	
	ИнтервалОбработчикаОжидания = 1;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ОбновитьСтатусГотовностиКЭПД);
	
	Если ЗаданиеЕщеВыполняется Тогда 
		 				
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеОбновитьСтатусГотовностиКЭПД", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		Элементы.Список.Обновить();
		
		Сообщить("Синхронизация реквизитов из Диадока завершена");
				
	КонецЕсли;

КонецПроцедуры



