
#Область Логистика

&НаКлиенте
&После("АдресДоставкиОбработкаВыбора")
Процедура ОД_АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(ВыбранноеЗначение.АдресДоставки);
	
	УстановитьКонтактыДоставки(Контакты);

КонецПроцедуры

&НаКлиенте
&После("СпособМестоДоставкиПеревозчикПриИзменении")
Процедура ОД_СпособМестоДоставкиПеревозчикПриИзменении(Элемент)

	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента") Тогда
		// Доставка по Москве и МО
		Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(Объект.АдресДоставки);
	ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") Тогда
		// Наша транспортная служба до перевозчика
		Контакты = ОД_Логистика.ПолучитьКонтактыИзАдреса(Объект.АдресДоставкиПеревозчика);
	Иначе
		Возврат;
	КонецЕсли;
	
	УстановитьКонтактыДоставки(Контакты);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПеревозчикПартнер = "";
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьКонтактыДоставки(п_Контакты)

	Если ЗначениеЗаполнено(п_Контакты.ВремяДоставкиС) Тогда
		Объект.ВремяДоставкиС = п_Контакты.ВремяДоставкиС;
	КонецЕсли;
	Если ЗначениеЗаполнено(п_Контакты.ВремяДоставкиПо) Тогда
		Объект.ВремяДоставкиПо = п_Контакты.ВремяДоставкиПо;
	КонецЕсли;
	Объект.КонтактноеЛицо						= п_Контакты.КонтактноеЛицо;
	Объект.ДополнительнаяИнформацияПоДоставке	= п_Контакты.ДополнительнаяИнформацияПоДоставке;

КонецПроцедуры

#КонецОбласти
