&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Действие") Тогда
		Если Параметры.Действие = "Восстановить" Тогда
			Элементы.ФормаСоздать.Видимость = Ложь;
			Элементы.СписокКонтекстноеМенюСоздать.Видимость = Ложь;
		КонецЕсли;
		
		Заголовок = Параметры.Действие;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элементы.Список.ТекущиеДанные.Наименование);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбрана ни одна из настроек");
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Закрыть(Элементы.Список.ТекущиеДанные.Наименование);

КонецПроцедуры