
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьКриптографию1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьКриптографию1С");
	ЭтоНовый = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период);
	
	Если Параметры.Свойство("Сертификат") Тогда
		
		Запись.Сертификат = Параметры.Сертификат;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ОрганизацияДиадок") Тогда
		
		Запись.ОрганизацияДиадок = Параметры.ОрганизацияДиадок;
		
	КонецЕсли;
	
	Параметры.Свойство("УказатьДатуБумажнойДоверенности", УказатьДатуБумажнойДоверенности);
	
	ИспользоватьСертификат = ЗначениеЗаполнено(Запись.Сертификат) Или ЭтоНовый;
	
	Если ЭтоНовый Тогда
		
		Запись.Период = НачалоДня(Запись.Период);
		
		Если Не ЗначениеЗаполнено(Запись.ОрганизацияДиадок) Тогда
			Запись.ОрганизацияДиадок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОднаНашаОрганизация();
		КонецЕсли;
		
		Запись.ИдентификаторНастройки = Строка(Новый УникальныйИдентификатор());
		
	КонецЕсли;
	
	Элементы.ГруппаИспользоватьСертификат.Видимость = Не ИспользоватьСертификат;
	Элементы.ГруппаДопСведения.Видимость = Не Запись.ДопСведенияОПодписанте = "";
	
	Если Не ЗначениеЗаполнено(Запись.ОбщийСпособПодтвержденияПолномочий) Тогда
		Запись.ОбщийСпособПодтвержденияПолномочий = Перечисления.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.МЧД;
	КонецЕсли;
	
	ТекПользовательАдминистратор 	= КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор();
	ТекПользовательМожетВНастройки  = РольДоступна("КонтурЛогистика_НастройкаПодписания");
	
	Если Не ТекПользовательАдминистратор И Не ТекПользовательМожетВНастройки Тогда
		
		Элементы.Пользователь1С.Доступность 		= Ложь;
		Элементы.ГруппаПараметрПодписания.Видимость = Ложь;
		Элементы.ФормаСкопировать.Видимость 		= Ложь;
		Элементы.ФормаУдалить.Видимость 			= Ложь;
		
		Элементы.ФормаОтобразитьГруппуИспользоватьСертификат.Видимость 	= Ложь;
		Элементы.ФормаОтобразитьГруппуДопСведения.Видимость 			= Ложь;
		
		ТекущийПользователь1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
				
		Если ЭтоНовый Тогда
			
			Запись.Пользователь1С = ТекущийПользователь1С;
			
		ИначеЕсли Не Запись.Пользователь1С = ТекущийПользователь1С
			Или Не ЗначениеЗаполнено(Запись.Пользователь1С) Тогда
			
			ЭтаФорма.ТолькоПросмотр 					= Истина;
			КоманднаяПанель.Видимость 					= Ложь;
			Элементы.ГруппаДоступЗапрещен.Видимость 	= Истина;
			
		КонецЕсли;
				
	КонецЕсли;
	
	Если Не ТекПользовательАдминистратор И ТекПользовательМожетВНастройки Тогда
			
		Элементы.ФормаУдалить.Видимость = Ложь;
		
	КонецЕсли;
	
	РежимАвторизации  = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
	АвторизацияПоOIDC = (РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow);
		
	ВалидацияМЧД();
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// чтобы снять фокус с баннера
	Элементы.КартинкаЗаглушка.Видимость = Ложь;
	ТекущийЭлемент = Элементы.КартинкаЗаглушка;
	
	Если УказатьДатуБумажнойДоверенности Тогда		
		ТекущийЭлемент = Элементы.СвДоверБум_ДатаДовер;		
	КонецЕсли;
	
	ПроверитьАвторизациюПоOIDC();
		
	УправлениеЭлементамиФормы(ЭтаФорма); 
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	Оповестить("КонтурЛогистика_ОбновитьФормуПроверкиСертификатов");
	Оповестить("КонтурЛогистика_ОбновитьНастройкиПодписанияВСтартовомПомощнике");
	
	Переменные = ПеременныеМетрикаНастройкиПодписания(Запись);	
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(Переменные, "Настройки подписания", "Записать настройку подписания",
		"РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи");
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПеременныеМетрикаНастройкиПодписания(Знач Запись)
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ПеременныеМетрикаНастройкиПодписания(Запись);
	
КонецФункции

&НаКлиенте
Процедура ВыбратьСертификат(Команда)
	
	 КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		 "ОбщаяФорма.КонтурЛогистика_ВыборСертификата",
		 ,
		 ЭтаФорма,
		 ЭтаФорма,
		 "ОбработчикВыборСертификата");
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыборСертификата(ДанныеСертификата, ДопПараметры = Неопределено) Экспорт

	Если ДанныеСертификата <> Неопределено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗаполнитьСертификатДанными(Запись, ДанныеСертификата);
		
		// определяем тип модуля криптографии
		#Если ВебКлиент Тогда
		
			ЗаполнитьТипПрограммыЭППоУмолчанию();
			
			Элементы.ПредупреждениеГруппа.Видимость = Истина;
			Элементы.Предупреждение.Заголовок = "После выбора сертификата рекомендуется выполнить проверку сертификата";
			
		#КонецЕсли
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура УбратьАвторизацию() Экспорт	
			
	Элементы.ПроверитьАвторизацию.Видимость = Ложь;	
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УсловноеОформлениеПредставленияПЗК(Форма)
	
	Если Форма.Запись.ВводитьПарольВПрограммеЭлектроннойПодписи Тогда		
		Форма.Запись.ПЗК = "";
		Форма.Элементы.ПредставлениеПЗК.Доступность = Ложь;				
	Иначе		
		Форма.Элементы.ПредставлениеПЗК.Доступность = Истина;		
	КонецЕсли;
	
	Форма.ПредставлениеПЗК = ?(ЗначениеЗаполнено(Форма.Запись.ПЗК), "Изменить", "Ввести");
	
	#Если ВебКлиент Тогда
		Форма.Элементы.ПредставлениеПЗК.Видимость = ЗначениеЗаполнено(Форма.Запись.ОтпечатокСертификата);	
	#Иначе
		Форма.Элементы.ПредставлениеПЗК.Видимость = Форма.ИспользоватьКриптографию1С И ЗначениеЗаполнено(Форма.Запись.ОтпечатокСертификата);
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПЗКНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ДанныеСертификата", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОписаниеДанныхСертификата());
	ЗаполнитьЗначенияСвойств(ПараметрыФормы.ДанныеСертификата, Запись);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		 "ОбщаяФорма.КонтурЛогистика_ВводПЗК",
		 ПараметрыФормы,
		 ЭтаФорма,
		 ЭтаФорма,
		 "ОбработчикВводаПЗК");
	
КонецПроцедуры

&НаКлиенте
Процедура ПопытатьсяАвторизоваться()
	
	Если Не ИспользоватьКриптографию1С Тогда 
					
		ПЗК = ?(ЗначениеЗаполнено(Запись.ПЗК), Запись.ПЗК, Неопределено);
		
		Попытка
			
			Если Не Запись.СертификатНаСервере Тогда 	
				Авторизация_ПоСертификату(Запись.ОтпечатокСертификата, ПЗК);			
			Иначе				
				Авторизация_ПоСертификатуНаСервере(Запись.ОтпечатокСертификата, ПЗК);		
			КонецЕсли;
			
		Исключение
			
			ДобавитьОшибкуАвторизации(Запись.ОтпечатокСертификата, ИнформацияОбОшибке()); 
			
			ОбработкаОшибокАвторизацииПоСертификатам();
			
		КонецПопытки;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаПЗК(Результат, ДопПараметры = Неопределено) Экспорт 
	
	Если Результат = Неопределено Тогда
		Сообщить("Пароль закрытого ключа сертификата не изменен");
		Возврат
	КонецЕсли;
	
	Запись.ПЗК = Результат;
	
	#Если Не Вебклиент Тогда
		ПопытатьсяАвторизоваться();
	#КонецЕсли	
	
	УсловноеОформлениеПредставленияПЗК(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Функция ДанныеСертификата(ДанныеТекущейСтроки)

	ДанныеСертификата = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОписаниеДанныхСертификата();
	ЗаполнитьЗначенияСвойств(ДанныеСертификата, ДанныеТекущейСтроки);
	
	Возврат ДанныеСертификата;

КонецФункции

&НаКлиенте
Функция Авторизация_ПоСертификату(ОтпечатокСертификата, ПЗК)
	
	Возврат Модуль_ЯдроНаКлиенте().Авторизация_ПоСертификату(ОтпечатокСертификата, ПЗК);
		
КонецФункции

&НаСервереБезКонтекста
Функция Авторизация_ПоСертификатуНаСервере(ОтпечатокСертификата, ПЗК)
		
	Возврат Модуль_ЯдроНаСервере().Авторизация_ПоСертификату(ОтпечатокСертификата, ПЗК);
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()

	Возврат КонтурЛогистика_ИнтеграцияДиадокКлиентПовтИсп.ЯдроНаКлиенте();	

КонецФункции

&НаСервереБезКонтекста
Функция Модуль_ЯдроНаСервере()

	Возврат КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.Ядро();	

КонецФункции 

&НаКлиенте
Процедура ДобавитьОшибкуАвторизации(ОтпечатокСертификата ,ИнформацияОбОшибке)
	
	ОшибкаАвторизации = Новый Структура;
		
	ОшибкаАвторизации.Вставить("ОтпечатокСертификата", "ОтпечатокСертификата");
	ОшибкаАвторизации.Вставить("ИнформацияОбОшибке", ИнформацияОбОшибке);

КонецПроцедуры

//Обрабатывает ошибки возникающие при авторизации по сертификату, выводит сообщение пользователю что авторизация не прошла
//
// Параметры:
//  ОшибкиАвторизации - Массив структур описывающих ошибки подключения
//   *ОтпечатокСертификата			 - Строка				 - отпечаток сертификата
//   *ИнформацияОбОшибке			 - ИнформацияОбОшибке	 - ИнформацияОбОшибке()
//
&НаКлиенте
Процедура ОбработкаОшибокАвторизацииПоСертификатам()
	
	Если ТипЗнч(ОшибкаАвторизации) = Тип("Структура") И ОшибкаАвторизации.Количество() > 0 Тогда
			
		ИдентификаторОшибки = "";
		
		Если ТипЗнч(ОшибкаАвторизации.ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда 
		
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ОшибкаАвторизации.ИнформацияОбОшибке);
			
			Если Найти(ПодробноеПредставлениеОшибки, "401") И Найти(ПодробноеПредставлениеОшибки, "is not authorized") Тогда
				ИдентификаторОшибки = "Сертификат не имеет доступа в Диадок";
			ИначеЕсли Найти(ПодробноеПредставлениеОшибки, "0x80090022") Тогда 	
				ИдентификаторОшибки = "Provider could not perform the action since the context was acquired as silent.";
			Иначе
				
				Если ОшибкаАвторизации.ИнформацияОбОшибке.Причина = Неопределено Тогда
					ОписаниеОшибки = ОшибкаАвторизации.ИнформацияОбОшибке.Описание;
				Иначе
					ОписаниеОшибки = ОшибкаАвторизации.ИнформацияОбОшибке.Причина.Описание;
				КонецЕсли;
				
				ИдентификаторОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
					"Не удалось авторизоваться по сертификату:
					|%1" + Символы.ПС,
					ОписаниеОшибки);
				
			КонецЕсли;
		
		Иначе
			
			ИдентификаторОшибки = ОшибкаАвторизации.ИнформацияОбОшибке;
			
		КонецЕсли;
				
		ШаблонОшибки = "%1
						|Попробуйте авторизироватьсся в веб-версии
						|или обратитесь в техподдержку";
	
		ТекстОшибки = КонтурЛогистика_ИнтеграцияДиадокКлиентПовтИсп.ЯдроНаКлиенте().Общее_ПодставитьПараметрыВСтроку(ШаблонОшибки, ИдентификаторОшибки);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстОшибки);
		
	КонецЕсли;
	
	ОшибкаАвторизации = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Запись.Сертификат) И ИспользоватьСертификат Тогда 
		Сообщить("Укажите Сертификат");
		Отказ = Истина;
	ИначеЕсли Не ИспользоватьСертификат Тогда
		
		Если Не ЗначениеЗаполнено(Запись.Фамилия) Тогда
			Сообщить("Укажите Фамилия");
			Отказ = Истина;	
		КонецЕсли;		
		Если Не ЗначениеЗаполнено(Запись.Имя) Тогда
			Сообщить("Укажите Имя");
			Отказ = Истина;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Должность) Тогда
			Сообщить("Укажите Должность");
			Отказ = Истина;	
		КонецЕсли;
				
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ОбщийСпособПодтвержденияПолномочий) Тогда 
		Сообщить("Укажите способ подтверждения полномочий");
		Отказ = Истина;
	КонецЕсли;	
		
	Если Не ЗначениеЗаполнено(Запись.МЧД) Тогда
		Запись.ПротоколВалидации = "";
	КонецЕсли;
	
	Если ИспользоватьСертификат 
		И ЗначениеЗаполнено(Запись.Сертификат)
		И Не Запись.ИсключениеДляОтдельныхДокументов
		И Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.МЧД")
		И Не ЗначениеЗаполнено(Запись.МЧД) Тогда
		Сообщить("Укажите МЧД");
		Отказ = Истина;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы(Форма)
	
	Элементы.ГруппаНетСертификата.Видимость = Не ИспользоватьСертификат;
	Элементы.ГруппаСертификат.Видимость = ИспользоватьСертификат;
	
	Элементы.ГруппаМЧД.Видимость = ИспользоватьСертификат
		И Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.МЧД");	
	
	Элементы.ГруппаБумажнаяДоверенность.Видимость = Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.БумажнаяДоверенность");
	
	УправлениеПодсказкойПериода();
	
	ОтобразитьГруппуПроверкиМЧД();
	
	УправлениеОтображениемВалидацииМЧД();
			
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПодсказкойПериода()
	
	Если Запись.Период <> НачалоДня(Запись.Период) И Запись.Период > НачалоДня(ТекущаяДата()) Тогда
		Элементы.ПериодВремя.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
		Элементы.ПериодВремя.Подсказка = "Настройка начнет действовать с " + Формат(Запись.Период + 60 * 60 * 24, "ДФ='dd.MM.yyyy'");
	Иначе
		Элементы.ПериодВремя.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		Элементы.ПериодВремя.Подсказка = "Можно настроить настроить начало использования сертификатов в будущем";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСертификатПриИзменении(Элемент)
	
	ЗаполнитьЗначенияСвойств(Запись, КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОписаниеДанныхСертификата());
	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПодписантаПриИзменении(Элемент)
	
	Запись.МЧД = "";
	Запись.ПротоколВалидации = "";
	
	ВалидацияМЧД();
	УправлениеЭлементамиФормы(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАвторизацию(Команда)
	
	ПопытатьсяАвторизоваться();
	
КонецПроцедуры

&НаКлиенте
Процедура СпосПодтПолномПриИзменении(Элемент)
	ВалидацияМЧД();
	УправлениеЭлементамиФормы(ЭтаФорма)
КонецПроцедуры

&НаКлиенте
Процедура ПериодВремяПриИзменении(Элемент)
	
	УправлениеПодсказкойПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УправлениеПодсказкойПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийСпособПодтвержденияПолномочийПриИзменении(Элемент)
	
	ИзменениеСпособаПодтержденияПолномочий();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключениеДляОтдельныхДокументовПриИзменении(Элемент)
	
	ВалидацияМЧД();	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСпособаПодтержденияПолномочий()
	
	Запись.МЧД = "";
	Запись.ПротоколВалидации = "";
	
	ВалидацияМЧД();	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
КонецПроцедуры

#Область Сертификат

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	
	Организация = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Запись.Сертификат, "Организация");
	
	СертификатВыдан = ОпределитьТипВладельцаСертификата(Запись.Сертификат);
	Если СертификатВыдан = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо") Тогда
		Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.МЧД");
	Иначе		
		Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.БезДоверенности");
	КонецЕсли;
		
	Запись.СертификатНаСервере = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Запись.Сертификат, "СертификатНаСервере");
	
	ОчиститьРеквизитыПроверкиМЧД();
	
	ВалидацияМЧД();	
	УправлениеЭлементамиФормы(ЭтаФорма);
    	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьТипВладельцаСертификата(Сертификат)
	
	Возврат Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ТипВладельцаСертификата(Сертификат);
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьГруппуИспользоватьСертификат(Команда)
	
	Элементы.ГруппаИспользоватьСертификат.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьГруппуДопСведения(Команда)
	
	Элементы.ГруппаДопСведения.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВалидацияМЧД()

	ТекстВалидации = "";
	ОшибкиВалидации = "";
	Запись.СертификатБезМЧД = Ложь;
	
	Если ЗначениеЗаполнено(Запись.Сертификат)
		И ЗначениеЗаполнено(Запись.ОрганизацияДиадок)
		И Не ЗначениеЗаполнено(Запись.МЧД)
		И Не Запись.ИсключениеДляОтдельныхДокументов
		И Не Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.БумажнаяДоверенность") Тогда		
				
		ТекстВалидации = "Без МЧД подпись юридически не значима. Выберите МЧД";
		ОшибкиВалидации = "";
		
		СертификатВыдан = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ТипВладельцаСертификата(Запись.Сертификат);
		
		Если Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо И СертификатВыдан = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо Тогда
			
			ОшибкиВалидации = "Для организации с типом юридическое лицо выбран сертификат физического лица";
						
		ИначеЕсли Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо Тогда
			
			Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок.ИНН) И ЗначениеЗаполнено(Запись.Сертификат.ИННЮЛ) 
				И Запись.ОрганизацияДиадок.ИНН <> Запись.Сертификат.ИННЮЛ Тогда
				
				ОшибкиВалидации = "ИНН организации не совпадает с ИНН сертификата";				
				
			КонецЕсли;
			
		ИначеЕсли Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ИП Тогда
			
			Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок.ОГРН) И ЗначениеЗаполнено(Запись.Сертификат.ОГРНИП) 
				И Запись.ОрганизацияДиадок.ОГРН <> Запись.Сертификат.ОГРНИП Тогда
				
				ОшибкиВалидации = "ОГРНИП организации не совпадает с ОГРНИП сертификата";
				
			ИначеЕсли ЗначениеЗаполнено(Запись.ОрганизацияДиадок.СНИЛС) И ЗначениеЗаполнено(Запись.Сертификат.СНИЛС) 
				И Не СНИЛССовпадает(Запись.ОрганизацияДиадок.СНИЛС, Запись.Сертификат.СНИЛС) Тогда
				
				ОшибкиВалидации = "СНИЛС организации не совпадает с СНИЛС сертификата";
				
			ИначеЕсли Запись.ОрганизацияДиадок.Фамилия <> Запись.Сертификат.Фамилия 
				И Запись.ОрганизацияДиадок.Имя <> Запись.Сертификат.Фамилия
				И Запись.ОрганизацияДиадок.Отчество <> Запись.Сертификат.Фамилия Тогда
				
				ОшибкиВалидации = "ФИО физического лица не совпадает с ФИО сертификата";
				
			КонецЕсли;
		
		ИначеЕсли Запись.ОрганизацияДиадок.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо Тогда
			
			Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок.СНИЛС) И ЗначениеЗаполнено(Запись.Сертификат.СНИЛС) 
				И Не СНИЛССовпадает(Запись.ОрганизацияДиадок.СНИЛС, Запись.Сертификат.СНИЛС) Тогда
				
				ОшибкиВалидации = "СНИЛС организации не совпадает с СНИЛС сертификата";
				
			ИначеЕсли Запись.ОрганизацияДиадок.Фамилия <> Запись.Сертификат.Фамилия 
				И Запись.ОрганизацияДиадок.Имя <> Запись.Сертификат.Фамилия
				И Запись.ОрганизацияДиадок.Отчество <> Запись.Сертификат.Фамилия Тогда
				
				ОшибкиВалидации = "ФИО физического лица не совпадает с ФИО сертификата";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОшибкиВалидации) Тогда
		Запись.СертификатБезМЧД = Истина;
	КонецЕсли;
					
КонецПроцедуры

&НаСервере
Функция СНИЛССовпадает(СНИЛС1, СНИЛС2)
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СтрокаИзЧисел(СНИЛС1)
		= КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СтрокаИзЧисел(СНИЛС2);
	
КонецФункции

&НаКлиенте
Процедура УправлениеОтображениемВалидацииМЧД()
	
	Элементы.ГруппаВалидацияМЧД.Видимость = ЗначениеЗаполнено(ОшибкиВалидации); 
	Элементы.ПоказатьОшибкиВалидации.Видимость = ЗначениеЗаполнено(ОшибкиВалидации);
	
	Элементы.ТекстВалидация.Заголовок = ТекстВалидации;
					
КонецПроцедуры

#Область ПроверкаСертификата

&НаКлиенте
Процедура ЗаполнитьСписокТиповМодуляКриптографииДляВыбора()
	
	ТипыМодуляКриптографииДляВыбора = Новый Массив;
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		Элементы.ТипПрограммыЭП.СписокВыбора.Добавить(ТипМодуля.ИмяМодуляКриптографии, );	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипПрограммыЭППриОткрытии()
	
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		
		Если ТипМодуля.ТипМодуляКриптографии = Запись.ТипМодуляКриптографии 
			И ТипМодуля.ИмяМодуляКриптографии = Запись.ИмяМодуляКриптографии Тогда
			
			ТипПрограммыЭП = ТипМодуля.ИмяМодуляКриптографии;			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрограммыЭПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		
		Если ТипМодуля.ИмяМодуляКриптографии = ВыбранноеЗначение Тогда
			
			Запись.ТипМодуляКриптографии = ТипМодуля.ТипМодуляКриптографии;
			Запись.ИмяМодуляКриптографии = ТипМодуля.ИмяМодуляКриптографии;
			
			Элементы.ПредупреждениеГруппа.Видимость = Истина;
			Элементы.Предупреждение.Заголовок = "После выбора сертификата рекомендуется выполнить проверку сертификата";
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипПрограммыЭППоУмолчанию()
	
	Если Запись.ТипМодуляКриптографии = 0 И ПустаяСтрока(Запись.ИмяМодуляКриптографии) Тогда
		
		ТипПрограммыЭППоУмолчанию = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии()[0];
		ТипПрограммыЭП = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
		Запись.ТипМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ТипМодуляКриптографии;
		Запись.ИмяМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСертификат(Команда)
	
	Если ПустаяСтрока(ТипПрограммыЭП) Тогда
		Сообщить("Тип программы ЭП не выбран!");
		Возврат;
	КонецЕсли;
	
	Если Запись.СертификатНаСервере Тогда
		
		Попытка
			
			ПроверитьСертификатНаСервере();
			
			Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
			ПоказатьПредупреждение(Оповещение, "Проверка пройдена успешно!");
			
			ПроверкаПройдена = Истина;
			ТекстПредупреждения = "Проверка пройдена";
			
			УправлениеЭлементамиФормы(ЭтаФорма);
			
		Исключение
			
			Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);	
			ВывестиОшибку(Оповещение, ИнформацияОбОшибке());
			
		КонецПопытки
		
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", ЭтаФорма);	
		НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&Насервере
Процедура ПроверитьСертификатНаСервере()
		
	МенеджерКриптографии = КонтурЛогистика_КриптографияСервер.ИнициализироватьМенеджерКриптографии(, Запись.ТипМодуляКриптографии);
			
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = КаталогВременныхФайлов() + "\" + ИмяФайла;
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяПромежуточногоФайла);
				
	КонтурЛогистика_КриптографияСервер.ПодписатьДанные(ДвоичныеДанные, 
															Запись.ОтпечатокСертификата, 
															Запись.ПЗК, 
															Запись.ТипМодуляКриптографии);		
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСФайламиПодключено", ЭтаФорма);	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипМодуля", Запись.ТипМодуляКриптографии);
	ДополнительныеПараметры.Вставить("ИмяМодуля", Запись.ИмяМодуляКриптографии);
	
	Оповещение = Новый ОписаниеОповещения("НачатьИнициализациюМенеджераКриптографииЗавершение", ЭтаФорма, ДополнительныеПараметры,
											"НачатьИнициализациюМенеджераКриптографииОшибка", ЭтаФорма);	
	КонтурЛогистика_КриптографияКлиент.НачатьИнициализациюМенеджераКриптографии(Оповещение, 
																				Запись.ТипМодуляКриптографии, 
																				Запись.ИмяМодуляКриптографии, 
																				Запись.ВводитьПарольВПрограммеЭлектроннойПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографииЗавершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	
	ПолучениеКаталогаВременныхФайлов(ДополнительныеПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографииОшибка(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	ВывестиОшибку(Оповещение, ИнформацияОбОшибке);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеЗавершение(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеКаталогаВременныхФайлов(ДополнительныеПараметры)      
	
	Оповещение = Новый ОписаниеОповещения("НачатьПолучениеКаталогаВременныхФайловЗавершение", ЭтаФорма, ДополнительныеПараметры);	
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеКаталогаВременныхФайловЗавершение(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = ИмяКаталогаВременныхФайлов + "\" + ИмяФайла;
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	ДополнительныеПараметры.Вставить("ИмяПромежуточногоФайла", ИмяПромежуточногоФайла);
	
	Оповещение = Новый ОписаниеОповещения("НачатьСозданиеДвоичныхДанныхИзФайлаЗавершение", ЭтаФорма, ДополнительныеПараметры);	
	НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ИмяПромежуточногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	ТипМодуля =  ДополнительныеПараметры.ТипМодуля;
	ИмяМодуля =  ДополнительныеПараметры.ИмяМодуля;
	
	Оповещение = Новый ОписаниеОповещения("ПроверкаПодписиЗавершение", ЭтаФорма, ДополнительныеПараметры, "ПроверкаПодписиЗавершениеОшибка", ЭтаФорма);
	КонтурЛогистика_КриптографияКлиент.ПодписатьАсинхронно(Оповещение, ДвоичныеДанные, Запись.ОтпечатокСертификата, 
															ТипМодуля, ИмяМодуля, Запись.ПЗК,
															Запись.ВводитьПарольВПрограммеЭлектроннойПодписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиЗавершение(ДанныеПодписи, ДополнительныеПараметры) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	ПоказатьПредупреждение(Оповещение, "Проверка пройдена успешно!");
	Элементы.ПредупреждениеГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиЗавершениеОшибка(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	
	ВывестиОшибку(Оповещение, ИнформацияОбОшибке);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОшибку(Оповещение, ИнформацияОбОшибке)
	
	ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПоказатьПредупреждение(Оповещение, ТекстОшибки);

КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеФайловЗавершение(ДополнительныеПараметры) Экспорт	

КонецПроцедуры

&НаКлиенте
Процедура ВводитьПарольВПрограммеЭлектроннойПодписиПриИзменении(Элемент)
	
	УсловноеОформлениеПредставленияПЗК(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область МЧД

&НаСервере
Процедура ПроверитьМЧДНаСервере()
	
	PowerOfAttorneyPrevalidateResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(Запись.ОрганизацияДиадок.ID, Запись.МЧД, Запись.Сертификат);
		
	ЗаписатьПротоколВалидации(PowerOfAttorneyPrevalidateResult);
	
	Если PowerOfAttorneyPrevalidateResult.Свойство("Статус404") Или ЕстьОшибкаВОтвете(PowerOfAttorneyPrevalidateResult, "PowerOfAttorneyNotFound", "PoaNotFound") Тогда
		
		Если ЗначениеЗаполнено(Запись.taskIdRegisterPOA) Тогда
			
			PowerOfAttorneyRegisterResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_RegisterPowerOfAttorneyResult(Запись.ОрганизацияДиадок.ID, Запись.taskIdRegisterPOA);
			
			Если PowerOfAttorneyRegisterResult.OperationStatus = "Done" Тогда
				
				ОшибкаРегистрации = Ложь;
				
				PowerOfAttorneyPrevalidateResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(Запись.ОрганизацияДиадок.ID, Запись.МЧД, Запись.Сертификат);
				Если PowerOfAttorneyPrevalidateResult.Свойство("PrevalidateStatus") Тогда
					ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
				КонецЕсли;
				
			Иначе
				
				ОшибкаРегистрации = Истина;
				ЗаполнитьОшибкиРегистрацииМЧД(PowerOfAttorneyRegisterResult);
				
			КонецЕсли;
			
		Иначе
		
			AsyncMethodResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_RegisterPowerOfAttorney(Запись.ОрганизацияДиадок, Запись.МЧД);
			
			Если AsyncMethodResult.Свойство("taskId") Тогда
				
				Запись.taskIdRegisterPOA = AsyncMethodResult.taskId;				
				Записать();
				
				PowerOfAttorneyRegisterResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_RegisterPowerOfAttorneyResult(Запись.ОрганизацияДиадок.ID, AsyncMethodResult.taskId);
				
				Если PowerOfAttorneyRegisterResult.OperationStatus = "Done" Тогда
					
					ОшибкаРегистрации = Ложь;
					
					PowerOfAttorneyPrevalidateResult = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(Запись.ОрганизацияДиадок.ID, Запись.МЧД, Запись.Сертификат);
					Если PowerOfAttorneyPrevalidateResult.Свойство("PrevalidateStatus") Тогда
						ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
					КонецЕсли;
					
				Иначе
					
					ОшибкаРегистрации = Истина;
					ЗаполнитьОшибкиРегистрацииМЧД(PowerOfAttorneyRegisterResult);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли PowerOfAttorneyPrevalidateResult.Свойство("PrevalidateStatus") Тогда
		
		ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПротоколВалидации(Ответ)
	
	Попытка
	    
		Если Ответ.Свойство("PrevalidateStatus")
			И Ответ.PrevalidateStatus.Свойство("ValidationProtocol")
			И Ответ.PrevalidateStatus.ValidationProtocol.Свойство("CheckResults") Тогда	    		
			Запись.ПротоколВалидации = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПротоколВалидацииВСтроку(Ответ.PrevalidateStatus.ValidationProtocol.CheckResults);		
		Иначе		
			Запись.ПротоколВалидации = "";		
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Ошибка чтения протокола валидации. " + ИнформацияОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЕстьОшибкаВОтвете(Ответ, КодОшибки, КодОшибки2 = "")
	
	Если Ответ.Свойство("PrevalidateStatus") Тогда
	
		Если Ответ.PrevalidateStatus.Свойство("ValidationProtocol") Тогда   
			
			Ошибки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МассивОшибкиИзПротоколаВалидации(Ответ.PrevalidateStatus.ValidationProtocol);
			
			Для каждого Error Из Ошибки Цикл
				
				Если ЕстьОшибкаВСтруктуре(Error, КодОшибки, КодОшибки2) Тогда
					Возврат Истина;
				КонецЕсли;
				
			КонецЦикла;
					
		ИначеЕсли Ответ.PrevalidateStatus.Свойство("OperationError") Тогда
			
			OperationError = Ответ.PrevalidateStatus.OperationError;
			
			Если ЕстьОшибкаВСтруктуре(OperationError, КодОшибки, КодОшибки2) Тогда
				Возврат Истина;
			КонецЕсли;
			 					
		ИначеЕсли Ответ.PrevalidateStatus.Свойство("Errors") Тогда
			
			Для каждого Error Из Ответ.PrevalidateStatus.Errors Цикл
				
				Если ЕстьОшибкаВСтруктуре(Error, КодОшибки, КодОшибки2) Тогда
					Возврат Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЕстьОшибкаВСтруктуре(СтруктураОшибки, КодОшибки, КодОшибки2 = "")
	
	Если СтруктураОшибки.Свойство("Code") И СтруктураОшибки.Code = КодОшибки Тогда
		Возврат Истина;
	ИначеЕсли СтруктураОшибки.Свойство("Text") И ЗначениеЗаполнено(КодОшибки2) И Найти(СтруктураОшибки.Text, КодОшибки2) > 0 Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОшибкиРегистрацииМЧД(PowerOfAttorneyRegisterResult)
	
	Запись.ТекстСтатусаПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ОписаниеСтатусаВыполненияРегистрации(PowerOfAttorneyRegisterResult.OperationStatus);
	
	Если ЗначениеЗаполнено(Запись.taskIdRegisterPOA) Тогда
		Запись.ТекстСтатусаПроверки = Запись.ТекстСтатусаПроверки + ". Идентификатор регистрации taskId: " + Запись.taskIdRegisterPOA;	
	КонецЕсли;
	
	Запись.СтатусПроверки = "IsNotValid";
	
	Если PowerOfAttorneyRegisterResult.Свойство("Errors") Тогда 
		Запись.ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МассивОшибокВСтроку(PowerOfAttorneyRegisterResult.Errors);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветПроверкиМЧД(PowerOfAttorneyPrevalidateResult)
	
	Если PowerOfAttorneyPrevalidateResult.PrevalidateStatus.Свойство("StatusText") Тогда
		Запись.ТекстСтатусаПроверки = PowerOfAttorneyPrevalidateResult.PrevalidateStatus.StatusText;	
	КонецЕсли;
	Если PowerOfAttorneyPrevalidateResult.PrevalidateStatus.Свойство("StatusNamedId") Тогда
		Запись.СтатусПроверки = PowerOfAttorneyPrevalidateResult.PrevalidateStatus.StatusNamedId;			
	КонецЕсли;
	
	Запись.ДатаПроверки = ТекущаяДатаСеанса();
	
	Запись.ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ОшибкиПроверкиМЧД(PowerOfAttorneyPrevalidateResult);
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМЧД(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.Сертификат) Тогда
		Сообщить("Сертификат не выбран!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.МЧД) Тогда
		Сообщить("МЧД не выбрана!");
		Возврат;
	КонецЕсли;
	
	
	Если АвторизацияПоOIDC И Не АвторизацияВыполнена Тогда
		// Перед проверкой нужно авторизоваться.
		Оповещение = Новый ОписаниеОповещения("ПослеАутентификации", ЭтаФорма);
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыполнитьАвторизациюНаПортале(
			ЭтаФорма, Запись.ОрганизацияДиадок, Оповещение);
			
	Иначе
			
		ВыполнитьПроверкуМЧД();		
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуМЧД()
	
	Попытка
		ПроверитьМЧДНаСервере();
	Исключение
		ИдентификаторДоверенности = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Запись.МЧД, "ИдентификаторДоверенности");
		ДопИнформация = Новый Структура;
		Если ЗначениеЗаполнено(ИдентификаторДоверенности) Тогда
			ДопИнформация.Вставить("IdМЧД", ИдентификаторДоверенности);
		КонецЕсли;
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ПроверитьМЧДНаСервере",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Запись.МЧД, ДопИнформация);
	КонецПопытки;
	
	ОтобразитьГруппуПроверкиМЧД();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьГруппуПроверкиМЧД()

	Если Запись.ОбщийСпособПодтвержденияПолномочий = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.МЧД") Тогда		
				
		Элементы.ГруппаПроверкаМЧД.Видимость = Не Запись.МЧД.Пустая();
		
		КолвоДнейПроверкиМЧД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КоличествоДнейДляПредупрежденияПроверкиМЧД();
		МЧДВалидна = КонтурЛогистика_МашиночитаемыеДовернностиСервер.МЧДВалидна(Запись.СтатусПроверки);
		Если ЗначениеЗаполнено(Запись.МЧД) И МЧДВалидна И РазницаВДнях() > КолвоДнейПроверкиМЧД Тогда
			ОписаниеСтатусаПроверки = "Проверка МЧД не выполнялась более "
													+ Строка(КолвоДнейПроверкиМЧД) + " дней"
													+ Формат(Запись.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ПроверитьМЧД.Заголовок = "Перепроверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(249, 237, 167);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(249, 237, 167);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(249, 237, 167);			
		ИначеЕсли Не ЗначениеЗаполнено(Запись.СтатусПроверки) Тогда
			ОписаниеСтатусаПроверки = "Проверка не выполнялась";
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ПроверитьМЧД.Заголовок = "Проверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(249, 237, 167);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(249, 237, 167);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(249, 237, 167);			
		ИначеЕсли МЧДВалидна Тогда
			ОписаниеСтатусаПроверки = СокрЛП(Запись.ТекстСтатусаПроверки) + Формат(Запись.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Истина;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Ложь;
			Элементы.ПроверитьМЧД.Заголовок = "Перепроверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(173, 223, 173);  // было 144, 238, 144
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(173, 223, 173);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(173, 223, 173);			
		Иначе
			ОписаниеСтатусаПроверки = СокрЛП(Запись.ТекстСтатусаПроверки) + Формат(Запись.ДатаПроверки, "ДФ=' (на дд.ММ.гггг ЧЧ:мм:сс)'");
			Элементы.КартинкаПроверкаМЧДУспешно.Видимость = Ложь;
			Элементы.КартинкаПроверкаМЧДНеУспешно.Видимость = Истина;
			Элементы.ПроверитьМЧД.Заголовок = "Перепроверить";
			Элементы.ГруппаПроверкаМЧД.ЦветФона = Новый Цвет(249, 237, 167);
			Элементы.ОписаниеСтатусаПроверки.ЦветРамки = Новый Цвет(249, 237, 167);
			Элементы.ОписаниеСтатусаПроверки.ЦветФона = Новый Цвет(249, 237, 167);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.ОшибкиПроверки) Тогда
			Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Истина;
			ОшибкиПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПредставлениеОшибокПроверкиМЧД(Запись.ОшибкиПроверки);
			Элементы.РешениеОшибки.Видимость = ОшибкаРегистрации;
		Иначе
			Элементы.ГруппаОшибкиПроверкиМЧД.Видимость = Ложь;
			Элементы.ОписаниеСтатусаПроверки.МногострочныйРежим = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаПроверкаМЧД.Видимость = Ложь;
				
	КонецЕсли;
	
	 Элементы.ФормаОткрытьПротоколВалидации.Видимость = ЗначениеЗаполнено(Запись.ПротоколВалидации) И Не Запись.МЧД.Пустая();
	 
КонецПроцедуры

&НаСервере
Функция РазницаВДнях()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазницаВДнях(ТекущаяДатаСеанса(), Запись.ДатаПроверки);
	
КонецФункции

&НаКлиенте
Процедура МЧД1ПриИзменении(Элемент)
	
	ОчиститьРеквизитыПроверкиМЧД();
	
	ОтобразитьГруппуПроверкиМЧД();
	
	ВалидацияМЧД();
	УправлениеОтображениемВалидацииМЧД();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыПроверкиМЧД()

	Запись.ДатаПроверки = "";
	Запись.СтатусПроверки = "";
	Запись.ТекстСтатусаПроверки = "";
	Запись.ОшибкиПроверки = "";	

КонецПроцедуры

&НаКлиенте
Процедура МЧД1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Запись.ОрганизацияДиадок) Тогда
		Сообщить("Не выбрана Организация (Диадок)");
		Возврат;
	КонецЕсли;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	СписокОрганизацийДД = СписокОрганизацийДляОтбора(Запись.ОрганизацияДиадок);
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсходныйДоверитель");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ОтборСписка.ПравоеЗначение = СписокОрганизацийДД;
    ОтборСписка.Использование = Истина;
	
    ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    ОтборСписка.ПравоеЗначение = ТекущаяДата();
    ОтборСписка.Использование = Истина;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборСписка.ПравоеЗначение = Ложь;
    ОтборСписка.Использование = Истина;
	
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наша");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборСписка.ПравоеЗначение = Истина;
    ОтборСписка.Использование = Истина;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);

	ОткрытьФорму("Справочник.КонтурЛогистика_МЧД.ФормаВыбора", ПараметрыВыбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СписокОрганизацийДляОтбора(ОрганизацияДиадок)
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.СписокОрганизацийПоИНН(ОрганизацияДиадок.ИНН);	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтурЛогистика_МЧД") Тогда
	
		Запись.МЧД = ВыбранноеЗначение;
		
		ОчиститьРеквизитыПроверкиМЧД(); 	
		ОтобразитьГруппуПроверкиМЧД();
		ВалидацияМЧД();
		УправлениеОтображениемВалидацииМЧД();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтурЛогистика_СертификатыЭлектроннойПодписи") Тогда
		
		Запись.Сертификат = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияДиадокПриИзменении(Элемент)
	
	Запись.МЧД = "";
	Запись.ПротоколВалидации = "";
	
	ОчиститьРеквизитыПроверкиМЧД();	
	ОтобразитьГруппуПроверкиМЧД();
	
	ВалидацияМЧД();	
	УправлениеЭлементамиФормы(ЭтаФорма);
	
	ПроверитьАвторизациюПоOIDC();
	
КонецПроцедуры

&НаКлиенте
Процедура СпосПодтПолном1ПриИзменении(Элемент)
	УправлениеЭлементамиФормы(ЭтаФорма)
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкиВалидации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", ОшибкиВалидации);
			
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_ФормаТекстовогоСообщения",
		ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПротоколВалидации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОрганизацияДиадок", Запись.ОрганизацияДиадок);
	ПараметрыФормы.Вставить("Сертификат", Запись.Сертификат);
	ПараметрыФормы.Вставить("МЧД", Запись.МЧД);
	ПараметрыФормы.Вставить("ПротоколВалидации", Запись.ПротоколВалидации);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаПротоколаВалидации", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область АвторизацияПоOIDC

&НаКлиенте
Процедура ПроверитьАвторизациюПоOIDC()

	АвторизацияВыполнена = Ложь;
	Если ЗначениеЗаполнено(Запись.ОрганизацияДиадок) И АвторизацияПоOIDC Тогда
		ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииПоОрганизации(Запись.ОрганизацияДиадок);
		Если ЗначениеЗаполнено(ДанныеАутентификации.ТокенДоступа) Тогда	
			АвторизацияВыполнена = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьАвторизациюПоOIDC();
	
	Если АвторизацияВыполнена Тогда
		ВыполнитьПроверкуМЧД();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
