
&НаСервере
Процедура КомандаЗаполнитьНаСервере()

	СтартовыйНабор = Новый Массив;
	СтартовыйНабор.Добавить("при наличии в оборудовании механических повреждений;");
	СтартовыйНабор.Добавить("при использовании оборудования в целях, не предусмотренных инструкцией;");
	СтартовыйНабор.Добавить("при повреждениях, возникших из-за несоблюдения правил монтажа, установки, настройки и эксплуатации оборудования;");
	СтартовыйНабор.Добавить("при нарушении правил проведения, или не проведении профилактических работ, предусмотренных инструкциями;");
	СтартовыйНабор.Добавить("при повреждениях, вызванных умышленными или ошибочными действиями потребителя, небрежным обращением с оборудованием;");
	СтартовыйНабор.Добавить("при повреждениях, вызванных обстоятельствами непреодолимой силы (стихия, пожар, молния, и т.п.);");
	СтартовыйНабор.Добавить("при повреждениях, вызванных попаданием внутрь оборудования посторонних предметов, жидкостей, насекомых, грызунов;");
	СтартовыйНабор.Добавить("при повреждениях, вызванных доработкой оборудования, внесением в него конструктивных изменений или проведением самостоятельного ремонта;");
	СтартовыйНабор.Добавить("при повреждениях оборудования вследствие неправильной транспортировки и хранения;");
	СтартовыйНабор.Добавить("при повреждениях, вызванных использованием нестандартных (неоригинальных) расходных материалов и комплектующих частей;");
	СтартовыйНабор.Добавить("при повреждениях, вызванных превышением допустимых значений питающего напряжения на входах оборудования, или  использованием источников питания, не удовлетворяющим требованиям, которые описаны в инструкции по эксплуатации оборудования;");
	СтартовыйНабор.Добавить("при повреждениях, возникших из-за использования нелицензионного программного обеспечения, а также программ вирусов;");
	СтартовыйНабор.Добавить("на оборудовании нарушена или отсутствует гарантийная метка Производителя\Импортера предусмотренная Производителем\Импортером.");
	
	НаборЗаписей = РегистрыСведений.ПечатьАктРекламацииГарантОбязательстваНеДействуют.СоздатьНаборЗаписей();
	Сч = 1;
	Для Каждого Стр Из СтартовыйНабор Цикл
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Порядок = Сч;
		НовЗапись.Содержание = Стр;
		Сч = Сч + 1;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры
