
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	УправлениеДоступностьюЭлементовРетроБонусы();
КонецПроцедуры

&НаКлиенте
Процедура ОД_РетроБонусПриИзмененииПосле(Элемент)
	УправлениеДоступностьюЭлементовРетроБонусы();
КонецПроцедуры

&НаКлиенте
Процедура ОД_РетроБонусСоглашенияСоглашениеНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Ссылка;
	ПараметрыВыбораСоглашения.ДатаДокумента               = ТекущаяДата();
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура УправлениеДоступностьюЭлементовРетроБонусы()

	Если Объект.РетроБонус Тогда
		Элементы.ГруппаРетроБонусы.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	Иначе	
		Элементы.ГруппаРетроБонусы.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

