
&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

		Партнер					= ДанныеЗаполнения.ПеревозчикПартнер;
		Контрагент				= КонтрагентПартнера(Партнер);
		ЦенаВключаетНДС			= Истина;
		ЗакупкаПодДеятельность	= НалогообложениеНДС;
		
		ЗаполнитьТабличнуюЧасть_ПоЗаказуКлиента(ДанныеЗаполнения.Товары, ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда

		Д = РеквизитыДляЗаполнения();
		
		Организация				= Д.Организация;
		Партнер					= ДанныеЗаполнения.Перевозчик;
		Контрагент				= КонтрагентПартнера(Партнер);
		ЦенаВключаетНДС			= Истина;
		ЗакупкаПодДеятельность	= НалогообложениеНДС;

		ЗаполнитьТабличнуюЧасть_ПоЗаданиюНаПеревозку(ДанныеЗаполнения.Распоряжения);

	КонецЕсли;	
	
КонецПроцедуры

Функция РеквизитыДляЗаполнения()
	
	Рез = Новый Структура();
	Рез.Вставить("Организация",		Справочники.Организации.НайтиПоРеквизиту("ИНН", "7706469887"));
	Рез.Вставить("Содержание",		"Доставка товара");
	Рез.Вставить("Подразделение",	Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина));
	Рез.Вставить("СтатьяРасходов",	ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Транспортировка при продаже товара", Истина));

	Если Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти("НДС22") <> Неопределено Тогда
		Рез.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.НДС22);
	Иначе
		Рез.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.НДС20);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция КонтрагентПартнера(п_Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции // ()

Процедура ЗаполнитьТабличнуюЧасть_ПоЗаказуКлиента(п_Товары, п_ДокументОснования)
	
	Д = РеквизитыДляЗаполнения();
	
	НоваяСтрока = Расходы.Добавить();
	НоваяСтрока.Содержание			= Д.Содержание;
	НоваяСтрока.Количество			= 1;
	НоваяСтрока.Подразделение		= Д.Подразделение;
	НоваяСтрока.СтатьяРасходов		= Д.СтатьяРасходов;
	НоваяСтрока.АналитикаРасходов	= п_ДокументОснования;
	НоваяСтрока.СтавкаНДС			= Д.СтавкаНДС;

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть_ПоЗаданиюНаПеревозку(п_ТабличнаяЧасть)
	
	Д = РеквизитыДляЗаполнения();
	
	Для каждого Т Из п_ТабличнаяЧасть Цикл
	
		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.Содержание			= Д.Содержание;
		НоваяСтрока.Количество			= 1;
		НоваяСтрока.Подразделение		= Д.Подразделение;
		НоваяСтрока.СтатьяРасходов		= Д.СтатьяРасходов;
		НоваяСтрока.АналитикаРасходов	= Т.Распоряжение;
		НоваяСтрока.СтавкаНДС			= Д.СтавкаНДС;
	
	КонецЦикла;

КонецПроцедуры

