#Область ОбработчикиСобытийЭлементовФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДатаДок) Тогда 
		ОтборДатаДок = Параметры.ДатаДок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НомДок) Тогда 
		ОтборНомДок = Параметры.НомДок;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборПЭ_Грузов") И ЗначениеЗаполнено(Параметры.ОтборПЭ_Грузов) Тогда 
		ОтборТитул1 = Параметры.ОтборПЭ_Грузов.Титул1;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗапретИзменятьОтбор") И ЗначениеЗаполнено(Параметры.ЗапретИзменятьОтбор) Тогда 
		Элементы.ГруппаОтборы.ТолькоПросмотр = Параметры.ЗапретИзменятьОтбор;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		Элементы.Список.МножественныйВыбор = ЗначениеЗаполнено(Параметры.МножественныйВыбор) И Параметры.МножественныйВыбор;
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыСозданияМаршрута") Тогда 
		 ПараметрыСозданияДокумента = Параметры.ПараметрыСозданияМаршрута;
	КонецЕсли;
	
	Параметры.Свойство("ЭтоШаблонТитула", ЭтоШаблонТитула);
	Параметры.Свойство("ЗаполненностьКакПредупреждение", ЗаполненностьКакПредупреждение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборДинСписка();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборНомДокПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаДокПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТитул1ПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	ПараметрыФормы = Новый Структура;
	
	Если НЕ ПараметрыСозданияДокумента = Неопределено Тогда  
		ПараметрыФормы.Вставить("ПараметрыСозданияМаршрута", ПараметрыСозданияДокумента);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ЭтоШаблонТитула", ЭтоШаблонТитула);
	ПараметрыФормы.Вставить("ЗаполненностьКакПредупреждение", ЗаполненностьКакПредупреждение);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Форма.ФормаДокумента",
															 ПараметрыФормы, ЭтаФорма, ЭтаФорма);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ОтборДатаДок) Тогда 
		УстановитьЭлементОтбора(НачалоДня(ОтборДатаДок), "ДатаДок", ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОтборНомДок) Тогда 
		УстановитьЭлементОтбора(ОтборНомДок, "НомДок", ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборТитул1) Тогда 
		УстановитьЭлементОтбора(ОтборТитул1, "Титул1", ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементОтбора(ПараметрОтбора, НазваниеПоляКомпоновкиДанных, ВидСравнения)

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НазваниеПоляКомпоновкиДанных);
	ЭлементОтбора.ВидСравнения = ВидСравнения;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ПараметрОтбора;

КонецПроцедуры

#КонецОбласти	