
Функция ПолучитьКонтактыИзАдреса(п_АдресДоставки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС.КонтактноеЛицо КАК КонтактноеЛицо,
		|	РС.ВремяДоставкиС КАК ВремяДоставкиС,
		|	РС.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	РС.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
		|	РС.Телефон КАК Телефон,
		|	РС.НеАктуален КАК НеАктуален,
		|	РС.ЗонаДоставки КАК ЗонаДоставки
		|ИЗ
		|	РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС
		|ГДЕ
		|	РС.АдресДоставки = &АдресДоставки";
	
	Запрос.УстановитьПараметр("АдресДоставки", СокрЛП(п_АдресДоставки));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура();

	Рез.Вставить("КонтактноеЛицо", "");
	Рез.Вставить("ВремяДоставкиС", "");
	Рез.Вставить("ВремяДоставкиПо", "");
	Рез.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	Рез.Вставить("Телефон", "");
	Рез.Вставить("НеАктуален", "");
	Рез.Вставить("ЗонаДоставки", "");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);		
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ()

Процедура ЗаписатьКонтактыВАдрес(п_ДопИнфо) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	МЗ = РегистрыСведений.ДополнительнаяИнформацияПоДоставке.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, п_ДопИнфо);
	МЗ.Записать();

КонецПроцедуры

Функция ПолучитьДополнительныеУслугиДоставки(п_ЗаказКлиента) Экспорт

	М = Новый Массив;
	
	Если п_ЗаказКлиента.ДоставкаОбрешетка Тогда
		М.Добавить("Обрешетка");
	КонецЕсли;

	Если п_ЗаказКлиента.ДоставкаСтраховка Тогда
		М.Добавить("Страховка");
	КонецЕсли;

	Если п_ЗаказКлиента.ДоставкаПаллетныйБорт Тогда
		М.Добавить("Паллетный борт");
	КонецЕсли;
	
	Рез = СтрСоединить(М, ", ");
	
	Возврат Рез;

КонецФункции // ПолучитьДополнительныеУслугиДоставки()

 Функция ПолучитьЗаказКлиента(п_ЗаявкаНаВозврат)
	 
	 УстановитьПривилегированныйРежим(Истина);
	 
	 РТиУ = п_ЗаявкаНаВозврат.ДокументРеализации;
	 Если Не ЗначениеЗаполнено(РТиУ) Тогда
	 	Возврат Неопределено;
	 КонецЕсли;
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РТиУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	КонецЕсли;

	Возврат Неопределено;
 
 КонецФункции // ()
 
Процедура ЗаписьВРегистреСостоянияИРеквизитыДоставки(п_Распоряжение) Экспорт
	
		НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
		НЗ.Отбор.Распоряжение.Установить(п_Распоряжение);
		НЗ.Отбор.СпособДоставки.Установить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
		НЗ.Записать();
		НЗ.Отбор.СпособДоставки.Установить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада);
		НЗ.Записать();

		МЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьМенеджерЗаписи();
		МЗ.Распоряжение 			= п_Распоряжение;
		МЗ.Склад					= п_Распоряжение.Склад;
		МЗ.СпособДоставки   		= Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
		
		Если ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Партнер = "";
			Если п_Распоряжение.Товары.Количество() > 0 Тогда
				АналитикаРасходов = п_Распоряжение.Товары[0].АналитикаРасходов;
				Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.Партнеры") Тогда
					МЗ.ПолучательОтправитель = АналитикаРасходов;
				КонецЕсли;
			КонецЕсли;
			МЗ.Дата = п_Распоряжение.ДатаОтгрузки;
			МЗ.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
			МЗ.Адрес = п_Распоряжение.АдресДоставки;
		ИначеЕсли ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			МЗ.ПолучательОтправитель = п_Распоряжение.Партнер;
			МЗ.Дата = п_Распоряжение.ДатаОтгрузки;
		Иначе
			МЗ.ПолучательОтправитель = п_Распоряжение.Партнер;
			МЗ.Дата = п_Распоряжение.ДатаПоступления;
		КонецЕсли;
		
		МЗ.Состояние			= Перечисления.СостоянияДоставки.ТребуетсяДоставка;
		МЗ.ДоставитьПолностью   = Истина;
		МЗ.Номер				= п_Распоряжение.Номер;

		Если ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			ЗаказКлиента = ПолучитьЗаказКлиента(п_Распоряжение);
			
			Если ЗначениеЗаполнено(ЗаказКлиента) Тогда

				МЗ.Зона = ЗаказКлиента.ЗонаДоставки;

				ТекАдрес = "";
				Если ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
					ТекАдрес = ЗаказКлиента.АдресДоставкиПеревозчика;
				Иначе
					ТекАдрес = ЗаказКлиента.АдресДоставки;
				КонецЕсли;

				Если ЗначениеЗаполнено(ТекАдрес) Тогда
					МЗ.Адрес = ТекАдрес;
				
					КонтактыИзАдреса = ОД_Логистика.ПолучитьКонтактыИзАдреса(ТекАдрес);
					
					МЗ.ВремяС					= КонтактыИзАдреса.ВремяДоставкиС;
					МЗ.ВремяПо					= КонтактыИзАдреса.ВремяДоставкиПо;
					МЗ.ДополнительнаяИнформация	= КонтактыИзАдреса.ДополнительнаяИнформацияПоДоставке;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МЗ.Записать();

КонецПроцедуры

Функция ФактАдресаКонтрагента(п_Контрагент) Экспорт
	
	СписокВыбора = Новый СписокЗначений;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтрагентыКонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС_ДополнительнаяИнформация
		|		ПО КонтрагентыКонтактнаяИнформация.Представление = РС_ДополнительнаяИнформация.АдресДоставки
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
		|	И НЕ ЕСТЬNULL(РС_ДополнительнаяИнформация.НеАктуален, ЛОЖЬ)";
	
    КИ_Родитель = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Контрагенты""", Истина);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Фактический адрес", Истина, КИ_Родитель));
	Запрос.УстановитьПараметр("Ссылка", п_Контрагент);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции // ()