#Область Регистрация

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.3.393");
	ПараметрыРегистрации.Информация = "(53-3) Коэффициент остатка, рассылка XLSX";
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.1.1.1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Коэффициент остатка, рассылка XLSX (ручн.)'");
	Команда.Идентификатор = "КоэффициентОстаткаРассылкаXLSX_Ручн";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Коэффициент остатка, рассылка XLSX (по расписанию)'");
	Команда.Идентификатор = "КоэффициентОстаткаРассылкаXLSX_Авто";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
	
#КонецОбласти 

#Область ОтправитьПисьма

Функция ОтправитьПисьмо(АдресаЭП, Вложения, Тема, ТекстСообщения)
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, Вложения");
	ПараметрыПисьма.Кому = АдресаЭП;
	ПараметрыПисьма.Тема = Тема;
	ПараметрыПисьма.Тело = ТекстСообщения;
	ПараметрыПисьма.Вложения = Вложения;
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ТекстОшибки = СтрШаблон("Ошибка при отправке письма на адрес: %1, по причине: %2", 
		АдресаЭП,
		ОписаниеОшибки());
		ЛогСообщить(ТекстОшибки);
		Сообщить(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
	
КонецФункции

Функция ДобавитьТабДокВоВложения(п_ТабДок, п_Вложения)

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	п_ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	п_Вложения.Вставить("purchase_list.xlsx", Новый ДвоичныеДанные(ИмяВременногоФайла));
		
	ЛогСообщить("    - записан файл: " + ИмяВременногоФайла);

КонецФункции

Функция ПисьмаОтправитьНаСервере(п_ТабДок)
	
	ГруппаНастройки = Справочники.qw_Константы.НайтиПоНаименованию("Коэффициент остатка", Истина);
	Если НЕ ЗначениеЗаполнено(ГруппаНастройки) Тогда
		Сообщить("На найдена папка с настройками");
		ЛогСообщить("На найдена папка с настройками");
		Возврат "";
	КонецЕсли;

	СпрАдрес = Справочники.qw_Константы.НайтиПоНаименованию("e-mail", Истина, ГруппаНастройки);
	Если НЕ ЗначениеЗаполнено(СпрАдрес) Тогда
		Сообщить("На найдена настройка e-mail");
		ЛогСообщить("На найдена настройка e-mail");
		Возврат "";
	КонецЕсли;
	
	ТекАдреса = СпрАдрес.Значения.ВыгрузитьКолонку("Свойство");
	
	ТекАдрестаСтрокой = СтрСоединить(ТекАдреса, ";");
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;	
	
	Если Не РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись, Истина, Ложь) Тогда
		ЛогСообщить("Не настроена учетная запись для отправки писем");
		ВызватьИсключение("Не настроена учетная запись для отправки писем");
	КонецЕсли; 
	
	Вложения = Новый Соответствие;
	
	ДобавитьТабДокВоВложения(п_ТабДок, Вложения);
	
	Тема			= "Закупки";
	ТекстСообщения	= "Закупки";
	
	Если Вложения.Количество() > 0 Тогда
		Рез = ОтправитьПисьмо(ТекАдрестаСтрокой, Вложения, Тема, ТекстСообщения);
	КонецЕсли;
	
	Если Рез Тогда
		ЛогСообщить("   ...отправлено: " + ТекАдрестаСтрокой);
	Иначе
		ЛогСообщить("  ! ошибка отправки: " + ТекАдрестаСтрокой);
	КонецЕсли;

	Возврат Рез;

КонецФункции

#КонецОбласти

#Область СформироватьОтчет

Функция ПолучитьНоменклатуру(п_ГруппыНоменклатуры, п_ВидыНоменклатуры, п_МассивАссортимент)
	
	Запрос = Новый Запрос;
	Запрос_Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, """") КАК Статус
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Номенклатура.Ссылка = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство = &СвойствоСтатус)
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппыНоменклатуры)
		|	И Номенклатура.ВидНоменклатуры В(&ВидыНоменклатуры)
		|	И ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, """") В(&МассивАссортимент)
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ГруппыНоменклатуры",	п_ГруппыНоменклатуры);
	Запрос.УстановитьПараметр("ВидыНоменклатуры",	п_ВидыНоменклатуры);
	Запрос.УстановитьПараметр("СвойствоСтатус", 	ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ассортимент", Истина));
	Запрос.УстановитьПараметр("МассивАссортимент", 	п_МассивАссортимент);
	
	Запрос.Текст = Запрос_Текст;	

	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
	
КонецФункции // ()

Функция ПолучитьПродажи(п_ДатаНачала, п_ДатаОкончания, п_ГруппыНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
		|	КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.Период КАК ПериодМесяц
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, ) КАК ВыручкаИСебестоимостьПродажОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
		|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
		|ГДЕ
		|	КлючиАналитикиУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|	И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ(&Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	КлючиАналитикиУчетаНоменклатуры.Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодМесяц";
	
	Запрос.УстановитьПараметр("ДатаНачала",		п_ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(п_ДатаОкончания));
	Запрос.УстановитьПараметр("Номенклатура",	п_ГруппыНоменклатуры);

	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;

КонецФункции // ()

Функция ПолучитьОстаткиНаСкладах(п_ДатаОстатков, п_ГруппыНоменклатуры, п_Склады)
	
	Запрос = Новый Запрос;
	Запрос_Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток - СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(
		|			&ДатаОстатков,
		|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
		|				И Склад В (&Склад)) КАК СвободныеОстаткиОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатков",	п_ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура",	п_ГруппыНоменклатуры);
	Запрос.УстановитьПараметр("Склад",			п_Склады);
	
	Запрос.Текст = Запрос_Текст;	

	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
	
КонецФункции // ()

Функция СформироватьОтчет(Авто = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ЛогСообщить(" -- Начало -- " + Авто);

	Путь = "c:\log_1c\КоэффициентОстатка.xlsx";
	
	ГруппаНастройки = Справочники.qw_Константы.НайтиПоНаименованию("Коэффициент остатка", Истина);
	НастройкиСклады = Справочники.qw_Константы.НайтиПоНаименованию("Склады", Истина, ГруппаНастройки);
	массив_Склады = НастройкиСклады.Значения.ВыгрузитьКолонку("Значение");

	спр_ГруппыНоменклатуры = Справочники.qw_Константы.НайтиПоНаименованию("Группы Номенклатуры", Истина, ГруппаНастройки);
	ГруппыНоменклатуры = спр_ГруппыНоменклатуры.Значения.ВыгрузитьКолонку("Значение");

	спр_ВидыНоменклатуры = Справочники.qw_Константы.НайтиПоНаименованию("Виды Номенклатуры", Истина, ГруппаНастройки);
	ВидыНоменклатуры = спр_ВидыНоменклатуры.Значения.ВыгрузитьКолонку("Значение");

	спр_ГлубинаМесяцев = Справочники.qw_Константы.НайтиПоНаименованию("Глубина месяцев", Истина, ГруппаНастройки);
	ГлубинаМесяцев = спр_ГлубинаМесяцев.Значение;
	ЛогСообщить("Глубина: " + ГлубинаМесяцев);

	спр_Ассортимент = Справочники.qw_Константы.НайтиПоНаименованию("Ассортимент", Истина, ГруппаНастройки);
	МассивАссортимент = спр_Ассортимент.Значения.ВыгрузитьКолонку("Значение");
	
	ТЗ_Номенклатура = ПолучитьНоменклатуру(ГруппыНоменклатуры, ВидыНоменклатуры, МассивАссортимент);
	
	ТекДата = ТекущаяДатаСеанса();
	
	ДатаОстатков	= ТекДата;
	ДатаОкончания	= КонецДня(ТекДата);
	ДатаНачала		= НачалоДня(ДобавитьМесяц(ТекДата, -ГлубинаМесяцев+1));

	ТЗ_ОстаткиНаСкладах = ПолучитьОстаткиНаСкладах(ДатаОстатков, ГруппыНоменклатуры, массив_Склады);
	ТЗ_ОстаткиНаСкладах.Индексы.Добавить("Номенклатура");

	ТЗ_Продажи = ПолучитьПродажи(ДатаНачала, ДатаОкончания, ГруппыНоменклатуры);
	ТЗ_Продажи.Индексы.Добавить("Номенклатура, ПериодМесяц");

	ТЗ_ПродажиМесяц = ТЗ_Продажи.Скопировать(, "ПериодМесяц");
	ТЗ_ПродажиМесяц.Свернуть("ПериодМесяц");
	
	Макет = ПолучитьМакет("МакетОтчета");

	ОбЗаголовок					= Макет.ПолучитьОбласть("Заголовок");
	ОбПодвалНачало				= Макет.ПолучитьОбласть("Подвал|Начало");
	ОбПодвалПродажи				= Макет.ПолучитьОбласть("Подвал|Продажи");
	ОбПодвалОкончание			= Макет.ПолучитьОбласть("Подвал|Окончание");
	ОбПодвалПустая				= Макет.ПолучитьОбласть("Подвал|Пустая");
	
	ОбШапкаТаблицыНачало		= Макет.ПолучитьОбласть("ШапкаТаблицы|Начало");
	ОбШапкаТаблицыПродажи		= Макет.ПолучитьОбласть("ШапкаТаблицы|Продажи");
	ОбШапкаТаблицыОкончание		= Макет.ПолучитьОбласть("ШапкаТаблицы|Окончание");
	ОбШапкаТаблицыПустая		= Макет.ПолучитьОбласть("ШапкаТаблицы|Пустая");
	ОбСтрокаНачало				= Макет.ПолучитьОбласть("Строка|Начало");
	ОбСтрокаПродажи				= Макет.ПолучитьОбласть("Строка|Продажи");
	ОбСтрокаОкончание			= Макет.ПолучитьОбласть("Строка|Окончание");
	ОбСтрокаПустая				= Макет.ПолучитьОбласть("Строка|Пустая");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбЗаголовок.Параметры.ПериодОтчета	= "с " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy")  + " по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	ТабДок.Вывести(ОбЗаголовок);
	
	ТабДок.НачатьАвтогруппировкуКолонок();
	
#Область ШапкаТаблицы

	ТабДок.Вывести(ОбШапкаТаблицыНачало, 1, "Группа 1", Ложь);
	
	КолМесяцев = ТЗ_ПродажиМесяц.Количество();
	НГ = 6; // Начало группировки по вертикали
	СГ = 5; // Строка группировки по вертикали
	
	// продажи
	Для каждого Т Из ТЗ_ПродажиМесяц Цикл
		ОбШапкаТаблицыПродажи.Параметры.Месяц = Формат(Т.ПериодМесяц, "ДФ=MMMM.yy");
		ТабДок.Присоединить(ОбШапкаТаблицыПродажи, 2, "Группа 2", Истина);	
	КонецЦикла;
	ТабДок.Область(СГ, НГ, СГ, НГ+КолМесяцев).Объединить();
	ТабДок.Присоединить(ОбШапкаТаблицыПустая, 1, "Группа 2", Ложь);

	ТабДок.Присоединить(ОбШапкаТаблицыОкончание);
	
#КонецОбласти	

#Область Строки

	Ном = 1;
	Для каждого Т Из ТЗ_Номенклатура Цикл
		
		ОбСтрокаНачало.Параметры.Ном = Ном;
		ОбСтрокаНачало.Параметры.Артикул		= Т.Номенклатура.Артикул;
		ОбСтрокаНачало.Параметры.Номенклатура	= Т.Номенклатура;
		
		ТекОстатокНаСкладе = 0;
		СтрокаОстатка = ТЗ_ОстаткиНаСкладах.Найти(Т.Номенклатура, "Номенклатура");
		Если СтрокаОстатка <> Неопределено Тогда
			ТекОстатокНаСкладе = СтрокаОстатка.Остаток;
		КонецЕсли;
		
		ОбСтрокаНачало.Параметры.Статус				= Т.Статус;
		ОбСтрокаНачало.Параметры.ОстатокНаСкладе	= ТекОстатокНаСкладе;
		
		ТабДок.Вывести(ОбСтрокаНачало, 1, "Группа 2", Ложь);

        ПродажиИтого = 0;
        ПродажиМаксимум = 0;
        ПродажиСреднее = 0;
        ПродажиМесяцев = 0;

#Область ПродажиПомесячно
	
		Для каждого ТТ Из ТЗ_ПродажиМесяц Цикл
			НайденаСтрока = ТЗ_Продажи.НайтиСтроки(Новый Структура("Номенклатура, ПериодМесяц", Т.Номенклатура, ТТ.ПериодМесяц));
			Если НайденаСтрока.Количество() > 0 Тогда
				ТекКоличество = НайденаСтрока[0].Количество;
				ОбСтрокаПродажи.Параметры.Продажи = ТекКоличество;
		        ПродажиИтого = ПродажиИтого + ТекКоличество;
				ПродажиМаксимум = макс(ПродажиМаксимум, ТекКоличество);
			Иначе
				ОбСтрокаПродажи.Параметры.Продажи = "";
			КонецЕсли;
	        ПродажиМесяцев = ПродажиМесяцев + 1;
			ТабДок.Присоединить(ОбСтрокаПродажи, 2, "Группа 2", Истина);	
		КонецЦикла;
		ТабДок.Присоединить(ОбСтрокаПустая, 1, "Группа 2", Ложь);	

#КонецОбласти		

		Если ПродажиМесяцев = 0 Тогда
			ПродажиСреднее = 0;
		Иначе
			Если ТЗ_ПродажиМесяц.Количество() > 0 Тогда
				ПродажиСреднее = ПродажиИтого / ПродажиМесяцев;
			КонецЕсли;
		КонецЕсли;

        ОбСтрокаОкончание.Параметры.ПродажиСреднее = ПродажиСреднее;

		КоэфОстатка = 0;
		Если ПродажиСреднее <> 0 Тогда
			КоэфОстатка = Окр(ТекОстатокНаСкладе / ПродажиСреднее, 1);
		КонецЕсли;

		ОбСтрокаОкончание.Параметры.КоэфОстатка = КоэфОстатка;

		ТабДок.Присоединить(ОбСтрокаОкончание);

		Если КоэфОстатка = 0 Тогда
			ТекОбласть  = ТабДок.Область("Я_КоэфОстатка");
			ТекОбласть.ЦветФона = Новый Цвет(248, 203, 173);
		КонецЕсли;

		Ном = Ном + 1;
	
	КонецЦикла; // по строкам номенклатуры
	
#КонецОбласти

	ТабДок.ЗакончитьАвтогруппировкуКолонок();

#Область Подвал
	
	ТабДок.Вывести(ОбПодвалНачало);
	
	Для каждого Т Из ТЗ_ПродажиМесяц Цикл
		ТабДок.Присоединить(ОбПодвалПродажи);	
	КонецЦикла;
	ТабДок.Присоединить(ОбПодвалПустая, 1, "Группа 2", Ложь);

	ТабДок.Присоединить(ОбПодвалОкончание);
	
#КонецОбласти	

	ТабДок.ФиксацияСлева = 3;
	ТабДок.ФиксацияСверху = 6;

	ТабДок.Записать(Путь, ТипФайлаТабличногоДокумента.XLSX);
	
	ЛогСообщить("Выгружено строк: " + Ном);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти  

#Область Прочее

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив = 0, СозданныеОбъекты = 0) Экспорт
    
	ТабДок = СформироватьОтчет(ИдентификаторКоманды);
	Рез = ПисьмаОтправитьНаСервере(ТабДок);
	
КонецПроцедуры

Процедура ЛогСообщить(Знач М)
	
    ПолноеИмяФайла = "c:\log_1c\Коэффициент остатка рассылка XLSX.txt";
    
    Попытка 
        ЛогФайл = Новый ЗаписьТекста(ПолноеИмяФайла, КодировкаТекста.ANSI,,Истина,);
        ЛогФайл.Записать(Формат(ТекущаяДата(),"ДЛФ=DT")+": " + М + Символы.ПС);
        ЛогФайл.Закрыть();
    Исключение
        Сообщить("ошибка записи лог файла");
    КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

