#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Наименование) 
		И ЗначениеЗаполнено(НаименованиеУслуги)  Тогда
			СформироватьНаименование();	
	КонецЕсли;		
	
КонецПроцедуры

Процедура СформироватьНаименование() Экспорт
	
	Если ЗначениеЗаполнено(НаименованиеУслуги) Тогда
		Наименование = НаименованиеУслуги;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецЕсли