&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТоварыХарактеристика.Видимость = 
		(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
			И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики") = Истина);
	
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Функция) Тогда
		Объект.Функция = Перечисления.КонтурЛогистика_ФункцииЗаказаЗаявки.Заказ;
	КонецЕсли;

	Параметры.Свойство("Основание", ДокументЛогистики);
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) 
		И ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
		ДокументЛогистики = РегистрыСведений.КонтурЛогистика_СвязиДокументов.ПолучитьДокументОснование(Объект.Ссылка);	
			
	КонецЕсли;		 
	
	Если Объект.ЭтоВходящийШаблон
		И Не ЗначениеЗаполнено(Объект.ПользовательПодписант) Тогда 
	
		Объект.ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьРеквизитыПоПользователю(Объект.Грузоотправитель);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ОбновитьДанныеФормы();
	
	Если КодТекущегоСтатусаДокументооборота = "zz-wait-consignor-sign"
		И Не ЗначениеЗаполнено(Объект.ПользовательПодписант) Тогда
		
		Объект.ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьРеквизитыПоПользователю(Объект.Грузоотправитель);
		Модифицированность = Истина;
		
	КонецЕсли;
		
	РазблокироватьДанныеФормыДляРедактирования();
	
	ЗаполнитьДатыПогрузкиЛокальные();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
		
КонецПроцедуры

&НаКлиенте 
Процедура ПриОткрытии(Отказ)
	
	// баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	ШапкаНаОтдельнойЗакладке = Истина;
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
	КонецЕсли;
	
	Если Объект.ЭтоШаблон Тогда  
		Если Не ЗначениеЗаполнено(Объект.ОтправительШаблона) Тогда
			Объект.ОтправительШаблона = Объект.Перевозчик;
		КонецЕсли; 
	КонецЕсли;
	
	Элементы.СоставительИноеЛицоПеревозчик.Видимость = Объект.ЭтоШаблон;
	Элементы.СоставляетИноеЛицоГО.Видимость = Не Объект.ЭтоШаблон;
	
	СоставительИноеЛицоПеревозчик = Объект.ЭтоШаблон 
			И (Не Объект.ОтправительШаблона = Объект.Перевозчик) Или СоставительИноеЛицоПеревозчик;
	Элементы.ГруппаОтправительШаблона.Видимость = СоставительИноеЛицоПеревозчик;
	
	ПроверитьДокумент();
	
	Если Объект.ЭтоВходящийШаблон Тогда
		УстановитьДоступностьРедактированияДляСценария();
	КонецЕсли;	
		
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ДокументЛогистики) Тогда
		РегистрыСведений.КонтурЛогистика_СвязиДокументов.УстановитьСвязь(ДокументЛогистики, ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()

	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка, Истина);
	КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
	ОсновнаяКоманда = Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		ОсновнаяКоманда.Заголовок = "Повторно выполнить задачу";
	Иначе
		ОсновнаяКоманда.Заголовок = "Выполнить задачу";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка,
		 	Объект.ДокументОснование, ОсновнаяКоманда, ТекущийСтатус);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	ОсновнаяКоманда.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию Или Объект.ЭтоВходящийШаблон;
	
	Если ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		ГОНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.Грузоотправитель, "Наш");
	Иначе
		ГОНаш = Ложь;
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВвестиЭТРНизЗЗ.Видимость = ГОНаш;
	
	Если ТекущийСтатусДокументооборота.ТребуемоеДействиеТ1 = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПроверитьОтветДругогоУчастника
		И ГОНаш Тогда
		
		РежимПроверкиОтвета = Истина;
		
	КонецЕсли;
	
	Элементы.ФормаПроверитьТ2.Видимость 		= НЕ ДоступнаОсновнаяКнопкаПоУмолчанию И РежимПроверкиОтвета;
	Элементы.ФормаПроверитьТ2.КнопкаПоУмолчанию = НЕ ДоступнаОсновнаяКнопкаПоУмолчанию И РежимПроверкиОтвета;
		
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	Элементы.ПерезаполнитьПоДокОснованию.Видимость 									= Не ЭтоВходящий;
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость 		= Не ЕстьДокУчСист;
	Элементы.ПользовательПодписант.Видимость 										= (Не ЭтоВходящий И Не Объект.ЭтоШаблон)
		Или КодТекущегоСтатусаДокументооборота = "zz-wait-consignor-sign";

	Элементы.ОткрытьНастройкуКонвертации.Видимость 	= ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ПартнерГрузоотправитель.Видимость 		= ЗначениеЗаполнено(Объект.ПартнерГрузоотправитель);
	Элементы.ПартнерПеревозчик.Видимость 			= ЗначениеЗаполнено(Объект.ПартнерПеревозчик);

	Если КодТекущегоСтатусаДокументооборота = "zz-rejected" Тогда
		ОсновнаяКоманда.Заголовок = "Создать Заказ-заявку с уточнениями";
		ОсновнаяКоманда.Видимость = Истина;
	ИначеЕсли Объект.ЭтоШаблон Тогда
		ОсновнаяКоманда.Заголовок = "Отправить шаблон грузоотправителю";
	ИначеЕсли КодТекущегоСтатусаДокументооборота = "zz-templateReceived" Тогда
		
		ОсновнаяКоманда.Видимость = Истина;
		ОсновнаяКоманда.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПодписатьИОтправить;
		ОсновнаяКоманда.Заголовок = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументЛогистики) Тогда
		Элементы.ГруппаДокументОснование.Видимость = Ложь;
		Элементы.ГруппаДокументЛогистики.Видимость = Истина;
	Иначе 
		Элементы.ГруппаДокументЛогистики.Видимость = Ложь;
		ОтрисоватьДокументыОснованияСервер();	 
	КонецЕсли;	
	
	ВходящееПоручение = (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
	 		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
	 		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением);
	
	Элементы.ЭтоШаблон.Видимость = (КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ЗЗ_ИспользоватьШаблоныДокументов")
		ИЛИ Объект.ЭтоШаблон) И Не Объект.ЭтоВходящийШаблон;
	
	Элементы.ДокументШаблон.Видимость = ЗначениеЗаполнено(Объект.ДокументШаблон);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПунктМаршрута"
		И Параметр = Объект.ПунктПод Тогда
		
		ОбновитьЧасовыеПоясаМестаПогрузки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ОбновитьФормуСпискаЗадач");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	
	КоличествоМест = 0;
	КоличествоСтрок = 0;
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.Товары Цикл
		
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
		КоличествоСтрок = КоличествоСтрок + 1;
		
	КонецЦикла;
	
	Форма.Элементы.ТоварыКоличествоМест.Заголовок = КоличествоМест;
	Форма.Элементы.ТоварыКоличество.Заголовок = Форма.Объект.Товары.Итог("Количество");
	
	Форма.Элементы.ГруппаТовары.Заголовок = "Грузы (" + КоличествоСтрок + ")";
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()

	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		 Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		 Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда

		ТолькоПросмотр = Макс(Ложь, ТолькоПросмотр);
		
	Иначе

		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// Оформление грузоотправитель - редактирование и команды подписи/отправки черновика
	Если КодТекущегоСтатусаДокументооборота = "zz-wait-consignor-sign" Тогда
		ТолькоПросмотр = Ложь;
	КонецЕсли;
		
	Элементы.ПерезаполнитьПоДокОснованию.Видимость 		= Не ТолькоПросмотр;
	Элементы.ТоварыДобавить.Видимость 					= Не ТолькоПросмотр;
	УстановитьДоступностьЭлемента("ФлажокЕстьДоговор", Не ТолькоПросмотр);
	
	УстановитьДоступностьКоманд(Не ТолькоПросмотр);
	
	Элементы.ГруппаСоздатьНовый.Видимость = (ЗначениеЗаполнено(Объект.Ссылка)
		И ТребуетсяПереотправить(ТекущийСтатусДокументооборота));
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКоманд(Доступность)
	
	УстановитьДоступностьЭлемента("ГруппаВключитьВидимостьСторон", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителю", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПропуститьДокумент", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ЗаполнитьДокументУчетнойСистемыПоТитулу", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОбработатьВходящийДокумент", Доступность);
	УстановитьДоступностьЭлемента("ФормаЗаписать", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СохранитьФайлыОбмена", Доступность);
	
	ДоступностьНеподписанного = Доступность И СценарийОтправлятьНеподписанный();
	УстановитьВидимостьИДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", ДоступностьНеподписанного);
	УстановитьВидимостьИДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", ДоступностьНеподписанного);
	
	ДоступностьПодписанного = Доступность И СценарийОтправлятьПодписанный();
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", ДоступностьПодписанного);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", ДоступностьПодписанного);
	
КонецПроцедуры

&НаСервере
Функция СценарийОтправлятьНеподписанный()
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СценарийРазрешаетОтправкуНеподписанного(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1, Объект.ДокументОснование);
	
КонецФункции

&НаСервере
Функция СценарийОтправлятьПодписанный()
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СценарийРазрешаетОтправкуПодписанного(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1, Объект.ДокументОснование);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлемента(ИмяЭлемента, Включить)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Видимость = Включить;
	НайденныйЭлемент.Доступность = Включить;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлемента(ИмяЭлемента, Доступность)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Доступность = Доступность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТребуетсяПереотправить(ТекущийСтатусДокументооборота)
	
	Возврат ТекущийСтатусДокументооборота.Код = "zz-rejected";
	
КонецФункции

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)

	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)

	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "zz-rejected");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)

	ОбработчикПеречитатьОбъект();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	ПолностьюОбновитьПредставлениеДанных();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставительИноеЛицоПеревозчикПриИзменении(Элемент)
	
	Элементы.ГруппаОтправительШаблона.Видимость = СоставительИноеЛицоПеревозчик;
	Элементы.Перевозчик.Заголовок = ?(Объект.ЭтоШаблон И Не СоставительИноеЛицоПеревозчик, "Перевозчик (отправитель шаблона)", "Перевозчик");
	
	Если СоставительИноеЛицоПеревозчик = Ложь Тогда
		Объект.ОтправительШаблона = Объект.Перевозчик; 
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставляетИноеЛицоГОПриИзменении(Элемент)
	
	Элементы.ГруппаСоставитель.Видимость = СоставляетИноеЛицоГО;
	Элементы.ГруппаВключитьВидимостьСторон.Видимость = Не СоставляетИноеЛицоГО;

КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	ЗаполнитьДатыПогрузкиЛокальные();
	ЗаполнитьТребуемыеДействияТоваров();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()

	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()

	РезультатПроверки = ПроверитьДокументСервер();

	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "zz-rejected");
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьПиктограммыОшибокТабличнойЧасти(Объект.Товары,
																			   ТаблицаОшибок,
																			   "Товары",
																			   "КартинкаОшибок");

	ЗаполнитьТребуемыеДействияТоваров(); 	// требуемые действия зависят от результатов проверки 
	УправлениеВидимостьюИДоступностью(); 	// доступность команд

	Возврат РезультатПроверки;

КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыФормированияФайлов = Неопределено;
	Если ДокОбъект.ЭтоШаблон Тогда
		ПараметрыФормированияФайлов = Новый Структура("ТребуетсяПодпись", Ложь);
	КонецЕсли;
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ЗЗ_Титул1.ПроверитьДокумент(
		ДокОбъект, ТаблицаОшибок, ПараметрыФормированияФайлов);

	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Картинка = 0;
	КонецЦикла;

	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьТребуемыеДействияТоваров()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл

		СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)

	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре

	Если Не СтрокаТовара.Учитывать Тогда
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда

		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";

			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";

			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.ВидТары)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.Высота)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.Длина)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.Ширина)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.МетодОпределенияМассы)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.ОбъемКубМ) Тогда

				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;

			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
			Если СтрокаТовара.Свернута Тогда 
				СтрокаТовара.ТребуемоеДействие = СтрокаТовара.ТребуемоеДействие + ", свернута";
			КонецЕсли;
			
		Иначе
			
			Если СтрокаТовара.КартинкаОшибок = 2 Тогда
				СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
		КонецЕсли;

	Иначе

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительШаблонаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АдрПунктПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1"),
		  Объект.ДокументОснование);
КонецПроцедуры 

// Управление положением подробных сведений о товаре

&НаКлиенте
Процедура СвернутьПодробныеСведенияНажатие(Элемент)

	СкрытьПодробностиТоваров = Истина;
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазвернутьПодробностиТоваровНажатие(Элемент)

	СкрытьПодробностиТоваров = Ложь;
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвернутостьПодробностейОТоварах()

	Элементы.ГруппаПодробныеСведенияСвернутая.Видимость = СкрытьПодробностиТоваров;
	Элементы.ГруппаПодробныеСведения.Видимость = Не Элементы.ГруппаПодробныеСведенияСвернутая.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыТребуемоеДействие" Тогда

		СтандартнаяОбработка = Ложь;

		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда

			ТекСтрТребуемоеДействие = ТекДанные.ТребуемоеДействие;
			ПараметрыТекСтрока = ВыбраннаяСтрока;
			Если ТекСтрТребуемоеДействие = "Указать Номенклатуру" Тогда

				ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");

				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы("Справочник."
																				   + ТипСправочникаНоменклатура
																				   + ".ФормаВыбора",
																				   ,
																				   ЭтаФорма,
																				   ЭтаФорма,
																				   "ОбработчикВыбораНоменклатуры",
																				   ПараметрыТекСтрока);

			ИначеЕсли ТекСтрТребуемоеДействие = "Указать Единицу измерения" Тогда

				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
				Элементы.Товары.ИзменитьСтроку();

			ИначеЕсли ТекСтрТребуемоеДействие = "Указать Количество" Тогда

				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
				Элементы.Товары.ИзменитьСтроку();

			ИначеЕсли ТекСтрТребуемоеДействие = "Установить соответствие" Или ТекСтрТребуемоеДействие = "Не учитывается" Тогда

				ОткрытьСоответствияТекущейСтроки();

			Иначе // требуемое действие от таблицы ошибок

				ОбработатьТребуемоеДействие(ТекСтрТребуемоеДействие, Неопределено);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда

	Иначе // типовая обработка таблицы ошибок

		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()

	УстановитьПоложениеСохраняемыхЭлементов();
	УстановитьФорматыКолонокСКоличеством();

	УстановитьВидимостьЭлементов();
	УстановитьЗаголовкиГруппамДопПолей();
	УстановитьЗаголовки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовки()
	
	Если Объект.ЭтоШаблон Тогда
		Заголовок = "Шаблон документа";
	ИначеЕсли Объект.ЭтоВходящийШаблон Тогда
		Заголовок = "Из шаблона";
	Иначе
		Заголовок = "";		
	КонецЕсли;
	
	Элементы.Грузоотправитель.Заголовок = ?(Объект.ЭтоШаблон, "Грузоотправитель (получатель шаблона)", "Грузоотправитель");
	Элементы.Перевозчик.Заголовок = ?(Объект.ЭтоШаблон И Не СоставительИноеЛицоПеревозчик, "Перевозчик (отправитель шаблона)", "Перевозчик");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоШаблонПриИзменении(Элемент)
	
	Если Объект.ЭтоШаблон Тогда
		Объект.ОтправительШаблона = Объект.Перевозчик;
		Если Не ЗначениеЗаполнено(Объект.СценарийРедактированияШаблона) Тогда
			Объект.СценарийРедактированияШаблона = ПолучитьСценарийРедактированияШаблонаНаСервере(); 
		КонецЕсли;	
	Иначе
		Объект.ОтправительШаблона = ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка");
		Объект.СценарийРедактированияШаблона = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииРедактированияШаблона.ПустаяСсылка");
	КонецЕсли;
	
	Элементы.СоставительИноеЛицоПеревозчик.Видимость = Объект.ЭтоШаблон;
	Элементы.СоставляетИноеЛицоГО.Видимость = Не Объект.ЭтоШаблон;
	
	ПроверитьДокумент();
	УстановитьЗаголовки();
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСценарийРедактированияШаблонаНаСервере()
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ЗЗ_ТипШаблонаДляОтправкиКонтрагенту");
КонецФункции	

&НаКлиенте
Процедура УстановитьДоступностьРедактированияДляСценария()
	
	Если Объект.СценарийРедактированияШаблона 
			= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииРедактированияШаблона.НеРедактируется") Тогда
	
		Элементы.ГруппаСоздатьНовый.ТолькоПросмотр = Истина;
		Элементы.ГруппаШаблон.ТолькоПросмотр = Истина;
		Элементы.ГруппаДокументЛогистики.ТолькоПросмотр = Истина;
		Элементы.ГруппаДокументОснование.ТолькоПросмотр = Истина;
		Элементы.ГруппаШапкаМестоположениеВерх.ТолькоПросмотр = Истина;
	
		Элементы.СтраницаШапка.ТолькоПросмотр = Истина;
		Элементы.ГруппаТовары.ТолькоПросмотр = Истина;
		Элементы.ГруппаПунктыМаршрута.ТолькоПросмотр = Истина;
	
		Элементы.ГруппаДопТексты.ТолькоПросмотр = Истина;
		Элементы.ГруппаОграничения.ТолькоПросмотр = Истина;
		Элементы.ГруппаПолномочияЛиц.ТолькоПросмотр = Истина;
		Элементы.ГруппаДополнительныеПолучатели.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнфПоля.ТолькоПросмотр = Истина;
		Элементы.ГруппаДокументыОснования.ТолькоПросмотр = Истина;
		Элементы.ГруппаТехнические.ТолькоПросмотр = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()

	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок()

	КонтурЛогистика_ОбработкаДокументовКлиент.УстановитьВидимостьНеучитываемыхИФильтраОшибок(Объект.Товары,
																							 СкрытьНеучитываемые,
																							 Элементы.Товары,
																							 Элементы.ТоварыИтоги);
	
	// лишним не будет
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = ЗначениеЗаполнено(ОтборТаблицыОшибокЗначениеТовары);

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибокТовары(Команда)

	ОтборТаблицыОшибокЗначениеТовары = "";

	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда

		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);

		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;

	КонецЕсли;

	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНеучитываемые(Команда)

	СкрытьНеучитываемые = Не СкрытьНеучитываемые;
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()

	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "МассаПлановаяНеттоКг",
																			 Элементы.ТоварыМассаПлановаяНеттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "МассаПлановаяБруттоКг",
																			 Элементы.ТоварыМассаПлановаяБруттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "Количество",
																			 Элементы.ТоварыКоличество);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "ОбъемКубМ",
																			 Элементы.ТоварыОбъемКубМ);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "МасТар",
																			 Элементы.ТоварыМасТар);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	УстановитьВидимостьНоменклатуры();
			
	Элементы.ОткрытьНастройкуКонвертации.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ГруппаСоставитель.Видимость = СоставляетИноеЛицоГО;
	
	ФлажокЕстьДоговор = Объект.Функция = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ФункцииЗаказаЗаявки.Заявка");
	Элементы.ДогОргПрвз.Видимость = ФлажокЕстьДоговор;
	
	Элементы.РазделительИндикатор.Видимость = ЗначениеЗаполнено(Объект.Разделитель);
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНоменклатуры()
	
	// видимость номенклатуры в зависимости от того есть ли там номенклатура (она есть если отправляли Т1 из этой базы) 
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаНоменклатура);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыХарактеристика);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаЕдиницы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
	// Автоитоги массы и объема
	РассчитатьАвтоитогиМассыИОбъема();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.Учитывать = Истина;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Автоитоги массы и объема
	РассчитатьАвтоитогиМассыИОбъема();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьАвтоитогиМассыИОбъема()
	
	// увеличиваем требования к ТС только если они стали недостаточными, в случае уменьшения требований не меняем
	
	Если Объект.ТСГрузопод < Объект.Товары.Итог("МассаПлановаяБруттоКг")/1000 
		И КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеНастройки("ЗЗ_АвтоитогМасса") Тогда
		
		Объект.ТСГрузопод = Окр(Объект.Товары.Итог("МассаПлановаяБруттоКг")/1000 + 0.004999999, 2);
		
	КонецЕсли;
	
	Если Объект.ТСВместим < Объект.Товары.Итог("ОбъемКубМ") 
		И КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеНастройки("ЗЗ_АвтоитогОбъем") Тогда
		
		Объект.ТСВместим = Окр(Объект.Товары.Итог("ОбъемКубМ") + 0.004999999, 2);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПунктыПогрузкиВыгрузкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)

	Перем ТекТовар;

	Если НоваяСтрока Тогда

		ТекТовар = Элементы.Товары.ТекущиеДанные;

		Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = ТекТовар.ИдентификаторСтроки;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыОписаниеОпасногоГрузаПриИзменении(Элемент)
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ЗаполнитьСтрокуОпасногоГрузаПоШаблону(Элементы.ОпасныеГрузы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПунктыПогрузкиВыгрузкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПунктыПогрузкиВыгрузкиПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.ИдентификаторСтроки = "" Тогда 		
		Элемент.ТекущиеДанные.Учитывать = Истина;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	ОтборСтрок = Неопределено;

	Если Не Элемент.ТекущиеДанные = Неопределено Тогда

		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров",
												  Элемент.ТекущиеДанные.ИдентификаторСтроки);

	КонецЕсли;

	Элементы.ОпасныеГрузы.ОтборСтрок 					= ОтборСтрок;
	Элементы.ТоварыПунктыПогрузкиВыгрузки.ОтборСтрок 	= ОтборСтрок;

	КонтурЛогистика_ПанельОшибокКлиент.УстановитьОтборТаблицыОшибокПоНомеруСтроки(ТаблицаОшибок,
																				  Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)

	ПерезаполнитьПоДокОснованиюСервер();
	ОбновитьДанныеФормы();

	Элементы.ПерезаполнитьПоДокОснованию.ЦветТекста = ЦветаСтиляЦветТекстаФормы();
	
	ПолностьюОбновитьПредставлениеДанных();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветаСтиляЦветТекстаФормы()
	
	Возврат ЦветаСтиля.ЦветТекстаФормы;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
		
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокОбъект.ДокументОснование);
	ДанныеЗаполнения.Вставить("ТипЛогистика", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1);
	ДанныеЗаполнения.Вставить("Разделитель", ДокОбъект.Разделитель);
	ДанныеЗаполнения.Вставить("Перезаполнить", Истина);
	
	ДокОбъект.Заполнить(ДанныеЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 	
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
			Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка") Тогда 
			ПерезаполнитьПоДокОснованию(Неопределено);
		КонецЕсли;
	КонецЕсли;
		
	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктПодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПунктПод) Тогда
		Если Не ЗначениеЗаполнено(Объект.АдрПункт) Тогда
			НоваяСтрока = Объект.АдрПункт.Добавить();
			НоваяСтрока.Погрузка 		= Истина;
			НоваяСтрока.ДатВрОпер 		= ТекущаяДата();
			НоваяСтрока.ПунктМаршрута 	= Объект.ПунктПод;
		КонецЕсли;
		
		ПунктПод_КПП = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ПунктПод, "КПП");
		
		Если ЗначениеЗаполнено(ПунктПод_КПП)
			И ПунктПод_КПП <> Объект.ГрузоотправительКПП Тогда
			
			Объект.ГрузоотправительКПП = ПунктПод_КПП;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьЧасовыеПоясаМестаПогрузки();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДобавить(Команда)

	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	НоваяСтрока.Учитывать = Истина;

	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() Тогда
		НоваяСтрока.Характеристика =  КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПустаяХарактеристика();
	КонецЕсли;
	
	НоваяСтрока.МетодОпределенияМассы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МетодОпределенияМассы");

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкопировать(Команда)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.Учитывать = Истина;
	
	Если ТекСтрока <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,, "ИдентификаторСтроки");
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаЕдиницаИзмеренияПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьНесопоставленныеНеУчитываемыми(Команда)

	НесопоставленныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КоличествоМест,МассаПлановаяБруттоКг,ОтгрузочноеНаименование,Учитывать",
																	   0,
																	   0,
																	   "",
																	   Истина));
	Если НесопоставленныеСтроки.Количество() > 0 Тогда

		Для Каждого текСтр Из НесопоставленныеСтроки Цикл
			СделатьСтрокуТовараНеучитываемой(текСтр);
		КонецЦикла;

		ПолностьюОбновитьПредставлениеДанных();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияНоменклатуры(Команда)

	ОткрытьСоответствияТекущейСтроки();

КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуТовараНеучитываемой(Знач ТекДанныеТоваров)

	СделатьНоменклатуруНеучитываемой(ТекДанныеТоваров.Номенклатура, ТекДанныеТоваров.УпаковкаЕдиницаИзмерения);
	
	// эта номенклатура может быть еще в других строках
	// требуется переконвертировать все строки с этой номенклатурой
	МассивСтрокСЭтойНоменклатурой = Объект.ТоварыДокумента1С.НайтиСтроки(Новый Структура("Номенклатура",
																						 ТекДанныеТоваров.Номенклатура));

	Для Каждого СтрокаПереконвертации Из МассивСтрокСЭтойНоменклатурой Цикл

		СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьНоменклатуруНеучитываемой(Номенклатура, УпаковкаЕдиницаИзмерения)

	РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.ПрисвоитьСоответствиеНоменклатуры(Номенклатура,
																									   Новый Структура("Учитывать,УпаковкаЕдиницаИзмерения",
																													   Ложь,
																													   УпаковкаЕдиницаИзмерения));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе

		текНоменклатура 	= ТекущиеДанные.Номенклатура;
		текЕдиница 			= ТекущиеДанные.УпаковкаЕдиницаИзмерения;
		текХарактеристика 	= ТекущиеДанные.Характеристика;
		
		КонтурЛогистика_КонвертацияКлиент.ОткрытьСоответствияНоменклатуры(текНоменклатура, текЕдиница, текХарактеристика, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуПриРучномИзменении(ПараметрИдСтрокиТоваров)
	
	СконвертироватьСтрокуТоваровКлиент(ПараметрИдСтрокиТоваров);
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
	РассчитатьАвтоитогиМассыИОбъема();
	
	ПроверитьДокумент();

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуТоваровКлиент(ИдентификаторСтрокиТоваров)

	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);

	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСтрока.УпаковкаЕдиницаИзмерения) Тогда
		СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров)

	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СконвертироватьСтрокуТоваров1СвЛогистика(СтрокаТоваров.НомерСтроки);

	ЗаполнитьЗначенияСвойств(СтрокаТоваров, ДокОбъект.Товары[СтрокаТоваров.НомерСтроки - 1]);
	// маркировки проч не переносим т.к. можно потерять данные

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораНоменклатуры(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда

		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.Номенклатура = ВыбранноеЗначение;

		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
		
		УстановитьВидимостьНоменклатуры();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЕдиницыИзмерения(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда

		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.УпаковкаЕдиницаИзмерения = ВыбранноеЗначение;

		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияСоответствий(Параметр, ДопПараметр) Экспорт

	Если ЗначениеЗаполнено(ДопПараметр) Тогда

		локМассивСтрокСЭтойНоменклатурой = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ДопПараметр));
		локМассивИдентификаторов = Новый Массив();

		Для Каждого СтрокаПереконвертации Из локМассивСтрокСЭтойНоменклатурой Цикл

			СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
			локМассивИдентификаторов.Добавить(СтрокаПереконвертации.ИдентификаторСтроки);

		КонецЦикла;

		ПолностьюОбновитьПредставлениеДанных();

		ПересчитатьЗаголовкиКоличества(ЭтаФорма);

		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПереконвертироватьСтроку(ИдСтрокиТоваров, ТекДанные)

	СконвертироватьСтрокуТоваровКлиент(ИдСтрокиТоваров);
	СформироватьТребуемоеДействиеСтрокиТовара(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ПунктПод_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры
															   
&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);

		ПолностьюОбновитьПредставлениеДанных();

		ОбновитьДанныеФормы();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)

	ДокОбъект = РеквизитФормыВЗначение("Объект");

	ПерезаполнитьЭТРН = Ложь;

	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	// надо понять, требуется ли переконвертировать ЭТРН или надо конвертнуть только титул	
	СоотвРеквизита = СоответствиеКонвертируемыхРеквизитовИзДокУчСист().Получить(ИмяРеквизита);
	Если СоотвРеквизита <> Неопределено Тогда
		Если Найти(СоотвРеквизита, "ДокументЭТРН") Тогда
			ПерезаполнитьЭТРН = Истина;
		КонецЕсли;
	КонецЕсли;

	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует",
									   Объект.ДокументОснование,
									   Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1,
									   ПерезаполнитьЭТРН);
	ДокОбъект.Заполнить(ДанныеЗаполнения);

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);

	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда

		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);

	Иначе
		
		// открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ПунктПод", "ПунктПод");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "Грузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Перевозчик", "Перевозчик");
	
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		
		
		Если Представления.Свойство(Эл.Ключ, Значение) Тогда
			
			// Есть значение в реквизите ДокУчСист_ххх извлеченного из Документа учетной системы
			
			текВыражение = "ДокУчСист_" + Эл.Ключ + " = Значение";
			Выполнить (текВыражение);
			
			// определим доступность команды сопоставления
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				
				ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
				
				РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
				
				Если РеквизитИзвлеченИзДокумента Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
					
					Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
						
						ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
						НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
						
					Иначе
						
						НужноСопоставить = Ложь;
						
					КонецЕсли;
					
					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить ИЛИ РеквизитыУчетногоДокументаВидимы;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
					
				Иначе // не извлечен из документа Уч сист
					
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
					
					Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
						
						Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Не извлечен или не заполнен в док. основании. Открыть исходный документ";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГрузоотправительПодразделение.Видимость 	= ЗначениеЗаполнено(Объект.ГрузоотправительПодразделение) Или РеквизитыУчетногоДокументаВидимы;
	Элементы.ГрузоотправительКПП.Видимость 				= ЗначениеЗаполнено(Объект.ГрузоотправительКПП) И Объект.ГрузоотправительКПП <> Объект.Грузоотправитель.КПП Или РеквизитыУчетногоДокументаВидимы;
	Элементы.ПеревозчикПодразделение.Видимость 			= ЗначениеЗаполнено(Объект.ПеревозчикПодразделение) Или РеквизитыУчетногоДокументаВидимы;
	Элементы.ПеревозчикКПП.Видимость 					= ЗначениеЗаполнено(Объект.ПеревозчикКПП) И Объект.ПеревозчикКПП <> Объект.Перевозчик.КПП Или РеквизитыУчетногоДокументаВидимы;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить(Эл.Ключ);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат СтруктураПредставлений;
	КонецЕсли;
	
	ИменаРеквизитов = Новый Массив;
	
	СоответствиеКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Для Каждого ТекущееЗначение Из СоответствиеКонвертируемыхРеквизитов Цикл
		ИменаРеквизитов.Добавить(ТекущееЗначение.Ключ);
	КонецЦикла;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1, ДокументОснование);
	
	СтруктураПредставлений = КонтурЛогистика_ОбработкаДокументовСервер.ВычислитьРеквизитыДокументаОснования(
		ИменаРеквизитов, ДокументТитулОбъект, КонтекстНастройкиКонвертации);
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура АдрПунктПунктМаршрутаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АдрПунктВыгрузкаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АдрПунктПогрузкаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ФлажокЕстьДоговорПриИзменении(Элемент)
	
	Если ФлажокЕстьДоговор Тогда
		Объект.Функция = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ФункцииЗаказаЗаявки.Заявка");
	Иначе
		Объект.Функция = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ФункцииЗаказаЗаявки.Заказ");
	КонецЕсли;
	
	Элементы.ДогОргПрвз.Видимость = ФлажокЕстьДоговор;
	
	Модифицированность = Истина;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ТСГрузоподПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатВрПодПриИзменении(Элемент)
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатВрПод");
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПредВрПодПриИзменении(Элемент)
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ПредВрПод");
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТСТипПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТСВместимПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПредСрПрвзПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПрвзПищПродПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ГрузоотправительПриИзмененииСервер();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	
	ПеревозчикПриИзмененииСервер();
	ПроверитьДокумент();
	
	Если Объект.ЭтоШаблон И Не СоставительИноеЛицоПеревозчик 
	   Или Не ЗначениеЗаполнено(Объект.ОтправительШаблона) Тогда
	 	Объект.ОтправительШаблона = Объект.Перевозчик;
	 	Модифицированность = Истина; 
	КонецЕсли;
	
	СоставительИноеЛицоПеревозчик = Объект.ЭтоШаблон 
			И (Не Объект.ОтправительШаблона = Объект.Перевозчик) Или СоставительИноеЛицоПеревозчик;
	
	Элементы.ГруппаОтправительШаблона.Видимость = СоставительИноеЛицоПеревозчик;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ГрузоотправительПриИзмененииСервер()

	Если ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда 
		Объект.ПартнерГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Объект.Грузоотправитель);
	Иначе
		Объект.ПартнерГрузоотправитель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПеревозчикПриИзмененииСервер()

	Если ЗначениеЗаполнено(Объект.Перевозчик) Тогда 
		Объект.ПартнерПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Объект.Перевозчик);
	Иначе
		Объект.ПартнерПеревозчик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТ2(Команда)
	
	ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2");
	КонтурЛогистика_ОбщегоНазначенияКлиент.НайтиИОткрытьДругойТитулВместоТекущего(Объект.Ссылка, ТипОткрываемогоТитула, ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопПолеПриИзменении(Элемент)
	УстановитьЗаголовкиГруппамДопПолей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиГруппамДопПолей()
	
	// Ограничения
	УстановитьЗаголовокОграничений();
	
	// ГруппаПолномочия
	Элементы.ГруппаПолномочияЛиц.Заголовок = "Полномочия лиц грузоотправителя (" + Объект.СвЛицГО.Количество() + ")";
	
	// ДополнительныеПолучателиФайла
	Элементы.ГруппаДополнительныеПолучатели.Заголовок = "Дополнительные получатели (" + Объект.ДополнительныеПолучателиФайла.Количество() + ")";
	
	// ГруппаИнфПоля
	Элементы.ГруппаИнфПоля.Заголовок = "Информационные поля (" + Объект.ИнфПол.Количество() + ")";
	
	// ГруппаДокументыОснования
	Элементы.ГруппаДокументыОснования.Заголовок = "Документы основания (" + Объект.ДокументыОснования.Количество() + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокОграничений()
	
	Счетчик = 0;
	Если ЗначениеЗаполнено(Объект.УказанияВОтношенииНормПеревозки) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПрвзПищПрод) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ИныеУслв) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТемператураНеНиже) Или ЗначениеЗаполнено(Объект.ТемператураНеВыше) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВлажностьНеНиже) Или ЗначениеЗаполнено(Объект.ВлажностьНеВыше) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Элементы.ГруппаОграничения.Заголовок = "Ограничения и указания (" + Счетчик + ")";

КонецПроцедуры

&НаКлиенте
Процедура ДогОргПрвзПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяПодачиТекущим(Команда)
	
	ДатВрПод = ТекущаяДатаВЧасовомПоясе(ЧасовойПоясПогрузки);
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатВрПод");
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделительИндикаторПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#Область ДокументыОснования

&НаКлиенте
Процедура ПодборДокументовОснования(Команда)
	
	ИмяФормыДокумента = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ИмяФормыДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ИмяФормыВыбораПоТипуДокумента(ТипЗнч(Объект.ДокументОснование));
	КонецЕсли;
	
	Если ИмяФормыДокумента = Неопределено Тогда
		
		// Открываем форму выбора типа документа
		ТипыДокументаОснования = КонтурЛогистика_ОбщегоНазначенияСервер.ТипыДокументаОснования("КонтурЛогистика_ЗЗ_Титул1");
		
		Если ТипыДокументаОснования = Неопределено Тогда
			Сообщить("Не удалось определить тип документа основания!");
			Возврат;
		КонецЕсли;
		
		СЗТипыДокументаОснования = Новый СписокЗначений;
		СЗТипыДокументаОснования.ЗагрузитьЗначения(ТипыДокументаОснования);
		
		Оповещение = Новый ОписаниеОповещения("ВыборТипаДокументаОснованияЗавершение", ЭтаФорма);
		
		СЗТипыДокументаОснования.ПоказатьВыборЭлемента(Оповещение);
		
	Иначе
		
		// Сразу открываем форму выбора
		ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаДокументаОснованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ИмяФормыВыбораПоТипуДокумента(Результат.Значение);
	
	ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Ложь);
	
	Если ТипЗнч(ПолучитьФорму(ИмяФормыДокумента)) = Тип("УправляемаяФорма") Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(ИмяФормыДокумента, ПараметрыФормы, Элементы.ДокументыОснования);
	Иначе
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы, Элементы.ДокументыОснования);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнымДокументомОснования(Команда)
	
	ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ТекущиеДанные.ДокументОснование;
	
	ИзменениеДокументовОснований();
	
	УстановитьПервой(Объект.ДокументыОснования.Индекс(ТекущиеДанные), ТекущиеДанные.НомерСтроки);
	
	ПоказатьПредупреждениеПерезаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДокументовОснований()
	
	ОтрисоватьДокументыОснованияКлиент();
	Элементы.ПерезаполнитьПоДокОснованию.ЦветТекста = WebЦвета.Красный;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтрисоватьДокументыОснованияКлиент()
	
	ОтрисоватьДокументыОснованияСервер();

КонецПроцедуры

&НаСервере
Процедура ОтрисоватьДокументыОснованияСервер()
	
	КоличествоОснований = Объект.ДокументыОснования.Количество();
	Если КоличествоОснований > 1 Тогда 
		Элементы.ДекорацияНесколькоОснований.Видимость = Истина;
		Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДекорацияНесколькоОснований.Заголовок = "" + КоличествоОснований + " документов-оснований";
	Иначе
		Элементы.ДекорацияНесколькоОснований.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеПерезаполнения()
	
	ТекстПредупреждения = "Документ используемый для заполнения изменен.
		|Возможно следует перезаполнить документ.";
	КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПервой(Знач ИндексСтроки, Знач НомерСтроки)
	
	Объект.ДокументыОснования.Сдвинуть(ИндексСтроки, 1 - НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНесколькоОснованийНажатие(Элемент)
	ЭтаФорма.ТекущийЭлемент = Элементы.ДокументыОснования;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзменениеДокументовОснований();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		ОбработатьВыборДокументовОснования(ВыбранноеЗначение);
		
	Иначе
		
		ДокументыОснования = Новый Массив;
		ДокументыОснования.Добавить(ВыбранноеЗначение);
		
		ОбработатьВыборДокументовОснования(ДокументыОснования);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументовОснования(массДокументыОснования)
	
	Если массДокументыОснования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееЗначение Из массДокументыОснования Цикл
		
		ЕстьДубли = ЕстьДублиДокументовОснования(ТекущееЗначение);
		
		Если ЕстьДубли Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ТекущееЗначение;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.ДокументыОснования.Количество() <> 0 Тогда
		Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
		ПоказатьПредупреждениеПерезаполнения();
	КонецЕсли;
	
	ИзменениеДокументовОснований();
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(ВыбранноеЗначение);
		
	ЕстьДубли = ЕстьДублиДокументовОснования(ВыбранноеЗначение);
	Если ЕстьДубли Тогда
		Сообщить("В таблице уже есть выбранный документ");
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДокументОснование = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьДублиДокументовОснования(ВыбранноеЗначение)

	ЕстьДубли = Ложь;
		
	Для Каждого ТекущийДокументОснования Из Объект.ДокументыОснования Цикл
		Если ТекущийДокументОснования.ДокументОснование = ВыбранноеЗначение Тогда
			ЕстьДубли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьДубли;
	
КонецФункции	

&НаКлиенте
Процедура ДокументыОснованияПослеУдаления(Элемент)
	
	ИзменениеДокументовОснований();
	УстановитьЗаголовкиГруппамДопПолей();
	
	// Проверим, что удаленный документ основания не используется для заполнения
	ЕстьДокументЗаполнения = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.ДокументыОснования Цикл
		Если ТекущаяСтрока.ДокументОснование = Объект.ДокументОснование Тогда
			ЕстьДокументЗаполнения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьДокументЗаполнения Тогда
		Если Объект.ДокументыОснования.Количество() > 0 Тогда
			// Возьмем первый из списка
			Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
			ПоказатьПредупреждениеПерезаполнения();
		Иначе
			Объект.ДокументОснование = Неопределено;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ДатаВремяПогрузки

&НаКлиенте
Процедура ОбновитьЧасовыеПоясаМестаПогрузки()
	
	Перем НовыйЧасовойПояс;
	
	НовыйЧасовойПояс = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
		Объект.ПунктПод, "ЧасовойПояс");

		Если ЧасовойПоясПогрузки <> НовыйЧасовойПояс Тогда
			
		// Пересчитаем время
		ДатВрПод = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			ДатВрПод, ЧасовойПоясПогрузки, НовыйЧасовойПояс);
			
		ПредВрПод = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			ПредВрПод, ЧасовойПоясПогрузки, НовыйЧасовойПояс);
		
		ЧасовойПоясПогрузки = НовыйЧасовойПояс;
		Элементы.ГруппаДатаИВремя.Заголовок = ЗаголовокДатИВременПогрузки(ЧасовойПоясПогрузки);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаВЧасовомПоясе(ЧасовойПояс)
	
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(ТекущаяДата(), Неопределено, ЧасовойПояс);
	Иначе
		Возврат ТекущаяДата();
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокДатИВременПогрузки(ЧасовойПояс)
	
	Заголовок = "Даты и время";
	
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		Заголовок = Заголовок + " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредставлениеЧасовогоПоясаЛок(ЧасовойПояс);
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДатыПогрузкиЛокальные()
	
	ЧасовойПоясПогрузки = Объект.ПунктПод.ЧасовойПояс;
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		ДатВрПод = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Объект.ДатВрПод, Неопределено, ЧасовойПоясПогрузки);
		ПредВрПод = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Объект.ПредВрПод, Неопределено, ЧасовойПоясПогрузки);
	Иначе
		ДатВрПод = Объект.ДатВрПод;
		ПредВрПод = Объект.ПредВрПод;
	КонецЕсли;
	
	Элементы.ГруппаДатаИВремя.Заголовок = ЗаголовокДатИВременПогрузки(ЧасовойПоясПогрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыПогрузкиОбъекта()
	
	ТекущийОбъект = Объект;
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		ТекущийОбъект.ДатВрПод = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			ДатВрПод, ЧасовойПоясПогрузки);
		ТекущийОбъект.ПредВрПод = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			ПредВрПод, ЧасовойПоясПогрузки);
	Иначе
		ТекущийОбъект.ДатВрПод = ДатВрПод;
		ТекущийОбъект.ПредВрПод = ПредВрПод;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуПогрузкиОбъекта(Форма, ЧасовойПоясПогрузки, ИмяРеквизита)
	
	РеквизитФормы = Форма[ИмяРеквизита];
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		Форма.Объект[ИмяРеквизита] = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(РеквизитФормы, ЧасовойПоясПогрузки);
	Иначе
		Форма.Объект[ИмяРеквизита] = РеквизитФормы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции