
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ТипДокументаЛогистика") И Параметры.Свойство("СпецСценарий") Тогда		
		ТипДокументаЛогистика = Параметры.ТипДокументаЛогистика;
		СпецСценарий 		  = Параметры.СпецСценарий;
	Иначе		
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
	Заголовок = Заголовок + " (" + ТипДокументаЛогистика + ")";
	
	Если Не КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ГруппаПредупреждениеERP.Видимость = Ложь;
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ИмяКонфигурации = "УФ_УТ"
			Или ИмяКонфигурации = "ERP" 
			Или ИмяКонфигурации = "КА_2" Тогда
			 
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда		
			ПроверятьПоказБаннераДублирования = Истина;			
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеБезДокумента();
	
	ПеречитатьСписокНастроек();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиКонвертацииДокументов

&НаКлиенте
Процедура НастройкиКонвертацииДокументовВключеноПриИзменении(Элемент)
	
	Модифицированность = Истина;
	Элементы.ФормаПрименить.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКонвертацииДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	ПерейтиКНастройкамКонвертации(ДанныеСтроки.ТипДокумента1С)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	ОповещениеОтмена = Новый ОписаниеОповещения("ОбработчикПрименить", ЭтаФорма);
	ПоказатьВопрос(ОповещениеОтмена, "Вы уверены?", РежимДиалогаВопрос.ДаНет,,, "Применить изменения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПрименить(КодВозврата = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда
		ОбработатьВыбор();
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ОповещениеОтмена = Новый ОписаниеОповещения("ОбработчикОтменить", ЭтаФорма);
	ПоказатьВопрос(ОповещениеОтмена, "Вы уверены?", РежимДиалогаВопрос.ДаНет,,, "Отменить изменения"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОтменить(КодВозврата = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроек(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаСписка",,
		ЭтаФорма, ЭтаФорма, "ОбработчикПеречитатьСписокНастроек");	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТипДокументаЛогистика", ТипДокументаЛогистика);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаЭлемента",
		ПараметрыОткрытия, ЭтаФорма, ЭтаФорма, "ОбработчикПеречитатьСписокНастроек");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВыбор()
	
	// Проходим по таблице настроек, сравниваем с настройками до изменения, и построчно делаем следующее:
	//		- Если сняли галку, то создаем заглушку, или в существующей настройке снимаем галку ВыводитьЗадачи
	//		- Если поставили галку, возвращаем галку на настройку или заглушку (заглушка могла быть не заглушкой, с временным снятием галки)
	
	Для Каждого СтрокаНастроек Из НастройкиКонвертацииДокументов Цикл
		
		НайденныеСтрокиНастроек = НастройкиКонвертацииДокументов_ДоИзменения.НайтиСтроки(
			Новый Структура("ТипДокумента1С", СтрокаНастроек.ТипДокумента1С));
			
		Если НайденныеСтрокиНастроек.Количество() > 0 
			И НайденныеСтрокиНастроек[0].ВыводитьЗадачи <> СтрокаНастроек.ВыводитьЗадачи Тогда
			
			КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
					ТипДокументаЛогистика, СтрокаНастроек.ТипДокумента1С, СпецСценарий);
		
			Если СтрокаНастроек.ВыводитьЗадачи Тогда				
					
				Если КонтекстНастройкиКонвертации.НастройкаКонвертации <> Неопределено Тогда
					НастройкаКонвертацииОбъект = КонтекстНастройкиКонвертации.НастройкаКонвертации.ПолучитьОбъект();
					НастройкаКонвертацииОбъект.ВыводитьЗадачи = Истина;
					НастройкаКонвертацииОбъект.Записать();
				КонецЕсли;
				
			Иначе
				
				Если КонтекстНастройкиКонвертации.НастройкаКонвертации <> Неопределено Тогда
					НастройкаКонвертацииОбъект = КонтекстНастройкиКонвертации.НастройкаКонвертации.ПолучитьОбъект();
					НастройкаКонвертацииОбъект.ВыводитьЗадачи = Ложь;
					НастройкаКонвертацииОбъект.Записать();
				Иначе
					
					НастройкаКонвертацииОбъект = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СоздатьЭлемент();
										
					СвойстваТиповойНастройки = КонтурЛогистика_КонвертацияСерверПовтИсп.СвойстваТиповойНастройкиКонвертацииДокументовДоступныеДляРедактирования();
					Для Каждого ИмяСвойства Из СвойстваТиповойНастройки Цикл
						ТекущееЗначение = КонтекстНастройкиКонвертации[ИмяСвойства];
						Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
							НастройкаКонвертацииОбъект[ИмяСвойства] = ТекущееЗначение;
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого ИмяЭлемента Из МассивИменЭлементовСоСпискомВыбораРеквизита() Цикл
			
						ТиповойПуть = КонтекстНастройкиКонвертации.ПутиРеквизитовУчетногоДокумента[ИмяЭлемента];
						Если ЗначениеЗаполнено(ТиповойПуть) Тогда
							НастройкаКонвертацииОбъект[ИмяЭлемента] = ТиповойПуть;
						Иначе
							НастройкаКонвертацииОбъект[ИмяЭлемента] = "";
						КонецЕсли;
						
					КонецЦикла;
					
					ЗаполнитьЗначенияСвойств(НастройкаКонвертацииОбъект, КонтекстНастройкиКонвертации);
					УстановитьЗаголовок(НастройкаКонвертацииОбъект);
					НастройкаКонвертацииОбъект.ВыводитьЗадачи = Ложь;
					НастройкаКонвертацииОбъект.Записать();
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПерейтиКНастройкамКонвертации(ТипДокумента1С)
	
	НастройкиКонфигураций = Новый Массив;
		
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ТипДокументаЛогистика, ТипДокумента1С);
	Если КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации Тогда
		
		НастройкиКонфигураций.Добавить(КонтекстНастройкиКонвертации.НастройкаКонвертации);
		
	Иначе
		
		// Откроем пустую
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ТипДокументаЛогистика", ТипДокументаЛогистика);
		ПараметрыОткрытия.Вставить("ТипДокумента1С", ТипДокумента1С);
		ПараметрыОткрытия.Вставить("Тип", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыНастроекКонвертаций.Основная"));
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаЭлемента",
			ПараметрыОткрытия, ЭтаФорма, ЭтаФорма, "ОбработчикПеречитатьСписокНастроек");
		
		Возврат;
		
	КонецЕсли;
		
	Если НастройкиКонфигураций.Количество() = 0 Тогда
		Сообщить("Выберите конкретный тип документа.");
	КонецЕсли;
	
	Для Каждого ТекущаяНастройкаКонфигурации Из НастройкиКонфигураций Цикл
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаЭлемента", Новый Структура("Ключ", ТекущаяНастройкаКонфигурации),
			ЭтаФорма, ЭтаФорма, "ОбработчикПеречитатьСписокНастроек");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьСписокНастроек(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ОбновитьПовторноИспользуемыеЗначения();  // в случае непосредственного удаления НКД надо сбросить ПовтИсп
	ПеречитатьСписокНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьСписокНастроек()
	
	НастройкиКонвертацииДокументов.Очистить();
	НастройкиКонвертацииДокументов_ДоИзменения.Очистить();
	
	ТиповыеТипыДокументов1С = КонтурЛогистика_КонвертацияСерверПовтИсп.ПоддерживаемыеТипыДокументовКонфигурации1С(
		ТипДокументаЛогистика, СпецСценарий);	
	МассивНастроекКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МассивНастроекКонвертацииПоТипуЛогистики(
		ТипДокументаЛогистика);
	
	Для Каждого ТиповойТип Из ТиповыеТипыДокументов1С Цикл
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			ТипДокументаЛогистика, ТиповойТип, СпецСценарий);
				
		НоваяСтрокаНастроек = НастройкиКонвертацииДокументов.Добавить();
			
		ЗаполнитьСтрокуНастроекКонвертации(НоваяСтрокаНастроек, КонтекстНастройкиКонвертации);
		
		Если КонтекстНастройкиКонвертации.НастройкаКонвертации = Неопределено Тогда
			НоваяСтрокаНастроек.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Основная;
		Иначе
			НоваяСтрокаНастроек.Тип = КонтекстНастройкиКонвертации.НастройкаКонвертации.Тип;
		КонецЕсли;		
				
	КонецЦикла;
	
	Для Каждого НастройкаКонвертации Из МассивНастроекКонвертации Цикл
		
		НайденныеСтрокиНастроек = НастройкиКонвертацииДокументов.НайтиСтроки(
			Новый Структура("ТипДокумента1С", НастройкаКонвертации.ТипДокумента1С));
		
		Если НайденныеСтрокиНастроек.Количество() = 0 Тогда
			
			НоваяСтрокаНастроек = НастройкиКонвертацииДокументов.Добавить();
			
			ЗаполнитьСтрокуНастроекКонвертации(НоваяСтрокаНастроек, НастройкаКонвертации);
			
			НоваяСтрокаНастроек.Тип	= НастройкаКонвертации.Тип;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВременнаяТаблица = НастройкиКонвертацииДокументов.Выгрузить();
	НастройкиКонвертацииДокументов_ДоИзменения.Загрузить(ВременнаяТаблица);
	
	Если ПроверятьПоказБаннераДублирования Тогда		
		ПроверитьИПоказатьБаннерДублирования();			
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуНастроекКонвертации(НоваяСтрокаНастроек, КонтекстНастройкиКонвертации)
	
	НоваяСтрокаНастроек.ТипДокумента1С 				= КонтекстНастройкиКонвертации.ТипДокумента1С;
	НоваяСтрокаНастроек.НаправлениеКонвертации		= КонтекстНастройкиКонвертации.НаправлениеКонвертации;
	НоваяСтрокаНастроек.Сценарий					= КонтекстНастройкиКонвертации.Сценарий;
	НоваяСтрокаНастроек.ВыводитьЗадачи 				= КонтекстНастройкиКонвертации.ВыводитьЗадачи;
	
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ТипДокумента1С) Тогда
		НоваяСтрокаНастроек.ТипДокумента1СПредставление = Метаданные.Документы[КонтекстНастройкиКонвертации.ТипДокумента1С].Синоним;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МассивИменЭлементовСоСпискомВыбораРеквизита()
	
	МассивИменЭлементовСоСпискомВыбораРеквизита = Новый Массив;
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьОрганизация");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьКонтрагент");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьГрузоотправитель");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьПеревозчик");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьГрузополучатель");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьМестоПогрузки");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьМестоДоставки");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьНомерТРН");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьДатаТРН");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьВодитель");
	МассивИменЭлементовСоСпискомВыбораРеквизита.Добавить("ПутьТранспортноеСредство");
	
	Возврат МассивИменЭлементовСоСпискомВыбораРеквизита;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовок(НастройкаКонвертацииОбъект)
	
	Попытка
		
		Если ЗначениеЗаполнено(НастройкаКонвертацииОбъект.ТипДокумента1С) Тогда
			НастройкаКонвертацииОбъект.Наименование = "" + НастройкаКонвертацииОбъект.ТипДокументаЛогистика + " по " + НастройкаКонвертацииОбъект.ТипДокумента1С;
		ИначеЕсли НастройкаКонвертацииОбъект.ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1")
			Или НастройкаКонвертацииОбъект.ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1")
			Или НастройкаКонвертацииОбъект.ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02")
			Или НастройкаКонвертацииОбъект.ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1") Тогда
			
			НастройкаКонвертацииОбъект.Наименование = "" + НастройкаКонвертацииОбъект.ТипДокументаЛогистика + " ввод вручную";
		Иначе
			НастройкаКонвертацииОбъект.Наименование = "" + НастройкаКонвертацииОбъект.ТипДокументаЛогистика + " по предыдущему титулу";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастройкаКонвертацииОбъект.ТипДополнительногоСвязанногоДокумента) И ЗначениеЗаполнено(НастройкаКонвертацииОбъект.Родитель) Тогда
			НастройкаКонвертацииОбъект.Наименование = "" + НастройкаКонвертацииОбъект.ТипДополнительногоСвязанногоДокумента + " - " + НастройкаКонвертацииОбъект.Наименование;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастройкаКонвертацииОбъект.СпецСценарий) Тогда
			НастройкаКонвертацииОбъект.Наименование = НастройкаКонвертацииОбъект.Наименование + ", " + НРег(НастройкаКонвертацииОбъект.СпецСценарий);
		КонецЕсли;
		
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИПоказатьБаннерДублирования()
	
	КакойБаннерПоказывать = КакойБаннерДублированияПоказывать();
		
	Элементы.ТекстПредупреждениеERP.Заголовок = "Задачи по документам ""ОсновнойДокумент"" и ""Документ"" могут дублировать друг друга. Рекомендуется отключить один из этих документов.";
	
	Если КакойБаннерПоказывать = Неопределено Тогда
		Элементы.ГруппаПредупреждениеERP.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПредупреждениеERP.Видимость = Истина;
		Элементы.ТекстПредупреждениеERP.Заголовок =
			СтрЗаменить(Элементы.ТекстПредупреждениеERP.Заголовок, "ОсновнойДокумент",
				КакойБаннерПоказывать.ОсновнойТипДокумента1С);
		Элементы.ТекстПредупреждениеERP.Заголовок =
			СтрЗаменить(Элементы.ТекстПредупреждениеERP.Заголовок, "Документ",
				КакойБаннерПоказывать.ТипДокумента1С);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция КакойБаннерДублированияПоказывать()
	
	Если ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда	
		ОсновнойТипДокумента1С = "ТранспортнаяНакладная";	
	ИначеЕсли ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда
		ОсновнойТипДокумента1С = "ПоручениеЭкспедитору";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
	СтрокиОсновнойДокумент = НастройкиКонвертацииДокументов.НайтиСтроки(
		Новый Структура("ВыводитьЗадачи, ТипДокумента1С", Истина, ОсновнойТипДокумента1С));			
	Если СтрокиОсновнойДокумент.Количество() > 0 Тогда
			
		СтрокиРеализацияТоваровУслуг = НастройкиКонвертацииДокументов.НайтиСтроки(
			Новый Структура("ВыводитьЗадачи, ТипДокумента1С", Истина, "РеализацияТоваровУслуг"));
		Если СтрокиРеализацияТоваровУслуг.Количество() > 0 Тогда
			Возврат Новый Структура("ОсновнойТипДокумента1С, ТипДокумента1С",
				СтрокиОсновнойДокумент[0].ТипДокумента1СПредставление,
				СтрокиРеализацияТоваровУслуг[0].ТипДокумента1СПредставление);
		Иначе
			
			СтрокиПеремещениеТоваров = НастройкиКонвертацииДокументов.НайтиСтроки(
				Новый Структура("ВыводитьЗадачи, ТипДокумента1С", Истина, "ПеремещениеТоваров"));
			Если СтрокиПеремещениеТоваров.Количество() > 0 Тогда
				Возврат Новый Структура("ОсновнойТипДокумента1С, ТипДокумента1С",
					СтрокиОсновнойДокумент[0].ТипДокумента1СПредставление,
					СтрокиПеремещениеТоваров[0].ТипДокумента1СПредставление);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ДобавитьУсловноеОформлениеБезДокумента()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Без документа");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НастройкиКонвертацииДокументов.ТипДокумента1СПредставление");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.Использование  = Истина;
	
	ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НастройкиКонвертацииДокументовТипДокументаПредставление");
	ПолеОформления.Использование = Истина;	
	
КонецПроцедуры

#КонецОбласти
