
&НаКлиенте
Процедура Распознать(Команда)
	
	РаспознанныеУИД.Очистить();
	
	МассивУИД = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ТекстСКодами, "," + Символы.ПС + " ", Ложь);
	
	ПроверитьЗагрузитьУИДы(МассивУИД);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗагрузитьУИДы(МассивУИД)

	ДлинаУИД = 36;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УИДы.УИД КАК УИД
	               |ПОМЕСТИТЬ ВТ_УИДы
	               |ИЗ
	               |	&УИДы КАК УИДы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_УИДы.УИД КАК УИД,
	               |	ВЫБОР
	               |		КОГДА КонтурЛогистика_УИДыГИС.Использован ЕСТЬ NULL
	               |			ТОГДА ""ОК""
	               |		КОГДА КонтурЛогистика_УИДыГИС.Использован = ИСТИНА
	               |			ТОГДА ""Уже использован""
	               |		ИНАЧЕ ""Уже был загружен""
	               |	КОНЕЦ КАК Статус
	               |ИЗ
	               |	ВТ_УИДы КАК ВТ_УИДы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
	               |		ПО ВТ_УИДы.УИД = КонтурЛогистика_УИДыГИС.УИД";

	ОписаниеТипаУИД = Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(ДлинаУИД, ДопустимаяДлина.Фиксированная));
	
	ТаблицаУИД = Новый ТаблицаЗначений;
	ТаблицаУИД.Колонки.Добавить("УИД", ОписаниеТипаУИД);
	
	Для НомерСтроки = 1 По МассивУИД.Количество() Цикл
		ТаблицаУИД.Добавить();
	КонецЦикла;	
	
	ТаблицаУИД.ЗагрузитьКолонку(МассивУИД, "УИД");
	Запрос.УстановитьПараметр("УИДы", ТаблицаУИД);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	НомерСтроки = 0;
	ЕстьОшибки = Ложь;

	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		НоваяСТрокаУИД = РаспознанныеУИД.Добавить();
		НоваяСТрокаУИД.НомерСтроки = НомерСтроки;
		НоваяСТрокаУИД.УИД = Выборка.УИД;
		НоваяСТрокаУИД.Статус = Выборка.Статус;

		Если СтрДлина(СокрЛП(НоваяСТрокаУИД.УИД)) <> ДлинаУИД Тогда 
			НоваяСТрокаУИД.Статус = "Длина не равна 36";
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьОшибки Тогда
		Сообщить("ВНИМАНИЕ Есть ошибочные УИД");
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Для Каждого СтрокаУИД из РаспознанныеУИД Цикл 
		
		Если СтрокаУИД.Статус = "ОК"
			Или СтрокаУИД.Статус = "Уже использован"
			Или СтрокаУИД.Статус = "Уже был загружен" Тогда
			
			МассивЗагрузки = Новый Массив;
			МассивЗагрузки.Добавить(СтрокаУИД.УИД);
			
			СтрокаУИД.Статус = "Загружен";
			
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрыСведений.КонтурЛогистика_УИДыГИС.ЗагрузитьМассивУИДов(МассивЗагрузки, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Сообщить("Выберите организацию");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.КонтурЛогистика_УИДыГИС"));
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознанныеУИДПриИзменении(Элемент)
		
	Если СтрДлина(СокрЛП(Элемент.ТекущиеДанные.УИД)) <> 36 Тогда 
		Элемент.ТекущиеДанные.Статус = "Длина не равна 36";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ДоступныеОрганизации = НашиОрганизации();
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборСписка.ПравоеЗначение = ДоступныеОрганизации;
	ОтборСписка.Использование = Истина;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);
	ПараметрыВыбора.Вставить("СкрытьОтбор");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, ЭтаФорма, "ОбработчикВыбораОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораОрганизации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ВыбранноеЗначение;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция НашиОрганизации()	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();			
КонецФункции
