#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(ИнициализацияРасширения = Ложь, ТолькоНеинициализированные = Ложь, ИнициализацияИзСтартовогоПомощника = Ложь, ОбновлятьОписание = Ложь) Экспорт
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	Если ИнициализацияИзСтартовогоПомощника Тогда
		ТаблицаНастроекПоУмолчанию = ТаблицаНастроекПоУмолчанию(ИнициализацияИзСтартовогоПомощника);
	Иначе
		ТаблицаНастроекПоУмолчанию = ПолучитьТаблицуНастроекПоУмолчанию();
	КонецЕсли;
	
	КопияТаблицы = ТаблицаНастроекПоУмолчанию.Скопировать(, "РодительИмяНастройки");
	КопияТаблицы.Свернуть("РодительИмяНастройки");
	МассивРодителей = КопияТаблицы.ВыгрузитьКолонку("РодительИмяНастройки");
	
	Если Не ЗначениеЗаполнено(ТаблицаНастроекПоУмолчанию) Тогда
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Общие настройки не найдены";
		
		Возврат Результат;
		
	КонецЕсли;
	
	Для Каждого СтрокаНастройки Из ТаблицаНастроекПоУмолчанию Цикл
		
		Если ЗначениеЗаполнено(СтрокаНастройки.Ссылка) Тогда
			
			// Пропускаем группы
			Если СтрокаНастройки.Ссылка.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			
			// Если требуется, то установим значение по умолчанию
			Если Не ТолькоНеинициализированные Тогда
				УстановитьНастройкеЗначениеПоУмолчанию(СтрокаНастройки.Ссылка, ТаблицаНастроекПоУмолчанию);
			КонецЕсли;
			
			Если ОбновлятьОписание Тогда
				
				ОписаниеДляЗаписи = ОписаниеНастройкиДляЗаписи(СтрокаНастройки);
				
				Если ОписаниеДляЗаписи <> СтрокаНастройки.Ссылка.Описание
					Или СтрокаНастройки.Наименование <> СтрокаНастройки.Ссылка.Наименование Тогда
					
					НастройкаОбъект = СтрокаНастройки.Ссылка.ПолучитьОбъект();
					НастройкаОбъект.Описание = ОписаниеДляЗаписи;
					НастройкаОбъект.Наименование = СтрокаНастройки.Наименование;
					НастройкаОбъект.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если МассивРодителей.Найти(СтрокаНастройки.ИмяНастройки) <> Неопределено
				Или СтрокаНастройки.ТипЗначения = "" Тогда
				
				НастройкаОбъект = Справочники.КонтурЛогистика_Настройки.СоздатьГруппу();
				Если ЗначениеЗаполнено(СтрокаНастройки.РодительИмяНастройки) Тогда
					НастройкаОбъект.Родитель = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
						"ИмяПредопределенногоДляРасширения", СтрокаНастройки.РодительИмяНастройки);
				КонецЕсли;
				НастройкаОбъект.ИмяПредопределенногоДляРасширения = СтрокаНастройки.ИмяНастройки;
				НастройкаОбъект.Наименование = СтрокаНастройки.Наименование;
				НастройкаОбъект.Записать();
				
			Иначе
				
				// Еще раз проверить что настройка не была создана (могла быть создана в другом сеансе)
				ПроверкаНастройка = НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", СтрокаНастройки.ИмяНастройки);
				Если Не ПроверкаНастройка.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				// Создадим новую настройку
				НастройкаОбъект = Справочники.КонтурЛогистика_Настройки.СоздатьЭлемент();
				НастройкаОбъект.Родитель = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
					"ИмяПредопределенногоДляРасширения", СтрокаНастройки.РодительИмяНастройки);
				
				Если НастройкаОбъект.Родитель.Пустая() И ЗначениеЗаполнено(СтрокаНастройки.РодительИмяНастройки) Тогда
					Сообщить("Для настройки " + СтрокаНастройки.Наименование
						+ " не удалось определить родителя (в какую группу добавить)");
				КонецЕсли;
				
				НастройкаОбъект.ИмяПредопределенногоДляРасширения = СтрокаНастройки.ИмяНастройки;
				НастройкаОбъект.Наименование = СтрокаНастройки.Наименование;
				НастройкаОбъект.Записать();
				
				СтрокаНастройки.Ссылка = НастройкаОбъект.Ссылка;
				
				УстановитьНастройкеЗначениеПоУмолчанию(СтрокаНастройки.Ссылка, ТаблицаНастроекПоУмолчанию);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Обновим состав отображаемых в панели документов
	НастройкаОтображатьПанельВУчетныхДокументах = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "ОтображатьПанельВУчетныхДокументах");
	Если Не НастройкаОтображатьПанельВУчетныхДокументах.Пустая()
		И НастройкаОтображатьПанельВУчетныхДокументах.Значение = Истина Тогда
		// Группа настроек
		ГруппаНастроек = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
			"ИмяПредопределенногоДляРасширения", "НастройкиОтображенияПанелиВУчетныхДокументах");
		Если Не ГруппаНастроек.Пустая() Тогда
			// Добавим настройки по документам
			КонтурЛогистика_ИнтеграцияТиповыеСервер.СоздатьНастройкиОтображенияУчетныхДокументовВРасширении();
		КонецЕсли;
	КонецЕсли;
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеНастройки(ИмяПредопределенного, Партнер = Неопределено) Экспорт
	
	НастройкаСсылка = ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	
	текЗначение = НастройкаСсылка.Значение;
	
	Если текЗначение <> Неопределено 
		И ТипЗнч(текЗначение) <> Тип(НастройкаСсылка.ТипЗначения)
		И ИмяПредопределенного <> "EDI_ПутьКМодулю" 
		И ИмяПредопределенного <> "ПодключаемыйМодульПуть" Тогда 
		Сообщить("Значение настройки " + ИмяПредопределенного + " не соответсвует по типу значения! Ожидаем: " + Тип(НастройкаСсылка.ТипЗначения) );
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(текЗначение) Тогда
		
		Если ИмяПредопределенного = "КлючРазработчика" Тогда 
			
			текЗначение = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КлючРазработчикаДиадок();
			ДвоичныеДанные = Base64Значение(текЗначение);
			текЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтрокуИзДвоичныхДанныхЛок(ДвоичныеДанные);
			
		ИначеЕсли ИмяПредопределенного = "ПарольAPIТелеграм" Тогда
			
			текЗначение = КонтурЛогистика_РаботаСТелеграм.КлючAPI();
			
		КонецЕсли;
		
	Иначе
		
		Если ИмяПредопределенного = "КлючРазработчикаДиадокTestkontur"
			Или ИмяПредопределенного = "КлючРазработчика" Тогда			
			ДвоичныеДанные = Base64Значение(текЗначение);
			текЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтрокуИзДвоичныхДанныхЛок(ДвоичныеДанные);						
		КонецЕсли;
		
	КонецЕсли;
	
	// Если заполнен партнер  - пробуем найти эту настройку у него
	Если ЗначениеЗаполнено(Партнер) Тогда
		
		ЗначениеНастройкиВПартнере = Справочники.КонтурЛогистика_Партнеры.ЗначениеНастройки(Партнер, НастройкаСсылка);
		Если ЗначениеЗаполнено(ЗначениеНастройкиВПартнере) Тогда 
			текЗначение = ЗначениеНастройкиВПартнере;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат текЗначение;
	
КонецФункции

// Возвращает список значений настройки
//
// Параметры:
//  Настройка	 - СправочникСсылка.КонтурЛогистика_Настройки	 - настрйока.
// 
// Возвращаемое значение:
//  Массив - значения из саписка значений
//
Функция СписокЗначенийНастройки(Настройка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройка", Настройка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСписокЗначений.Значение КАК Значение
	|ИЗ
	|	Справочник.КонтурЛогистика_Настройки.СписокЗначений КАК КонтурЛогистика_НастройкиСписокЗначений
	|ГДЕ
	|	КонтурЛогистика_НастройкиСписокЗначений.Ссылка = &Настройка";
	
	МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат МассивЗначений;
	
КонецФункции

Функция ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного, ПробоватьСоздаватьПриОтсутствии = Истина) Экспорт
	
	Если ТипЗнч(ИмяПредопределенного) <> Тип("Строка") Тогда
		Если ТипЗнч(ИмяПредопределенного) = Тип("СправочникСсылка.КонтурЛогистика_Настройки")
				И НЕ КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Устаревший тип наименования настройки (ожидается строка): " + ИмяПредопределенного;
			Сообщение.Сообщить();
			Возврат ИмяПредопределенного;
			
		Иначе
			
			ВызватьИсключение "Неверный тип наименования настройки (ожидается строка): " + ИмяПредопределенного;					
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкаСсылка = НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяПредопределенного);
	
	Если НастройкаСсылка.Пустая() И ПробоватьСоздаватьПриОтсутствии = Истина Тогда // возможно её просто не в справочнике
		
		ОбновитьПовторноИспользуемыеЗначения();
		ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(, Истина); // истина - только неинициализированные
		ОбновитьПовторноИспользуемыеЗначения();

		НастройкаСсылка = НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяПредопределенного);
		
	КонецЕсли;
	
	Если НастройкаСсылка.Пустая() Тогда
		
		Если ПробоватьСоздаватьПриОтсутствии = Истина Тогда 
			ВызватьИсключение "Попытка получить значение неизвестной настройки " + ИмяПредопределенного;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НастройкаСсылка;
	
КонецФункции

Процедура УстановитьНастройкеЗначениеПоУмолчанию(НастройкаСсылка, ТаблицаНастроекПоУмолчанию = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// не возвращаем к дефолту эти настройки:
	Если НастройкаСсылка = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", "СлужебныйИдентификаторБазыДанных") Тогда 
		
		Если ЗначениеЗаполнено(НастройкаСсылка.Значение) Тогда
		
			Возврат;	
		
		КонецЕсли;
		
	КонецЕсли;
	
	// настройки можно скинуть в дефолт
	
	Если ТаблицаНастроекПоУмолчанию = Неопределено Тогда 
		ТаблицаНастроекПоУмолчанию = ПолучитьТаблицуНастроекПоУмолчанию();
	КонецЕсли;
	
	Попытка  // на 8.2 нет Имя_Предопределенных_Данных
		
		НайденноеУмолчание = ТаблицаНастроекПоУмолчанию.Найти(НастройкаСсылка, "Ссылка");
		
	Исключение
		
	    НайденноеУмолчание = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Настройка: " + НастройкаСсылка + " >>> Очень старая версия платформы, заполнение значения по умолчанию не реализовано";
		Сообщение.Сообщить();
		
	КонецПопытки;	
	
	Если ЗначениеЗаполнено(НайденноеУмолчание) Тогда 
		
		Если НастройкаСсылка.ТипЗначения <> НайденноеУмолчание.ТипЗначения 
			ИЛИ НастройкаСсылка.Описание <> НайденноеУмолчание.Описание
			ИЛИ (ЗначениеЗаполнено(НайденноеУмолчание.Значение) И НастройкаСсылка.Значение <> НайденноеУмолчание.Значение) Тогда 
			
			Попытка
				
				НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(НастройкаОбъект, НайденноеУмолчание, "ТипЗначения, Описание");
				Если ЗначениеЗаполнено(НайденноеУмолчание.Значение) ИЛИ 
					(НайденноеУмолчание.ТипЗначения = "Число" И НайденноеУмолчание.Значение = 0) Тогда 
					ЗаполнитьЗначенияСвойств(НастройкаОбъект, НайденноеУмолчание, "Значение");
				КонецЕсли;
				
				УстановитьОписаниеТипаШаблонаДляОтправкиКонтрагенту(НастройкаОбъект);
				
				НастройкаОбъект.Записать();
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось записать значение по умолчанию для настройки: " + НастройкаСсылка.Наименование;
				Сообщение.УстановитьДанные(НастройкаСсылка);
				Сообщение.Сообщить();
				
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура УстановитьНастройку(ИмяПредопределенного, УстанавливаемоеЗначение) Экспорт
	
	НастройкаСсылка = ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
	НастройкаОбъект.Прочитать();
	
	Если НастройкаОбъект.Значение <> УстанавливаемоеЗначение Тогда
		
		НастройкаОбъект.Значение = УстанавливаемоеЗначение;
		НастройкаОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройку(ИмяПредопределенного) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкаСсылка = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	
	// Не возвращаем к дефолту эти настройки:
	Если НастройкаСсылка = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту(
		"ИмяПредопределенногоДляРасширения", "СлужебныйИдентификаторБазыДанных") Тогда
		
		Если ЗначениеЗаполнено(НастройкаСсылка.Значение) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// Настройки можно скинуть в дефолт
	ТаблицаНастроекПоУмолчанию = ПолучитьТаблицуНастроекПоУмолчанию();
	
	// На 8.2 нет Имя_Предопределенных_Данных
	Попытка
		НайденноеУмолчание = ТаблицаНастроекПоУмолчанию.Найти(НастройкаСсылка, "Ссылка");
	Исключение
		НайденноеУмолчание = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Настройка: " + НастройкаСсылка
			+ " >>> Очень старая версия платформы, заполнение значения по умолчанию не реализовано";
		Сообщение.Сообщить();
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(НайденноеУмолчание) Тогда 
		Возврат;
	КонецЕсли;
	
	Попытка
		
		НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
		
		ЗаполнитьЗначенияСвойств(НастройкаОбъект, НайденноеУмолчание, "Наименование, ТипЗначения, Описание");
		
		НастройкаОбъект.Записать();
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать значение по умолчанию для настройки: " + НастройкаСсылка.Наименование;
		Сообщение.УстановитьДанные(НастройкаСсылка);
		Сообщение.Сообщить();
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТаблицуНастроекПоУмолчанию() Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТаблицуНастроекПоУмолчанию();
	
КонецФункции

Функция ТаблицаНастроекПоУмолчанию(ИнициализацияИзСтартовогоПомощника = Ложь) Экспорт
	
	ТаблицаНастроек = ИнициализироватьТаблицуНастроек();
	
	Если ИнициализацияИзСтартовогоПомощника Тогда
		ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСервер.ОпределитьКонфигурацию();
	Иначе
		ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	КонецЕсли;
	
	ДобавитьГруппу_ОбщиеНастройки(ТаблицаНастроек);
	ДобавитьГруппу_НастройкиКонвертации(ТаблицаНастроек, ИмяКонфигурации);
	ДобавитьГруппу_НастройкиДокументов(ТаблицаНастроек);
	ДобавитьГруппу_НастройкиПодключения(ТаблицаНастроек);
	ДобавитьГруппу_НастройкиАрхива(ТаблицаНастроек);
	ДобавитьГруппу_СлужебныеНастройки(ТаблицаНастроек, ИмяКонфигурации);
	ДобавитьГруппу_НастройкиКриптографии(ТаблицаНастроек);
	ДобавитьГруппу_НастройкиПечати(ТаблицаНастроек);
	ДобавитьГруппу_ПЛ_РМ(ТаблицаНастроек);
	ДобавитьГруппу_СвоиНастройки(ТаблицаНастроек);
	ДобавитьГруппу_КонтактыАдминистратора(ТаблицаНастроек);
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Функция ПолучитьГруппу_ОсобенностиХраненияДанных(ИнициализацияИзСтартовогоПомощника) Экспорт
	
	ТаблицаНастроек = ИнициализироватьТаблицуНастроек();
	
	Если ИнициализацияИзСтартовогоПомощника Тогда
		ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСервер.ОпределитьКонфигурацию();
	Иначе
		ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	КонецЕсли;
	
	ДобавитьГруппу_ОсобенностиХраненияДанных(ТаблицаНастроек, "СлужебныеНастройки", ИмяКонфигурации);
	
	Возврат ТаблицаНастроек;
	
КонецФункции	

Функция ИнициализироватьТаблицуНастроек()
	
	// Инициализируем таблицу хранения
	ТаблицаНастроек = Новый ТаблицаЗначений;
	
	ОписаниеСтроки100 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная));
	ОписаниеСтроки150 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
	ОписаниеСтроки200 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
	ОписаниеСтроки0 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	
	ТаблицаНастроек.Колонки.Добавить("Наименование", ОписаниеСтроки150);
	ТаблицаНастроек.Колонки.Добавить("ИмяНастройки", ОписаниеСтроки100);
	ТаблицаНастроек.Колонки.Добавить("РодительИмяНастройки", ОписаниеСтроки100);
	ТаблицаНастроек.Колонки.Добавить("Значение");
	ТаблицаНастроек.Колонки.Добавить("ТипЗначения", ОписаниеСтроки200);
	ТаблицаНастроек.Колонки.Добавить("Описание", ОписаниеСтроки0);
	ТаблицаНастроек.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_Настройки"));
	
	Возврат ТаблицаНастроек; 
	
КонецФункции	

// Добавить строку настроек
//
// Параметры:
//  ТаблицаНастроек	 - ТаблицаЗначений	 - Таблица с данными
//  ИмяРодителя		 - Строка	 - Имя родителя
//  Наименование	 - Строка	 - Наименование (синоним)
//  ИмяНастройки	 - Строка	 - Имя предопределенного
//  ТипЗначения		 - Строка	 - Тип (для групп не указывается)
//  Значение		 - Строка	 - Значение по умолчанию (для групп не указывается)
//  Описание		 - Строка	 - Описание
//
Процедура ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя, Наименование, ИмяНастройки, ТипЗначения, Значение, Описание)
	
	НоваяСтрокаТаблицы = ТаблицаНастроек.Добавить();
	НоваяСтрокаТаблицы.Наименование = Наименование;
	НоваяСтрокаТаблицы.ИмяНастройки = ИмяНастройки;
	НоваяСтрокаТаблицы.РодительИмяНастройки = ИмяРодителя;
	НоваяСтрокаТаблицы.ТипЗначения = ТипЗначения;
	НоваяСтрокаТаблицы.Описание = Описание;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		НоваяСтрокаТаблицы.Значение = КонтурЛогистика_ОбщегоНазначенияСервер.ПреобразоватьЗначениеКТипу(Значение, НоваяСтрокаТаблицы.ТипЗначения);
	Иначе
		НоваяСтрокаТаблицы.Значение = КонтурЛогистика_ОбщегоНазначенияСервер.ПреобразоватьЗначениеКТипу(Неопределено, НоваяСтрокаТаблицы.ТипЗначения);
	КонецЕсли;
	
	Попытка
		// Важно здесь не пробовать её создать, иначе зациклимся
		НоваяСтрокаТаблицы.Ссылка = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(НоваяСтрокаТаблицы.ИмяНастройки, Ложь);
	Исключение
		Сообщить("Не могу найти предопределенную настройку в справочнике настроек: " + НоваяСтрокаТаблицы.ИмяНастройки);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьИмяСправочникаСущности(ИмяСущностиЛогистика) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочника" + ИмяСущностиЛогистика);
	
КонецФункции

Функция ПолучитьОписаниеТиповЕдиницИзмерения() Экспорт

	ТипЕдиницыИзмерения = "СправочникСсылка." + ЗначениеНастройки("ИмяСправочникаЕдиницаИзмерения");	
	ТипУпаковки = "СправочникСсылка." + ЗначениеНастройки("ИмяСправочникаУпаковка");
	
	Если Не ЗначениеЗаполнено(ТипЕдиницыИзмерения) Тогда 
		ВызватьИсключение "В настройках не указано Имя справочника Единицы измерения";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипУпаковки) Тогда
		ВызватьИсключение "В настройках не указано Имя справочника Упаковок";
	КонецЕсли;
	
	ОписаниеТиповЕдиницИзмерения = Новый ОписаниеТипов(ТипЕдиницыИзмерения + ", " + ТипУпаковки);
	
	Возврат ОписаниеТиповЕдиницИзмерения;
	
КонецФункции

Функция ПолучитьОписаниеТипаСущности(ИмяСущностиЛогистика) Экспорт

	Если ИмяСущностиЛогистика = "Характеристика" 
		И Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() Тогда
		
		Возврат Неопределено;

	Иначе
		
		Возврат Новый ОписаниеТипов("СправочникСсылка." + ПолучитьИмяСправочникаСущности(ИмяСущностиЛогистика));
	 	
	КонецЕсли;
	
КонецФункции

Функция НастройкиВыполнены() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_Настройки.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки
	               |ГДЕ
	               |	НЕ КонтурЛогистика_Настройки.ЭтоГруппа
	               |	И НЕ КонтурЛогистика_Настройки.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Количество > 10;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьПроверкуНастроекОсобенностейХраненияДанных(ИмяНастройки = Неопределено) Экспорт
	
	Соответствие = Новый Соответствие;
	
	МассивПредопределенных = Новый Массив;
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	
	Если ИмяНастройки = Неопределено Тогда 
		
		МассивПредопределенных.Добавить("ИмяСправочникаЕдиницаИзмерения");
		МассивПредопределенных.Добавить("ИмяСправочникаУпаковка");
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()   
			И Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуютсяХарактеристики") Тогда 
			МассивПредопределенных.Добавить("ИмяСправочникаХарактеристика");
		КонецЕсли;
		МассивПредопределенных.Добавить("ИмяСправочникаНоменклатура");
		МассивПредопределенных.Добавить("ИмяСправочникаПользователи");
		МассивПредопределенных.Добавить("ИмяСправочникаВалюты");
		МассивПредопределенных.Добавить("ИмяПВХДопСвойства");
		МассивПредопределенных.Добавить("ИмяРегистраДопСвойства");
		
	Иначе
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() Тогда 
			МассивПредопределенных.Добавить(ИмяНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ИмяПредопределенного Из МассивПредопределенных Цикл 
		
		ОбъектМД = Неопределено;
		
		Значение = ЗначениеНастройки(ИмяПредопределенного);
		
		Если Значение = "Неопределено" Тогда 
			Соответствие.Вставить(ИмяПредопределенного, Истина);
			Продолжить;
		КонецЕсли;
		
		Если ИмяПредопределенного = "ИмяПВХДопСвойства" Тогда 
			
			ОбъектМД = Метаданные.НайтиПоПолномуИмени("ПланВидовХарактеристик." + Значение);
			
		ИначеЕсли ИмяПредопределенного = "ИмяРегистраДопСвойства" Тогда 
			
			ОбъектМД = Метаданные.НайтиПоПолномуИмени("РегистрСведений." + Значение);	
							
		Иначе
			
			
			ОбъектМД = Метаданные.НайтиПоПолномуИмени("Справочник." + Значение);
						
		КонецЕсли;	
				
		Соответствие.Вставить(ИмяПредопределенного, Не ОбъектМД = Неопределено);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции	

// Вызывается как при создании формы по её данным
// так и при сохранении нового/существующего объекта
//
Функция ЭтоПользовательскаяНастройка(ДанныеФормыОбъекта) Экспорт
	
	ИдСвоихНастроек = "СвоиНастройки";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдСвоихНастроек", ИдСвоихНастроек);
	Запрос.УстановитьПараметр("Родитель", ДанныеФормыОбъекта.Родитель);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_Настройки1.ИмяПредопределенногоДляРасширения = &ИдСвоихНастроек
	|			ТОГДА ИСТИНА
	|		КОГДА КонтурЛогистика_Настройки2.ИмяПредопределенногоДляРасширения = &ИдСвоихНастроек
	|			ТОГДА ИСТИНА
	|		КОГДА КонтурЛогистика_Настройки3.ИмяПредопределенногоДляРасширения = &ИдСвоихНастроек
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПользовательскаяНастройка
	|ИЗ
	|	Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки2
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки3
	|			ПО КонтурЛогистика_Настройки2.Родитель = КонтурЛогистика_Настройки3.Ссылка
	|		ПО КонтурЛогистика_Настройки1.Родитель = КонтурЛогистика_Настройки2.Ссылка
	|ГДЕ
	|	КонтурЛогистика_Настройки1.Родитель = &Родитель";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтоСвоиНастройки = Выборка.ЭтоПользовательскаяНастройка;
	Иначе
		ЭтоСвоиНастройки = Ложь;
	КонецЕсли;
		
	Возврат ЭтоСвоиНастройки;
	
КонецФункции

Функция ЭтоНастройкаТипаШаблонаДляОтправкиКонтрагенту(ИмяНастройки)
	
	Возврат ИмяНастройки = "ПЭ_ТипШаблонаДляОтправкиКонтрагенту"
		Или ИмяНастройки = "ЗЗ_ТипШаблонаДляОтправкиКонтрагенту";
	
КонецФункции

Процедура УстановитьОписаниеТипаШаблонаДляОтправкиКонтрагенту(НастройкаОбъект) Экспорт
	
	Если Не ЭтоНастройкаТипаШаблонаДляОтправкиКонтрагенту(НастройкаОбъект.ИмяПредопределенногоДляРасширения) Тогда
		Возврат;
	КонецЕсли;
	
	Описание = Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ОписаниеДляНастройки(НастройкаОбъект.Значение);
	Если ЗначениеЗаполнено(Описание) Тогда
		НастройкаОбъект.Описание = Описание;
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеНастройкиДляЗаписи(СтрокаНастройки)
	
	Если ЭтоНастройкаТипаШаблонаДляОтправкиКонтрагенту(СтрокаНастройки.ИмяНастройки) Тогда
		Возврат Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ОписаниеДляНастройки(
			СтрокаНастройки.Ссылка.Значение);
	КонецЕсли;
	
	Возврат СтрокаНастройки.Описание;
	
КонецФункции

#Область ЗаполнениеЗначениямиПоУмолчанию

Процедура ДобавитьГруппу_ОбщиеНастройки(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Общие настройки", "ОбщиеНастройки",
		"", "",
		"");
	
	ИмяРодителя = "ОбщиеНастройки";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Авто получение и отправка QR-кодов", "АвтоматическоеПолучениеИОтправкаQRКодов",
		"Булево", "Ложь",
		"Регламентное задание получает QR-коды после подписания нужных титулов и отправляет водителям у которых заполнен адрес "
			+ "электронной почты и в Телеграм по номеру телефона (если включена отправка в Телеграм)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать отправку в Телеграм", "ИспользоватьОтправкуВТелеграм",
		"Булево", "Ложь",
		"Если настройка включена, то сообщения будут отправляться водителям в Telegram по номеру телефона, указанному в карточке "
			+ "водителя. Замечания перевозчиков и водителей будут отправляться по номерам телефонов, указанным в контактах получателей (организаций и пунктов маршрута).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Отправлять уведомления водителям о необходимости согласовать погрузку/выгрузку", "ОтправлятьУведомленияВодителюПоставитьПодпись",
		"Булево", "Ложь",
		"Если настройка включена, то будут отправляться уведомления водителям о необходимости подписать документ в личном кабинете. "
			+ "В карточке водителя, если заполнен телефон, то по Телеграм, если заполнен адрес электронной почты, то по почте.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать группы доступа", "ИспользоватьГруппыДоступа",
		"Булево", "Ложь",
		"Если настройка включена, то будет возможно ограничить доступ определенных пользователей до справочников, титулов и механизмов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать ограничения доступа по организации на уровне записей (БСП)", "ИспользоватьОграниченияДоступаПоОрганизацииНаУровнеЗаписей",
		"Булево", "Ложь",
		"Если настройка включена, то будет возможно ограничить доступ на уровне записей определенных пользователей в разрезе организаций. "
			+ "Будет использоваться подсистема управления доступом из БСП. Если в конфигурации нет БСП, то ограничения работать не будут. "
			+ "Ограничения по организациям настроенные в группах доступа учитываться не будут!");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Период обновления форм (секунд)", "ПериодОбновленияФорм",
		"Число", "300",
		"Устанавливается частота (в секундах) обновления основных форм (Рабочий стол Контур.Логистика, Рабочее место путевого листа, Список документов).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Выводить баннер проблем с оплатой", "ВыводитьБаннерПроблемСОплатой",
		"Булево", "Истина",
		"Если настройка выключена, баннер проблем с лицензией и оплатой на рабочем столе не отображается. "
			+ "Форму подписок и оплаты можно открыть из меню настроек.");
			
	ДобавитьГруппу_ИнтеграцияСотрудниковССервисом(ТаблицаНастроек, ИмяРодителя)
	
КонецПроцедуры

Процедура ДобавитьГруппу_ИнтеграцияСотрудниковССервисом(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Интеграция сотрудников с сервисом", "ИнтеграцияСотрудниковССервисом",
		"", "",
		"");
	
	ИмяРодителя = "ИнтеграцияСотрудниковССервисом";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Мастер-данные информации о сотрудниках", "МастерДанныеСотрудников",
		"ПеречислениеСсылка.КонтурЛогистика_МастерДанныеСотрудников", 
		"Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с",
		"Настройка указывает, где ведется основной учет данных по сотрудникам и в каком направлении выполняется синхронизация между 1С и сервисом." 
			+ " Например, если выбрано значение 1С, тогда при возникновении расхождений в данных сотрудника модуль предложит выгрузить информацию"
			+ " из модуля 1С в сервис.");
			
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Запрет отправки титула без добавленного в сервис водителя", "ЗапретОтправкиПервыхТитуловБезВодителяВСервисе",
		"Булево", 
		"Ложь",
		"Настройка включает запрет отправки первых титулов ТРН, ПЛ и ЗЗ, если водитель не добавлен в сервис. И автоматически отправляет приглашение" 
			+ "  водителю при проверке титула, если заполнены фамилия, имя, телефон и данные водительского удостоверения");
			
КонецПроцедуры

#Область НастройкиКонвертации

Процедура ДобавитьГруппу_НастройкиКонвертации(ТаблицаНастроек, ИмяКонфигурации)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки конвертации", "НастройкиКонвертации",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиКонвертации";
	
	ДобавитьГруппу_НастройкиКонвертацииСправочников(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьГруппу_НастройкиСоответствияНоменклатуры(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пропускать товары без базовых соответствий", "НесопоставленныеТоварыПропускать",
		"Булево", "Ложь",
		"Позволяет выбрасывать из списка товары, у которых отсутствуют базовые соответствия. "
			+ "(Товары, у которых в базовых соответствиях указано Учитывать = Нет, будут пропущены в любом случае.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Способ упаковки по умолчанию", "СпособУпаковкиПоУмолчанию",
		"Строка", "",
		"Позволяет задать общее правило что ставить в способ упаковки в описании груза");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Конвертировать входящий гос. номер ТС в кириллицу", "КонвертироватьВходящийГосНомерТСКириллицу",
		"Булево", "Истина",
		"Если вы храните гос. номера в кириллице, тогда вам нужно установить признак Истина.
		|И полученный гос. номера латиницей будет преобразован в кириллицу.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Метод определения массы по умолчанию", "МетодОпределенияМассы",
		"ПеречислениеСсылка.КонтурЛогистика_МетодыОпределенияМассы", "Перечисление.КонтурЛогистика_МетодыОпределенияМассы._03",
		"В ТрН (титулы 1 и 3) и в ЗЗ (титул 1) Метод определения массы - обязательное поле. Данная настройка устанавливает значение по умолчанию.");
	    
	// Используются характеристики
	Если ИмяКонфигурации = "КЛ"
		Или ИмяКонфигурации = "УПП"
		Или ИмяКонфигурации = "УТ"
		Или ИмяКонфигурации = "УФ_УТ"
		Или ИмяКонфигурации = "УФ_УНФ"
		Или ИмяКонфигурации = "ERP"
		Или ИмяКонфигурации = "КА" Тогда
		
		ТекущееЗначение = "Истина";
	Иначе
		ТекущееЗначение = "Ложь";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используются характеристики", "ИспользуютсяХарактеристики",
		"Булево", ТекущееЗначение,
		"Объясняет программе, следует ли обращать внимание на Характеристики. Для конфигураций где нет характеристик - должно быть значение ""Нет""");
	
	ТекущееЗначение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные("Справочники.алкПунктыРазгрузки"); 
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется конвертация для КТ-2000", "ИспользуетсяКонвертацияКТ2000",
		"Булево", ТекущееЗначение,
		"При конвертации будут использоваться настройки, специфичные для КТ-2000");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиКонвертацииСправочников(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Настройки конвертации справочников", "НастройкиКонвертацииСправочников",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиКонвертацииСправочников";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Компактный режим формы элемента", "КомпактныйРежим_НастройкаКонвертацииСправочников",
		"Булево", "Ложь",
		"Если настройка включена - то при открытии формы элемента, форма будет открыта без дополнительной справочной информации.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Горюче-смазочные материалы (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_ГорючеСмазочныеМатериалы",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации договоров будет осуществлен поиск по:
			|1. Наименование + ТипТоплива + ВидТоплива
			|2. Наименование
			|и последующее создание ГСМ, если он не найден.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Договоры (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_Договоры",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации договоров будет осуществлен поиск по:
			|1. Организация + Номер договора + Дата Договора,
			|и последующее создание договора, если он не найден.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Лицензии (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_Лицензии",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации лицензии будет осуществлен поиск по:
			|1. Владелец + Серия + Номер
			|2. Владелец + Номер,
			|и последующее создание лицензии, если она не найдена.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Организации Диадок (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_ОрганизацииДиадок",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации организаци будет осуществлен поиск по:
			|1. ИНН + КПП
			|2. ИНН
			|3. ОГРН
			|и последующее создание организации из Диадок, если она не найдена.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""КонтурЛогистика_ПодразделенияДиадок""", "Автоконвертация_КонтурЛогистика_ПодразделенияДиадок",
		"Булево", "Ложь",
		"ПОКА НЕ РЕАЛИЗОВАН ПОИСК И СОЗДАНИЕ");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Пункты маршрута (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_ПунктыМаршрута",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации пунктов маршрута будет осуществлен поиск по:
			|1. Адресу, указанному в строковом представлении
			|2. Город + Улица + Дом + Корпус + Квартира
			|3. Населенный пункт + Улица + Дом + Корпус + Квартира 
			|и последующее создание пункта маршрута, если он не найден.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Сотрудники и физические лица (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_Сотрудники",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации сотрудников будет осуществлен поиск по:
			|1. СНИЛС
			|2. ИНН
			|3. Данные водительского удостоверения
			|4. Фамилия + Имя + Отчество + Дата рождения
			|5. Фамилия + Имя + Дата рождения
			|и последующее создание сотрудника, если он не найден.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация сотрудников по ФИО без идентификатора", "АвтоконвертацияСотрудниковПоФИОБезДР",
		"Булево", "Ложь",
		"Если включить то то при работе автоконвертации будет предприниматься попытка поиска сотрудника по ФИО без идентификатора (СНИЛС/ИНН/ДатаРождения)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоконвертация справочника ""Транспортные средства (Контур.Логистика)""", "Автоконвертация_КонтурЛогистика_ТранспортныеСредства",
		"Булево", "Ложь",
		"Если настройка включена - то при создании Титула при конвертации транпортных средств будет осуществлен поиск по:
			|1. Рег номер (гос. рег. номер)
			|2. Идентификационный номер (VIN)
			|3. Свидетельство о регистрации (СТС)
			|и последующее создание транспортного средства, если оно не найдено.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиСоответствияНоменклатуры(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Соответствия товаров", "НастройкиСоответствияНоменклатуры",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиСоответствияНоменклатуры";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать базовые соответствия товаров", "ИспользоватьИПрименятьБазовыеСоответствия",
		"Булево", "Истина",
		"Если настройка включена - то будут применяться значения из базовых соответствий товаров. "
			+ "Если настройку выключить - то базовые соответствия применяться не будут, потребуется "
			+ "обеспечить заполнение обязательных полей по грузам из исходного документа.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Обязательно требовать наличие базовых соответствий", "ТребоватьНаличиеБазовыхСоответствий",
		"Булево", "Истина",
		"Если Включено, то при отсутствии заполненного базового соответствия по товару, будет препятствовать отправке Титула "
			+ "(будет требовать проставить соответствие). Если отключено - то отсутствие базового соответствия не будет препятствовать отправке "
			+ "(но проверки обязательных полей будут все равно)");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиДокументов

Процедура ДобавитьГруппу_НастройкиДокументов(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки Документов", "НастройкиДокументов",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиДокументов";
	
	ДобавитьГруппу_НастройкиУИД(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_НастройкиТитул1(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_НастройкиТитул2(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_НастройкиТитул3(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_НастройкиТитул4(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ПутевойЛист(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ЗаказЗаявка(ТаблицаНастроек, ИмяРодителя);
	//ДобавитьГруппу_ЭкспедиторскаяРасписка(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ПоручениеЭкспедитору(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Заказ-Наряд", "ИспользуетсяЗаказНаряд",
		"Булево", "Ложь",
		"Включает/выключает на рабочем столе видимость задач по работе с Заказ-Нарядом");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Заказ (заявка)", "ИспользуетсяЗаказЗаявка",
		"Булево", "Истина",
		"Включает/выключает на рабочем столе видимость задач по работе с Заказом (заявкой)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Транспортная накладная", "ИспользуетсяТРН",
		"Булево", "Истина",
		"Включает/выключает на рабочем столе видимость задач по работе с Транспортными накладными");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Путевой лист", "ИспользуетсяПутевойЛист",
		"Булево", "Ложь",
		"Включает/выключает на рабочем столе видимость задач по работе с Путевыми листами");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Путевой лист (формат 5.02)", "ИспользуетсяПутевойЛист_5_02",
		"Булево", "Ложь",
		"Включает/выключает на рабочем столе видимость задач по работе с Путевыми листами формата 5.02");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Поручение экспедитору", "ИспользуетсяПоручениеЭкспедитору",
		"Булево", "Истина",
		"Включает/выключает на рабочем столе видимость задач по работе с Поручениями экспедитору");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Экспедиторская расписка", "ИспользуетсяЭкспедиторскаяРасписка",
		"Булево", "Истина",
		"Включает/выключает на рабочем столе видимость задач по работе с Экспедиторскими расписками");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Используется Складская расписка", "ИспользуетсяСкладскаяРасписка",
		"Булево", "Истина",
		"Включает/выключает на рабочем столе видимость задач по работе со Складскими расписками");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиУИД(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"УИД", "НастройкиУИД",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиУИД";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Брать УИД из пула или сервиса Логистика для ТрН", "БратьУИДИзПулаДляТРН",
		"Булево", "Ложь",
		"При включении начнет использовать (ПРИ ЗАПИСИ документа титула 1 ТрН) УИД из пула заранее полученных УИДов.
			|Учет ведется в регистре сведений КонтурЛогистика_УИДыГИС. Получить пул УИДов можно обратившись в техподдержку Контур.Логистика.
			|При отключении, УИД будет присваиваться ГИС Минтранса уже после отправки Титула 1 ТрН.
			|При отсутствии УИД в пуле, будет получен УИД из сервиса Логистики, если есть ключ АПИ.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Брать УИД из пула или сервиса Логистика для Заказ-Наряда", "БратьУИДИзПулаДляЗН",
		"Булево", "Ложь",
		"При включении начнет использовать (ПРИ ЗАПИСИ документа титула 1 Заказ-Наряда) УИД из пула заранее полученных УИДов.
			|Учет ведется в регистре сведений КонтурЛогистика_УИДыГИС. Получить пул УИДов можно обратившись в техподдержку Контур.Логистика.
			|При отключении, УИД будет присваиваться ГИС Минтранса уже после отправки Титула 1 Заказ-Наряда.
			|При отсутствии УИД в пуле, будет получен УИД из сервиса Логистики, если есть ключ АПИ.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Брать УИД из пула или сервиса Логистика для Заказа (заявки)", "БратьУИДИзПулаДляЗЗ",
		"Булево", "Ложь",
		"При включении начнет использовать (ПРИ ЗАПИСИ документа титула 1 Заказа (заявки)) УИД из пула заранее полученных УИДов.
			|Учет ведется в регистре сведений КонтурЛогистика_УИДыГИС. Получить пул УИДов можно обратившись в техподдержку Контур.Логистика.
			|При отключении, УИД будет присваиваться ГИС Минтранса уже после отправки Титула 1 Заказа (заявки).
			|При отсутствии УИД в пуле, будет получен УИД из сервиса Логистики, если есть ключ АПИ.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Размер пула получения УИД Минтранса", "РазмерПулаПолученияУИДМинтранса",
		"Число", "1",
		"Количество УИД Минтранса получаемого за раз. Допустимое значение целое в пределах от 1 до 1000.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Период актуальности УИД (месяцы)", "ПериодАктуальностиУИД",
		"Число", "3",
		"Период актуальности УИД с момента запроса в месяцах. После истечения срока УИД станет не актуальным и будет возвращен в сервис.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиТитул1(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Настройки Титула 1", "НастройкиТитул1",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиТитул1";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"1 ЭТРН из нескольких документов", "ИспользуютсяМногиеКОдному",
		"Булево", "Ложь",
		"Если включить, то в ЭТрН Титул1 будет использоваться табличная часть ДокументыОснования вместо реквизита ДокументОснование. "
			+ "В настройке конвертации документа, на закладке ""Документ учетной системы"" появится дополнительное поле "
			+ "ПоискОснованийКодНа1С - там можно будет организовать поиск дополнительных оснований.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Средн. продолжительность погрузки (минут)", "СредняяПродолжительностьПогрузки",
		"Число", "60",
		"Позволяет сделать автоматический предварительный расчет времени убытия при заполнении обязательного реквизита Титула 1 ТрН. "
			+ "Указывается в минутах. Иначе говоря, сколько обычно времени проходит на погрузку одной машины (в среднем)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог Количество мест (титул 1)", "Т1АвтоитогКоличествоМест",
		"Булево", "Истина",
		"При заполнении титула 1 считать ли автоматически количество мест по всему документу из строк грузов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог Масса брутто (титул 1)", "Т1АвтоитогМассаБрутто",
		"Булево", "Истина",
		"При заполнении титула 1 считать ли автоматически массу брутто всего документа из строк грузов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Состояние титула для задачи ""Распечатать""", "Т1НастройкаСостояниеРаспечатать",
		"СправочникСсылка.КонтурЛогистика_СостоянияДвиженияДокументооборота", "",
		"Укажите какое текущее состояние движения документооборота должно быть у титула 1, при котором в списке задач появится требуемое действие ""Распечатать"".
			|Это требуемое действие позволяет распечатать транспортную накладную.
			|Необходимость показа требуемого действия ""Распечатать"" регулируется настройкой ""Выводить задачу ""Распечатать"""" в разделе ""Настройки печати"".");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Валидация прототипов и черновиков", "ВалидацияПрототиповИЧерновиков",
		"Булево", "Ложь",
		"Если включить, то в ЭТрН Титул1 будут валидироваться прототипы и черновики.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Допустимое превышение массы груза над грузоподъемностью ТС", "ДопустимоеПревышениеМассыГрузаНадГрузоподъемностьюТС",
		"Число", "0",
		"Заблокировать отправку титула если общая масса груза превышает заявленную грузоподъемность ТС плюс прицепа "
			+ "на такой процент (от 0 до 100 %)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Блокировать отправку если не выполнены требования торговых сетей",
		"БлокироватьОтправкуПриНевыполненныхТребованияхТорговыхСетей",
		"Булево", "Истина",
		"При отключении настройки модуль разрешит отправку титула ТРН титул 1 в адрес торговой сети, "
			+ "если не выполнены требования (номера заказов, DESADV, УПД, их даты, GLN и прочие требования).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоматически заполнять реквизиты из модуля EDI",
		"АвтоматическиЗаполнятьРеквизитыИзМодуляEDI",
		"Булево", "Истина",
		"Позволяет включить или отключить автоматический запрос в модуль Контур.EDI при оформлении ТРН титул 1 и ЗЗ титул 1 "
			+ "для автоподстановки реквизитов заказов, DESADV, УПД, GLN по требованиям торговых сетей.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пропускать задачи (ЗЗ и ЭТрН) при оформлении ПЭ", "ПЭ_ПропускатьЗадачиЗЗИЭТрНПриОформленииПЭ",
		"Булево", "Ложь",
		"Если настройка включена, при записи поручения экспедитору (ПЭ1) автоматически пропускаются задачи "
			+ "титула1 ЭТрН и ЗЗ1 по тому же учетному документу 1С (статус ""Пропущен""). "
			+ "По умолчанию выключена: документы ПЭ, ЗЗ и ЭТрН ведутся независимо.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиТитул2(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Настройки Титула 2", "НастройкиТитул2",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиТитул2";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Разрешить отправлять до подтверждения водителем титул 2", "РазрешитьОтправлятьТ2ДоВодителя",
		"Булево", "Ложь",
		"В списке задач будет разрешена отправка титула 2 в не зависимости наличия подтверждения водителем "
			+ "(ПЭП Водителя) принятия грузов к перевозке.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиТитул3(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Настройки Титула 3", "НастройкиТитул3",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиТитул3";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Отправлять товары из учетного документа", "Т3ТоварыУчитыватьУчетныйДокумент",
		"Булево", "Ложь",
		"Если установлена - то данные по грузам будут браться из таб части ТоварыСоответствиеСтрокТоваров.
			|Если сброшена - товары будут браться из таб. части Товары (генерируется из данных в Т1 и может быть исправлена "
				+ "вручную на закладке Товары по данным отправителя)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Детализировать грузы построчно", "Т3ОтправлятьТаблицуГрузов",
		"Булево", "Ложь",
		"Если установлена - то данные по грузам будут отправляться в титуле приемки.
			|Если сброшена - будем отправлять в титуле 3 только общее кол-во мест и массы, а сведения из Т1 будут выводиться справочно");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Сопоставлять строки в очередности", "Т3СпособСопоставленияТоваров",
		"ПеречислениеСсылка.КонтурЛогистика_СпособыСопоставленияТоваровТитул3", "Перечисление.КонтурЛогистика_СпособыСопоставленияТоваровТитул3.НаименованиеМаркировка",
		"Если для титула 3 указан документ учетной системы, то автоматическое сопоставление товаров из Т1 "
			+ "и документа учетной системы (поступления) будет выполняться в этой очередности.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Игнорировать лидирующие нули при поиске документа учетной системы", "Т3ПоискПоНомеруТРНСУчетомЛидиующихНулей",
		"Булево", "Истина",
		"Если установлена - поиск документа учетной системы будет выполняться с игнорированием лидирующих нулей");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Средн. продолжительность разгрузки (минут)", "СредняяПродолжительностьРазгрузки",
		"Число", "60",
		"Позволяет сделать автоматический предварительный расчет времени убытия при заполнении обязательного реквизита Титула 3 ТрН.
			|Указывается в минутах. Иначе говоря, сколько обычно времени проходит на разгрузку одной машины (в среднем)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог Количество мест (титул 3)", "Т3АвтоитогКоличествоМест",
		"Булево", "Истина",
		"При заполнении титула 3 считать ли автоматически количество мест по всему документу из строк грузов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог Объем куб.м. (титул 3)", "Т3АвтоитогОбъем",
		"Булево", "Истина",
		"При заполнении титула 3 считать ли автоматически объем всего документа из строк грузов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог Масса брутто (титул 3)", "Т3АвтоитогМассаБрутто",
		"Булево", "Истина",
		"При заполнении титула 3 считать ли автоматически массу брутто всего документа из строк грузов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог Масса нетто (титул 3)", "Т3АвтоитогМассаНетто",
		"Булево", "Истина",
		"При заполнении титула 3 считать ли автоматически массу нетто всего документа из строк грузов.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиТитул4(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Настройки Титула 4", "НастройкиТитул4",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиТитул4";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Запрет расхождения количества мест на погрузке и разгрузке", "ЗапретРасхожденийМестТ1Т3",
		"Булево", "Ложь",
		"Если количество мест в титулах грузоотправителя и грузополучателя будет расходиться, то если настройка включена, "
			+ "будет заблокирована отправка Т4. Если будет отключена, выдаст предупреждение.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Запрет расхождения массы брутто на погрузке и разгрузке", "ЗапретРасхожденийМассыБруттоТ1Т3",
		"Булево", "Ложь",
		"Если Масса брутто в титулах грузоотправителя и грузополучателя будет расходиться более чем на порог, "
			+ "указанный в настройке порога, то если настройка включена, будет заблокирована отправка Т4. Если будет отключена, выдаст предупреждение.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Порог расхождения по массе % на погрузке и разгрузке", "ПорогРасхожденияМассыБруттоПроцент",
		"Число", "2",
		"Процент расхождения массы брутто между погрузкой и разгрузкой, при котором будет срабатывать предупреждение/ошибка проверки.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Разрешить отправлять до подтверждения водителем титул 4", "РазрешитьОтправлятьТ4ДоВодителя",
		"Булево", "Ложь",
		"В списке задач будет разрешена отправка титула 4 в не зависимости наличия подтверждения водителем (ПЭП Водителя) сдачи груза получателю");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ПутевойЛист(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Путевой лист", "ПутевойЛист",
		"", "",
		"");
	
	ИмяРодителя = "ПутевойЛист";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"1 ЭПЛ из нескольких документов", "ИспользуютсяМногиеКОдномуЭПЛ",
		"Булево", "Ложь",
		"Если включить, то в ЭПЛ Титул1 будеть использоваться табличная часть ДокументыОснования вместо реквизита ДокументОснование. "
			+ "В настройке конвертации документа, на закладке ""Документ учетной системы"" появится дополнительное "
			+ "поле ПоискОснованийКодНа1С - там можно будет организовать поиск дополнительных оснований.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		" Контролировать, что предыдущий ЭПЛ закрыт при оформлении", "КонтрольЕстьАктивныйПЛ",
		"ПеречислениеСсылка.КонтурЛогистика_ВариантыВалидации", "Перечисление.КонтурЛогистика_ВариантыВалидации.НеПроверять",
		"В начале оформления ЭПЛ можем проверить, что в настоящий момент есть активный ЭПЛ по тому же водителю и транспортному средству."
		+ "   Можно выбрать, как поступать системе в случае, если такой будет найден: предупреждать или блокировать отправку."
		+ "   Или же можно отключить эту проверку для улучшения производительности (не будет выполняться запрос проверки)");
	
	// Значения по умолчанию
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Вид перевозки (по умолчанию)", "ПЛ_ВидПеревозкиПоУмолчанию",
		"ПеречислениеСсылка.КонтурЛогистика_ВидыПеревозки", "Перечисление.КонтурЛогистика_ВидыПеревозки.СН",
		"Значение по умолчанию для реквизита ""Вид перевозки"" путевых листов");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Вид сообщения (по умолчанию)", "ПЛ_ВидСообщенияПоУмолчанию",
		"ПеречислениеСсылка.КонтурЛогистика_ВидыПутейСообщений", "Перечисление.КонтурЛогистика_ВидыПутейСообщений.М",
		"Значение по умолчанию для реквизита ""Вид сообщения"" путевых листов");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Срок действия (дни)", "ПЛ_СрокДействияПоУмолчанию",
		"Число", "1",
		"Срок действия определяется путем прибавления указанного количества дней к текущей дате");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тех. работник (по умолчанию)", "ПЛ_ТехРаботникПоУмолчанию",
		"СправочникСсылка.КонтурЛогистика_Сотрудники", "",
		"Значение по умолчанию для ответственного за техническое состояние и одометр путевых листов");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Мед. организация (по умолчанию)", "ПЛ_ОрганизацияМедикПоУмолчанию",
		"СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок", "",
		"Значение по умолчанию для внешней медицинской организации в путевых листах");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ЗаказЗаявка(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Заказ (заявка)", "ЗаказЗаявка",
		"", "",
		"");
	
	ИмяРодителя = "ЗаказЗаявка";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"После проверки Титула 1 выводить задачу ввода ЭТрН", "ОформитьЭТрНПослеЗЗ",
		"Булево", "Истина",
		"Выводит задачу ""Ввести на основании"" в списке задач после успешной проверки Титула 1. По нажатию создается новая ЭТрН.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"После отправки Титула 2 выводить задачу ввода Путевого листа", "ОформитьПЛПослеЗЗ",
		"Булево", "Ложь",
		"Выводит задачу ""Ввести на основании"" в списке задач после положительной отправке Титула 2. По нажатию создается новый Путевой лист.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"1 ЭЗЗ из нескольких документов", "ИспользуютсяМногиеКОдномуЭЗЗ",
		"Булево", "Ложь",
		"Если включить, то в ЭЗЗ Титул1 будеть использоваться табличная часть ДокументыОснования вместо реквизита ДокументОснование. "
			+ "В настройке конвертации документа, на закладке ""Документ учетной системы"" появится дополнительное "
			+ "поле ПоискОснованийКодНа1С - там можно будет организовать поиск дополнительных оснований.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог массы грузов в требуемую грузоподъемность ТС", "ЗЗ_АвтоитогМасса",
		"Булево", "Истина",
		"Автоматически рассчитывает итоги массы груза и устанавливает в реквизит Грузоподъемность транспортного средства. Не применяется если грузоподъемность уже была рассчитана иным способом");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоитог объема грузов в требуемую вместимость ТС", "ЗЗ_АвтоитогОбъем",
		"Булево", "Истина",
		"Автоматически рассчитывает итоги объема груза и устанавливает в реквизит Вместимость транспортного средства. Не применяется если вместимость уже была рассчитана иным способом");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тип транспортного средства по умолчанию", "ЗЗ_ТипТСПоумолчанию",
		"Строка", "Грузовой",
		"Автоматически подставим это значение в реквизит Тип транспортного средства (какой тип ТС заказывается). 
		|Если требуется отказаться от значения по умолчанию, очистите поле.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать шаблоны документов для ЗЗ", "ЗЗ_ИспользоватьШаблоныДокументов",
		"Булево", "Истина",
		"Включает работу с исходящими шаблонами заказ(заявки).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тип шаблона для отправки контрагенту (ЗЗ)", "ЗЗ_ТипШаблонаДляОтправкиКонтрагенту",
		"ПеречислениеСсылка.КонтурЛогистика_СценарииРедактированияШаблона",
		"Перечисление.КонтурЛогистика_СценарииРедактированияШаблона.ДоступныВсеПоля",
		Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ОписаниеДляНастройки(
			Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ДоступныВсеПоля));
	
КонецПроцедуры

Процедура ДобавитьГруппу_ЭкспедиторскаяРасписка(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Экспедиторская расписка", "ЭкспедиторскаяРасписка",
		"", "",
		"");
	
	ИмяРодителя = "ЭкспедиторскаяРасписка";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Требуется ответная подпись заказчика", "ТребуетсяОтветнаяПодписьЗаказчикаЭР",
		"Булево", "Истина",
		"Если настройка включена - то для заверешения документооборота  требуется подпись экспедитор и заказчика");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ПоручениеЭкспедитору(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Поручение экспедитору", "ПоручениеЭкспедитору",
		"", "",
		"");
	
	ИмяРодителя = "ПоручениеЭкспедитору";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Время готовности груза к отгрузке С (по умолчанию)", "ПЭ_ВремяГотовностиС",
		"Дата", Дата(1,1,1,9,0,0),
		"Значение по умолчанию для поля ""Время готовности груза к отгрузке С""");
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Время готовности груза к отгрузке По (по умолчанию)", "ПЭ_ВремяГотовностиПо",
		"Дата", Дата(1,1,1,18,0,0), 
		"Значение по умолчанию для поля ""Время готовности груза к отгрузке По""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Вид транспортного средства по умолчанию", "ПЭ_ВидТСПоУмолчанию",
		"ПеречислениеСсылка.КонтурЛогистика_ВидыТранспорта", "Перечисление.КонтурЛогистика_ВидыТранспорта._1",
		"Значение по умолчанию для поля ""Вид транспортного средства (по умолчанию)""");
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Требования к типу кузова/вагона по умолчанию", "ПЭ_ТипКузовПоУмолчанию",
		"Строка", "Тентованный кузов",
		"Значение по умолчанию для поля ""Требования к типу кузова/вагона""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Экспедитор по умолчанию", "ПЭ_ЭкспедиторПоУмолчанию",
		"СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок", "",
		"Значение по умолчанию для поля ""Экспедитор""");
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Договор экспедиции по умолчанию", "ПЭ_ДоговорЭкспедицииПоУмолчанию",
		"СправочникСсылка.КонтурЛогистика_Договоры", "",
		"Значение по умолчанию для поля ""Договор экспедиции по умолчанию""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Автоматически заполнять даты отгрузки", "ПЭ_АвтоматическиДатОтгр",
		"Булево", "Ложь",
		"При включении настройки модуль будет заполнять даты отгрузки в документе ""Маршрут"" для поручения экспедитора. 
		|После включения настройки обязательно проверьте значения в настройках:
 		|	- Период для отгрузки начинается через X дней от текущей даты.
 		|	- Период для отгрузки завершится через X дней.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Период для отгрузки начинается через X дней от текущей даты", "ПЭ_ДатОтгрСДнейПлюсОтТек",
		"Число", "0",
		"Укажите количество календарных дней от даты отправки поручения экспедитору (текущей даты) до возможной даты отгрузки груза (Дата отгрузки с). 
		|- Если установить значение ""0"", тогда в ""Дата отгрузки с"" заполнится текущая дата.
		|- Если установить значение ""-1"", тогда настройка использоваться не будет.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Период отгрузки завершится через X дней", "ПЭ_ДнейНаПогрузку",
		"Число", "1",
		"Укажите через сколько календарных дней от ""Дата отгрузки с"" завершится период отгрузки.
		|Если установить значение ""0"", тогда в ""Дата отгрузки по"" заполнится дата из ""Дата отгрузки с"".
		|Если установить значение ""-1"" настройка использоваться не будет.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать шаблоны документов для ПЭ", "ПЭ_ИспользоватьШаблоныДокументов",
		"Булево", "Истина",
		"Включает работу с исходящими шаблонами поручения экспедитору.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тип шаблона для отправки контрагенту (ПЭ)", "ПЭ_ТипШаблонаДляОтправкиКонтрагенту",
		"ПеречислениеСсылка.КонтурЛогистика_СценарииРедактированияШаблона",
		"Перечисление.КонтурЛогистика_СценарииРедактированияШаблона.ДоступныВсеПоля",
		Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ОписаниеДляНастройки(
			Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ДоступныВсеПоля));
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пропускать задачи (ПЭ) при оформлении ЗЗ и ЭТрН", "ПЭ_ПропускатьЗадачиПриОформленииЗЗИЭТрН",
		"Булево", "Ложь",
		"Если настройка включена, при записи титула1 ЭТрН или ЗЗ1 автоматически пропускаются задачи "
			+ "поручения экспедитору по тому же учетному документу 1С (статус ""Пропущен""). "
			+ "По умолчанию выключена: документы ПЭ, ЗЗ и ЭТрН ведутся независимо.");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПодключения

Процедура ДобавитьГруппу_НастройкиПодключения(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки подключения", "НастройкиПодключения",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиПодключения";
	
	ДобавитьГруппу_АвторизацияПоЛогинПаролю(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ИнтернетПрокси(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Количество циклов чтения ленты за 1 итерацию обмена", "КоличествоЦикловОбмена",
		"Число", "10",
		"Определяет максимальное количество запросов GetDocflowEvents_v3 при вычитывании ленты событий за 1 раз");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тестовый сервер Диадок / Логистика", "ИспользоватьТестовыйСерверДиадок",
		"Булево", "Ложь",
		"Переключает программу на работу с тестовым сервером Диадок и Логистика (стэйджинг).
			|Не равносильно использованию тестовых ящиков на боевом сервере.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Режим авторизации", "РежимАвторизации",
		"ПеречислениеСсылка.КонтурЛогистика_РежимыАвторизации", "Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow",
		"Логин и пароль Диадок - для использования Api Диадок
			|Api key - для использования Api Контур.Логистика
			|Логин и пароль Диадок + Api Key - для одновременного использования Api Диадок и Api Контур.Логистика");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес API Диадок", "АдресDiadocAPI",
		"Строка", "https://diadoc-api.kontur.ru",
		"Для штатного использования - оставьте значение по умолчанию (https://diadoc-api.kontur.ru).
			|Если требуется перейти на альтернативный сервер - введите его адрес.
			|Переключение между тестовым и продуктивным сервером выполняется настройкой ""Тестовый сервер Диадок""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес Тестового API Диадок", "АдресТестовогоDiadocAPI",
		"Строка", "https://diadoc-api-staging.kontur.ru",
		"Для штатного использования - оставьте значение по умолчанию (https://diadoc-api-test.kontur.ru).
			|Если требуется перейти на альтернативный сервер - введите его адрес.
			|Переключение между тестовым и продуктивным сервером выполняется настройкой ""Тестовый сервер Диадок""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Ключ разработчика API (APIkey)", "КлючРазработчика",
		"Строка", "",
		"Если вам был выдан специальный ключ разработчика - введите его в этом поле.
			|Если вам ничего не известно о выдаче ключа или вы его не получали - оставьте поле пустым, будет использоваться ключ типового релиза.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес API Логистика", "АдресLogisticsAPI",
		"Строка", "https://logist-api.kontur.ru",
		"Для штатного использования - оставьте значение по умолчанию (https://logist-api.kontur.ru).
			|Если требуется перейти на альтернативный сервер - введите его адрес.
			|Переключение между тестовым и продуктивным сервером выполняется настройкой ""Тестовый сервер Диадок""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес Тестового API Логистика", "АдресТестовогоLogisticsAPI",
		"Строка", "https://logist-api-staging.kontur.ru",
		"Для штатного использования - оставьте значение по умолчанию (https://logist-api-staging.kontur.ru).
			|Если требуется перейти на альтернативный сервер - введите его адрес.
			|Переключение между тестовым и продуктивным сервером выполняется настройкой ""Тестовый сервер Диадок""");
	
	///
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес API сервиса физических лиц", "АдресPersonsAPI",
		"Строка", "https://platform.kontur.ru/api/persons",
		"Для штатного использования - оставьте значение по умолчанию (https://platform.kontur.ru/api/persons).
			|Если требуется перейти на альтернативный сервер - введите его адрес.
			|Переключение между тестовым и продуктивным сервером выполяется настройкой ""Тестовый сервер Диадок""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес Тестового API сервиса физических лиц", "АдресТестовогоPersonsAPI",
		"Строка", "https://platform.testkontur.ru/api/persons",
		"Для штатного использования - оставьте значение по умолчанию (https://platform.testkontur.ru/api/persons).
			|Если требуется перейти на альтернативный сервер - введите его адрес.
			|Переключение между тестовым и продуктивным сервером выполяется настройкой ""Тестовый сервер Диадок""");
	///
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес API Телеграм", "АдресAPIТелеграм",
		"Строка", "https://logistic-bot.ru",
		"Для штатного использования - оставьте значение по умолчанию (https://logistic-bot.ru).
			|Если требуется перейти на альтернативный сервер - введите его адрес.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Ключ Телеграм API (APIkey)", "ПарольAPIТелеграм",
		"Строка", "",
		"");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Таймаут HTTP запросов", "ТаймаутHTTP",
		"Число", "30",
		"Таймаут ожидания ответа от сервера. Значение по умолчанию 30 сек.
			|Если при обмене по какой-то причине происходит частое срабатывание таймаута или не удается вычитать какие-то данные, "
			+ "то рекомендуется сначала попытаться понять что это за такой огромный кусок данных (или узкий канал связи) что за 30 "
			+ "секунд ответ не успевает полностью дойти. И только после этого увеличивать значение таймаута.
			|В очень редких случаях в ответах от сервиса могут приходить огромные по размеру файлы "
			+ "- в этом случае как раз и требуется увеличить таймаут.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_АвторизацияПоЛогинПаролю(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Авторизация по логину+паролю", "АвторизацияПоЛогинПаролю",
		"", "",
		"");
	
	ИмяРодителя = "АвторизацияПоЛогинПаролю";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Логин авторизации Диадок API", "ЛогинАвторизацииДиадокАПИ",
		"Строка", "",
		"");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пароль авторизации Диадок API", "ПарольАвторизацииДиадокАПИ",
		"Строка", "",
		"");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ИнтернетПрокси(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Интернет прокси", "ИнтернетПрокси",
		"", "",
		"");
	
	ИмяРодителя = "ИнтернетПрокси";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать интернет прокси", "ПроксиИспользовать",
		"Булево", "Ложь",
		"Основной включатель использования интернет прокси для всех отправляемых HTTP запросов");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Логин прокси", "ЛогинПроксиСервера",
		"Строка", "",
		"Логин для прокси сервера");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пароль прокси", "ПарольПроксиСервера",
		"Строка", "",
		"Пароль для прокси сервера");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Порт прокси", "ПортПроксиСервера",
		"Число", "",
		"Порт для прокси сервера");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес сервера прокси", "АдресПроксиСервера",
		"Строка", "",
		"Адрес прокси сервера (он же Хост прокси)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тип (режим) прокси", "РежимПрокси",
		"ПеречислениеСсылка.КонтурЛогистика_ТипыПрокси", "Перечисление.КонтурЛогистика_ТипыПрокси.NoProxy",
		"Режим прокси, указывается строкой:
			|""NoProxy""		  - без прокси
			|""UseProxy""		  - использовать настройки модуля
			|""UseDefaultProxy"" - использовать системные настройки");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиАрхива

Процедура ДобавитьГруппу_НастройкиАрхива(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки архива", "НастройкиАрхива",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиАрхива";
	
	ДобавитьГруппу_ПечатнаяФормуЭПДВПрисоединенныеФайлы(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_АрхивДокументооборота(ТаблицаНастроек, ИмяРодителя);
	
КонецПроцедуры

Процедура ДобавитьГруппу_ПечатнаяФормуЭПДВПрисоединенныеФайлы(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Печатная форма ЭПД в присоединенные файлы", "ПечатнаяФормуЭПДВПрисоединенныеФайлы",
		"", "",
		"");
	
	ИмяРодителя = "ПечатнаяФормуЭПДВПрисоединенныеФайлы";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Сохранять в присоединенные файлы ", "СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы ",
		"Булево", "Ложь",
		"Если настройка включена, то печатная форма ЭПД будет сохранена в присоединенных файлах документа основания.
			|Доступна замена процедуры сохранения через подключаемый модуль.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Загружены до даты", "ДатаГраницыПолученияПечатныхФормЭПД",
		"Дата", "",
		"Указывается дата с начала которой будут сохранятся печатные формы ЭПД в присоединенные файлы документа основания");
	
КонецПроцедуры

Процедура ДобавитьГруппу_АрхивДокументооборота(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Архив документооборота", "АрхивДокументооборота",
		"", "",
		"");
	
	ИмяРодителя = "АрхивДокументооборота";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Каталог сохранения", "КаталогСохраненияАрхиваДокументооборота",
		"Строка", "",
		"Укажите общедоступный каталог сохранения архива документа.
			|Для клиент-серверного варианта работы нужно, чтобы сервер имел доступ к выбранному каталогу (проверка выполняется на сервере).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Разбить по организациям", "РазбитьПоОрганизациямАрхивДокументооборота",
		"Булево", "Ложь",
		"В каталоге сохранения архивы будут сохранены по папкам организаций (ИНН)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Сохранять в каталог на жестком диске", "СохранятьАрхивДокументооборотаВКаталог",
		"Булево", "Ложь",
		"Если настройка включена, то архив документа будет сохранен в каталог на жестком диске.
			|Доступна замена процедуры сохранения через подключаемый модуль.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Загружен до даты", "ДатаГраницыСохраненияАрхиваДокументооборота",
		"Дата", "",
		"Указывается дата с начала которой будут сохранятся архивы документов");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеНастройки

Процедура ДобавитьГруппу_СлужебныеНастройки(ТаблицаНастроек, ИмяКонфигурации)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Служебные настройки", "СлужебныеНастройки",
		"", "",
		"");
	
	ИмяРодителя = "СлужебныеНастройки";
	
	ДобавитьГруппу_ПараметрыБлокировкиРаботыСВнешнимиРесурсами(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ПодключаемыйМодуль(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ОсобенностиХраненияДанных(ТаблицаНастроек, ИмяРодителя, ИмяКонфигурации);
	ДобавитьГруппу_УчетнаяЗаписьЭлектроннойПочты(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_ЗапускРоботовНаКлиенте(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_Производительность(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_EDI(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя конфигурации 1С", "ИмяКонфигурации1С",
		"Строка", "",
		"Расшифровка - перечисление КонтурЛогистика_ТиповыеКонфигурации1С
			|Если используется нетиповая конфигурация, задайте ее имя (строковый идентификатор) и обработайте это значение "
			+ "в расширениях (см. вызовы функции ОпределитьКонфигурацию()).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Списки задач в отдельных формах.", "ЗадачиВОтдельныхФормах",
		"Булево", "Ложь",
		"Для ОФ не актуальна, ИЗМЕНЕНИЕ ТРЕБУЕТ ПЕРЕЗАПУСК РАБОЧЕГО СТОЛА!
			|Если установить, то списки задач различных типов будут открываться в различных формах, что позволит "
			+ "одновременно открыть несколько разных списков задач (например для различных ролей или этапов обработки)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Служебный идентификатор базы данных", "СлужебныйИдентификаторБазыДанных",
		"Строка", "",
		"Специальный служебный идентификатор для метрики");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Таймаут потока обработки (минут)", "ТаймаутПотокаОбработки",
		"Число", "10",
		"Время в минутах, через которое поток обработки границы синхронизации или массива заявок будет прекращен.
			|Имеется в виду ограничение жизни фонового задания такой обработки.
			|Фоновое задание будет аварийно завершено через этот период времени.
			|Для файловых баз может существовать только 1 фоновое задание, а новые ФЗ ожидают в очереди пока оно не завершится.
			|Для файловых баз рекомендуется таймаут 5 минут, для серверных (может одновременно работать несколько фоновых заданий) - 15 минут.
			|В некоторых ситуациях может потребоваться выставить значительно бОльший таймаут обработки.
			|Таймаут не может быть менее 1 минуты и более 240 минут "
			+ "(при указании значения не из интервала 1-240 значение будет приведено к ближайшему возможному).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Версия лицензионного договора", "ВерсияЛицензионногоДоговора",
		"Число", "0",
		"");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Версия данных", "ДанныеОбновленыДоВерсии",
		"Строка", "",
		"");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Отправлять метрики в тестовый сервис", "ОтправлятьМетрикиВТест",
		"Булево", "Ложь",
		"");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Последняя дата отправки трафика в сервис Контур.Метрики", "ПоследняяДатаОтправкиТрафика",
		"Дата", "",
		"Дата, на которую отправлен трафик в сервис Контур.Метрики. Служебная настройка, значение которой нельзя изменить.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Последняя дата получения уведомлений из сервиса", "ПоследняяДатаПолученияУведомлений",
		"Дата", "",
		"Дата, на которую были получены уведомления из сервиса уведомления Контур. Служебная настройка, значение которой нельзя изменить.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Удалить старые данные через (дней)", "УдалятьДанныеЧерезДней",
		"Число", "180",
		"Спустя это количество ДНЕЙ после завершения будут автоматически удалены ЭТрН и все связанные с ними данные "
			+ "(титулы, файлы, записи регистров) для освобождения ресурсов системы.
			|Датой завершения для ЭТрН считается последняя дата в регистре ""Состояние движения документооборота"" по ЭТрН.
			|Минимально допустимое значение настройки - 90, если указать меньше или не указать, то программа для работы будет использовать 90.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тестовый сервер Центра поддержки", "ИспользоватьТестовыйСерверЦентраПоддержки",
		"Булево", "Ложь",
		"Переключает программу на работу с тестовым сервером Центра поддержки");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Отправлена метрика Установка", "ОбщепродуктоваяМетрика_Установка_Отправлена",
		"Булево", "Ложь",
		"Фиксирует что уже была отправлена общепродуктовая метрика первого запуска модуля");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Увеличение интервала периода запроса получения документов (часы)", "СмещениеОкончанияПериодаСпискаЗадач",
		"Число", "0",
		"Время в часах добавляемое к концу периода при построении списков задач для списков.
			|Тем самым позволяем обрабатывать задачи с будущей датой.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать замеры производительности", "ИспользоватьЗамерыПроизводительности",
		"Булево", "Ложь",
		"Фиксирует выполнение целевых операций");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Минимальный период актуальности данных организации (часы)", "МинимальныйПериодАктуальностиДанныхОрганизации",
		"Число", "3",
		"При автоматическом обновлении данных карточки организации будет учитываться минимальный период.
			|Если минимальное время не прошло, то данные организации не будут обновляться.
			|Если значение равно ноль, значит данные обновляются всегда.");
	
	ДобавитьГруппу_НастройкиДляРаботыСCloudНаTestkontur(ТаблицаНастроек, ИмяРодителя);
	
КонецПроцедуры

Процедура ДобавитьГруппу_НастройкиДляРаботыСCloudНаTestkontur(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Настройки для работы с клаудами на testkontur", "НастройкиДляРаботыСCloudНаTestkontur",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиДляРаботыСCloudНаTestkontur";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Ключ разработчика Диадок для testkontur", "КлючРазработчикаДиадокTestkontur",
		"Строка", "bG9naXN0aWthMWMtODJjYmE3ZWUtNGFjYi00NmJlLTljOWEtOTU1OGU1MDBkOWZk",
		"Ключ разработчика Диадок для testkontur для выполнения запрос в АПИ");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Параметр kl-environment", "KlEnvironment",
		"Строка", "",
		"Параметр kl-environment в CustomData в структуре MessageToPost при отправке документа в Диадок. Если нужно использовать cloud11, то  
		|то значение параметра: kl-cloud11");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ПараметрыБлокировкиРаботыСВнешнимиРесурсами(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Параметры блокировки работы с внешними ресурсами", "ПараметрыБлокировкиРаботыСВнешнимиРесурсами",
		"", "",
		"");
	
	ИмяРодителя = "ПараметрыБлокировкиРаботыСВнешнимиРесурсами";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Идентификатор базы", "ПараметрыБлокировки_ИдентификаторБазы",
		"Строка", "",
		"Уникальный идентификатор информационной базы, с помощью которого можно различать различные экземпляры информационных баз.
			|Настройка ИдентификаторИнформационнойБазы не должна входить в составы планов обмена, чтобы иметь "
			+ "различные значения в каждой информационной базе (узле РИБ).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Это файловая база", "ПараметрыБлокировки_ЭтоФайловаяБаза",
		"Булево", "Истина",
		"Признак расположения базы (файловая или серверная).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Разделение включено", "ПараметрыБлокировки_РазделениеВключено",
		"Булево", "Ложь",
		"Возвращает признак работы в режиме разделения данных по областям (технически это признак условного разделения).
			|Возвращает Ложь, если конфигурация не может работать в режиме разделения данных "
			+ "(не содержит общих реквизитов, предназначенных для разделения данных).");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Строка соединения", "ПараметрыБлокировки_СтрокаСоединения",
		"Строка", "",
		"Путь, по которому проверяется расположение базы.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя компьютера", "ПараметрыБлокировки_ИмяКомпьютера",
		"Строка", "",
		"Хранит сетевое имя компьютера.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Проверять имя сервера", "ПараметрыБлокировки_ПроверятьИмяСервера",
		"Булево", "Ложь",
		"Отвечает за проверку имени сервера. При отключенной настройке ""Проверять имя сервера"" проверка факта "
			+ "перемещения базы будет осуществляться только по имени информационной базы.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Работа с внешними ресурсами заблокирована", "ПараметрыБлокировки_РаботаСВнешнимиРесурсамиЗаблокирована",
		"Булево", "Ложь",
		"При активной настройке блокируется работа регламентных заданий. Активируется при копировании базы.
			|Если есть БСП с механизмом блокировки работы с внешними ресурсами, то используем его и игнорируем эту настройку.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Причина блокировки", "ПараметрыБлокировки_ПричинаБлокировки",
		"Строка", "",
		"Текстовое описание причины блокировки, формируемое программно.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ПодключаемыйМодуль(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Подключаемый модуль", "ПодключаемыйМодуль",
		"", "",
		"");
	
	ИмяРодителя = "ПодключаемыйМодуль";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Путь до файла обработки epf", "ПодключаемыйМодульПуть",
		"Строка", "",
		"Если Настройка ""Тип ПМ"" содержит значение ""Файл на диске"", то указывается ПУТЬ СО СТОРОНЫ СЕРВЕРА до файла подключаемого модуля.
			|Это обработка с расширением epf.
			|Если Настройка ""Тип ПМ"" содержит значение ""В справочнике"", то указывается ссылка на обработку подключаемого модуля, "
			+ "которая хранится в качестве элемента справочнике. Например, для современных конфигураций построенных на базе библиотеки "
			+ "БСП таким справочником является справочник ""Дополнительные отчеты и обработки"".");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Тип ПМ (вариант подключения)", "ПодключаемыйМодульТип",
		"ПеречислениеСсылка.КонтурЛогистика_ТипыПМ", "Перечисление.КонтурЛогистика_ТипыПМ.Отключен",
		"Включает (отключает) использование одного из вариантов подключения подключаемого модуля");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ОсобенностиХраненияДанных(ТаблицаНастроек, ИмяРодителяГруппы, ИмяКонфигурации)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Особенности хранения данных типовой конфигурации", "ОсобенностиХраненияДанных",
		"", "",
		"");
	
	ИмяРодителя = "ОсобенностиХраненияДанных";
	
	// Имя справочника Единицы измерения
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_УпаковкиЕдиницыИзмерения";
	ИначеЕсли ИмяКонфигурации = "УПП"
		Или ИмяКонфигурации = "КА"
		Или ИмяКонфигурации = "УТ"
		Или ИмяКонфигурации = "УФ_УНФ"
		Или ИмяКонфигурации = "УАТ_ПРОФ"
		Или ИмяКонфигурации = "УАТ"
		Или ИмяКонфигурации = "ТЛЭ" Тогда
		ТекущееЗначение = "ЕдиницыИзмерения";
	ИначеЕсли ИмяКонфигурации = "УФ_БП"
		Или ИмяКонфигурации = "БП" Тогда
		ТекущееЗначение = "КлассификаторЕдиницИзмерения";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "УпаковкиЕдиницыИзмерения";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя справочника Единицы измерения", "ИмяСправочникаЕдиницаИзмерения",
		"Строка", ТекущееЗначение,
		"может не быть отдельного справочника, а использоваться такой же как для Упаковок (например как в УТ 11)");
	
	// Имя справочника Упаковок
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_УпаковкиЕдиницыИзмерения";
	ИначеЕсли ИмяКонфигурации = "УПП"
		Или ИмяКонфигурации = "КА"
		Или ИмяКонфигурации = "УТ"
		Или ИмяКонфигурации = "УФ_УНФ" Тогда
		ТекущееЗначение = "ЕдиницыИзмерения";
	ИначеЕсли ИмяКонфигурации = "УФ_БП"
		Или ИмяКонфигурации = "БП" Тогда
		ТекущееЗначение = "КлассификаторЕдиницИзмерения";
	ИначеЕсли ИмяКонфигурации = "УАТ_ПРОФ"
		Или ИмяКонфигурации = "УАТ"
		Или ИмяКонфигурации = "ТЛЭ" Тогда
		ТекущееЗначение = "УпаковкиНоменклатуры";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "УпаковкиЕдиницыИзмерения";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя справочника Упаковок", "ИмяСправочникаУпаковка",
		"Строка", ТекущееЗначение,
		"");
	
	// Имя справочника Характеристика
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_ХарактеристикиНоменклатуры";
	ИначеЕсли ИмяКонфигурации = "УФ_БП"
		Или ИмяКонфигурации = "БП"
		Или ИмяКонфигурации = "УАТ_ПРОФ"
		Или ИмяКонфигурации = "УАТ"
		Или ИмяКонфигурации = "ТЛЭ" Тогда
		ТекущееЗначение = "не поддерживается";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "ХарактеристикиНоменклатуры";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя справочника Характеристика", "ИмяСправочникаХарактеристика",
		"Строка", ТекущееЗначение,
		"не поддерживается в конфигурациях ""Бухгалтерия предприятия 2.0"" и ""Бухгалтерия предприятия 3.0""");
	
	// Имя справочника Номенклатура
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_Номенклатура";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "Номенклатура";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя справочника Номенклатура", "ИмяСправочникаНоменклатура",
		"Строка", ТекущееЗначение,
		"");
	
	// Имя справочника Пользователи
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_Пользователи";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "Пользователи";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя справочника Пользователи", "ИмяСправочникаПользователи",
		"Строка", ТекущееЗначение,
		"Указывается имя справочника Пользователи (1С) учетной системы. Обычно справочник называется ""Пользователи""");
	
	// Имя справочника Валюты
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_Валюты";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "Валюты";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя справочника Валюты", "ИмяСправочникаВалюты",
		"Строка", ТекущееЗначение,
		"Указывается имя справочника Валюты (1С) учетной системы. Обычно справочник называется ""Валюты""");
	
	// Имя ПланаВидовХарактеристик для хранения доп свойств объектов
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_ДополнительныеРеквизитыИСведения";
	ИначеЕсли ИмяКонфигурации = "УПП"
		Или ИмяКонфигурации = "КА"
		Или ИмяКонфигурации = "УТ" Тогда
		ТекущееЗначение = "СвойстваОбъектов";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "ДополнительныеРеквизитыИСведения";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя ПланаВидовХарактеристик для хранения доп свойств объектов", "ИмяПВХДопСвойства",
		"Строка", ТекущееЗначение,
		"Чтобы механизм конвертации мог обращаться к допсвойствам и допреквизитам вашей основной конфигурации.
			|Здесь указывается имя Плана вида характеристик с допсвойствами, как оно задано в конфигураторе");
	
	// Имя РегистраСведений для хранения доп свойств объектов
	Если ИмяКонфигурации = "КЛ" Тогда
		ТекущееЗначение = "УчетнаяСистема_ДополнительныеСведения";
	ИначеЕсли ИмяКонфигурации = "УПП"
		Или ИмяКонфигурации = "КА"
		Или ИмяКонфигурации = "УТ" Тогда
		ТекущееЗначение = "ЗначенияСвойствОбъектов";
	ИначеЕсли ИмяКонфигурации = "УС_3" Тогда
		ТекущееЗначение = "";
	Иначе
		ТекущееЗначение = "ДополнительныеСведения";
	КонецЕсли;
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя РегистраСведений для хранения доп свойств объектов", "ИмяРегистраДопСвойства",
		"Строка", ТекущееЗначение,
		"Чтобы механизм конвертации мог обращаться к допсвойствам и допреквизитам вашей основной конфигурации.
			|Здесь указывается имя Регистра хранения допсвойств, как оно задано в конфигураторе");
	
КонецПроцедуры

Процедура ДобавитьГруппу_УчетнаяЗаписьЭлектроннойПочты(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Учетная запись электронной почты", "УчетнаяЗаписьЭлектроннойПочты",
		"", "",
		"");
	
	ИмяРодителя = "УчетнаяЗаписьЭлектроннойПочты";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес электронной почты", "АдресЭлектроннойПочты",
		"Строка", "",
		"Адрес электронной почты в формате пользователь@сервер с которой будут отправляться QR-коды водителям");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адрес сервера SMTP", "АдресСервераSMTP",
		"Строка", "",
		"Имя хоста сервера исходящей почты");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Порт SMTP", "ПортSMTP",
		"Строка", "",
		"Номер порта");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пользователь SMTP", "ПользовательSMTP",
		"Строка", "",
		"Имя пользователя для доступа к почте (логин)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать системную учетную запись", "ИспользоватьСистемнуюУчетнуюЗапись",
		"Булево", "Ложь",
		"Если включить, то будет использоваться системная учетная запись учетной системы");
	
КонецПроцедуры

Процедура ДобавитьГруппу_ЗапускРоботовНаКлиенте(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Запуск роботов на клиенте", "ЗапускРоботовНаКлиенте",
		"", "",
		"");
	
	ИмяРодителя = "ЗапускРоботовНаКлиенте";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать", "ЗапускРоботовНаКлиенте_Использовать",
		"Булево", "",
		"Включает автоматический запуск роботов с клиента. Подписание документов выполняется на машине клиента.
			|Все остальное выполняется на стороне сервера.
			|Запускается вручную с рабочего стола. Для работы необходимо всегда держать рабочий стол открытым.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Интервал запуска (сек.)", "ЗапускРоботовНаКлиенте_ИнтервалЗапуска",
		"Число", "60",
		"Интервал запуска роботов в секундах");
	
КонецПроцедуры

Процедура ДобавитьГруппу_Производительность(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Производительность", "Производительность",
		"", "",
		"");
	
	ИмяРодителя = "Производительность";
	
	ДобавитьГруппу_Производительность_Роботы(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Количество потоков загрузки входящих документов", "Производительность_КоличествоПотоковЗагрузкиВходящихДокументов",
		"Число", "3",
		"Максимальное количество потоков загрузки входящих документов.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Минимальное количество документов для отправки в фоне", "Производительность_МинимальноеКоличествоДокументовДляОтправкиВФоне",
		"Число", "10",
		"Минимальное количество документов для отправки в фоне при интерактивной обработки документов из списка задач или рабочего места путевых листов.
			|Если значение 0, то отправка в фоне не будет использоваться.
			|Если значение больше 0, то при количестве задач равное или больше введенному значению, то отправка файлов обмена будет выполняться в фоне.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_Производительность_Роботы(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Сценарии автоматической обработки (Роботы)", "Производительность_Роботы",
		"", "",
		"");
	
	ИмяРодителя = "Производительность_Роботы";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Количество потоков", "Производительность_Роботы_КоличествоПотоков",
		"Число", "3",
		"Максимальное количество потоков выполнения сценариев автоматической обработки (Роботы).
			|Регламентное задание ""Запуск роботов"" будет создавать несколько фоновых заданий для ускорения обработки.
			|Указанное количество для всех роботов в сумме.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Количество задач в одном потоке", "Производительность_Роботы_КоличествоЗадач",
		"Число", "10",
		"Максимальное количество задач в одном потоке выполнения сценариев автоматической обработки.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_EDI(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Контур.EDI", "Контур_EDI",
		"", "",
		"");
	
	ИмяРодителя = "Контур_EDI";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Расположение модуля", "EDI_РасположениеМодуля",
		"ПеречислениеСсылка.КонтурЛогистика_ТипыПМ", Неопределено,
		"Включает (отключает) использование одного из вариантов подключения модуля EDI");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Путь к модулю", "EDI_ПутьКМодулю",
		"Строка", "",
		"Если Настройка ""Расположение модуля EDI"" содержит значение ""Файл на диске"", то указывается ПУТЬ СО СТОРОНЫ СЕРВЕРА до файла модуля EDI.
			|Это обработка с расширением epf.
			|Если Настройка ""Расположение модуля EDI"" содержит значение ""В справочнике"", то указывается ссылка на обработку модуля EDI, "
			+ "которая хранится в качестве элемента справочнике. Например, для современных конфигураций построенных на базе библиотеки "
			+ "БСП таким справочником является справочник ""Дополнительные отчеты и обработки"".");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиКриптографии

Процедура ДобавитьГруппу_НастройкиКриптографии(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки криптографии", "НастройкиКриптографии",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиКриптографии";
	
	ДобавитьГруппу_МЧД(ТаблицаНастроек, ИмяРодителя);
	ДобавитьГруппу_БиблиотекаКриптографии(ТаблицаНастроек, ИмяРодителя);
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Разрешить пользователям выбор и сохранение сертификата подписи", "РазрешитьПользователямВыборСертификата",
		"Булево", "Истина",
		"Позволяет пользователям без роли КонтурЛогистика_ПолныеПраваЛогистика выбирать сертификат для подписания титулов и "
			+ "запоминать его в регистр КонтурЛогистика_НастройкиПодписания для своего пользователя 1С. 
			|При этом обычные пользователи затем не смогут сами изменить эту запись.
			|А продвинутые пользователи (роль КонтурЛогистика_НастройкаПодписания) смогут изменять эту запись.");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Разрешить подпись на сервере", "РазрешитьПодписьНаСервере",
		"Булево", "Истина",
		"Только для клиент-серверной базы. Для файловой не учитывается.
			|В таком режиме не требуется устанавливать на компьютер пользователя программу криптографии и сертификат.
			|Важно! На каждом компьютере, где работает сервер 1С:Предприятия, требуется программа криптографии и сертификат с закрытым ключом.");
	 	
КонецПроцедуры

Процедура ДобавитьГруппу_МЧД(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"МЧД", "МЧД",
		"", "",
		"");
	
	ИмяРодителя = "МЧД";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Способ отправки МЧД", "СпособПередачиМЧД",
		"ПеречислениеСсылка.КонтурЛогистика_СпособыПередачиМЧД", "Перечисление.КонтурЛогистика_СпособыПередачиМЧД.Мета",
		"Позволяет пользователю выбрать способ передачи МЧД:
			|Идентификатор - при такой передаче с документом отправляется идентификатор МЧД и ИНН доверителя, "
			+ "позволяющие идентифицировать ее и найти в ИС хранения.
			|Файл - при такой передаче с документом отправляются xml файл МЧД и файл подписи.
			|Преимущественно файлом - передача происходит в начале файлом. Если нет файла, то идентификатором");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Доставка МЧД файлом", "ДоставкаМЧДФайлом",
		"Булево", "Ложь",
		"Признак, указывающий что МЧД будет доставляться файлом");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Вариант проверки полномочий МЧД", "ВариантПроверкиПолномочийМЧД",
		"ПеречислениеСсылка.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД", "Перечисление.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД.НеПроверять",
		"Позволяет пользователю выбрать вариант проверки полномочий МЧД:
			|Не проверять - полномочия МЧД проверяться не будут;
			|Проверять с предупреждением - пользователю будут выводится предупреждения при оформление исходящих "
			+ "документов и при получение входящих;
			|Проверять с ошибкой - пользователю будут выводится ошибки при оформление исходящих документов и при получение входящиих. "
			+ "Необходимо будет выполнить настройку полномочий для продолжения работы");
			
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Запрет отправки титула при ошибках в МЧД", "ЗапретОтправкиТитулаПриОшибкахМЧД",
		"Булево", "Истина",
		"Признак, указывающий, что если МЧД не проходит проверку, то пользователю будет выведена ошибка, и дальнейшая работа с документом будет заблокирована.
			|В противном случае будет выведено предупреждение.");
	
КонецПроцедуры

Процедура ДобавитьГруппу_БиблиотекаКриптографии(ТаблицаНастроек, ИмяРодителяГруппы)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителяГруппы,
		"Библиотека криптографии", "БиблиотекаКриптографии",
		"", "",
		"");
	
	ИмяРодителя = "БиблиотекаКриптографии";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать криптографию 1С в тонком и толстом клиенте", "ИспользоватьКриптографию1С",
		"Булево", "",
		"На веб-клиенте всегда будет использоваться менеджер криптографии 1С (из платформы 1с).
			|Для Тонкого и Толстого клиентов по умолчанию используется плагин работы с криптографией из подсистемы.
			|Вы можете для Тонкого и Толстого клиентов включить использование менеджера криптографии 1С (из платформы 1с)");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПечати

Процедура ДобавитьГруппу_НастройкиПечати(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки печати", "НастройкиПечати",
		"", "",
		"");
	
	ИмяРодителя = "НастройкиПечати";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Выводить задачу ""Распечатать""", "ВыводитьЗадачуРаспечатать",
		"Булево", "",
		"Если настройка включена, то в списке задач титула 1 в требуемых действиях появится ещё одна задача ""Распечатать"".");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Имя принтера для печати", "ИмяПринтераДляПечати",
		"Строка", "",
		"Выбирается из списка принтеров, установленных в системе. Если  не указан (например, разные пользователи могут использовать "
			+ "различные несетевые принтеры), то предлагается выбрать принтер в момент печати");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Выводить QR код в печатной форме ЭТРН", "ВыводитьQRКодВПечатнойФормеТРН",
		"Булево", "Ложь",
		"Включите, если требуется вывести в печатную форму ЭТРН кадры QR кода. "
			+ "Для получения QR кода требуется чтобы был подписан титул 2 (Перевозчика)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Всегда формировать печатную форму средствами 1С", "ВсегдаФормироватьПечатнуюФормуИз1С",
		"Булево", "Ложь",
		"Если настройка включена, то не будет выполняться запрос в сервис для получения печатных форм.
			|Печатные формы будут формироваться только на основании данных 1С.");
	
КонецПроцедуры

#КонецОбласти

#Область ПЛ_РМ

Процедура ДобавитьГруппу_ПЛ_РМ(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Настройки рабочего места Путевого листа", "ПЛ_РМ",
		"", "",
		"");
	
	ИмяРодителя = "ПЛ_РМ";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Использовать подключаемое оборудование", "ПЛ_РМ_ИспользоватьОборудование",
		"Булево", "Ложь",
		"Включает и выключает ипользование отбора в списках при помощи подключаемого оборудования");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Код расчета значения отбора", "ПЛ_РМ_КодРасчетаЗначенияОтбора",
		"Строка", "",
		"Код расчета значения отбора");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Поле отбора в списке Диспетчер", "ПЛ_РМ_ПолеОтбора_Диспетчер",
		"Строка", "",
		"Имя поля для отбора динамического списка, можно писать ""через точку""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Поле отбора в списке Медосмотр", "ПЛ_РМ_ПолеОтбора_Медосмотр",
		"Строка", "",
		"Имя поля для отбора динамического списка, можно писать ""через точку""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Поле отбора в списке Одометр", "ПЛ_РМ_ПолеОтбора_Одометр",
		"Строка", "",
		"Имя поля для отбора динамического списка, можно писать ""через точку""");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Поле отбора в списке ТехКонтроль", "ПЛ_РМ_ПолеОтбора_ТехКонтроль",
		"Строка", "",
		"Имя поля для отбора динамического списка, можно писать ""через точку""");
	
КонецПроцедуры

#КонецОбласти

#Область СвоиНастройки

Процедура ДобавитьГруппу_СвоиНастройки(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Свои настройки", "СвоиНастройки",
		"", "",
		"");
	
	ИмяРодителя = "СвоиНастройки";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Пример своей настройки", "ПримерСвоейНастройки",
		"Строка", "",
		"Это пример добавления в справочник своих настроек");
	
КонецПроцедуры

#КонецОбласти

#Область КонтактыАдминистратора

Процедура ДобавитьГруппу_КонтактыАдминистратора(ТаблицаНастроек)
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, "",
		"Контакты администратора", "КонтактыАдминистратора",
		"", "",
		"");
	
	ИмяРодителя = "КонтактыАдминистратора";
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Телефоны", "КонтактыАдминистратора_Телефоны",
		"Строка", "",
		"Телефоны для связи с администратором. Можно указать несколько через точку с запятой.
			|Будут отправляться только важные новостные сообщения и об автоматической разлогировании организации.
			|Требуется включить настройку: ""Использовать отправку в Телеграм"".");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Адреса электронных почт", "КонтактыАдминистратора_АдресаЭлектронныхПочт",
		"Строка", "",
		"Адреса электронных почт для связи с администратором. Можно указать несколько через точку с запятой.
			|Будут отправляться только важные новостные сообщения и об автоматической разлогировании организации.
			|Требуется настроить учетную запись электронной почты.");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли