
&НаСервере
Процедура ОД_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("Операционист")
		ИЛИ РольДоступна("МенеджерПоПродажамУправлениеРазделом")
		ИЛИ РольДоступна("РуководительОтделаПродажДополнительно") Тогда
	
		Если Параметры.Свойство("КлючВарианта") Тогда
			Если Параметры.КлючВарианта = "ОстаткиИДоступностьТоваров"
				ИЛИ Параметры.КлючВарианта = "ПоступлениеИОтгрузкаТоваров" Тогда
				Сообщить("Ограничение прав");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли; 
		
		Если Параметры.Свойство("ИмяОтчета") Тогда
			Если Параметры.ИмяОтчета = "ОстаткиИДоступностьТоваров" Тогда
				Сообщить("Ограничение прав");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
