#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено) Экспорт 
	
Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТаблицаОшибок.Очистить();
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;

	Если Перечисления.КонтурЛогистика_СтатусыТитулов.СтатусДокументаТребуетПроверки(ТекСтатусТитула) Тогда

			КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
			КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);

			КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
																				  Неопределено,
																				  ТаблицаОшибок,
																				  ДокументОбъектИлиСсылка.СвЭксп);

			КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(ДокументОбъектИлиСсылка, ТаблицаОшибок);

			ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
			ПроверитьВодителей(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
			КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьОтправителя(ДокументОбъектИлиСсылка, ТаблицаОшибок);

		ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		// КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		// КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НомДок");
	Поля.Добавить("ДатаДок");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "Поручение экспедитору(титул2) №" + Данные.НомДок + " от " + Формат(Данные.ДатаДок, "ДФ=dd.MM.yy");
	
КонецПроцедуры

Функция ТекущаяВерсияСТД() Экспорт
	Возврат Документы.КонтурЛогистика_ПЭ_Титул1.ТекущаяВерсияСТД();
КонецФункции	

Функция КНД() Экспорт
	 Возврат "1110487" ;
КонецФункции	

Функция НаимДок() Экспорт
	Возврат "электронное поручение экспедитору, информация экспедитора";
КонецФункции

Функция СодОпер() Экспорт
	Возврат "согласование подлежащих оказанию транспортно-экспедиционных услуг и условий";
КонецФункции

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
		
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
		
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("НомДок");
	МассивКлючевых.Добавить("ДатаДок");
	
	МассивКлючевых.Добавить("УИД_ПорЭксп");
	МассивКлючевых.Добавить("ДатаДок");
	
	МассивКлючевых.Добавить("kl_id");
	
	МассивКлючевых.Добавить("СвКлиент");
	МассивКлючевых.Добавить("СвЭксп");
	МассивКлючевых.Добавить("ДогТрЭксп");
	
	МассивКлючевых.Добавить("ПользовательПодписант");
	МассивКлючевых.Добавить("ПараметрНастроекПодписания");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	// КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ПОС = КонтурЛогистика_ПанельОшибокСервер;
	
	Если Не ЗначениеЗаполнено(Объект.СвЭксп.НомРеестр) Тогда
		ТекстОшибки = "Укажите рег. номер записи в реестре уведомлений о транспортно-экспедиционной деятельности";
		ПОС.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"СвЭксп.НомРеестр", КатегорияОшибка, ТекстОшибки, "Указать");
	КонецЕсли;
		 
	Если Не ЗначениеЗаполнено(Объект.СвЭксп.ДатаРеестр) Тогда
		ТекстОшибки = "Укажите дату записи в реестре уведомлений о транспортно-экспедиционной деятельности";
		ПОС.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"СвЭксп.НомДок", КатегорияОшибка, ТекстОшибки, "Указать");
	КонецЕсли;	 
		
КонецПроцедуры

Процедура ПроверитьВодителей(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	// КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ПОС = КонтурЛогистика_ПанельОшибокСервер;
	
	Для Каждого СтрокаВодитель Из Объект.Водители Цикл 
	
		Если Не ЗначениеЗаполнено(СтрокаВодитель.Водитель.ВУНомер) 
				Или Не ЗначениеЗаполнено(СтрокаВодитель.Водитель.ВУСерия) Тогда
				ТекстОшибки = "Укажите водительское удостоверение";
				Индекс = СтрокаВодитель.НомерСтроки - 1;
				ПОС.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", "Водители[" + Индекс + "].Водитель.ВУНомер", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаВодитель.Водитель.ТелефонОсновной) Тогда
				ТекстОшибки = "Укажите телефон";
				Индекс = СтрокаВодитель.НомерСтроки - 1;
				ПОС.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", "Водители[" + Индекс + "].Водитель.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры	

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
		Возврат Метаданные.Документы.КонтурЛогистика_ПЭ_Титул1.Реквизиты[ИмяРеквизита].Синоним;
	Исключение
		Возврат ИмяРеквизита;
	КонецПопытки;

КонецФункции

Функция ПолучитьДанныеДляМетрик(Документ) Экспорт
	
	Результат = Новый Структура("Переменные, Path_Category, Path_View");
	Результат.Path_Category = "Подписание и отправка ПЭ2";
	Результат.Path_View = "Документ.КонтурЛогистика_ПЭ_Титул2.Форма.ФормаДокумента";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка), 0) КАК КоличествоМаршрутов,
	|	КонтурЛогистика_ПЭ_Титул2.Ссылка.СвКлиент.ID КАК BoxID,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_ПЭ_Титул2Водители.Водитель), 0) КАК КоличествоВодителей,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_ПЭ_Титул2СвТсДост.ТранспортноеСредство), 0) КАК КоличествоТС,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_ПЭ_Титул2ДопИнфЭксп.ИдентификаторСтроки), 0) КАК КоличествоУслуг
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_Титул2 КАК КонтурЛогистика_ПЭ_Титул2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_Титул2.Водители КАК КонтурЛогистика_ПЭ_Титул2Водители
	|		ПО КонтурЛогистика_ПЭ_Титул2Водители.Ссылка = КонтурЛогистика_ПЭ_Титул2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_Титул2.ДопИнфЭксп КАК КонтурЛогистика_ПЭ_Титул2ДопИнфЭксп
	|		ПО КонтурЛогистика_ПЭ_Титул2ДопИнфЭксп.Ссылка = КонтурЛогистика_ПЭ_Титул2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_Титул2.СвТсДост КАК КонтурЛогистика_ПЭ_Титул2СвТсДост
	|		ПО КонтурЛогистика_ПЭ_Титул2СвТсДост.Ссылка = КонтурЛогистика_ПЭ_Титул2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|		ПО КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 = КонтурЛогистика_ПЭ_Титул2.Титул1
	|		И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления = ЛОЖЬ
	|ГДЕ
	|	КонтурЛогистика_ПЭ_Титул2.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ПЭ_Титул2.Ссылка.СвКлиент.ID";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Переменные = Новый Структура("BoxIdОтправитель, КоличествоМаршрутов, КоличествоВодителей, КоличествоТС, КоличествоУслуг");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Переменные, Выборка);
	КонецЕсли;
	
	Результат.Переменные = Переменные;
	
	Возврат Результат;
	 	
КонецФункции

#КонецЕсли
