#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НайтиСоздатьПоОбъектуXDTO(СвСтрах, Входящий = Истина) Экспорт
	
	Если СвСтрах = Неопределено Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ПараметрыПоиска = Новый Структура("НаименованиеПолиса, ДатаПолиса, НомерПолиса, НаимСтрахОрг");
	
	ПараметрыПоиска.НаимСтрахОрг = КС.XDTO_Вычислить(СвСтрах, "НаимСтрахОрг");
	
	Полис = КС.XDTO_Вычислить(СвСтрах, "Полис");
	ПараметрыПоиска.НаименованиеПолиса = КС.XDTO_Вычислить(Полис, "РеквНаимДок");
	ПараметрыПоиска.НомерПолиса = КС.XDTO_Вычислить(Полис, "РеквНомерДок");
	ПараметрыПоиска.ДатаПолиса = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Полис, "РеквДатаДок"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_СведенияОСтрахованииГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_СведенияОСтрахованииГрузов КАК КонтурЛогистика_СведенияОСтрахованииГрузов
	|ГДЕ
	|	КонтурЛогистика_СведенияОСтрахованииГрузов.ПометкаУдаления = Ложь
	|	И КонтурЛогистика_СведенияОСтрахованииГрузов.ДатаПолиса = &ДатаПолиса
	|	И КонтурЛогистика_СведенияОСтрахованииГрузов.НомерПолиса = &НомерПолиса";
	
	Запрос.УстановитьПараметр("ДатаПолиса", ПараметрыПоиска.ДатаПолиса);
	Запрос.УстановитьПараметр("НомерПолиса", ПараметрыПоиска.НомерПолиса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе 
		ДоговорСтрахования = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ДоговорСтрахования, ПараметрыПоиска);
		ДоговорСтрахования.АдрСтрахОрг = КС.Конвертировать_АдресТип_вПунктМаршрутаЛогистика(КС.XDTO_Вычислить(СвСтрах, "АдрСтрахОрг"));
		ДоговорСтрахования.РекИдентСтрах = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_Вычислить(СвСтрах, "РекИдентСтрах"));
		Для Каждого Условие Из КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СвСтрах, "УслСтрах")) Цикл
			СтрокаУсловия = ДоговорСтрахования.УсловияСтрахования.Добавить();
			СтрокаУсловия.УслСтрах = Условие;
		КонецЦикла;
		ДоговорСтрахования.Входящий = Истина;  
		ДоговорСтрахования.Записать();
		Результат = ДоговорСтрахования.Ссылка;
	КонецЕсли;
		
	Возврат Результат;	
		
КонецФункции	

#КонецЕсли