#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИдентификаторСтрокиЗаявкиНаМаршрут", ИдентификаторСтрокиЗаявкиНаМаршрут);
	Параметры.Свойство("ПризнакПеревозки", ПризнакПеревозки);
	Параметры.Свойство("ТолькоПросмотр", ТолькоПросмотр);
	
	Если Параметры.Свойство("АдресСведенийОКонтейнерах") Тогда
		АдресСведенийОКонтейнерах = Параметры.АдресСведенийОКонтейнерах;
		СведенияОКонтейнерах.Загрузить(ПолучитьИзВременногоХранилища(АдресСведенийОКонтейнерах));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПризнакПеревозкиПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СведенияОКонтейнерахПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКонтейнерахПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ПредоставленКлиентом = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_ПредоставлениеКонтейнера.ПредоставленКлиентом");
		Элемент.ТекущиеДанные.Номер = НайтиМаксимальныйНомер() + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиМаксимальныйНомер()
	
	МаксНомер = 0;
	
	Для Каждого ТекущаяСтрока Из СведенияОКонтейнерах Цикл
		МаксНомер = Макс(ТекущаяСтрока.Номер, МаксНомер);
	КонецЦикла;
	
	Возврат МаксНомер;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИзменения(Команда)
	
	Если Не Модифицированность Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПризнакПеревозки", ПризнакПеревозки);
	Результат.Вставить("АдресСведенийОКонтейнерах", ПоместитьИзмененныеДанные());
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеДанные()
	
	Возврат ПоместитьВоВременноеХранилище(СведенияОКонтейнерах.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	
	Если Модифицированность Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
			"Есть изменения. Вы уверены?", РежимДиалогаВопрос.ДаНетОтмена,,, ЭтаФорма,
			"ОтменитьИзмененияЗавершение");
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзмененияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ФормаПринятьИзменения.Доступность = Модифицированность;
	
	НетКонтейнера = (ПризнакПеревозки = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВариантыПодачиКонтейнера.НетКонтейнера"));
	Элементы.СведенияОКонтейнерах.Доступность = Не НетКонтейнера;
	
КонецПроцедуры

#КонецОбласти
